[
  {
    "id": "46795864",
    "title": "Microsoft forced me to switch to Linux",
    "url": "https://www.himthe.dev/blog/microsoft-to-linux",
    "summary": "This article details a software developer's forced migration from Windows to Linux after decades of loyalty. The author's breaking point was the bug-ridden Windows 11 24H2 update, which caused severe graphical issues and system instability. Microsoft's lack of effective fixes, combined with intrusive ads, forced updates, and declining user control, made Windows \"too much work.\"\n\nAfter switching to CachyOS (an Arch-based Linux distribution), the author acknowledges initial hurdles like broken sleep mode. However, they found they could effectively troubleshoot problems and discovered robust native alternatives for their workflow, including Bitwig Studio for music production. The summary argues that in 2026, Linux offers excellent support for web browsing, software development, and—increasingly—gaming via Proton, with performance gaps closing.\n\nThe author concludes they switched not by choice but because Microsoft's focus on AI integration and cross-platform apps has degraded Windows into a \"buggy, ad-ridden, bloated\" product. They assert that Linux is now a viable, user-respecting alternative for many, despite some remaining gaps in professional creative software.",
    "chinese_title": "微软迫使我转向Linux。",
    "chinese_summary": "本文详述了一位软件开发者数十年忠诚于Windows后被迫迁移至Linux的经历。作者的转折点是漏洞百出的Windows 11 24H2更新，该更新导致严重的图形问题和系统不稳定。微软缺乏有效修复，加上侵入式广告、强制更新和用户控制权下降，使得Windows变得“过于费神”。\n\n在切换到CachyOS（基于Arch的Linux发行版）后，作者承认初期遇到诸如睡眠模式故障等障碍。但他们发现自己能有效排查问题，并为工作流程找到了强大的原生替代方案，包括用于音乐制作的Bitwig Studio。文章总结认为，到2026年，Linux将为网页浏览、软件开发提供出色支持，并且通过Proton对游戏的支持也日益完善，性能差距正在缩小。\n\n作者最后强调，他们的转换并非出于自愿，而是因为微软专注于AI集成和跨平台应用，已将Windows降级为“漏洞百出、广告泛滥、臃肿不堪”的产品。他们断言，尽管专业创意软件领域仍存在差距，但Linux如今已成为许多用户可行且尊重用户的选择。"
  },
  {
    "id": "46795908",
    "title": "Airfoil (2024)",
    "url": "https://ciechanow.ski/airfoil/",
    "summary": "This article explores the physics of flight by examining airflow around an airfoil (wing cross-section). It begins by explaining that while air itself is invisible, its motion can be visualized using methods like arrows (showing local velocity), moving markers (showing particle paths), and color gradients (showing speed).\n\nThe core of the explanation delves into the microscopic behavior of air. It describes how, in still air, gas particles move at high speeds in random directions, with their average velocity being zero. Wind is then defined as the *average velocity* of a large group of these particles in a specific direction, which emerges from their chaotic individual motions.\n\nThe article introduces the concept of **relative velocity**, explaining that airflow can be created either by air moving past a stationary object (like wind) or by an object moving through still air (like a car driving). This principle is key to understanding lift on an airfoil.\n\nFinally, it sets the stage for analyzing how an airfoil's shape and angle interact with this airflow to generate the pressure differences that create lift, promising to build intuition for the forces that keep airplanes airborne.",
    "chinese_title": "翼型（2024）",
    "chinese_summary": "本文通过研究翼型（机翼横截面）周围的气流来探讨飞行的物理学原理。文章首先指出，虽然空气本身不可见，但可以通过箭头（显示局部速度）、移动标记（显示粒子路径）和颜色渐变（显示速度）等方法可视化其运动。\n\n解释的核心深入探讨了空气的微观行为：在静止空气中，气体粒子以高速随机运动，其平均速度为零。风则被定义为大量粒子在特定方向上的*平均速度*，这一宏观运动源于粒子混乱的个体运动。\n\n文章引入了**相对速度**的概念，说明气流可以通过空气流过静止物体（如风）或物体在静止空气中运动（如行驶的汽车）产生。这一原理是理解翼型升力的关键。\n\n最后，文章为后续分析做好铺垫：翼型的形状和角度如何与气流相互作用，产生形成升力的压力差，从而帮助读者直观理解维持飞机飞行的力量。"
  },
  {
    "id": "46798402",
    "title": "Mousefood – Build embedded terminal UIs for microcontrollers",
    "url": "https://github.com/ratatui/mousefood",
    "summary": "**Mousefood** is a no-std Rust library that enables building Ratatui terminal user interfaces for microcontrollers by acting as an embedded-graphics backend. It allows developers to render Ratatui widgets on embedded displays like ILI9341, ST7735, or SSD1306.\n\nKey features include:\n*   **Unicode Font Support:** Uses `embedded-graphics-unicodefonts` by default to support Ratatui's special characters (box-drawing, Braille). This can be disabled for size-constrained projects, with `ibm437` offered as a lighter alternative.\n*   **Font Styling:** Supports bold and italic text modifiers by providing corresponding fonts in the `EmbeddedBackendConfig`.\n*   **Customizable Colors:** Includes a `ColorTheme` system for remapping colors, with built-in themes like ANSI (default) and Tokyo Night.\n*   **E-Ink Display Support:** Offers features for WeAct Studio and Waveshare EPD (e-ink) displays, requiring a custom `flush_callback` for updates.\n*   **Hardware Agnostic:** Tested on various architectures including ESP32, STM32, and RP2040.\n\nThe library is designed for embedded constraints, recommending optimization level 3 for performance. It includes a simulator for development and is dual-licensed under Apache 2.0 and MIT.",
    "chinese_title": "Mousefood – 为微控制器构建嵌入式终端用户界面",
    "chinese_summary": "**Mousefood** 是一个无标准库的 Rust 库，它通过充当 embedded-graphics 后端，支持在微控制器上构建 Ratatui 终端用户界面。该库允许开发者在嵌入式显示屏（如 ILI9341、ST7735 或 SSD1306）上渲染 Ratatui 组件。\n\n主要特性包括：\n*   **Unicode 字体支持：** 默认使用 `embedded-graphics-unicodefonts` 以支持 Ratatui 的特殊字符（如制表符、盲文）。对于空间受限的项目，可以禁用此功能，并使用更轻量的 `ibm437` 作为替代方案。\n*   **字体样式：** 通过在 `EmbeddedBackendConfig` 中提供相应字体，支持粗体和斜体文本修饰。\n*   **可自定义颜色：** 包含一个用于颜色重映射的 `ColorTheme` 系统，内置 ANSI（默认）和 Tokyo Night 等主题。\n*   **电子墨水屏支持：** 为 WeAct Studio 和 Waveshare EPD（电子墨水）显示屏提供功能，需要自定义 `flush_callback` 进行更新。\n*   **硬件无关：** 已在多种架构上测试，包括 ESP32、STM32 和 RP2040。\n\n该库专为嵌入式限制设计，建议使用优化级别 3 以获得最佳性能。它包含一个用于开发的模拟器，并采用 Apache 2.0 和 MIT 双重许可。"
  },
  {
    "id": "46797594",
    "title": "Oban, the job processing framework from Elixir, has come to Python",
    "url": "https://www.dimamik.com/posts/oban_py/",
    "summary": "Oban-py is a Python port of the popular Elixir job processing framework, using PostgreSQL as its sole coordination and storage layer. It allows jobs to be enqueued within database transactions, ensuring atomicity. The core processing flow involves inserting a job, notifying producers via PostgreSQL's `LISTEN/NOTIFY`, and fetching jobs using `FOR UPDATE SKIP LOCKED` for safe, concurrent access. Jobs are then executed as asynchronous tasks.\n\nThe open-source version handles concurrency via asyncio but is limited to single-threaded execution, making it unsuitable for CPU-bound tasks. It also lacks bulk operations and uses a time-based \"rescue\" mechanism for orphaned jobs, which can cause duplicate executions for long-running tasks.\n\nKey background processes include a leader election system (implemented with a TTL-based lease in PostgreSQL), a lifeline to rescue stuck jobs, and a pruner to clean up old records. Retry logic uses jittered exponential backoff to prevent thundering herds.\n\nThe commercial Pro version addresses OSS limitations by adding true parallelism with process pools, bulk operations, smarter heartbeats for job rescues, and features like unique jobs and workflows. The article concludes that while OSS Oban-py is excellent for evaluation or small projects, the Pro version is recommended for production-scale applications due to its enhanced performance and reliability features.",
    "chinese_title": "来自Elixir的任务处理框架Oban现已登陆Python平台。",
    "chinese_summary": "Oban-py是流行的Elixir作业处理框架的Python移植版本，采用PostgreSQL作为其唯一的协调和存储层。它允许在数据库事务中排队作业，确保原子性。核心处理流程包括插入作业、通过PostgreSQL的`LISTEN/NOTIFY`通知生产者，以及使用`FOR UPDATE SKIP LOCKED`获取作业以实现安全的并发访问。随后，作业作为异步任务执行。\n\n开源版本通过asyncio处理并发，但仅限于单线程执行，因此不适合CPU密集型任务。它还缺少批量操作，并使用基于时间的“救援”机制处理孤立作业，这可能导致长时间运行任务的重复执行。\n\n关键后台进程包括领导者选举系统（通过PostgreSQL中基于TTL的租约实现）、用于救援卡住作业的生命线，以及清理旧记录的修剪器。重试逻辑采用抖动指数退避算法，以防止惊群效应。\n\n商业Pro版本通过添加进程池实现的真正并行性、批量操作、更智能的作业救援心跳机制，以及唯一作业和工作流等功能，解决了开源版本的局限性。文章总结指出，虽然开源版Oban-py非常适合评估或小型项目，但由于其增强的性能和可靠性特性，Pro版本被推荐用于生产级应用。"
  },
  {
    "id": "46798994",
    "title": "Computer History Museum Launches Digital Portal to Its Collection",
    "url": "https://computerhistory.org/press-releases/computer-history-museum-launches-digital-portal-to-its-vast-collection/",
    "summary": "**Summary**\n\nOn January 21, 2026, the Computer History Museum (CHM) in Mountain View, California, announced the launch of a major new digital portal providing online access to its extensive collection. This initiative represents a significant step in making the museum's vast archives of computing history available to a global audience.\n\nThe primary goal of the portal is to democratize access to the museum's physical artifacts, documents, software, and media. It allows researchers, students, educators, and the general public to explore curated collections, high-resolution images, and detailed catalog records from anywhere in the world. Key features include advanced search capabilities, thematic online exhibits, and digital preservation of historically significant software and hardware.\n\nThis launch underscores the CHM's commitment to its mission of preserving and presenting the history of computing in the digital age. By creating a comprehensive online resource, the museum aims to foster greater education, innovation, and appreciation for the technological revolution that has shaped the modern world.",
    "chinese_title": "计算机历史博物馆推出其馆藏数字门户",
    "chinese_summary": "**摘要**\n\n2026年1月21日，位于加利福尼亚州山景城的计算机历史博物馆宣布推出一个重要的全新数字门户网站，提供对其丰富馆藏的在线访问。这一举措标志着该博物馆在向全球观众开放其庞大的计算历史档案方面迈出了重要一步。\n\n该门户网站的主要目标是让博物馆的实体文物、文件、软件和媒体资源能够被大众便捷获取。它使研究人员、学生、教育工作者和普通公众能够从世界任何地方探索精心策划的藏品、高分辨率图像和详细的编目记录。其主要功能包括高级搜索能力、主题在线展览以及对具有历史意义的软件和硬件的数字保存。\n\n此次发布突显了计算机历史博物馆在数字时代致力于保存和展示计算历史的使命。通过创建这一全面的在线资源，博物馆旨在促进对塑造现代世界的技术革命有更深入的教育、创新和认识。"
  },
  {
    "id": "46793693",
    "title": "Show HN: The HN Arcade",
    "url": "https://andrewgy8.github.io/hnarcade/",
    "summary": "**Summary:**\n\nThe \"HN Arcade\" is a community-built website that compiles and hosts simple, playable browser games inspired by or discussed on Hacker News. The project's main goal is to create a curated, interactive archive of the classic and inventive games often shared in HN comment threads, which might otherwise be lost or hard to find.\n\nKey features of the site include:\n*   **Curated Collection:** It gathers games that are typically lightweight, built with web technologies (like JavaScript), and have a clever or minimalist design.\n*   **Direct Playability:** Games are embedded or linked so they can be played directly in the browser without downloads.\n*   **Community-Driven:** The selection is based on submissions and discussions from the Hacker News community itself.\n*   **Preservation:** It acts as a digital archive for these often-experimental projects, ensuring they remain accessible.\n\nThe arcade serves as both a fun diversion and a tribute to the creative and technical experimentation frequently showcased within the HN community.",
    "chinese_title": "展示 HN：HN 街机",
    "chinese_summary": "**摘要：**\n\n“HN街机”是一个由社区创建的网站，专门收集并托管那些受Hacker News启发或在其上讨论的简单、可直接在浏览器中游玩的小游戏。该项目的主要目标是创建一个经过筛选的互动式档案库，收录那些经常在HN评论区分享的经典和创新游戏，这些游戏可能因时间流逝而难以查找或彻底消失。\n\n网站的主要特点包括：\n*   **精选合集：** 收集的游戏通常体量轻巧，采用Web技术（如JavaScript）开发，并具有巧妙或极简的设计。\n*   **直接可玩：** 游戏被嵌入或链接，无需下载即可直接在浏览器中游玩。\n*   **社区驱动：** 游戏的选择基于Hacker News社区本身的提交和讨论。\n*   **保存功能：** 它充当了这些通常是实验性项目的数字档案馆，确保它们能够持续被访问。\n\n这个街机既是一个有趣的消遣之地，也是对HN社区内经常展示的创造性和技术实验精神的致敬。"
  },
  {
    "id": "46765772",
    "title": "I have written gemma3 inference in pure C",
    "url": "https://github.com/robitec97/gemma3.c",
    "summary": "**Summary**\n\n`gemma3.c` is a pure C (C11) inference engine for the Gemma 3 4B IT language model, demonstrating that modern LLMs can run without Python, PyTorch, or GPUs. It is a self-contained, dependency-free implementation of the full Gemma 3 architecture, including GQA, hybrid attention, and SwiGLU.\n\nThe engine loads BF16 model weights directly from memory-mapped SafeTensors files and includes a native SentencePiece tokenizer. It supports both a command-line interface for interactive chat or single prompts and a library API for integration. Performance on CPU is approximately 1–3 tokens per second for generation.\n\nKey features include streaming token-by-token output, configurable generation parameters (temperature, top-k/p), and a model download script for Hugging Face. The runtime requires about 3 GB of RAM, with weights occupying ~8 GB on disk. It is natively compatible with Linux and macOS; Windows users are advised to use WSL or MinGW.\n\nCurrent limitations are CPU-only execution, text-only capabilities, and a lack of quantization. The project is released under the MIT license, with model weights governed by Google's Gemma license.",
    "chinese_title": "我用纯C语言编写了gemma3推理程序。",
    "chinese_summary": "**概述**\n\n`gemma3.c` 是一个用纯 C 语言（C11）编写的 Gemma 3 4B IT 语言模型推理引擎，旨在证明现代大语言模型无需依赖 Python、PyTorch 或 GPU 即可运行。它是一个自包含、无依赖的完整 Gemma 3 架构实现，包含了 GQA、混合注意力机制和 SwiGLU。\n\n该引擎直接从内存映射的 SafeTensors 文件加载 BF16 模型权重，并内置了原生的 SentencePiece 分词器。它既支持用于交互式聊天或单次提示的命令行界面，也提供了用于集成的库 API。在 CPU 上运行时，生成速度约为每秒 1-3 个词元。\n\n主要特性包括：流式逐词元输出、可配置的生成参数（温度、top-k/p），以及用于从 Hugging Face 下载模型的脚本。运行时约需 3 GB 内存，模型权重在磁盘上占用约 8 GB。它原生兼容 Linux 和 macOS；Windows 用户建议使用 WSL 或 MinGW。\n\n目前的限制包括：仅支持 CPU 运行、仅具备文本处理能力，且不支持量化。该项目基于 MIT 许可证发布，模型权重则遵循 Google 的 Gemma 许可证。"
  },
  {
    "id": "46728070",
    "title": "I Overengineered a Spinning Top",
    "url": "https://www.youtube.com/watch?v=Wp5NodfvvF4",
    "summary": "This text appears to be the standard legal and informational footer from a YouTube video page, not the actual content of a video titled \"I Overengineered a Spinning Top.\"\n\nTherefore, a summary of the provided content is:\n\nThe text consists entirely of YouTube's generic footer information. It includes links to policies (copyright, terms, privacy), contact details for YouTube/Google, corporate addresses, and legal disclaimers stating that YouTube is not responsible for products featured in videos. There is no information about the video's actual subject—the creator's process of overengineering a spinning top—as the article's body content is missing.\n\n**Key Points from the Shown Text:**\n*   It is boilerplate legal and administrative text from YouTube.\n*   It contains copyright information, policy links, and Google's business details.\n*   It includes a disclaimer that YouTube does not sell or endorse products shown in videos.\n*   **Crucially, it provides no details about the video's topic or content.**",
    "chinese_title": "我过度设计了一个陀螺",
    "chinese_summary": "这段文字似乎是YouTube视频页面的标准法律和信息页脚，而非视频《我过度设计了一个陀螺》的实际内容。\n\n因此，对所提供内容的总结如下：\n\n该文本完全由YouTube的通用页脚信息构成。它包括政策链接（版权、条款、隐私）、YouTube/Google的联系方式、公司地址，以及声明YouTube不对视频中展示的产品负责的法律免责声明。由于文章正文内容缺失，其中没有任何关于视频实际主题——即创作者过度设计陀螺的过程——的信息。\n\n**所展示文本的关键点：**\n*   这是YouTube的标准法律和行政文本。\n*   包含版权信息、政策链接和谷歌的业务详情。\n*   包含一项免责声明，即YouTube不出售也不认可视频中展示的产品。\n*   **关键的是，它没有提供关于视频主题或内容的任何细节。**"
  },
  {
    "id": "46797868",
    "title": "Spinning around: Please don't – Common problems with spin locks",
    "url": "https://www.siliceum.com/en/blog/post/spinning-around/",
    "summary": "This article details common pitfalls in implementing spin locks and advises against their use in modern software. It begins by highlighting a basic, non-thread-safe spin lock that suffers from race conditions, then shows how to fix it using atomic operations. However, this introduces new problems.\n\nThe primary issues discussed are:\n1.  **CPU Burning:** A naive empty spin loop keeps the CPU core at high frequency, wasting power and generating heat.\n2.  **Performance Penalties:** On modern multi-core and NUMA systems, constant spinning causes expensive memory synchronization between cores, severely degrading performance, especially with Simultaneous Multithreading (SMT/Hyper-Threading).\n3.  **Incorrect Waiting:** The solution is to use the CPU's `PAUSE` instruction (or equivalent like `__yield()` on ARM) within the loop. This signals the CPU that the thread is waiting, reducing power consumption and preventing memory order violation penalties.\n4.  **Backoff Strategy:** To further reduce contention, an exponential backoff strategy is recommended, gradually increasing the number of `PAUSE` instructions between lock attempts.\n5.  **Architectural Variance:** The duration of a `PAUSE` instruction in CPU cycles varies drastically (from ~10 to over 160 cycles) across different CPU architectures (Intel vs. AMD, old vs. new). A fixed backoff counter can therefore wait too long or not enough.\n6.  **The Final Fix:** The article recommends implementing a time-bound backoff using the CPU's Time Stamp Counter (TSC) to limit the total spin duration in microseconds, making the wait time consistent and architecture-agnostic.\n\nThe overarching message is that spin locks are complex, error-prone, and require deep architectural knowledge to implement correctly. The author strongly suggests using operating system-provided synchronization primitives instead.",
    "chinese_title": "旋转吧：请不要这样做——自旋锁的常见问题",
    "chinese_summary": "本文详细阐述了实现自旋锁时常见的陷阱，并建议在现代软件中避免使用。文章首先指出一个存在竞态条件的基本非线程安全自旋锁，随后展示如何通过原子操作修复该问题，但这种方法又引入了新的难题。\n\n讨论的核心问题包括：\n1.  **CPU资源消耗**：简单的空转循环会使CPU核心保持高频运行，浪费电力并产生热量。\n2.  **性能损失**：在现代多核和NUMA系统中，持续自旋会导致核心间昂贵的内存同步操作，严重降低性能，在同时多线程（SMT/超线程）环境下尤为明显。\n3.  **等待机制缺陷**：解决方案是在循环中使用CPU的`PAUSE`指令（或ARM架构的等效指令`__yield()`）。这向CPU表明线程处于等待状态，既能降低功耗，又可避免内存顺序违规导致的性能损失。\n4.  **退避策略**：为减少竞争冲突，建议采用指数退避策略，逐步增加锁尝试之间的`PAUSE`指令次数。\n5.  **架构差异**：不同CPU架构（英特尔与AMD、新旧型号）中`PAUSE`指令的CPU周期时长差异巨大（约10到超过160个周期）。因此固定的退避计数器可能导致等待时间过长或不足。\n6.  **最终解决方案**：文章建议利用CPU时间戳计数器（TSC）实现有时限的退避机制，将总自旋时长限制在微秒级，使等待时间保持稳定且不受架构影响。\n\n贯穿全文的核心观点是：自旋锁实现复杂、易出错，且需要深厚的架构知识才能正确实施。作者强烈建议改用操作系统提供的同步原语。"
  },
  {
    "id": "46799477",
    "title": "LM Studio 0.4.0",
    "url": "https://lmstudio.ai/blog/0.4.0",
    "summary": "LM Studio 0.4.0 introduces a major update focused on deployment flexibility, performance, and a refreshed user experience. The key addition is **llmster**, a headless server-native daemon that allows the core software to be deployed on cloud servers, CI pipelines, or anywhere without a GUI, via a new CLI.\n\nFor performance, the release adds **parallel request processing with continuous batching** (via an updated llama.cpp engine), enabling high-throughput concurrent inference instead of queuing. A new **stateful REST API endpoint (`/v1/chat`)** supports multi-turn conversations and integrates locally configured MCPs (Model Context Protocols).\n\nThe desktop application receives a **complete UI refresh**, featuring chat export (PDF, markdown, text), a split-view for multiple chats, a developer mode for advanced options, and in-app documentation. The CLI is also enhanced with a new interactive `lms chat` command.\n\nOverall, LM Studio 0.4.0 transforms from a desktop-only application into a platform suitable for both local development and scalable server-side deployment.",
    "chinese_title": "LM Studio 0.4.0",
    "chinese_summary": "LM Studio 0.4.0 推出了一项重大更新，重点在于提升部署灵活性、性能表现以及焕然一新的用户体验。核心新增功能是 **llmster**，这是一个无头服务器原生守护进程，通过新的命令行界面（CLI），允许将核心软件部署在云服务器、CI流水线或任何无需图形界面的环境中。\n\n在性能方面，本次更新引入了**支持连续批处理的并行请求处理**（通过升级的 llama.cpp 引擎），实现了高吞吐量的并发推理，而非排队等待。全新的**有状态 REST API 端点（`/v1/chat`）** 支持多轮对话，并能集成本地配置的 MCP（模型上下文协议）。\n\n桌面应用程序进行了**全面的界面更新**，新增聊天导出功能（PDF、Markdown、文本）、多聊天分屏视图、面向高级选项的开发者模式以及内置应用文档。命令行界面也得到增强，新增了交互式的 `lms chat` 命令。\n\n总体而言，LM Studio 0.4.0 已从仅限桌面的应用程序，转变为一个既适合本地开发又适用于可扩展服务器端部署的平台。"
  },
  {
    "id": "46744272",
    "title": "3D-Printed Mathematical Lampshades",
    "url": "https://hessammehr.github.io/blog/posts/2025-12-24-maths-to-lampshade.html",
    "summary": "This article details the process of creating a 3D-printed lampshade with a complex, organic shape derived from a mathematical equation. The author was inspired by viral videos and began by graphing a polar equation in Desmos to generate a 2D profile featuring large undulations with small ridges.\n\nInitial attempts to model the 3D shape in OnShape by lofting this intricate profile (composed of over 1,000 points) to a single apex point proved challenging, causing the software to freeze or fail. To overcome this, the author pivoted to a Python-based solution, using a script (developed with ChatGPT's assistance) to programmatically generate the 3D mesh by scaling the 2D profile as it rises to a point, forming a smooth dome.\n\nThe final design was exported as a large STL file and successfully 3D printed using translucent PLA filament. The author has since made the code more accessible by converting it to a marimo notebook, which allows the profile and cross-section to be visualized directly in a web browser without any local installation.",
    "chinese_title": "3D打印数学灯罩",
    "chinese_summary": "本文详细介绍了如何通过数学方程生成复杂有机形状，并以此制作3D打印灯罩的过程。作者受网络热门视频启发，首先在Desmos中绘制极坐标方程，生成具有大幅波动与细微褶皱的二维轮廓。\n\n初期尝试在OnShape中将这个由1000多个点构成的复杂轮廓放样至单一顶点时遇到困难，软件频繁卡顿或崩溃。为此，作者转向基于Python的解决方案，通过ChatGPT协助编写的脚本，将二维轮廓随高度上升逐步缩放至顶点，程序化生成平滑圆顶状的三维网格模型。\n\n最终设计导出为大型STL文件，并采用半透明PLA线材成功完成3D打印。作者后续将代码转换为marimo笔记本格式，用户无需本地安装即可在网页浏览器中直接可视化轮廓与横截面，大幅提升了代码的可访问性。"
  },
  {
    "id": "46794281",
    "title": "Show HN: SHDL – A minimal hardware description language built from logic gates",
    "url": "https://github.com/rafa-rrayes/SHDL",
    "summary": "SHDL is a minimal hardware description language designed for digital circuit simulation using only logic gates. It features a simple syntax for defining circuits and includes a Python API (PySHDL) for simulation, along with a C backend for fast, optimized execution. Users can define components (like a full adder), connect gates, and simulate behavior through Python commands for setting inputs, stepping through cycles, and reading outputs. The tool also provides a command-line compiler (`shdlc`) to generate C code or binaries. SHDL supports component reuse, constants, and is open to feedback and contributions via its GitHub repository.",
    "chinese_title": "展示HN：SHDL – 一个从逻辑门构建的极简硬件描述语言",
    "chinese_summary": "SHDL是一种极简硬件描述语言，专为仅使用逻辑门进行数字电路仿真而设计。它采用简洁语法定义电路，包含用于仿真的Python API（PySHDL），以及支持快速优化执行的C后端。用户可通过Python命令定义组件（如全加器）、连接逻辑门并进行行为仿真，包括设置输入、逐步执行时钟周期和读取输出。该工具还提供命令行编译器（`shdlc`）以生成C代码或二进制文件。SHDL支持组件复用、常量定义，并通过GitHub仓库开放反馈与贡献渠道。"
  },
  {
    "id": "46795582",
    "title": "When Every Network is 192.168.1.x",
    "url": "https://netrinos.com/blog/conflicting-subnets",
    "summary": "This article addresses the common problem faced by service companies managing devices across multiple customer sites: nearly all consumer networks use the same default IP subnet (e.g., 192.168.1.x). This creates routing conflicts when trying to access devices like cameras or NVRs from a central location, as traditional VPNs cannot distinguish between identical IP addresses at different sites.\n\nTraditional solutions like port forwarding or re-addressing local networks are impractical, unreliable, and insecure at scale. The effective solution is **overlay addressing with 1:1 NAT**.\n\nHere’s how it works: A small gateway device (like a Raspberry Pi) is placed on each customer's LAN. It connects to a central WireGuard mesh network. Each remote device (camera, NVR) is assigned a **unique IP address from a dedicated overlay range** (like 100.64.0.0/10). The gateway performs Network Address Translation (NAT), seamlessly translating between the device's local IP (e.g., 192.168.1.100) and its unique overlay address for all traffic on the mesh.\n\nThis approach eliminates IP conflicts, removes the need for risky public port forwarding, and provides encrypted end-to-end connectivity. Devices become reachable by consistent DNS names, and connectivity survives ISP modem changes. The core challenge is automating the orchestration of WireGuard configs, NAT rules, and DNS across hundreds of sites—which tools like Netrinos are built to solve.",
    "chinese_title": "当每个网络都是192.168.1.x时",
    "chinese_summary": "本文探讨了服务公司在管理多个客户站点设备时面临的普遍问题：几乎所有消费级网络都使用相同的默认IP子网（如192.168.1.x）。当试图从中央位置访问摄像头或NVR等设备时，由于传统VPN无法区分不同站点中相同的IP地址，会导致路由冲突。\n\n传统的解决方案（如端口转发或重新配置本地网络地址）在大规模部署中既不实用、不可靠，也不安全。有效的解决方案是**采用1:1 NAT的覆盖层寻址技术**。\n\n其工作原理如下：在每个客户的局域网中部署一个小型网关设备（如树莓派），该设备连接到中央WireGuard网状网络。每个远程设备（摄像头、NVR）被分配**来自专用覆盖层地址范围的唯一IP地址**（如100.64.0.0/10）。网关执行网络地址转换（NAT），在设备本地IP（如192.168.1.100）与其在网状网络中唯一的覆盖层地址之间无缝转换所有流量。\n\n这种方法消除了IP冲突，无需冒险进行公共端口转发，并提供加密的端到端连接。设备可通过固定的DNS名称访问，且连接在ISP调制解调器更换时仍能保持。核心挑战在于如何自动化协调数百个站点的WireGuard配置、NAT规则和DNS——这正是Netrinos等工具旨在解决的问题。"
  },
  {
    "id": "46755278",
    "title": "Immanuel 'the Königsberg clock' Kant (2015)",
    "url": "https://www.versobooks.com/en-gb/blogs/news/1963-immanuel-kant-the-errrr-walker",
    "summary": "This article explores the disciplined life and walking habits of philosopher Immanuel Kant, drawing from Frédéric Gros's *A Philosophy of Walking* and a conversation between Heiner Müller and Alexander Kluge.\n\nKant was famously rigid in his routines, earning the nickname \"the Königsberg clock\" for his precise daily schedule. His solitary afternoon walk was a non-negotiable hygienic ritual, taken to breathe through his nose. He followed the same route so consistently it became known as \"The Philosopher's Walk.\"\n\nGros uses Kant's walking practice to highlight three philosophical aspects: its **monotony** frees the mind for thought; its **regularity** demonstrates how discipline builds monumental work through small, repeated efforts; and its **inescapability** reflects a willed destiny, where starting the walk forces one to finish it.\n\nThe article also contrasts Kant's brief, careful walks with Nietzsche's strenuous hikes and notes Kant's interest in dietetics, which he credited for his longevity. Anecdotally, a conversation excerpt reveals a more human side: Müller shares a (likely apocryphal) story that Kant's regular walks included stopping at a specific oak tree to masturbate, humorously contradicting his own stern writings against the practice. This contrasts with his otherwise austere and orderly public image.",
    "chinese_title": "伊曼努尔·“柯尼斯堡时钟”·康德（2015）",
    "chinese_summary": "本文探讨了哲学家伊曼努尔·康德严谨的生活与散步习惯，取材于弗雷德里克·格罗的《散步哲学》以及海纳·穆勒与亚历山大·克鲁格的对话。康德以其刻板的日常规律闻名，因精准的作息被称为“柯尼斯堡时钟”。他每日午后雷打不动的独行散步是一种不可妥协的保健仪式，旨在用鼻腔呼吸。他始终遵循同一路线，这条小径因此得名“哲学家之路”。\n\n格罗借康德的散步实践阐明了三个哲学维度：其**单调性**让思维得以自由驰骋；其**规律性**展现了微小而重复的自律如何铸就宏大的思想成果；其**不可中断性**则象征一种自主选择的命运——一旦启程就必须走完全程。\n\n文章还将康德短暂而谨慎的散步与尼采耗费体力的长途徒步进行对比，并提及康德对养生学的重视，他认为这正是自己长寿的秘诀。一段轶事对话则展现了更人性化的一面：穆勒讲述了一个（可能虚构的）故事，称康德散步时常在一棵特定橡树下自渎，这与其著作中反对此行为的严肃论述形成幽默反差，也与他平日严峻有序的公众形象大相径庭。"
  },
  {
    "id": "46739704",
    "title": "Show HN: Dwm.tmux – a dwm-inspired window manager for tmux",
    "url": "https://github.com/saysjonathan/dwm.tmux",
    "summary": "**dwm.tmux** is a tmux plugin that replicates the tiling window management behavior of the dwm window manager within tmux sessions. It organizes panes into a main pane on the left and a vertical stack of secondary panes on the right.\n\n**Key Features:**\n*   **Tiled Layout:** Automatically arranges panes into a main area and a stack.\n*   **Pane Management:** Commands to create, kill, move, rotate, and zoom panes, with options for same-directory spawning.\n*   **Window Management:** Functions for creating, killing, and switching between windows.\n*   **Customizable:** Keybindings and behavior (like the main pane size factor `mfact`) can be configured via environment variables or tmux bindings in your `.tmux.conf`.\n*   **Floating Panes:** Includes a popup function for temporary floating panes.\n\n**Installation** is done via a Makefile, and setup requires sourcing its config file in `~/.tmux.conf`. It requires **tmux version 3.2 or higher**.\n\nThe plugin provides a set of default meta-key shortcuts for all operations, offering a keyboard-driven workflow inspired by dwm for efficient terminal multiplexing.",
    "chinese_title": "Show HN: Dwm.tmux – 一款受dwm启发的tmux窗口管理器",
    "chinese_summary": "**dwm.tmux** 是一个 tmux 插件，可在 tmux 会话中复现 dwm 窗口管理器的平铺窗口管理行为。它将窗格组织为左侧的主窗格和右侧垂直堆叠的辅助窗格。\n\n**主要特性：**\n*   **平铺布局：** 自动将窗格排列为主区域和堆叠区域。\n*   **窗格管理：** 提供创建、关闭、移动、旋转和缩放窗格的命令，并支持在同目录下生成窗格。\n*   **窗口管理：** 提供创建、关闭和切换窗口的功能。\n*   **可自定义：** 可通过环境变量或在 `.tmux.conf` 中配置 tmux 绑定来自定义按键绑定和行为（如主窗格大小比例 `mfact`）。\n*   **浮动窗格：** 包含用于临时浮动窗格的弹出功能。\n\n**安装**通过 Makefile 完成，设置需要在 `~/.tmux.conf` 中引入其配置文件。要求 **tmux 版本 3.2 或更高**。\n\n该插件为所有操作提供了一套默认的元键快捷键，提供受 dwm 启发的键盘驱动工作流，以实现高效的终端多路复用。"
  },
  {
    "id": "46735407",
    "title": "There's only one Woz, but we can all learn from him",
    "url": "https://www.fastcompany.com/91477114/steve-wozniak-woz-apple-the-tech-interactive-humanitarian-award",
    "summary": "Based on the article from Fast Company, here is a concise summary:\n\nThe article profiles Apple co-founder Steve Wozniak (\"Woz\"), highlighting his enduring legacy not just as an engineering genius but as a principled humanitarian. It contrasts his quiet, collaborative personality with the more famous driven persona of Steve Jobs, crediting Woz's groundbreaking technical work (like the Apple I and II) as the true foundation of the company's early success.\n\nThe core of the piece focuses on Woz's values and post-Apple life. It details his commitment to \"ethical engineering,\" where he believes technology should serve and empower people, not control them. This philosophy is reflected in his decades of philanthropic work, notably his hands-on involvement in teaching computer skills to school children for over 30 years, often personally teaching full 5th-grade classes.\n\nWoz is presented as a model of humility and joy in work. He is driven by intrinsic motivation—the love of invention and problem-solving—rather than money or fame. The article concludes by presenting him as a crucial counterbalance in the tech industry, embodying the ideal that technological innovation should be guided by humanism, ethics, and a focus on education and positive social impact. He recently received The Tech Interactive's Humanitarian Award for this lifelong commitment.",
    "chinese_title": "只有一个沃兹，但我们都能向他学习。",
    "chinese_summary": "根据《快公司》的文章，以下是简要概述：\n\n这篇文章描绘了苹果联合创始人史蒂夫·沃兹尼亚克（“沃兹”）的形象，强调了他持久的遗产——不仅是一位工程天才，更是一位有原则的人道主义者。文中将他安静、协作的个性与史蒂夫·乔布斯更为人熟知的强势形象进行对比，并指出沃兹突破性的技术工作（如Apple I和II）才是公司早期成功的真正基石。\n\n文章的核心聚焦于沃兹的价值观和离开苹果后的生活。详细描述了他对“道德工程”的承诺，他认为技术应该服务并赋能于人，而非控制人类。这一理念体现在他数十年的慈善工作中，尤其是他三十多年来亲力亲为地教授学童计算机技能，常常亲自为整个五年级班级授课。\n\n沃兹被塑造成谦逊与工作乐趣的典范。他的动力源于内在动机——对发明和解决问题的热爱——而非金钱或名誉。文章最后将他视为科技行业至关重要的制衡力量，体现了技术创新应以人文主义、道德伦理为核心，并聚焦于教育和积极社会影响的理想。他近期因其终身奉献而荣获The Tech Interactive颁发的人道主义奖。"
  },
  {
    "id": "46791742",
    "title": "Rust at Scale: An Added Layer of Security for WhatsApp",
    "url": "https://engineering.fb.com/2026/01/27/security/rust-at-scale-security-whatsapp/",
    "summary": "WhatsApp has successfully deployed a major security enhancement by rewriting a core media-handling library in Rust, marking what they believe is the largest global rollout of Rust code. This initiative, named \"Kaleidoscope,\" aims to protect over 3 billion users from malware hidden in seemingly benign files like images or videos.\n\nThe project was driven by vulnerabilities like the 2015 \"Stagefright\" bug, which exposed the risks of relying on operating system libraries written in memory-unsafe languages like C++. By developing a parallel Rust library, WhatsApp replaced 160,000 lines of C++ with 90,000 lines of Rust, achieving better performance and memory usage. The library validates file structures, detects risky content (like PDFs with embedded scripts), and identifies file-type spoofing to prevent parser exploits.\n\nThis rollout demonstrates Rust's production readiness at an unprecedented scale, running on Android, iOS, Mac, Web, and wearables. It reflects WhatsApp's broader security strategy to reduce memory-safety vulnerabilities by defaulting to memory-safe languages for new code, while continuing to harden existing C/C++ codebases. The company plans to accelerate Rust adoption as a key part of its defense-in-depth approach to application security.",
    "chinese_title": "规模化应用Rust：为WhatsApp增添一层安全保障",
    "chinese_summary": "WhatsApp成功部署了一项重大安全增强措施，通过用Rust重写核心媒体处理库，完成了他们眼中全球最大规模的Rust代码部署。这项名为\"Kaleidoscope\"的计划旨在保护超过30亿用户免受隐藏在图像或视频等看似无害文件中的恶意软件侵害。\n\n该项目的推动力源于类似2015年\"Stagefright\"漏洞的安全隐患，这些漏洞暴露了依赖C++等内存不安全语言编写的操作系统库的风险。通过开发并行Rust库，WhatsApp用9万行Rust代码替换了16万行C++代码，实现了更好的性能和内存使用效率。该库能验证文件结构、检测风险内容（如嵌入脚本的PDF文件），并识别文件类型伪装以防止解析器漏洞利用。\n\n此次部署以空前规模证明了Rust在生产环境中的成熟度，覆盖Android、iOS、Mac、网页及可穿戴设备平台。这体现了WhatsApp更广泛的安全策略：默认采用内存安全语言编写新代码以减少内存安全漏洞，同时持续强化现有C/C++代码库。该公司计划加速采用Rust，将其作为应用安全深度防御策略的关键组成部分。"
  },
  {
    "id": "46795540",
    "title": "Show HN: I built a small browser engine from scratch in C++",
    "url": "https://github.com/beginner-jhj/mini_browser",
    "summary": "This project is a small browser engine built from scratch in C++ by a high school senior as a learning exercise. It implements the core rendering pipeline: parsing HTML into tokens and a DOM tree, applying CSS styles, calculating layouts, and finally painting to the screen using Qt. The engine supports basic HTML/CSS features, including local/network images, navigation, and a subset of CSS properties for layout and styling.\n\nKey challenges included mastering string parsing for HTML/CSS, implementing the complex state management for rendering, and handling asynchronous image loading with caching. The developer overcame these by studying foundational concepts, using AI tools for understanding, and designing robust systems.\n\nBeyond technical browser internals, the project taught valuable software engineering skills: systematic debugging, persistence through difficult problems, and the pragmatism of shipping functional, if imperfect, software. The complete code is available with build instructions for macOS, Linux, and Windows.",
    "chinese_title": "Show HN：我用C++从零开始构建了一个小型浏览器引擎",
    "chinese_summary": "本项目是一名高中生为学习而用C++从零构建的小型浏览器引擎。它实现了核心渲染管线：将HTML解析为词元及DOM树，应用CSS样式，计算布局，并最终通过Qt绘制到屏幕。该引擎支持基础HTML/CSS功能，包括本地/网络图片加载、页面导航，以及用于布局与样式处理的CSS属性子集。\n\n主要挑战包括掌握HTML/CSS字符串解析、实现复杂的渲染状态管理，以及处理带缓存的异步图片加载。开发者通过钻研基础概念、借助AI工具辅助理解，并设计健壮的系统来克服这些难题。\n\n除浏览器内部技术外，该项目还培养了宝贵的软件工程能力：系统性调试、攻克难题的毅力，以及交付可用软件（即使尚不完美）的务实精神。完整代码已开源，并提供适用于macOS、Linux和Windows的构建指南。"
  },
  {
    "id": "46771564",
    "title": "A few random notes from Claude coding quite a bit last few weeks",
    "url": "https://twitter.com/karpathy/status/2015883857489522876",
    "summary": "This brief text is not an article but a browser error message from X.com (formerly Twitter). The main points are:\n\n*   The system has detected that JavaScript is disabled in the user's web browser.\n*   To use the X.com website, the user must either enable JavaScript or switch to a different, supported browser.\n*   A link to a Help Center is provided for a list of compatible browsers.\n*   Standard website footer links are included, pointing to the Help Center, Terms of Service, Privacy Policy, Cookie Policy, Imprint, and Ads info, with a copyright notice for X Corp. dated 2026.\n\nThe core message is a technical requirement: JavaScript must be enabled to access the platform's functionality.",
    "chinese_title": "过去几周克劳德大量编码的一些零散笔记",
    "chinese_summary": "这段简短文字并非文章，而是来自X.com（原Twitter）的浏览器错误提示。主要内容如下：\n\n*   系统检测到用户网页浏览器中禁用了JavaScript。\n*   若要使用X.com网站，用户需启用JavaScript或切换至其他受支持的浏览器。\n*   提供帮助中心链接以查看兼容浏览器列表。\n*   包含标准网站页脚链接：指向帮助中心、服务条款、隐私政策、Cookie政策、法律声明和广告信息，并附有X Corp. 2026年版权声明。\n\n核心信息是一项技术"
  },
  {
    "id": "46790127",
    "title": "A verification layer for browser agents: Amazon case study",
    "url": "https://sentienceapi.com/blog/verification-layer-amazon-case-study",
    "summary": "This article presents a case study demonstrating that **reliability in browser automation agents comes from a strong verification layer, not from using larger or vision-based models.**\n\nThe core idea is to treat the browser page as a **structured snapshot** (roles, text, geometry) and gate every action with **explicit, deterministic assertions** (e.g., checking if a URL changed or an element exists). This \"Jest for agents\" approach ensures a step only succeeds if it passes verification, preventing silent failures.\n\nThe study tested an Amazon shopping flow across four demos, culminating in a fully autonomous run using a small local executor model (~3B parameters) guided by a planner. The verification layer enabled this \"impossible benchmark\" by:\n*   **Providing reliability:** The run completed 7/7 steps successfully.\n*   **Enforcing determinism:** It overruled the model with safer choices when intent was clear (e.g., clicking the first product).\n*   **Improving efficiency:** Structured snapshots and filtering reduced prompt tokens by ~43% in a baseline test.\n\nKey takeaways are that **verification is more critical than raw model intelligence** for reliability, that **structure-first snapshots are superior to pixel-based control**, and that this architecture makes **small, local models viable** for cost-effective, private, and debuggable automation.",
    "chinese_title": "浏览器代理验证层：亚马逊案例研究",
    "chinese_summary": "本文通过一个案例研究证明：**浏览器自动化代理的可靠性源于强大的验证层，而非使用更大规模或基于视觉的模型。**\n\n核心思想是将浏览器页面视为**结构化快照**（角色、文本、几何信息），并通过**明确、确定性的断言**（例如检查URL是否变更或元素是否存在）来管控每个操作。这种“面向代理的Jest测试”方法确保每个步骤只有在通过验证后才能成功，从而避免静默失败。\n\n该研究通过四个演示测试了亚马逊购物流程，最终使用由规划器引导的小型本地执行模型（约30亿参数）实现了完全自主运行。验证层通过以下方式实现了这一“不可能的任务”：\n*   **提供可靠性：** 运行成功完成了7个步骤中的7个。\n*   **确保确定性：** 当意图明确时（例如点击第一个商品），验证层会以更安全的选择覆盖模型决策。\n*   **提升效率：** 结构化快照与信息过滤在基线测试中将提示令牌数量减少了约43%。\n\n关键结论是：对于可靠性而言，**验证比原始模型智能更为关键**；**结构优先的快照优于基于像素的控制**；这种架构使得**小型本地模型**能够实现经济高效、私密且可调试的自动化。"
  },
  {
    "id": "46794231",
    "title": "Kyber (YC W23) Is Hiring a Staff Engineer",
    "url": "https://www.ycombinator.com/companies/kyber/jobs/GPJkv5v-staff-engineer-tech-lead",
    "summary": "Kyber (YC W23) is hiring a Staff Engineer/Tech Lead in New York. The role offers a salary of $200K-$260K plus equity and requires 6+ years of experience with a tech stack including Next.js, Node.js, TypeScript, and PostgreSQL.\n\nThe company builds an AI-native platform for drafting regulatory documents, primarily for insurance claims, and reports significant growth with profitable revenue and major enterprise clients.\n\nThe successful candidate will have a clear path to CTO, owning all technical decisions, shipping features, and scaling AI-driven systems. Key responsibilities include leading product development, boosting team efficiency with AI tools, ensuring reliability/security, and mentoring.\n\nIdeal applicants are described as \"10x engineers\" who excel at rapid prototyping and system design, with experience in enterprise compliance (SOC 2, HIPAA). The hiring process involves a founder screen, practical task, technical interviews, and reference checks.\n\nApplicants are encouraged to have a former colleague submit a referral with a brief endorsement to stand out.",
    "chinese_title": "Kyber（YC W23）正在招聘高级工程师",
    "chinese_summary": "Kyber（YC W23）正在纽约招聘一名高级工程师/技术主管。该职位提供20万至26万美元的薪资加股权，要求具备6年以上技术栈经验，包括Next.js、Node.js、TypeScript和PostgreSQL。\n\n该公司构建了一个用于起草监管文件的AI原生平台，主要服务于保险理赔领域，并报告了显著增长，已实现盈利收入并拥有多家大型企业客户。\n\n成功的候选人将有明确的晋升为首席技术官的路径，负责所有技术决策、功能交付和扩展AI驱动系统。主要职责包括领导产品开发、利用AI工具提升团队效率、确保系统可靠性与安全性，以及指导团队成员。\n\n理想的申请人被描述为“10倍效率工程师”，擅长快速原型设计和系统架构，并具备企业合规经验（如SOC 2、HIPAA）。招聘流程包括创始人面试、实践任务、技术面试和背景调查。\n\n建议申请人请前同事提交推荐信并附简短评价，以提升入选机会。"
  },
  {
    "id": "46783752",
    "title": "Prism",
    "url": "https://openai.com/index/introducing-prism",
    "summary": "**Summary of \"Introducing Prism\"**\n\nOpenAI has introduced Prism, a new method designed to evaluate the safety of AI models, specifically their potential to be misused for creating cybersecurity threats. The core goal is to measure a model's capability to assist in carrying out malicious cyber operations, a key concern as AI becomes more powerful.\n\nThe traditional approach of \"red-teaming\" (human experts probing for vulnerabilities) is resource-intensive and difficult to scale. Prism addresses this by creating a **standardized, automated benchmark**. It works by simulating the steps of a real cyber attack (the \"cyber kill chain\") and using a separate, high-security \"judge\" AI model to evaluate if the AI being tested can successfully perform tasks relevant to each stage, such as reconnaissance or exploitation.\n\nKey points of the Prism framework include:\n*   **Focus on Capability, Not Intent:** It assesses what a model *can* do, not whether it *will* do it, separating capability measurement from deployment safety measures.\n*   **Simulated Environment:** Tests are run in controlled, simulated network environments to prevent any real-world harm.\n*   **Standardized Scoring:** It produces a clear \"cyber score\" to compare models and track progress over time.\n*   **Proactive Safety:** The aim is to help developers understand risks *before* models are deployed, allowing for better risk mitigation and informed decisions about model release.\n\nIn essence, Prism is a proactive safety tool. By providing a scalable and repeatable way to gauge cyber offense capabilities, OpenAI hopes to help the AI community better understand and manage the risks associated with advanced AI systems, contributing to more responsible development and deployment.",
    "chinese_title": "棱镜",
    "chinese_summary": "**《Prism 简介》摘要**\n\nOpenAI 推出了 Prism，这是一种旨在评估 AI 模型安全性的新方法，特别是评估其可能被滥用于制造网络安全威胁的潜力。其核心目标是衡量模型协助实施恶意网络行动的能力，这是随着 AI 能力日益强大而备受关注的关键问题。\n\n传统的“红队测试”（由人类专家探测漏洞）方法资源密集且难以扩展。Prism 通过创建一个**标准化、自动化的基准测试**来解决这个问题。其工作原理是模拟真实网络攻击的各个步骤（即“网络杀伤链”），并使用一个独立的、高安全性的“裁判”AI 模型来评估被测试的 AI 是否能成功执行与每个阶段相关的任务，例如侦察或漏洞利用。\n\nPrism 框架的关键点包括：\n*   **关注能力而非意图：** 它评估模型**能够**做什么，而不是它**是否会**这么做，从而将能力测量与部署安全措施分开。\n*   **模拟环境：** 测试在受控的模拟网络环境中进行，以防止任何现实世界的危害。\n*   **标准化评分：** 它产生一个清晰的“网络安全评分”，用于比较不同模型并追踪其随时间的进展。\n*   **主动安全：** 其目标是帮助开发者在模型部署**之前**就了解风险，从而能够更好地进行风险缓解，并就模型发布做出明智决策。\n\n本质上，Prism 是一种主动安全工具。通过提供一种可扩展且可重复的方法来衡量网络攻击能力，OpenAI 希望帮助 AI 社区更好地理解和管理与先进 AI 系统相关的风险，从而促进更负责任的开发和部署。"
  },
  {
    "id": "46768906",
    "title": "Show HN: Cua-Bench – a benchmark for AI agents in GUI environments",
    "url": "https://github.com/trycua/cua",
    "summary": "Cua is an open-source platform for building, benchmarking, and deploying AI agents that can interact with computer interfaces. Its core offering consists of three main components:\n\n1.  **Cua:** A framework for creating agents that automate GUI tasks (like clicking buttons) and execute code in isolated sandboxes (Docker, QEMU).\n2.  **Cua-Bench:** A benchmarking suite to evaluate these agents on established tasks (OSWorld, ScreenSpot) and custom environments, supporting trajectory export for training.\n3.  **Lume:** A tool for managing high-performance macOS and Linux virtual machines on Apple Silicon.\n\nThe platform is modular, with separate packages for the agent framework, computer control SDK, benchmark runner, and VM management. It is designed for developers and researchers, offering extensive documentation, community support via Discord, and is open for contributions under an MIT license.",
    "chinese_title": "展示 HN：Cua-Bench —— GUI 环境中 AI 智能体的基准测试工具",
    "chinese_summary": "Cua是一个开源平台，用于构建、评估和部署能与计算机界面交互的AI智能体。其核心功能包含三大组件：\n\n1.  **Cua框架**：用于创建自动化执行GUI任务（如点击按钮）和在隔离沙箱（Docker、QEMU）中运行代码的智能体。\n2.  **Cua-Bench基准测试套件**：通过标准任务（OSWorld、ScreenSpot）和自定义环境评估智能体性能，支持轨迹导出以用于训练。\n3.  **Lume虚拟机管理工具**：用于在Apple Silicon芯片上管理高性能macOS与Linux虚拟机。\n\n该平台采用模块化设计，包含独立的智能体框架包、计算机控制SDK、基准测试运行器和虚拟机管理模块。平台面向开发者和研究人员，提供详细文档、Discord社区支持，并基于MIT许可证开放贡献。"
  },
  {
    "id": "46726269",
    "title": "SVG Path Editor",
    "url": "https://yqnn.github.io/svg-path-editor/",
    "summary": "Based on the provided text, this is not an article but a brief interface message from a web application called \"SVG Path Editor.\"\n\nThe main points are:\n*   The application is named **SVG Path Editor**, indicating it is a tool for creating or editing Scalable Vector Graphics (SVG) path data.\n*   The core message is an instruction to the user: **\"Please enable JavaScript to continue using this application.\"**\n*   This reveals that the application is **client-side and browser-based**, relying entirely on JavaScript to function. Without it enabled, the editor cannot load or operate.\n\nIn summary, this is a functional notice informing users that JavaScript is a mandatory requirement to access the SVG Path Editor's features.",
    "chinese_title": "SVG路径编辑器",
    "chinese_summary": "根据提供的文本，这不是一篇文章，而是来自名为“SVG路径编辑器”的网页应用程序的简短界面消息。\n\n要点如下：\n*   该应用程序名为**SVG路径编辑器**，表明它是一个用于创建或编辑可缩放矢量图形（SVG）路径数据的工具。\n*   核心信息是给用户的指示：**“请启用JavaScript以继续使用此应用程序。”**\n*   这表明该应用程序是**客户端且基于浏览器**的，完全依赖JavaScript运行。如果未启用JavaScript，编辑器将无法加载或操作。\n\n总之，这是一个功能性通知，告知用户JavaScript是使用SVG路径编辑器功能的必备条件。"
  },
  {
    "id": "46792194",
    "title": "Make.ts",
    "url": "https://matklad.github.io/2026/01/27/make-ts.html",
    "summary": "This article introduces **make.ts**, a workflow pattern for managing complex, interactive command sequences by writing them into a persistent script file rather than relying on shell history. The author explains that they use a TypeScript file named `make.ts` (ignored by Git) to capture ad-hoc commands, which is then executed with a single command like `./make.ts`.\n\nKey benefits of this approach include:\n- Using a proper text editor for complex commands instead of a limited shell line editor.\n- Running multiple commands easily without cumbersome `&&` conjunctions.\n- Encouraging incremental improvements, such as making commands idempotent.\n- Simplifying the transition to formal scripts when needed, as the core logic is already in the file.\n- Managing multi-process applications declaratively with concurrency support (e.g., using `Promise.all` in JavaScript/TypeScript).\n\nThe author demonstrates the pattern with a concrete example involving benchmarking a distributed system (TigerBeetle), showing how commands evolve from simple setups to complex, parameterized scripts. They recommend using a scripting language like TypeScript with Deno (or Bun) and libraries like `dax` for easy subprocess spawning and concurrency. The overall goal is to move beyond manual command entry and shell history reliance toward a more reproducible and scalable workflow.",
    "chinese_title": "Make.ts",
    "chinese_summary": "本文介绍了**make.ts**，这是一种通过将复杂交互式命令序列写入持久化脚本文件而非依赖shell历史记录来管理它们的工作流模式。作者解释了他们使用一个名为`make.ts`（被Git忽略）的TypeScript文件来捕获临时命令，随后通过类似`./make.ts`的单一命令执行该文件。\n\n这种方法的主要优势包括：\n- 使用功能完善的文本编辑器编写复杂命令，而非受限制的shell行编辑器。\n- 轻松运行多个命令，无需繁琐的`&&`连接符。\n- 鼓励渐进式改进，例如使命令具备幂等性。\n- 在需要时简化向正式脚本的过渡，因为核心逻辑已存在于文件中。\n- 通过声明式方式管理多进程应用，并支持并发操作（例如在JavaScript/TypeScript中使用`Promise.all`）。\n\n作者通过一个涉及分布式系统（TigerBeetle）基准测试的具体示例演示了该模式，展示了命令如何从简单设置演变为复杂的参数化脚本。他们建议使用TypeScript配合Deno（或Bun）等脚本语言，以及`dax`这类便于创建子进程和处理并发的库。总体目标是超越手动输入命令和依赖shell历史记录的传统方式，转向更具可复现性和可扩展性的工作流程。"
  },
  {
    "id": "46779864",
    "title": "Show HN: Build Web Automations via Demonstration",
    "url": "https://www.notte.cc/launch-week-i/demonstrate-mode",
    "summary": "**Summary:**\n\nThe article announces \"Demonstrate Mode,\" a new feature from Notte that allows users to build web automations by simply performing a task manually in their browser. Instead of writing code or using complex prompts, the tool records a user's actions (like clicks, typing, and navigation) during a single manual run-through of a workflow. It then automatically converts those actions into production-ready, editable automation code.\n\nThe key promise is a significant reduction in the technical barrier to creating automations. Users can \"show\" the system what to do, and it instantly generates the underlying code, ready for deployment. The announcement is part of the company's \"Launch Week\" series.\n\n**Key Information:**\n*   **Product:** Demonstrate Mode by Notte.\n*   **Core Function:** Records browser actions to generate automation code automatically.\n*   **User Benefit:** No coding or prompt engineering required; build by demonstration.\n*   **Output:** Production-ready, editable code.\n*   **Call to Action:** Readers are directed to build at https://console.notte.cc or book a demo.",
    "chinese_title": "展示HN：通过演示构建网页自动化",
    "chinese_summary": "**摘要：**\n\n文章宣布了Notte推出的新功能\"演示模式\"，该功能允许用户仅需在浏览器中手动执行一次任务，即可构建网络自动化流程。该工具无需编写代码或使用复杂指令，而是记录用户在单次手动操作工作流程中的行为（如点击、输入和页面跳转），随后自动将这些操作转换为可直接投入生产、可编辑的自动化代码。\n\n其核心优势在于大幅降低了创建自动化流程的技术门槛。用户只需向系统\"演示\"操作步骤，工具便能立即生成可直接部署的底层代码。此次发布是该公司\"发布周\"系列活动的组成部分。\n\n**关键信息：**\n*   **产品：** Notte的\"演示模式\"。\n*   **核心功能：** 记录浏览器操作以自动生成自动化代码。\n*   **用户受益：** 无需编码或指令工程，通过演示即可构建。\n*   **输出成果：** 可直接投入生产、可编辑的代码。\n*   **行动呼吁：** 引导读者前往 https://console.notte.cc 开始构建，或预约产品演示。"
  },
  {
    "id": "46792572",
    "title": "Virtual Boy on TV with Intelligent Systems Video Boy",
    "url": "https://hcs64.com/video-boy-vue/",
    "summary": "The Intelligent Systems Video Boy VUE is a development tool that allows Nintendo Virtual Boy games to be displayed on a standard PAL TV or monitor. It was used for demonstrations, debugging, and recording gameplay footage.\n\nThe device contains a standard Virtual Boy main board mounted onto a custom \"VUE TV Monitor\" board. This monitor board uses two FPGAs and several SRAM chips to convert the Virtual Boy's unique column-based display into a standard PAL video signal. Output is provided via RGB and a PAL multi-out AV connector.\n\nA key feature is a set of DIP switches that control the display of the stereoscopic images: the left-eye image can be shown in red, the right-eye in green, or they can be combined for an anaglyph 3D effect. The unit outputs a clean S-Video signal, though its composite video is blurrier.\n\nThe article details the internal hardware, including the FPGAs, memory configuration, and video encoder, and notes that this particular unit appears to be a modified or retrofitted \"Ver. C\" model. It served as a practical tool for developers to share the Virtual Boy experience without the need for the headset.",
    "chinese_title": "Virtual Boy电视版搭配智能系统视频男孩",
    "chinese_summary": "智能系统视频男孩VUE是一款开发工具，允许将任天堂Virtual Boy游戏显示在标准的PAL制式电视或显示器上。该工具曾用于演示、调试和录制游戏画面。\n\n该设备包含一块标准的Virtual Boy主板，安装在一块定制的“VUE电视监视器”电路板上。这块监视器板采用两个FPGA和多个SRAM芯片，将Virtual Boy独特的列式显示转换为标准的PAL视频信号。输出通过RGB和PAL多接口AV连接器提供。\n\n其关键特性是一组控制立体图像显示的DIP开关：左眼图像可显示为红色，右眼图像可显示为绿色，也可将两者合并以产生红蓝立体3D效果。设备可输出清晰的S-Video信号，但其复合视频信号较为模糊。\n\n文章详细介绍了内部硬件，包括FPGA、内存配置和视频编码器，并指出此特定设备似乎是经过改装或升级的“Ver. C”型号。它曾是开发者无需头戴设备即可分享Virtual Boy体验的实用工具。"
  },
  {
    "id": "46790740",
    "title": "Android's full desktop interface leaks: New status bar, Chrome Extensions",
    "url": "https://9to5google.com/2026/01/27/android-desktop-leak/",
    "summary": "This article reports on a leak revealing Google's development of a full desktop interface for Android, codenamed \"Aluminum OS\" (ALOS). The information came from a Chromium bug report that included screenshots taken on an HP Chromebook, indicating Google is using existing hardware to build the experience, likely for Android 16.\n\nKey details from the leak include:\n\n*   **Interface:** A new, taller status bar optimized for large screens, showing time with seconds, date, and system icons. The taskbar remains similar to current designs.\n*   **Features:** The interface shows Chrome with an **Extensions button**—a feature currently exclusive to desktop browsers—and demonstrates split-screen multitasking.\n*   **Windowing:** App windows have a desktop-style title bar with minimize, fullscreen, and close buttons, resembling ChromeOS.\n\nThe leak suggests Google is advancing Android into a more capable desktop operating system, moving beyond tablet and phone-projected modes to a native, large-screen experience with crucial desktop features like browser extensions.",
    "chinese_title": "安卓完整桌面界面曝光：全新状态栏与Chrome扩展支持",
    "chinese_summary": "本文报道了一起泄露事件，揭示了谷歌正在开发一款名为“铝制操作系统”（ALOS）的完整安卓桌面界面。相关信息来自一份Chromium错误报告，其中包含在惠普Chromebook上拍摄的截图，表明谷歌正在利用现有硬件构建这一体验，很可能面向安卓16系统。\n\n泄露信息的关键细节包括：\n\n*   **界面：** 一个为大型屏幕优化的全新加高状态栏，显示包含秒数的时间、日期和系统图标。任务栏设计则与当前版本类似。\n*   **功能：** 界面显示Chrome浏览器带有**扩展程序按钮**——这是目前桌面浏览器独有的功能——并展示了分屏多任务处理。\n*   **窗口化：** 应用窗口采用桌面风格的标题栏，配有最小化、全屏和关闭按钮，类似于ChromeOS。\n\n此次泄露表明，谷歌正在将安卓推进为功能更强大的桌面操作系统，超越平板和手机投屏模式，转向具备浏览器扩展等关键桌面功能的原生大屏体验。"
  },
  {
    "id": "46781530",
    "title": "430k-year-old well-preserved wooden tools are the oldest ever found",
    "url": "https://www.nytimes.com/2026/01/26/science/archaeology-neanderthals-tools.html",
    "summary": "**Summary of \"430,000-Year-Old Well-Preserved Wooden Tools Are the Oldest Ever Found\"**\n\nArchaeologists have discovered the oldest known wooden tools, dating back approximately 430,000 years, at a site in Spain. This find dramatically pushes back the timeline for the sophisticated use of wood by early humans.\n\nThe artifacts, including a pointed digging stick and a smoothed, curved object, were found preserved in waterlogged sediments at the archaeological site of Aranbaltza. Their exceptional preservation offers a rare and direct look at wooden technology from the Middle Pleistocene, a period from which wooden items almost never survive.\n\nAnalysis indicates the tools were carefully crafted, showing evidence of being shaped with stone tools, stripped of bark, and fire-hardened to create durable, sharp points. The digging stick, in particular, suggests systematic use for excavating roots or tubers, or possibly for defense.\n\nWhile stone tools from this era are common, this discovery proves that wood—a perishable material—was a crucial part of early human toolkits much earlier than previously documented. The makers of the tools were likely early Neanderthals or their immediate ancestors, demonstrating advanced cognitive skills and planning in their manufacture.\n\nThe find fundamentally alters our understanding of prehistoric technology, highlighting that the \"Stone Age\" could equally be called the \"Wood Age,\" and that early humans were adept at utilizing a wide range of materials from their environment.",
    "chinese_title": "43万年前保存完好的木制工具是迄今发现的最古老木器。",
    "chinese_summary": "**《43万年前保存完好的木质工具为迄今最古老发现》摘要**\n\n考古学家在西班牙一处遗址发现了已知最古老的木质工具，其年代可追溯至约43万年前。这一发现极大地推翻了早期人类复杂使用木材的时间线。\n\n这些文物包括一根尖头挖掘棒和一个光滑的弧形物体，发现于阿拉巴尔扎考古遗址的浸水沉积物中，保存状况极佳。其异常完好的保存状态，为研究中更新世（该时期的木质物品几乎无法留存至今）的木质技术提供了罕见而直接的证据。\n\n分析表明，这些工具经过精心制作，有证据显示它们曾用石器塑形、剥去树皮，并经火烤硬化以形成耐用锋利的尖端。尤其是那根挖掘棒，表明其曾被系统性地用于挖掘根茎或块茎，或可能用于防御。\n\n虽然该时期的石器很常见，但这一发现证明，木材这种易腐材料作为早期人类工具包的重要组成部分，其使用时间远比此前记载的更早。这些工具的制造者很可能是早期尼安德特人或他们的直系祖先，其制作过程展现了先进的认知技能和规划能力。\n\n这一发现从根本上改变了我们对史前技术的理解，凸显出\"石器时代\"同样可被称为\"木器时代\"，并且早期人类善于利用环境中的多种材料。"
  },
  {
    "id": "46735152",
    "title": "Golden Ratio using an equilateral triangle inscribed in a circle",
    "url": "https://geometrycode.com/free/how-to-graphically-derive-the-golden-ratio-using-an-equilateral-triangle-inscribed-in-a-circle/",
    "summary": "**Summary of \"Golden Ratio using an equilateral triangle inscribed in a circle\"**\n\nThe article presents a geometric construction to derive the Golden Ratio (φ ≈ 1.618) using a simple setup of an equilateral triangle inscribed in a circle.\n\n**Main Construction Steps:**\n1.  Inscribe an equilateral triangle within a circle.\n2.  Draw a line from the midpoint of one side of the triangle to the opposite vertex on the circle. This line passes through the circle's center.\n3.  The key segment is then defined from that top vertex down to the midpoint of the *opposite side of the triangle* (not the circle's center). This creates a specific point of intersection along the radius.\n\n**Key Geometric Result:**\nThe construction divides the radius of the circle into two segments. The ratio of the **entire radius** to the **longer segment** is exactly equal to the Golden Ratio. Conversely, the ratio of the **longer segment** to the **shorter segment** also equals φ.\n\n**Core Insight:**\nThis method visually demonstrates the defining property of the Golden Ratio—that the ratio of the whole to the larger part is the same as the ratio of the larger part to the smaller part (a/b = (a+b)/a = φ). It connects the fundamental symmetry of the equilateral triangle and circle to the famous irrational constant, providing an elegant graphical proof without complex calculations.",
    "chinese_title": "黄金比例：利用圆内接等边三角形的方法",
    "chinese_summary": "**《利用圆内接等边三角形推导黄金比例》摘要**\n\n本文提出一种几何构造法，通过圆内接等边三角形的简单设定推导黄金比例（φ ≈ 1.618）。\n\n**主要构造步骤：**\n1. 作圆内接等边三角形。\n2. 从三角形一边中点向圆上对顶点作直线，该直线通过圆心。\n3. 关键线段定义为从该顶点到**三角形对边中点**（非圆心）的连线，从而在半径上形成特定交点。\n\n**核心几何结论：**\n该构造将圆的半径分为两段。**整条半径**与**较长分段**之比恰等于黄金比例；反之，**较长分段**与**较短分段**之比亦等于 φ。\n\n**核心洞见：**\n此方法直观展示了黄金比例的定义特性——整体与较大部分之比等于较大部分与较小部分之比（a/b = (a+b)/a = φ）。它将等边三角形与圆的基本对称性与著名的无理常数相联系，无需复杂计算即提供了一种优雅的图解证明。"
  }
]