[
  {
    "id": "46425198",
    "title": "Google is dead. Where do we go now?",
    "url": "https://www.circusscientist.com/2025/12/29/google-is-dead-where-do-we-go-now/",
    "summary": "The author, a long-time Google Ads user for their entertainment business, reports a sudden and severe decline in ad performance. Despite increasing their budget, running multiple campaigns, and even using a substantial Google Ads credit bonus, they received zero return on a 10x budget increase, leading them to stop investing in the platform.\n\nFacing this revenue crisis, they outline a multi-pronged strategy to rebuild their business. This includes pivoting to short-form video ads on platforms like TikTok and Instagram to reach younger audiences. They are also focusing on their existing customer base through a regular email newsletter to drive repeat business.\n\nAdditionally, they plan to engage in local, physical marketing like free shows at markets and are developing new product lines related to their core business. As an immediate stopgap, the author offers their services in website and IoT development to generate income while they implement these new strategies.",
    "chinese_title": "谷歌已死。我们该何去何从？",
    "chinese_summary": "作者长期在娱乐业务中使用谷歌广告，但近期广告效果突然急剧下滑。尽管增加了预算、同时运行多个广告系列，甚至使用了大量谷歌广告赠金，但在预算提升十倍后仍毫无回报，因此决定停止在该平台的投入。\n\n面对收入危机，他们制定了多管齐下的业务重建策略：转向TikTok和Instagram等平台的短视频广告以触达年轻受众；同时通过定期发送电子邮件通讯维护现有客户群，促进复购。\n\n此外，他们计划开展本地实体营销（如在市集举办免费演出），并围绕核心业务开发新产品线。作为过渡方案，作者还提供网站与物联网开发服务以获取收入，支撑新战略的实施。"
  },
  {
    "id": "46424262",
    "title": "All Delisted Steam Games",
    "url": "https://delistedgames.com/all-delisted-steam-games/",
    "summary": "This page serves as a comprehensive list of 1,038 video games that have been removed (delisted) from the Steam store. The primary purpose is to catalog these titles and link each one to its associated developers and publishers.\n\nThe list is organized alphabetically and includes a wide range of games, from major AAA titles like *007 Legends*, *Alan Wake*, and *Battleborn* to smaller indie games. An asterisk (*) indicates a placeholder page with only basic details.\n\nKey recurring themes in the delistings include:\n*   **Licensing Expirations:** Many games based on movies, TV shows (e.g., *Adventure Time*, *Doctor Who*), or other IP have been removed.\n*   **Server Shutdowns:** Primarily online-focused or live-service games like *Battleborn*, *Evolve*, and *Atlas Reactor*.\n*   **Developer/Publisher Closures:** Games from studios that have shut down, such as Telltale Games titles (*Back to the Future: The Game*) and those from defunct publishers like THQ.\n*   **Re-releases:** Some games marked as \"[RELISTED]\" (e.g., *Call of Juarez: Gunslinger*, *Dark Souls*) have been returned to Steam, often as remastered or updated versions.\n\nThe data highlights the transient nature of digital storefronts, where games can disappear due to legal, commercial, or technical reasons, making such archives valuable for preservation.",
    "chinese_title": "所有已下架的Steam游戏",
    "chinese_summary": "本页面是Steam商店中已下架的1,038款游戏的完整列表，主要目的在于收录这些游戏并关联其对应的开发商与发行商。\n\n列表按字母顺序排列，涵盖从《007传奇》《心灵杀手》《为战而生》等3A大作到各类小型独立游戏。标有星号（*）的条目为仅含基础信息的占位页面。\n\n游戏下架的常见原因包括：\n*   **授权到期：** 许多基于影视剧（如《探险活宝》《神秘博士》）或其他IP的游戏因此下架。\n*   **服务器关闭：** 主要为强联网或服务型游戏，如《为战而生》《进化》《阿特拉斯反应》。\n*   **开发商/发行商停业：** 例如Telltale Games旗下作品（《回到未来：游戏版》）及THQ等已倒闭发行商的游戏。\n*   **重新上架：** 部分标注“[已重新上架]”的游戏（如《狂野西部：枪手》《黑暗之魂》）以重制或更新版本形式回归Steam。\n\n这些数据凸显了数字商店内容的短暂性——游戏常因法律、商业或技术原因消失，使得此类存档对游戏保存具有重要意义。"
  },
  {
    "id": "46422009",
    "title": "Static Allocation with Zig",
    "url": "https://nickmonad.blog/2025/static-allocation-with-zig-kv/",
    "summary": "This article explores implementing static memory allocation in a Redis-compatible key/value server (\"kv\") using Zig. The author adopts \"TigerStyle,\" a technique where all memory is allocated at startup and reused, avoiding dynamic allocation/freeing during runtime to improve performance, predictability, and security.\n\nThe implementation focuses on three areas:\n1.  **Connection Handling:** Uses memory pools for `Connection` structs and their send/receive buffers, setting a fixed maximum for concurrent connections.\n2.  **Command Parsing:** Employs a `FixedBufferAllocator` for zero-copy parsing of Redis commands (RESP protocol), resetting it after each request.\n3.  **Key/Value Storage:** Utilizes Zig's unmanaged hash map (`std.StringHashMapUnmanaged`) pre-allocated with maximum capacity. A custom `ByteArrayPool` stores key/value data, with the map managing pointers.\n\nKey challenges include determining upfront memory limits based on configurable parameters (max connections, key/value sizes) and managing hash map efficiency—particularly ensuring enough space for worst-case scenarios (e.g., every key holding a maximally sized list) and handling deletions without dynamic reallocation. The author concludes that a custom map implementation may be necessary for optimal control in a statically allocated context.",
    "chinese_title": "使用Zig进行静态分配",
    "chinese_summary": "本文探讨了如何使用Zig语言在兼容Redis的键值服务器（\"kv\"）中实现静态内存分配。作者采用了\"TigerStyle\"技术，即在启动时分配所有内存并重复使用，避免运行时动态分配/释放，以提高性能、可预测性和安全性。\n\n实现主要关注三个领域：\n1.  **连接处理：** 使用内存池管理`Connection`结构及其发送/接收缓冲区，为并发连接设置固定上限。\n2.  **命令解析：** 采用`FixedBufferAllocator`实现Redis命令（RESP协议）的零拷贝解析，并在每个请求后重置分配器。\n3.  **键值存储：** 使用Zig的非托管哈希映射（`std.StringHashMapUnmanaged`）并预先分配最大容量。自定义的`ByteArrayPool`存储键值数据，映射表负责管理指针。\n\n主要挑战包括：根据可配置参数（最大连接数、键值大小）预先确定内存限制，以及管理哈希映射的效率——特别是确保为最坏情况（例如每个键都存储最大尺寸的列表）预留足够空间，并在不进行动态重新分配的情况下处理删除操作。作者总结认为，在静态分配环境中，为实现最优控制可能需要自定义映射实现。"
  },
  {
    "id": "46401052",
    "title": "Flame Graphs vs. Tree Maps vs. Sunburst (2017)",
    "url": "https://www.brendangregg.com/blog/2017-02-06/flamegraphs-vs-treemaps-vs-sunburst.html",
    "summary": "This 2017 article compares different visualizations for analyzing file system disk usage, using the Linux 4.9-rc5 source code as an example.\n\nThe author argues that **Flame Graphs** are highly effective for a default view. They allow for quick, high-level understanding by comparing rectangle lengths, enabling users to immediately see that, for instance, the `drivers` directory consumes over 50% of space. They remain informative even in static formats like screenshots or printouts.\n\n**Tree Maps** (e.g., GrandPerspective, Baobab) make better use of vertical space and can highlight large individual files, but make it harder to compare sizes and grasp top-level proportions at a glance without interactive exploration.\n\n**Sunburst** diagrams, while visually striking, are criticized for being perceptually misleading. Their use of angles and radial area can exaggerate the size of deeper directories, making accurate comparison difficult.\n\nTraditional tools like **`ncdu`** and **`du`** are acknowledged as practical starting points due to their speed and simplicity, but they lack the holistic, multi-level overview provided by the visualizations.\n\nThe author concludes that an ideal tool would offer all three visualizations as complementary views, but suggests the flame graph is likely the best choice for a default, at-a-glance understanding of hierarchical data.",
    "chinese_title": "火焰图 vs. 树状图 vs. 旭日图（2017）",
    "chinese_summary": "这篇2017年的文章以Linux 4.9-rc5源代码为例，比较了分析文件系统磁盘使用情况的不同可视化方法。\n\n作者认为**火焰图**作为默认视图效果极佳。通过对比矩形长度，它能帮助用户快速建立高层级认知——例如立即看出`drivers`目录占用超过50%空间。即使以截图或打印稿等静态形式呈现，它依然能提供丰富信息。\n\n**树状图**（如GrandPerspective、Baobab）能更高效利用垂直空间，突出显示大型独立文件，但若不进行交互式探索，则难以直观比较文件大小或把握顶层目录的比例关系。\n\n**旭日图**虽然视觉冲击力强，但被批评存在感知误导性。其角度与径向面积的设计可能夸大深层目录的视觉占比，导致准确比较变得困难。\n\n传统工具如**`ncdu`**和**`du`**因速度快、操作简单被视为实用的入门选择，但它们缺乏可视化工具提供的多层次整体视角。\n\n作者总结道，理想工具应同时提供这三种互为补充的可视化视图，但指出火焰图可能是理解层级数据时最适合作为默认快速浏览的选择。"
  },
  {
    "id": "46423566",
    "title": "List of domains censored by German ISPs",
    "url": "https://cuiiliste.de/domains",
    "summary": "This text appears to be the navigation menu and header for a website called **CUIIListe.de**. The site's primary purpose is to track and list internet domains that are **blocked or censored by German Internet Service Providers (ISPs)**, likely under legal orders.\n\nThe key information and functions of the site, as indicated by the menu, are:\n*   **Listing Blocked Domains:** It maintains a list of domains that have been censored.\n*   **User Submission:** It allows visitors to \"Domain hinzufügen\" (Add a domain) to the list.\n*   **Self-Check Tool:** It offers a \"Bin ich betroffen?\" (Am I affected?) feature, presumably to let users check if their access to a site is being blocked.\n*   **Circumvention Guidance:** It provides information on \"Zensur umgehen\" (Bypass censorship), suggesting methods to access blocked content.\n*   **Background:** An \"Über uns\" (About us) section explains the site's purpose.\n\nIn essence, **CUIIListe.de acts as a public transparency and resource platform regarding internet censorship in Germany**, focusing on informing users about blocked sites and offering ways to identify and potentially circumvent these blocks.",
    "chinese_title": "德国互联网服务提供商屏蔽的域名列表",
    "chinese_summary": "这段文字似乎是网站 **CUIIListe.de** 的导航菜单和标题。该网站的主要目的是追踪并列出**被德国互联网服务提供商（ISP）根据法律命令封锁或审查**的互联网域名。\n\n根据菜单显示，网站的核心信息和功能包括：\n*   **列出被封锁域名：** 维护一份已受审查的域名列表。\n*   **用户提交功能：** 允许访客“添加域名”至该列表。\n*   **自检工具：** 提供“我受影响了吗？”功能，可能用于让用户检查自己访问某个网站是否受到封锁。\n*   **规避指南：** 提供“绕过审查”的信息，建议访问被封锁内容的方法。\n*   **背景介绍：** “关于我们”部分解释了网站的宗旨。\n\n本质上，**CUIIListe.de 是一个关于德国互联网审查的公共透明度与资源平台**，侧重于告知用户被封锁的网站，并提供识别和潜在规避这些封锁的方法。"
  },
  {
    "id": "46423521",
    "title": "The production bug that made me care about undefined behavior",
    "url": "https://gaultier.github.io/blog/the_production_bug_that_made_me_care_about_undefined_behavior.html",
    "summary": "This article recounts a production bug in a C++ payment system where an HTTP endpoint returned contradictory JSON fields (`\"error\": true, \"succeeded\": true`), which should have been mutually exclusive. The author traced the issue to uninitialized boolean fields in a `Response` struct. The declaration `Response response;` triggered default initialization, which, for this non-POD struct, called a compiler-generated default constructor. This constructor initialized the `std::string` member but left the primitive `bool` fields uninitialized, leading to undefined behavior when they were read.\n\nThe investigation revealed the complexity and pitfalls of C++ initialization rules, which vary based on type (POD vs. non-POD) and can change between standards. The fix was to use value initialization (`Response response{};`) to ensure all fields were zero-initialized. The author notes that compilers often don't warn about such issues, emphasizing the need for external tools like AddressSanitizer or static analyzers, though these have limitations.\n\nThe experience underscored that undefined behavior is a real and dangerous phenomenon that can cause programs to act completely unpredictably, contradicting the apparent logic of the source code. The author concludes that while C++ is powerful, its intricate and error-prone initialization rules exemplify the language's flaws, advocating for simpler, safer defaults found in other languages.",
    "chinese_title": "那个让我开始关注未定义行为的生产缺陷",
    "chinese_summary": "本文讲述了一个C++支付系统中的生产故障：一个HTTP端点返回了相互矛盾的JSON字段（`\"error\": true, \"succeeded\": true`），而这两个字段本应互斥。作者将问题追溯到`Response`结构体中未初始化的布尔字段。声明`Response response;`触发了默认初始化，对于这个非POD结构体，这调用了编译器生成的默认构造函数。该构造函数初始化了`std::string`成员，但保留了原始`bool`字段未初始化，导致读取时出现未定义行为。\n\n调查揭示了C++初始化规则的复杂性和陷阱，这些规则因类型（POD与非POD）而异，并可能随标准变化而改变。修复方法是使用值初始化（`Response response{};`）以确保所有字段被零初始化。作者指出编译器通常不会对此类问题发出警告，强调了使用AddressSanitizer或静态分析器等外部工具的必要性，尽管这些工具也有局限性。\n\n这次经历凸显了未定义行为是一种真实且危险的现象，可能导致程序行为完全不可预测，与源代码的表面逻辑相矛盾。作者总结道，尽管C++功能强大，但其复杂且易出错的初始化规则体现了该语言的缺陷，并提倡采用其他语言中更简单、更安全的默认设置。"
  },
  {
    "id": "46386878",
    "title": "Show HN: Aroma: Every TCP Proxy Is Detectable with RTT Fingerprinting",
    "url": "https://github.com/Sakura-sx/Aroma",
    "summary": "**Summary:**\n\nAroma is a proof-of-concept tool that detects TCP proxies by analyzing network timing discrepancies, specifically Round-Trip Time (RTT). It operates by comparing two TCP RTT values obtained from the Linux kernel: the minimum RTT (`tcpi_min_rtt`) and the smoothed RTT (`tcpi_rtt`).\n\nThe core detection method calculates a simple score: `tcpi_min_rtt / tcpi_rtt`. In a direct connection, these values are typically similar, resulting in a high score (close to 1). However, when a TCP proxy is used, the client's RTT to the proxy server and the proxy's RTT to the destination server differ significantly. This causes the minimum RTT (often representing the proxy's fast local connection) to be much lower than the smoothed RTT (which includes the client's longer delay to the proxy), producing a low score. Scores below approximately 0.1 are flagged as proxies.\n\nThe author demonstrates this using Fastly's infrastructure, which exposes the necessary TCP socket data. The tool currently focuses on Layer 4 (TCP) proxies and may detect some VPNs that use TCP proxying, but it is not designed for Layer 3 (e.g., standard VPN) detection. The code is presented as non-production-ready, serving primarily to validate the concept that timing fingerprinting can reliably identify intermediary proxies in a connection path.",
    "chinese_title": "展示 HN：Aroma：每个 TCP 代理都可通过 RTT 指纹识别被检测",
    "chinese_summary": "**摘要：**\n\nAroma是一款概念验证工具，通过分析网络时序差异（特别是往返时间RTT）来检测TCP代理。其工作原理基于比较从Linux内核获取的两个TCP RTT值：最小RTT（`tcpi_min_rtt`）与平滑RTT（`tcpi_rtt`）。\n\n核心检测方法通过计算简单得分实现：`tcpi_min_rtt / tcpi_rtt`。在直连情况下，这两个值通常相近，得分较高（接近1）。但当存在TCP代理时，客户端到代理服务器的RTT与代理服务器到目标服务器的RTT存在显著差异。这会导致最小RTT（通常反映代理的快速本地连接）远低于平滑RTT（包含客户端到代理的较长延迟），从而产生低分。得分低于约0.1时即标记为代理。\n\n作者通过Fastly基础设施演示了该方法，该环境可提供必要的TCP套接字数据。该工具目前专注于第4层（TCP）代理检测，可能识别部分采用TCP代理的VPN，但并非为第3层（如标准VPN）检测设计。代码目前尚未达到生产就绪标准，主要用于验证时序指纹技术可可靠识别连接路径中中间代理的概念。"
  },
  {
    "id": "46422412",
    "title": "GOG is getting acquired by its original co-founder",
    "url": "https://www.gog.com/blog/gog-is-getting-acquired-by-its-original-co-founder-what-it-means-for-you/",
    "summary": "GOG, the DRM-free game store, is being acquired by its original co-founder, Michał Kiciński, from CD PROJEKT. The core mission of the platform—to preserve games and ensure player ownership—will remain unchanged and is now reinforced.\n\nThe acquisition is driven by a shared commitment to GOG's founding principles of freedom, independence, and genuine control over purchased games. Kiciński aims to strengthen this vision in a market increasingly dominated by mandatory clients and closed ecosystems.\n\nFor users, this means no disruption: DRM-free remains central, libraries and offline installers are unaffected, and account data stays with GOG. The platform will maintain its operational independence and continue its relationship with CD PROJEKT, which will still release its games on GOG while focusing its own efforts on game development.\n\nLooking ahead, GOG plans to intensify its game preservation efforts and give the community a stronger voice, with new initiatives planned for 2026. The company emphasizes it is financially stable and that patron donations will continue to fund its preservation work exclusively.",
    "chinese_title": "GOG将被其联合创始人收购。",
    "chinese_summary": "无DRM游戏平台GOG将被其联合创始人米哈尔·基钦斯基从CD PROJEKT手中收购。该平台保护游戏作品、确保玩家所有权的核心使命将保持不变，并会得到进一步强化。\n\n此次收购源于双方对GOG创立原则的共同坚守：自由、独立以及对已购游戏的真正掌控权。基钦斯基旨在强化这一理念，以应对当前由强制客户端和封闭生态系统主导的市场趋势。\n\n对用户而言，一切如常：无DRM政策仍是核心，游戏库与离线安装器不受影响，账户数据仍由GOG保管。平台将保持运营独立性，并继续与CD PROJEKT保持合作——后者仍会在GOG发布游戏，同时将自身重心集中于游戏开发。\n\n展望未来，GOG计划加强游戏保护工作并赋予社区更多话语权，相关新举措将于2026年启动。公司强调其财务状况稳定，用户赞助将继续专用于游戏保护事业。"
  },
  {
    "id": "46371120",
    "title": "High-performance C++ hash table using grouped SIMD metadata scanning",
    "url": "https://github.com/Cranot/grouped-simd-hashtable",
    "summary": "This article introduces a high-performance C++ hash table, **GroupedSIMDElastic**, which uses grouped SIMD metadata scanning to outperform state-of-the-art alternatives like `ankerl::unordered_dense` for large-scale, lookup-heavy workloads.\n\nThe key innovation is **grouped probing**. Traditional quadratic probing scatters memory accesses, making SIMD inefficient. Instead, this design probes 16 contiguous slots as a single group, enabling efficient SIMD scanning of metadata with just a few instructions. This approach, inspired by Google's Swiss Tables, filters out most non-matches using a 1-byte metadata tag (containing an occupancy flag and a 7-bit hash fragment) before performing full key comparisons.\n\nBenchmarks show it becomes faster for tables larger than 1 million elements, with lookup hits up to **1.69x faster** than the baseline. However, there is a trade-off: insert operations are slower (~0.72x), making it best suited for lookup-dominated use cases. The implementation requires C++17, SSE2 support, and a pre-sized fixed capacity, as dynamic resizing and deletion are not yet supported.\n\nThe design emerged from research disproving an old hashing conjecture, with experiments showing that contiguous memory access is essential for SIMD speedups. Quadratic jumps between groups (e.g., h, h+16, h+64) are used to avoid clustering and ensure all slots are reachable.",
    "chinese_title": "高性能C++哈希表采用分组SIMD元数据扫描技术",
    "chinese_summary": "本文介绍了一种高性能C++哈希表**GroupedSIMDElastic**，它采用分组SIMD元数据扫描技术，在大规模、查询密集型工作负载中超越了`ankerl::unordered_dense`等先进方案。\n\n其核心创新在于**分组探测机制**。传统的二次探测会分散内存访问，导致SIMD效率低下。而本设计将16个连续槽位作为单个分组进行探测，仅需少数指令即可通过SIMD高效扫描元数据。该方法受谷歌Swiss Tables启发，先通过1字节元数据标签（包含占用标志和7位哈希片段）过滤掉大部分不匹配项，再进行完整的键值比较。\n\n基准测试表明，当元素数量超过100万时，其查询命中速度比基准方案**快达1.69倍**。但存在权衡：插入操作较慢（约0.72倍），因此最适合以查询为主的应用场景。该实现需要C++17标准、SSE2指令集支持以及预分配固定容量，暂不支持动态扩容和删除操作。\n\n该设计源于一项推翻旧哈希猜想的研究，实验证明连续内存访问对SIMD加速至关重要。通过组间二次跳跃（如h、h+16、h+64）可避免聚类问题，并确保所有槽位均可被访问。"
  },
  {
    "id": "46368739",
    "title": "Show HN: Superset – Terminal to run 10 parallel coding agents",
    "url": "https://superset.sh/",
    "summary": "Superset is a terminal-based tool that enables developers to run multiple AI coding agents in parallel, aiming to accelerate coding workflows. It allows users to launch dozens of agents (like Claude Code, Codex, Cursor, or any CLI-based tool) simultaneously across different tasks, such as feature development, bug fixes, and refactoring.\n\nKey features include:\n*   **Parallel Execution:** Work on multiple coding tasks at once without switching contexts.\n*   **Agent Agnostic:** Compatible with various AI coding agents and integrates with existing tools.\n*   **Isolated Worktrees:** Each agent operates in its own isolated Git worktree to prevent merge conflicts, with changes viewable side-by-side before merging.\n*   **IDE Flexibility:** Users can open any worktree directly in their preferred IDE, including VS Code, Cursor, Xcode, or JetBrains.\n\nThe tool is currently available for macOS as a free download, positioning itself as a solution for engineers seeking to enhance productivity by parallelizing AI-assisted coding.",
    "chinese_title": "Show HN: Superset – 可运行10个并行编码代理的终端",
    "chinese_summary": "Superset是一款基于终端的工具，能让开发者并行运行多个AI编程助手，旨在加速编码工作流程。它允许用户同时启动数十个代理（如Claude Code、Codex、Cursor或任何基于CLI的工具），处理不同任务，例如功能开发、错误修复和代码重构。\n\n主要功能包括：\n*   **并行执行：** 可同时处理多个编码任务，无需切换上下文。\n*   **代理无关性：** 兼容多种AI编程助手，并能与现有工具集成。\n*   **隔离工作树：** 每个代理在独立的Git工作树中运行，避免合并冲突，合并前可并排查看更改。\n*   **IDE灵活性：** 用户可直接在偏好的IDE（包括VS Code、Cursor、Xcode或JetBrains）中打开任意工作树。\n\n该工具目前可在macOS上免费下载，旨在为希望通过并行化AI辅助编码来提升效率的工程师提供解决方案。"
  },
  {
    "id": "46424733",
    "title": "Meta's ads tools started switching out top-performing ads with AI-generated ones",
    "url": "https://www.businessinsider.com/meta-ai-generating-bizarre-ads-advantage-plus-2025-10",
    "summary": "This article reports that Meta has begun automatically replacing some of advertisers' top-performing ad creatives with AI-generated variations, a move that has caused significant concern within the advertising community.\n\nThe key points are:\n\n*   **Automated Replacement:** Meta's ad tools are now, without explicit advertiser permission, swapping out human-made ads that are performing well with AI-generated versions. These AI variations alter elements like background images or product arrangements.\n*   **Advertiser Backlash:** Marketers have expressed frustration and alarm. They argue this practice removes creative control, risks damaging brand consistency, and could disrupt carefully optimized campaigns. The lack of a clear opt-out mechanism is a major point of contention.\n*   **Meta's Rationale:** The company frames this as a performance-enhancing feature, suggesting its AI can generate numerous ad variations to identify the most effective ones, thereby improving results.\n*   **Broader AI Push:** This change is part of Meta's larger strategic shift toward automating its ad platform with AI, reducing the need for manual creative input from businesses.\n\nIn summary, Meta is prioritizing AI-driven ad optimization, but its implementation—automatically overriding human creative decisions—has sparked a conflict with advertisers who value control over their brand's messaging and campaign integrity.",
    "chinese_title": "Meta的广告工具开始用AI生成的广告替换表现最佳的广告",
    "chinese_summary": "本文报道称，Meta已开始自动将广告主表现最优的广告素材替换为AI生成的变体，这一举措在广告界引发了重大担忧。\n\n核心要点如下：\n\n*   **自动替换：** Meta的广告工具现可在未经广告主明确许可的情况下，将表现优异的人工制作广告替换为AI生成的版本。这些AI变体会更改背景图片或产品布局等元素。\n*   **广告主反弹：** 营销人员对此表示沮丧和担忧。他们认为这种做法剥夺了创意控制权，可能损害品牌一致性，并扰乱精心优化的广告活动。缺乏明确的退出机制是主要争议点。\n*   **Meta的立场：** 该公司将此定位为提升绩效的功能，声称其AI能生成大量广告变体以识别最有效的版本，从而改善广告效果。\n*   **广泛的AI推进：** 此次变更是Meta整体战略转向的一部分，旨在通过AI自动化其广告平台，减少对企业人工创意投入的需求。\n\n总之，Meta正优先推行AI驱动的广告优化，但其自动覆盖人工创意决策的实施方式，引发了与重视品牌信息传递和广告活动完整性的广告主之间的冲突。"
  },
  {
    "id": "46420672",
    "title": "Libgodc: Write Go Programs for Sega Dreamcast",
    "url": "https://github.com/drpaneas/libgodc",
    "summary": "**Summary**\n\nLibgodc is a specialized Go runtime that enables developers to write programs for the Sega Dreamcast console. It replaces the standard Go runtime to work within the console's hardware constraints: 16MB of RAM, a single-core SH-4 CPU, and no operating system. The runtime provides core Go features including garbage collection, goroutines, and channels.\n\nDevelopment is facilitated by the separate `godc` CLI tool, which handles toolchain setup, project initialization, building, and running programs. The workflow involves installing the tool, initializing a project, writing Go code, and building it for the Dreamcast.\n\nThe project includes comprehensive documentation, performance benchmarks measured on real hardware, and a suite of example programs demonstrating graphics, input, concurrency, filesystem access, and game development. It is released under the BSD 3-Clause license.",
    "chinese_title": "Libgodc：为世嘉Dreamcast编写Go程序",
    "chinese_summary": "**摘要**\n\nLibgodc 是一个专为 Sega Dreamcast 游戏机设计的 Go 运行时环境，使开发者能够为该平台编写程序。它替换了标准的 Go 运行时，以适应游戏机的硬件限制：16MB 内存、单核 SH-4 CPU 且无操作系统。该运行时提供了 Go 的核心功能，包括垃圾回收、goroutine 和通道。\n\n开发过程由独立的 `godc` 命令行工具支持，该工具负责工具链设置、项目初始化、构建和运行程序。工作流程包括安装工具、初始化项目、编写 Go 代码，以及为 Dreamcast 构建程序。\n\n该项目包含详尽的文档、在真实硬件上测量的性能基准测试，以及一系列示例程序，展示了图形渲染、输入处理、并发、文件系统访问和游戏开发等功能。项目采用 BSD 3-Clause 许可证发布。"
  },
  {
    "id": "46423010",
    "title": "Nvidia takes $5B stake in Intel under September agreement",
    "url": "https://www.reuters.com/legal/transactional/nvidia-takes-5-billion-stake-intel-under-september-agreement-2025-12-29/",
    "summary": "**Summary of Article: Nvidia takes $5B stake in Intel under September agreement**\n\nOn December 29, 2025, Reuters reported that Nvidia has acquired a $5 billion stake in its longtime rival, Intel. This strategic investment is the result of a confidential agreement the two chipmakers signed in September.\n\nThe deal involves Nvidia purchasing newly issued Intel shares, which will give it a minority ownership position of approximately 2.5% in the company. The primary motivations behind this unexpected partnership are to strengthen the U.S. semiconductor supply chain and to combine resources for competing more effectively against common rivals, particularly in the advanced chip manufacturing sector.\n\nA key component of the agreement is a multi-year partnership focused on next-generation chip fabrication. Intel will manufacture some of Nvidia's future graphics processing units (GPUs) using its advanced \"18A\" manufacturing process. In return, Nvidia will integrate some of Intel's forthcoming \"Clearwater Forest\" processors into its own data center products.\n\nThe article notes that this collaboration marks a significant shift in the industry, as the two companies have historically been direct competitors across multiple segments. The move is widely seen as an effort to bolster domestic chip production capabilities and present a united front against other leading foundries, such as Taiwan's TSMC.",
    "chinese_title": "根据九月协议，英伟达向英特尔投资50亿美元。",
    "chinese_summary": "**文章摘要：英伟达依据九月协议，斥资50亿美元入股英特尔**\n\n2025年12月29日，路透社报道称，英伟达已收购其长期竞争对手英特尔价值50亿美元的股份。此项战略投资源于两家芯片制造商于九月签署的一份保密协议。\n\n根据协议，英伟达将购入英特尔新发行的股份，从而获得后者约2.5%的少数股权。此次出人意料的合作主要旨在强化美国半导体供应链，并通过整合资源更有效地对抗共同对手，尤其是在先进芯片制造领域。\n\n协议的一个关键部分是双方将建立多年期合作伙伴关系，专注于下一代芯片制造。英特尔将使用其先进的“18A”制造工艺为英伟达生产部分未来的图形处理器（GPU）。作为回报，英伟达则会将英特尔即将推出的“清水森林”处理器集成至自家数据中心产品中。\n\n文章指出，此次合作标志着行业格局的重大转变，因为两家公司历来在多个领域都是直接竞争对手。此举被普遍视为加强本土芯片生产能力、并联合对抗台积电等其他领先晶圆代工厂的共同举措。"
  },
  {
    "id": "46419970",
    "title": "Kidnapped by Deutsche Bahn",
    "url": "https://www.theocharis.dev/blog/kidnapped-by-deutsche-bahn/",
    "summary": "In this personal account, the author describes being effectively \"kidnapped\" by Deutsche Bahn (DB) on Christmas Eve 2025. While traveling from Cologne to Meckenheim, their train was rerouted due to unspecified issues. Despite planning to disembark at Troisdorf, the train failed to stop because it was \"not registered\" at the station, forcing the author and other passengers to continue on a detour.\n\nAs a result, the author was carried 63 kilometers past their intended destination to Neuwied, a town in a different federal state, making them farther from their goal than when they started. The narrative uses this experience to critique DB's systemic failures, citing official statistics that exclude cancelled trains from punctuality metrics and offering minimal compensation. The tone blends personal frustration with dark humor, comparing passengers to livestock and highlighting the resigned acceptance of fellow travelers to DB's chronic unreliability.",
    "chinese_title": "被德国铁路绑架",
    "chinese_summary": "在这篇个人记述中，作者描述了2025年平安夜被德国铁路（DB）变相“绑架”的经历。当时他正从科隆前往梅肯海姆，列车因不明原因改道。尽管计划在特罗斯多夫下车，但由于该站“未登记”这班列车，车厢并未停靠，迫使作者与其他乘客继续绕行。\n\n最终，作者被载至距离目的地63公里外、位于不同联邦州的新维德，反而比出发时离目标更远。作者借此事例批判德国铁路的系统性缺陷，指出官方统计数据将取消班次排除在准点率计算之外，且补偿微薄。全文语调夹杂着个人愤懑与黑色幽默，将乘客比作牲畜，并突出了同行旅客对德国铁路长期不可靠性的无奈接受。"
  },
  {
    "id": "46424217",
    "title": "Left Behind: Futurist Fetishists, Prepping and the Abandonment of Earth",
    "url": "https://www.boundary2.org/2019/08/sarah-t-roberts-and-mel-hogan-left-behind-futurist-fetishists-prepping-and-the-abandonment-of-earth/",
    "summary": "This article examines how contemporary \"prepping\" culture and elite space colonization fantasies are secular adaptations of the religious \"Left Behind\" narrative. It argues that the popular Evangelical book series, which depicted survival after the Rapture, normalized end-times anxiety, shifting it from a religious prophecy to a mainstream preoccupation with secular global disasters.\n\nThe authors trace a lineage from Cold War fallout shelters to today's preppers, who are often portrayed in media as eccentric individuals hoarding supplies and weapons. However, they contrast this with the serious, large-scale projects of financial and technological elites like Elon Musk, who invest in escaping Earth entirely. This elite \"futurist fetishism\" is framed as a parallel form of prepping—one that abandons solving Earth's systemic crises (ecological, economic, social) in favor of technologically advanced escape plans.\n\nUltimately, the critique posits that both grassroots preppers and elite space colonizers are driven by a shared \"cold panic\" about collapse. Yet, the elite version represents a dangerous abandonment of collective responsibility, offering market-based, techno-solutionist escapes that reinforce existing power dynamics and doom the planet to a choice \"between barbarism and barbarism.\"",
    "chinese_title": "被遗弃者：未来主义迷恋者、末日准备与地球的抛弃",
    "chinese_summary": "本文探讨了当代“生存主义”文化与精英阶层太空殖民幻想如何成为宗教“末日幸存”叙事的世俗化改编。文章指出，流行福音派书籍系列描绘的“被提”后生存故事，将末日焦虑常态化，使其从宗教预言转变为世俗社会对全球性灾难的主流关切。\n\n作者梳理了从冷战时期防辐射掩体到当今生存主义者的脉络——后者常被媒体描绘为囤积物资武器的怪人。然而，与此形成对比的是像埃隆·马斯克这类财力雄厚的科技精英所推动的严肃大型计划，他们投资于完全逃离地球的方案。这种精英阶层的“未来主义迷恋”被视作生存主义的平行形态——它放弃解决地球的系统性危机（生态、经济、社会），转而追求技术先进的逃亡计划。\n\n最终，批评指出草根生存主义者与精英太空殖民者都受到对崩溃的“冰冷恐慌”驱动。但精英版本代表着对集体责任的危险背弃，其提供的市场化技术解决方案强化了现有权力结构，使地球注定面临“野蛮与野蛮之间的抉择”。"
  },
  {
    "id": "46422812",
    "title": "Show HN: Evidex – AI Clinical Search (RAG over PubMed/OpenAlex and SOAP Notes)",
    "url": "https://www.getevidex.com",
    "summary": "**Evidex** is an AI-powered clinical search platform designed to help healthcare professionals quickly access evidence-based medical information. It combines two key data sources:\n\n1.  **Medical Literature:** It uses Retrieval-Augmented Generation (RAG) to search and synthesize information from vast databases like PubMed and OpenAlex, providing up-to-date research and clinical guidelines.\n2.  **Patient Context:** It can also analyze a patient's own SOAP (Subjective, Objective, Assessment, Plan) notes to tailor search results to a specific clinical case.\n\nThe core promise of Evidex is to bridge the gap between a clinician's immediate patient care questions and the vast, often overwhelming, body of medical literature. Instead of manually sifting through search results, the AI retrieves relevant documents and generates concise, contextual answers.\n\nThe \"Show HN\" title indicates this is a new project being shared with the Hacker News community for feedback. The platform is presented as a web application, as noted by the \"You need to enable JavaScript to run this app\" message.\n\nIn summary, Evidex aims to be a practical tool for evidence-based medicine, using modern AI (RAG) to deliver precise, patient-aware clinical insights directly at the point of care.",
    "chinese_title": "Show HN：Evidex——AI临床搜索（基于PubMed/OpenAlex和SOAP病历的检索增强生成）",
    "chinese_summary": "**Evidex** 是一款基于人工智能的临床搜索平台，旨在帮助医疗专业人员快速获取循证医学信息。它整合了以下两个关键数据源：\n\n1.  **医学文献：** 通过检索增强生成技术，从 PubMed 和 OpenAlex 等海量数据库中搜索并综合信息，提供最新的研究和临床指南。\n2.  **患者情境：** 还能分析患者自身的 SOAP 笔记，从而将搜索结果适配到特定的临床病例。\n\nEvidex 的核心承诺是弥合临床医生在诊疗中遇到的即时问题与庞大且常令人望而却步的医学文献之间的鸿沟。该人工智能无需用户手动筛选搜索结果，而是直接检索相关文档并生成简洁、贴合情境的答案。\n\n\"Show HN\" 标题表明这是一个新项目，正与 Hacker News 社区分享以获取反馈。该平台是一个网络应用程序，正如\"您需要启用 JavaScript 才能运行此应用\"的提示信息所示。\n\n总之，Evidex 致力于成为循证医学的实用工具，利用现代人工智能技术，在诊疗点为医生直接提供精准且结合患者情境的临床洞见。"
  },
  {
    "id": "46424233",
    "title": "The Future of Software Development Is Software Developers",
    "url": "https://codemanship.wordpress.com/2025/11/25/the-future-of-software-development-is-software-developers/",
    "summary": "In this article, a programmer with 43 years of experience argues that software developers are not becoming obsolete due to AI, drawing parallels with past technologies (like Visual Basic and no-code platforms) that were similarly predicted to end programming jobs but instead increased demand.\n\nThe author asserts that the core challenge of programming is not writing code, but the precise translation of ambiguous human needs into logical, computational thinking—a task requiring general intelligence that current LLMs lack. He notes that, unlike reliable past tools, LLMs often slow teams down and produce unreliable, hard-to-maintain code.\n\nHe dismisses the hype around AI replacing developers, attributing recent job market shifts to post-pandemic over-hiring and economic factors rather than AI displacement. The article is skeptical of the long-term viability of expensive, large-scale LLMs, predicting they may fade, while more modest coding assistants for prototyping and completions will persist.\n\nUltimately, the author concludes that skilled human developers will remain essential, likely in greater numbers due to Jevons Paradox, and advises companies to hire and train developers now before demand surges again.",
    "chinese_title": "软件开发的未来在于软件开发者",
    "chinese_summary": "本文中，一位拥有43年经验的程序员认为，软件开发者不会因AI而变得过时，并类比了以往的技术（如Visual Basic和无代码平台）——它们也曾被预言将终结编程工作，结果反而增加了需求。\n\n作者指出，编程的核心挑战不在于编写代码，而在于将模糊的人类需求精确转化为逻辑性、计算性的思维——这项任务需要通用智能，而当前的大语言模型尚不具备。他提到，与过去可靠的工具不同，大语言模型常常拖慢团队进度，并产出不可靠、难以维护的代码。\n\n他驳斥了AI取代开发者的炒作，认为近期的就业市场波动源于疫情后的过度招聘和经济因素，而非AI替代。文章对昂贵、大规模的大语言模型的长期可行性持怀疑态度，预测它们可能会逐渐消退，而更适度的用于原型设计和代码补全的编程助手将会持续存在。\n\n最终，作者总结道，熟练的人类开发者仍将不可或缺，且由于杰文斯悖论，其数量很可能还会增加，并建议企业在需求再次激增前立即招聘和培训开发者。"
  },
  {
    "id": "46419968",
    "title": "Linux DAW: Help Linux musicians to quickly and easily find the tools they need",
    "url": "https://linuxdaw.org/",
    "summary": "This article serves as a guide for musicians looking to create music on Linux, addressing the common challenge of finding the right tools. It explains that while Linux has a robust ecosystem for audio production, it can be fragmented and difficult for newcomers to navigate.\n\nThe core of the article is a curated list of essential tools, organized by category:\n*   **Digital Audio Workstations (DAWs):** Highlights popular options like Ardour (for recording/mixing), LMMS (pattern-based composition), and Qtractor.\n*   **Audio Plugins:** Explains the LV2 standard and mentions tools like Carla for hosting both Linux-native and Windows VST plugins.\n*   **JACK Audio Connection Kit:** Emphasizes its critical role as a system for routing audio between applications, which is fundamental to the Linux audio workflow.\n*   **Essential Utilities:** Lists important tools for system configuration (QjackCtl), MIDI sequencing (Hydrogen drum machine), and notation (MuseScore).\n\nThe article concludes by acknowledging that setting up a Linux audio system requires initial configuration but assures readers that the available software is powerful, professional-grade, and often free and open-source. Its primary goal is to reduce the research burden by providing a clear, centralized starting point for musicians.",
    "chinese_title": "Linux DAW：助力Linux音乐人快速便捷地找到所需工具",
    "chinese_summary": "本文旨在为希望在Linux系统上创作音乐的音乐人提供指南，解决他们寻找合适工具的常见难题。文章指出，尽管Linux拥有强大的音频制作生态系统，但其工具分散且对新手不够友好，增加了入门难度。\n\n文章核心内容是按类别整理的必备工具清单：\n*   **数字音频工作站（DAW）：** 重点介绍Ardour（录音/混音）、LMMS（基于模式的作曲）和Qtractor等流行选项。\n*   **音频插件：** 解释LV2标准，并提及Carla等工具，它既能托管Linux原生插件，也能运行Windows VST插件。\n*   **JACK音频连接套件：** 强调其作为应用程序间音频路由系统的关键作用，这是Linux音频工作流程的基础。\n*   **必备实用工具：** 列出系统配置（QjackCtl）、MIDI序列（Hydrogen鼓机）和乐谱制作（MuseScore）等重要工具。\n\n文章最后指出，搭建Linux音频系统确实需要初始配置，但向读者保证，现有软件功能强大、达到专业水准，且多为免费开源。本文的主要目标是通过提供一个清晰、集中的起点，减轻音乐人的研究负担。"
  },
  {
    "id": "46424782",
    "title": "Which Humans?",
    "url": "https://osf.io/preprints/psyarxiv/5b26t_v1",
    "summary": "This article, titled \"Which Humans?\", appears to be a placeholder or introductory text for the Open Science Framework (OSF). The OSF is a free, open-source platform designed to support and facilitate transparent, collaborative research across the entire project lifecycle.\n\nThe core message of the article is to pose a fundamental question about inclusivity in open science: **whose research practices and needs are being centered?** It challenges the assumption that open science tools and norms are universally applicable by asking \"which humans\" they are actually built for and by.\n\nThe key points are:\n*   It introduces the OSF as a central hub for managing research projects, connecting with collaborators, and sharing materials, data, and code.\n*   The title serves as a critical prompt, suggesting the article will explore issues of diversity, equity, and inclusion within the open science movement.\n*   It implies a discussion on whether current open science infrastructures adequately serve a global and diverse community of researchers, including those from underrepresented groups or low-resource institutions.\n*   The overarching theme is a call to reflect on and broaden the human scope of open science, ensuring its tools and culture are accessible and beneficial to all researchers.",
    "chinese_title": "哪些人类？",
    "chinese_summary": "这篇文章题为《哪些人类？》，似乎是开放科学框架（OSF）的占位文本或引言。OSF是一个免费开源平台，旨在支持和促进整个项目生命周期中透明、协作的研究。\n\n文章的核心信息是提出一个关于开放科学包容性的根本问题：**当前的研究实践和需求是以谁为中心？** 它通过追问开放科学工具和规范“究竟是为哪些人类、由哪些人类构建”，挑战了这些工具和规范普遍适用的假设。\n\n文章要点包括：\n*   介绍OSF作为管理研究项目、连接合作者、共享材料、数据和代码的核心平台。\n*   标题本身是一个关键提示，表明文章将探讨开放科学运动中的多样性、公平性和包容性问题。\n*   暗示将讨论当前开放科学基础设施是否充分服务于全球多元化的研究群体，包括来自代表性不足群体或资源匮乏机构的研究人员。\n*   总体主题是呼吁反思并拓宽开放科学的人类范畴，确保其工具和文化对所有研究者都是可及且有益的。"
  },
  {
    "id": "46416945",
    "title": "You can make up HTML tags",
    "url": "https://maurycyz.com/misc/make-up-tags/",
    "summary": "This article explains that you can create and use custom HTML tags, provided they include a hyphen in their name (e.g., `<cool-thing>`). Browsers treat unrecognized tags as generic inline elements, which can be fully styled with CSS. This behavior is standardized and ensures future HTML specifications won't conflict with your custom tags.\n\nThe author argues that custom tags improve code readability and maintainability compared to overusing generic `<div>` or `<span>` elements with numerous class names. They illustrate this with an example of nested `<div>` elements, where matching opening and closing tags becomes confusing. Using semantic, custom tags like `<article-header>` or `<quote-body>` makes the HTML structure self-documenting and eliminates the need to count closing `</div>` tags when editing. While built-in semantic tags should be preferred when appropriate, custom tags offer a cleaner alternative to a proliferation of non-descriptive divs.",
    "chinese_title": "你可以编造HTML标签",
    "chinese_summary": "本文阐述，只要在名称中包含连字符（例如`<cool-thing>`），您就可以创建和使用自定义HTML标签。浏览器会将无法识别的标签视为通用的内联元素，这些元素可以通过CSS完全样式化。这种行为是标准化的，确保未来的HTML规范不会与您的自定义标签冲突。\n\n作者认为，与过度使用带有大量类名的通用`<div>`或`<span>`元素相比，自定义标签提高了代码的可读性和可维护性。他们通过嵌套`<div>`元素的例子来说明这一点，其中匹配的开闭标签会变得混乱。使用语义化的自定义标签，如`<article-header>`或`<quote-body>`，可以使HTML结构自文档化，并在编辑时无需费力计算闭合的`</div>`标签。虽然内置的语义标签在适用时应优先考虑，但自定义标签为大量非描述性的div提供了一种更简洁的替代方案。"
  },
  {
    "id": "46418415",
    "title": "You can't design software you don't work on",
    "url": "https://www.seangoedecke.com/you-cant-design-software-you-dont-work-on/",
    "summary": "This article argues that effective software design for large, existing systems cannot be done in the abstract. It asserts that only engineers who work directly on a codebase possess the concrete, detailed understanding necessary for meaningful design decisions.\n\nThe author distinguishes between \"generic software design\" (general principles and patterns) and \"concrete software design.\" They contend that while generic advice is common in books and blogs, it is largely useless for day-to-day work on established systems. In real codebases, factors like internal consistency, unpredictable consequences, and the system's transitional state dominate over ideal patterns.\n\nTruly useful design, the article states, happens in detailed discussions among engineers deeply familiar with the system, focusing on specific constraints and implementation details rather than philosophical principles.\n\nThe author acknowledges that generic design has limited utility: for building brand-new systems, tie-breaking between concrete options, and guiding company-wide architectural choices. However, they criticize formal \"big-picture architect\" roles that are detached from implementation, arguing they create misaligned incentives and provide little practical value. The ideal, they conclude, is for designers to also be responsible for a project's success, ensuring that those who understand the system's realities get credit for the design work.",
    "chinese_title": "不参与其中，便无法设计软件。",
    "chinese_summary": "本文认为，对大型现有系统进行有效的软件设计无法脱离具体实践。文章主张，只有直接参与代码库工作的工程师才具备做出有意义设计决策所需的具体而细致的理解。\n\n作者区分了“通用软件设计”（通用原则与模式）与“具体软件设计”。他们指出，尽管书籍和博客中普遍存在通用建议，但这些建议对既有系统的日常工作基本无用。在实际代码库中，内部一致性、不可预见的后果以及系统的过渡状态等因素，远比理想模式更具影响力。\n\n文章强调，真正有用的设计产生于对系统极为熟悉的工程师之间的细致讨论，这些讨论聚焦于具体约束和实现细节，而非抽象原则。\n\n作者承认通用设计有其有限用途：适用于构建全新系统、在具体方案间做出抉择，以及指导公司层面的架构选择。然而，他们批评那些脱离实际执行的正式“宏观架构师”角色，认为这类角色会引发激励错位，且几乎不提供实际价值。文章最后总结，理想的设计者应当同时对项目成败负责，从而确保真正理解系统现实的人获得设计工作的认可。"
  },
  {
    "id": "46417815",
    "title": "Show HN: Z80-μLM, a 'Conversational AI' That Fits in 40KB",
    "url": "https://github.com/HarryR/z80ai",
    "summary": "**Z80-μLM** is a minimalist conversational AI designed to run on vintage Z80 processors with only 64KB of RAM. The core challenge was creating a functional model small enough to fit into a 40KB .COM file, including its weights, inference engine, and a chat interface.\n\nIt operates using a trigram hash encoding system that converts input text into 128 abstract \"buckets.\" This method provides typo tolerance and ignores word order but limits its ability to handle long or complex sentences. The model's neural network uses 2-bit quantized weights (values of -2, -1, 0, +1) packed four per byte and performs all calculations with 16-bit integer arithmetic, avoiding any floating-point operations.\n\nTwo example applications are included: **tinychat**, a personality-driven Q&A bot, and **guess**, a 20 Questions-style game. The model generates terse, character-by-character responses (like \"YES,\" \"MAYBE,\" or \"WHY?\"), relying on context and user interpretation for meaning.\n\nWhile not a true conversational AI—it lacks deep contextual understanding and generative capabilities—it demonstrates how a quantized, integer-based neural network can deliver a stylized interactive experience on severely constrained 1970s hardware. The project is open-source (MIT/Apache 2.0) and includes tools for training custom models.",
    "chinese_title": "展示HN：Z80-μLM，一款仅占40KB的“对话式人工智能”",
    "chinese_summary": "**Z80-μLM**是一款极简主义对话人工智能，专为在仅有64KB内存的老式Z80处理器上运行而设计。其核心挑战在于创建一个功能完整的模型，小到足以装入40KB的.COM文件，同时包含权重、推理引擎和聊天界面。\n\n它采用三元哈希编码系统，将输入文本转换为128个抽象的“桶”。这种方法具备容错能力且忽略词序，但限制了处理长句或复杂语句的能力。该模型的神经网络使用2位量化权重（取值为-2、-1、0、+1），每字节打包四个权重，并通过16位整数运算执行所有计算，完全避免浮点操作。\n\n包含两个示例应用：**tinychat**（个性驱动的问答机器人）和**guess**（20个问题风格的游戏）。模型生成简洁的逐字符响应（如“YES”、“MAYBE”或“WHY？”），依赖上下文和用户解读来传递含义。\n\n虽然它并非真正的对话人工智能——缺乏深度上下文理解和生成能力——但它展示了量化、基于整数的神经网络如何在严重受限的1970年代硬件上实现风格化的交互体验。该项目为开源（MIT/Apache 2.0协议），并包含训练自定义模型的工具。"
  },
  {
    "id": "46401982",
    "title": "Why is calling my asm function from Rust slower than calling it from C?",
    "url": "https://ohadravid.github.io/posts/2025-12-rav1d-faster-asm/",
    "summary": "In a performance comparison between the C and Rust implementations of the rav1d video decoder, one specific hand-written assembly function (`cdef_filter4_pri_edged_8bpc_neon`) was found to be 30% slower when called from Rust. Profiling revealed the slowdown was due to a single ARM `ld1` instruction stalling during a memory load from a stack buffer.\n\nThe root cause was traced to the Rust compiler's inability to optimize away unused arguments in a function pointer dispatch layer. The Rust version passed extra `*FFISafe` pointer arguments (intended only for a pure-Rust fallback path) alongside the raw pointers used by the assembly. This forced the compiler to allocate additional space on the stack in the calling function (`rav1d_cdef_brow`), altering the memory layout and causing a CPU cache stall during a specific load in the assembly.\n\nThe issue was resolved by refactoring the code to separate the assembly and Rust fallback dispatch paths, eliminating the unused `FFISafe` arguments from the assembly call path. This allowed the compiler to avoid the extra stack allocations, restoring performance to match the C version. The fix highlights a subtle interaction between Rust abstractions, compiler optimizations, and low-level performance.",
    "chinese_title": "为什么从Rust调用我的汇编函数比从C调用更慢？",
    "chinese_summary": "在对rav1d视频解码器的C语言和Rust实现进行性能对比时，发现一个特定手写汇编函数（`cdef_filter4_pri_edged_8bpc_neon`）在通过Rust调用时速度慢了30%。性能分析显示，减速源于一条ARM `ld1`指令在从栈缓冲区加载内存时发生停滞。\n\n根本原因可追溯至Rust编译器无法在函数指针调度层优化未使用的参数。Rust版本在传递汇编使用的原始指针时，同时传递了额外的`*FFISafe`指针参数（该参数仅用于纯Rust备用路径）。这迫使编译器在调用函数（`rav1d_cdef_brow`）中分配额外的栈空间，改变了内存布局，导致汇编代码中特定加载操作时出现CPU缓存停滞。\n\n通过重构代码将汇编路径与Rust备用调度路径分离，并从汇编调用路径中移除未使用的`FFISafe`参数，该问题得以解决。这使得编译器能够避免额外的栈分配，使性能恢复至与C版本相当的水平。此修复案例揭示了Rust抽象机制、编译器优化与底层性能之间微妙的相互作用。"
  },
  {
    "id": "46424892",
    "title": "Binance's Trust Wallet extension hacked; users lose $7M",
    "url": "https://www.web3isgoinggreat.com/?id=trust-wallet-hack",
    "summary": "This article compiles a series of cryptocurrency security incidents and controversies from late 2025, highlighting persistent vulnerabilities across the ecosystem.\n\nThe most significant event was a **supply chain attack** on Binance's Trust Wallet Chrome extension, where a malicious update stole seed phrases, leading to **$7 million in user losses**. Binance founder Changpeng Zhao pledged reimbursement. Other major hacks included a **$50 million address poisoning scam**, a **$30 million theft from Upbit exchange** (suspected to be by North Korea's Lazarus Group), and multiple **DeFi protocol exploits** targeting Yearn Finance (twice) and Ribbon Finance.\n\nThe incidents reveal common attack vectors: **smart contract bugs**, **oracle manipulation**, **DNS hijacking** (as seen with Aerodrome/Velodrome), and **social engineering**. The response to a **Cardano chainsplit**, caused by a user's error, sparked controversy when founder Charles Hoskinson involved the FBI, leading to internal dissent.\n\nOverall, the report underscores that despite advancements, the crypto space remains plagued by technical flaws, sophisticated scams, and operational risks, affecting wallets, exchanges, DeFi protocols, and even core blockchain infrastructure.",
    "chinese_title": "币安Trust Wallet扩展程序遭黑客攻击，用户损失700万美元",
    "chinese_summary": "本文汇总了2025年末发生的一系列加密货币安全事件与争议，凸显了整个生态系统中持续存在的脆弱性。\n\n最严重的事件是币安Trust Wallet Chrome扩展程序遭遇的**供应链攻击**，恶意更新窃取了助记词，导致**用户损失700万美元**。币安创始人赵长鹏承诺进行赔付。其他重大黑客事件包括**5000万美元的地址投毒骗局**、**Upbit交易所被盗3000万美元**（疑似朝鲜 Lazarus 集团所为），以及针对Yearn Finance（两次）和Ribbon Finance的多起**DeFi协议漏洞利用**。\n\n这些事件揭示了常见的攻击手段：**智能合约漏洞**、**预言机操纵**、**DNS劫持**（如Aerodrome/Velodrome事件）以及**社会工程学攻击**。针对用户操作失误导致的**Cardano链分裂**，创始人Charles Hoskinson因联系FBI介入处理引发内部争议。\n\n总体而言，报告强调尽管技术有所进步，加密货币领域仍深受技术缺陷、复杂骗局和操作风险困扰，影响范围涵盖钱包、交易所、DeFi协议乃至核心区块链基础设施。"
  },
  {
    "id": "46395714",
    "title": "Karpathy on Programming: \"I've never felt this much behind\"",
    "url": "https://twitter.com/karpathy/status/2004607146781278521",
    "summary": "This article is not a traditional news piece but a browser error message displayed on X (formerly Twitter). The core message informs the user that JavaScript is disabled in their web browser, which is preventing the X.com website from loading or functioning correctly.\n\nThe key points are:\n*   **Problem Identified:** The site has detected that JavaScript is not enabled in the user's current browser.\n*   **Required Action:** The user must enable JavaScript or switch to a different, supported browser to use X.com.\n*   **Support Offered:** It directs users to the Help Center for a list of compatible browsers.\n*   **Standard Footer:** The notice includes standard legal and corporate links (Terms of Service, Privacy Policy, etc.) and the copyright for X Corp.\n\nThe title \"Karpathy on Programming: 'I've never felt this much behind'\" appears to be the intended title of a tweet or post that the user cannot view due to this technical barrier. The summary is solely of the visible error message content.",
    "chinese_title": "卡帕西谈编程：“我从未感到如此落后”",
    "chinese_summary": "本文并非传统新闻报道，而是X平台（原Twitter）上显示的浏览器错误提示。核心信息是告知用户其网页浏览器已禁用JavaScript，导致X.com网站无法正常加载或运行。\n\n主要内容包括：\n*   **问题定位：** 网站检测到用户当前浏览器未启用JavaScript。\n*   **必要操作：** 用户需启用JavaScript或切换至其他受支持的浏览器才能使用X.com。\n*   **支持指引：** 提示用户前往帮助中心查看兼容浏览器列表。\n*   **标准页脚：** 通知包含标准法律与企业链接（服务条款、隐私政策等）及X Corp版权信息。\n\n标题《Karpathy谈编程：“从未感到如此落后”》疑似用户因技术障碍无法查看的推文或帖子原标题。本摘要仅针对可见的错误提示内容进行说明。"
  },
  {
    "id": "46415225",
    "title": "What an unprocessed photo looks like",
    "url": "https://maurycyz.com/misc/raw_photo/",
    "summary": "This article explains the complex, multi-step process required to transform raw sensor data into a viewable photograph. It begins by showing that a camera's raw data is a monochromatic, low-contrast image because the sensor only measures light intensity, not color. To create a color image, the data from a Bayer filter array (which gives each pixel a red, green, or blue filter) must be interpreted through a demosaicing algorithm.\n\nThe author then details two major adjustments needed for display. First, the linear brightness data from the sensor must be compressed using a non-linear curve (like sRGB) to match human perception and the limited dynamic range of screens. Second, white balance must be corrected to remove color casts, often caused by the sensor's higher sensitivity to green light.\n\nThe piece emphasizes that these steps—demosaicing, applying a tone curve, and white balancing—are the essential, automated mathematics every camera or software performs. It argues that a final JPEG is not an \"unedited\" truth but one interpretation of the data, and that further manual editing is often necessary to correct the automated process or achieve a specific artistic result.",
    "chinese_title": "一张未经处理的照片看起来是什么样子",
    "chinese_summary": "本文阐述了将原始传感器数据转化为可视照片所需的复杂多步骤过程。文章首先指出，相机的原始数据是单色、低对比度的图像，因为传感器仅测量光强度而非颜色。为生成彩色图像，必须通过去马赛克算法解析来自拜耳滤镜阵列（该阵列为每个像素配备红、绿或蓝滤镜）的数据。\n\n作者随后详述了显示所需的两个主要调整。首先，传感器的线性亮度数据必须通过非线性曲线（如sRGB）进行压缩，以匹配人类视觉感知和屏幕有限的动态范围。其次，必须校正白平衡以消除色偏，这通常由传感器对绿光更敏感导致。\n\n文章强调，去马赛克、应用色调曲线和白平衡调整——这些步骤是每台相机或软件自动执行的核心数学运算。文中指出，最终的JPEG图像并非“未经编辑”的真实记录，而是对数据的一种解读；通常需要进一步手动编辑来修正自动化处理的不足，或实现特定的艺术效果。"
  },
  {
    "id": "46419273",
    "title": "Feynman's Hughes Lectures: 950 pages of notes",
    "url": "https://thehugheslectures.info/the-lectures/",
    "summary": "This article describes a collection of 950 pages of personal lecture notes taken by an attendee at Richard Feynman's lectures at Hughes Aircraft Company from 1966 to 1971. The notes, compiled into five volumes, cover a wide range of advanced physics topics.\n\nVolume 1 focuses on astronomy, astrophysics, and cosmology, a unique subject Feynman did not typically teach at Caltech. Volumes 2 and 3 revisit and expand upon the electrodynamics and quantum mechanics from his famous *Feynman Lectures on Physics*, delving deeper into quantum electrodynamics (QED), scattering theory, and Lie groups. Volume 4 contains brief notes on molecular biology, a field Feynman explored but found time-consuming. Volume 5 is dedicated to mathematical methods, reflecting Feynman's belief that math is the essential \"language\" of physics and showcasing his pragmatic, intuitive approach to problem-solving.\n\nThe author emphasizes that these are personal reconstructions from memory and original notes, not official transcripts. A key theme is Feynman's lecturing style: he often spoke for two hours with minimal notes, blending deep theoretical explanations with engaging \"sidebar\" discussions. The notes are presented as a historical record of Feynman's genius in explaining complex topics, his intellectual curiosity across scientific disciplines, and his unique pedagogical approach tailored to an audience of practicing scientists.",
    "chinese_title": "费曼的休斯讲座：950页笔记",
    "chinese_summary": "本文介绍了一套共950页的个人讲座笔记，由一位听众在1966年至1971年间参加理查德·费曼于休斯飞机公司举办的讲座时记录。这些笔记汇编为五卷，涵盖了广泛的物理学前沿主题。\n\n第一卷聚焦于天文学、天体物理学和宇宙学——这是费曼在加州理工学院通常不教授的独特领域。第二卷和第三卷重新探讨并扩展了其名著《费曼物理学讲义》中的电动力学和量子力学内容，深入探究了量子电动力学（QED）、散射理论及李群。第四卷收录了关于分子生物学的简要笔记，这是费曼曾探索但认为耗时颇多的领域。第五卷专攻数学方法，体现了费曼“数学是物理学基本语言”的理念，并展示了他务实而直观的问题解决方式。\n\n作者强调，这些笔记是基于记忆和原始记录的个人重构，并非官方文稿。一个核心主题是费曼的讲座风格：他常连续讲授两小时而极少参阅笔记，将深奥的理论阐述与生动的“题外话”讨论巧妙融合。这些笔记作为历史记录，展现了费曼阐释复杂主题的天赋、跨越科学领域的求知热忱，以及他为在职科学家量身定制的独特教学方式。"
  },
  {
    "id": "46419822",
    "title": "Show HN: See what readers who loved your favorite book/author also loved to read",
    "url": "https://shepherd.com/bboy/2025",
    "summary": "This is a Show HN post for a new book recommendation website. The core idea is that users can share a book or author they love, and the platform will show them what other readers with similar tastes (\"Book Twins\") also enjoyed. It appears to use a form of collaborative filtering based on user-submitted favorites.\n\nThe post demonstrates the platform by displaying a list of popular books among its early users, ranked by how many people have \"loved\" them. *Project Hail Mary* by Andy Weir is currently at the top with 11 people. The list includes a diverse mix of recent fiction (e.g., *Demon Copperhead*, *Lessons in Chemistry*), science fiction/fantasy (e.g., *Dungeon Crawler Carl*, *Babel*), and literary titles.\n\nA key call-to-action invites users to \"Share your top 3 reads of 2025!\" to both get personalized recommendations and create a \"beautiful page\" showcasing their favorites, noting that 726 readers have already participated.\n\nEach book entry includes the author, a \"Loved by [number] people\" count, and direct links to read a sample chapter or purchase the book from retailers like Amazon and Bookshop.org. The post acknowledges the service is new and may not have every book in its database yet.",
    "chinese_title": "Show HN：看看喜欢您最爱的书籍/作者的读者们还爱读什么",
    "chinese_summary": "这是一篇关于新书推荐网站的Show HN帖子。其核心理念是用户可分享喜爱的书籍或作者，平台会据此展示具有相似阅读品味（\"书籍双胞胎\"）的其他读者喜欢的作品。该平台似乎采用了基于用户提交喜好的协同过滤算法。\n\n帖子通过展示早期用户中热门书籍列表来演示平台功能，书籍按\"喜爱\"人数排序。安迪·威尔的《挽救计划》目前以11人喜爱位居榜首。榜单涵盖多元类型，包括近期小说（如《恶魔铜头》《化学课》）、科幻奇幻作品（如《地牢爬行者卡尔》《巴别塔》）及文学经典。\n\n关键行动号召邀请用户\"分享2025年你最爱的三本书！\"，既可获取个性化推荐，又能创建展示个人书单的\"精美页面\"。文中提及已有726位读者参与。\n\n每本书目均包含作者信息、\"获[数字]人喜爱\"的统计，以及直接跳转至亚马逊、Bookshop.org等平台试读样章或购书的链接。帖子说明该服务尚处初期阶段，数据库中可能尚未收录所有书籍。"
  },
  {
    "id": "46420453",
    "title": "Show HN: Vibe coding a bookshelf with Claude Code",
    "url": "https://balajmarius.com/writings/vibe-coding-a-bookshelf-with-claude-code/",
    "summary": "This article details the author's journey from owning an uncataloged personal library of nearly 500 books to creating a digital bookshelf using AI, specifically Claude Code. The initial challenge was that standard tools failed to identify many non-standard and Romanian editions, leading to incomplete data.\n\nThe process began by photographing all the books and using AI to extract metadata from the images via the OpenAI Vision API, achieving about 90% accuracy. The author manually corrected the remaining errors, accepting that perfection wasn't necessary. Next, they used APIs to fetch book covers, manually fixing the few that remained missing.\n\nFor the interface, the author rejected a simple grid of covers, wanting to replicate the textured look of physical book spines. Claude executed this by extracting colors from covers and varying spine widths based on page counts. The author then refined a scroll-based tilt animation to make the shelf feel interactive, rejecting unnecessary features like infinite scroll that harmed the user experience.\n\nThe key takeaway is that the AI handled all the implementation and coding, while the author provided the critical judgment, taste, and decision-making—knowing when to accept imperfections, what visual feel to pursue, and which features to keep or discard. The project demonstrates that while AI makes execution cheap, human curation remains essential.",
    "chinese_title": "Show HN：用Claude Code编程打造一个书架",
    "chinese_summary": "本文详细讲述了作者如何将个人近500本未经编目的藏书，通过AI技术（特别是Claude Code）转化为数字书架的过程。最初的挑战在于，标准工具无法识别许多非标准和罗马尼亚语版本的书籍，导致数据不全。\n\n作者首先拍摄了所有书籍的照片，并利用OpenAI Vision API通过AI从图像中提取元数据，准确率约为90%。随后手动修正了剩余的错误，并接受无法达到完美。接着，通过API获取书籍封面，并手动补全了少数缺失的封面。\n\n在界面设计上，作者摒弃了简单的封面网格布局，希望复现实体书书脊的质感。Claude通过提取封面颜色并根据页数调整书脊宽度来实现这一效果。作者还优化了基于滚动的倾斜动画，使书架更具互动感，同时摒弃了无限滚动等影响用户体验的不必要功能。\n\n项目的核心启示在于：AI负责了所有实施和编码工作，而作者则提供了关键的判断、审美和决策——知道何时接受不完美、追求何种视觉感受，以及保留或舍弃哪些功能。这表明，尽管AI让执行变得廉价，但人类的策展能力依然不可或缺。"
  },
  {
    "id": "46417110",
    "title": "CIA Star Gate Project: An Overview (1993) [pdf]",
    "url": "https://www.cia.gov/readingroom/docs/CIA-RDP96-00789R002800180001-2.pdf",
    "summary": "**Summary of \"CIA Star Gate Project: An Overview (1993)\"**\n\nThis 1993 document provides an official historical overview of the U.S. government's 24-year, $20 million research and operational program into \"remote viewing\"—the purported ability to psychically perceive distant locations or information. The program, known as STAR GATE (and earlier as GRILL FLAME and CENTER LANE), was managed sequentially by the CIA, DIA, and U.S. Army.\n\nThe summary states that research, primarily conducted at SRI International and later at Science Applications International Corporation (SAIC), aimed to determine if the phenomenon had utility for intelligence collection. While some laboratory experiments yielded statistically significant results, the document concludes that the remote viewing data was **\"vague and ambiguous,\"** contained significant **\"reliability and accuracy problems,\"** and never provided actionable intelligence that guided policy decisions.\n\nA key finding was that the information produced was too subjective and inconsistent to be verifiably useful in an intelligence context. Consequently, the program's managers recommended its termination, judging that **continued funding was not justified**. The document notes that a 1995 review by the American Institutes for Research (AIR) concurred, finding no evidence of its value for intelligence operations. The program was officially ended in 1995.",
    "chinese_title": "中情局星门计划：概览（1993年）[pdf]",
    "chinese_summary": "**《中情局星门计划概述（1993年）》摘要**\n\n这份1993年的文件对美国政府一项历时24年、耗资2000万美元的研究与操作项目提供了官方历史概述，该项目旨在研究“遥视”——即声称能够以心灵感知远处地点或信息的能力。该项目先后由中情局、国防情报局和美国陆军管理，代号为“星门”（早期曾用“烤焰”和“中心通道”）。\n\n摘要指出，主要由斯坦福研究院及后来的科学应用国际公司进行的研究，旨在确定该现象是否对情报收集具有实用价值。尽管部分实验室实验取得了统计学上的显著结果，但文件结论认为，遥视数据**“模糊且不明确”**，存在严重的**“可靠性与准确性问题”**，且从未提供过能够指导政策决策的、可付诸行动的情报。\n\n一项关键结论是，所产生的情报过于主观且不一致，无法在情报领域中被验证为有用。因此，项目管理者建议终止该项目，认为**“继续资助的理由不成立”**。文件指出，美国研究院在1995年的审查亦表示同意，认为没有证据表明其对情报行动具有价值。该项目于1995年正式结束。"
  }
]