[
  {
    "id": "46847780",
    "title": "Apple I Advertisement (1976)",
    "url": "http://apple1.chez.com/Apple1project/Gallery/Gallery.htm",
    "summary": "This 1976 advertisement introduces the Apple I, the first product from Apple Computer. It is marketed as a complete, low-cost microcomputer system on a single printed circuit board for $666.66, including 4KB of RAM.\n\nKey features highlighted are its integration and ease of use. The board combines the MOS 6502 microprocessor, a built-in video terminal, and memory, eliminating the need for an expensive, noisy teletypewriter. This allows users to connect a keyboard and video monitor (or a TV with a modulator) for immediate use. The system displays 960 characters and includes firmware for entering and debugging programs directly, removing the need for a front panel with switches and lights.\n\nTechnical advantages include the use of efficient, new 4K dynamic memory chips, allowing 8KB of RAM on the board and expandability up to 65KB. The advertisement also promotes a reliable, fast cassette interface for data storage and includes a free copy of Apple BASIC software.\n\nThe overall message positions the Apple I as a powerful, affordable, and user-friendly system that opens computing to a wider audience for programming, running software, and playing games.",
    "chinese_title": "苹果I型电脑广告（1976年）",
    "chinese_summary": "这则1976年的广告介绍了苹果公司的首款产品Apple I。它被定位为一款完整、低成本、集成于单块印刷电路板的微型计算机系统，售价666.66美元，包含4KB内存。\n\n其核心卖点在于高度集成与易用性。该主板集成了MOS 6502微处理器、内置视频终端和存储器，无需昂贵嘈杂的电传打字机。用户只需连接键盘和视频显示器（或通过调制器连接电视）即可直接使用。系统支持显示960个字符，并内置可直接输入和调试程序的固件，省去了传统的前置开关与指示灯面板。\n\n技术优势包括采用高效的新型4K动态内存芯片，使主板可搭载8KB内存并支持扩展至65KB。广告还宣传其可靠快速的数据存储磁带接口，并随机附赠Apple BASIC软件。\n\n整体而言，广告将Apple I塑造为一款强大、经济、易用的系统，旨在为更广泛的用户开启编程、运行软件和游戏体验的计算机世界。"
  },
  {
    "id": "46846252",
    "title": "Adventure Game Studio: OSS software for creating adventure games",
    "url": "https://www.adventuregamestudio.co.uk/",
    "summary": "Adventure Game Studio (AGS) is a free, open-source software suite for creating point-and-click adventure games. Its core feature is a Windows-based integrated development environment (IDE) that combines tools for graphics, scripting, and testing into a streamlined workflow. Games built with AGS are cross-platform, playable on Windows, Linux, iOS, and Android.\n\nThe software is supported by an active, volunteer-run community offering help through forums, Discord, and social media. The official website serves as a hub for this community, featuring a game showcase with notable titles like award-winners *5 Days a Stranger* and *If On A Winter's Night, Four Travelers*, and hosting events like game jams.\n\nUsers can download the software directly from the site, which also encourages donations to help cover server and maintenance costs for the community resources.",
    "chinese_title": "冒险游戏制作工具：用于创建冒险游戏的开源软件",
    "chinese_summary": "冒险游戏制作工具（AGS）是一款免费开源软件套件，专为创作点击式冒险游戏而设计。其核心功能是一个基于Windows的集成开发环境（IDE），将图形处理、脚本编写和测试工具整合为流畅的工作流程。使用AGS开发的游戏具有跨平台特性，可在Windows、Linux、iOS和Android系统上运行。\n\n该软件由一个活跃的志愿者运营社区提供支持，通过论坛、Discord和社交媒体为用户提供帮助。官方网站作为社区枢纽，设有游戏展示区，收录了《五日陌生人》和《如果在冬夜，四位旅人》等获奖知名作品，并定期举办游戏开发马拉松等活动。\n\n用户可直接从网站下载软件，网站同时接受捐赠以支持社区资源的服务器和维护成本。"
  },
  {
    "id": "46844870",
    "title": "Netbird – Open Source Zero Trust Networking",
    "url": "https://netbird.io/",
    "summary": "**Netbird – Open Source Zero Trust Networking**\n\nNetbird is an open-source platform designed to simplify the implementation of Zero Trust Network Access (ZTNA). It provides a secure, encrypted mesh network that connects devices and private resources (like servers or databases) as if they were on the same local network, regardless of their physical location.\n\nThe core solution replaces traditional, complex VPNs with a lightweight agent installed on each device. This agent automatically establishes secure peer-to-peer WireGuard tunnels between authorized users and the specific resources they need, following the Zero Trust principle of \"never trust, always verify.\" Access is managed through a central dashboard and is based on user identity and defined policies, not just network location.\n\nKey features and benefits highlighted include:\n*   **Ease of Use:** Quick setup with automated configuration and peer discovery.\n*   **Security:** End-to-end encryption, no open inbound firewall ports, and mandatory authentication.\n*   **Open Source:** Full transparency, self-hosting capability, and a free-forever core version.\n*   **Efficiency:** Direct peer-to-peer connections reduce latency and bandwidth costs compared to VPN gateways.\n\nNetbird is positioned as an accessible alternative for businesses, developers, and homelab users seeking to modernize their remote access with a Zero Trust model without high costs or complexity.",
    "chinese_title": "Netbird – 开源零信任网络",
    "chinese_summary": "**Netbird – 开源零信任网络**\n\nNetbird 是一个开源平台，旨在简化零信任网络访问（ZTNA）的实施。它提供了一个安全、加密的网状网络，无论设备物理位置如何，都能像在同一本地网络一样连接设备和私有资源（如服务器或数据库）。\n\n其核心解决方案通过在每个设备上安装轻量级代理，取代了传统复杂的VPN。该代理遵循“永不信任，始终验证”的零信任原则，在授权用户与其所需特定资源之间自动建立安全的点对点WireGuard隧道。访问通过中央仪表板进行管理，基于用户身份和既定策略，而不仅仅是网络位置。\n\n强调的主要特性和优势包括：\n*   **易于使用：** 自动配置和对等节点发现，实现快速设置。\n*   **安全性：** 端到端加密，无需开放入站防火墙端口，且强制身份验证。\n*   **开源：** 完全透明，支持自托管，并提供永久免费的核心版本。\n*   **高效性：** 与VPN网关相比，直接的点对点连接降低了延迟和带宽成本。\n\nNetbird 定位为一种易于采用的替代方案，适用于寻求以零信任模型现代化远程访问、同时希望避免高成本或复杂性的企业、开发者和家庭实验室用户。"
  },
  {
    "id": "46848415",
    "title": "I taught my neighbor to keep the volume down",
    "url": "https://idiallo.com/blog/teaching-my-neighbor-to-keep-the-volume-down",
    "summary": "In 2007, the author switched to Dish Network, intrigued by an RF (radio frequency) remote that didn't require line-of-sight. However, after a noisy neighbor also got Dish Network with an RF remote, the author's TV began malfunctioning—changing channels and volume on its own. Diagnosing the issue, the author discovered both remotes operated on the same frequency, allowing each to control both set-top boxes.\n\nAttempting to resolve it amicably, the author visited the neighbor to explain the interference, but was rudely dismissed. With the neighbor continuing to blast his TV, the author kept the RF remote in the bedroom and began using it to turn off the neighbor's TV whenever the volume exceeded a certain threshold. Through this consistent \"Pavlovian\" conditioning over weeks, the neighbor unconsciously learned to keep the volume down to avoid his TV shutting off. The author never reprogrammed the remote, using the interference as a tool to enforce quieter behavior, ultimately solving the noise problem without further confrontation.",
    "chinese_title": "我教会了我的邻居把音量调低。",
    "chinese_summary": "2007年，作者因一款无需视线对准的射频遥控器而转用Dish Network电视服务。然而，当一位吵闹的邻居也安装了带射频遥控器的Dish Network后，作者的电视开始自动换台和调节音量。经排查，作者发现两台遥控器使用相同频率，导致彼此都能控制对方的机顶盒。\n\n作者试图友好解决问题，上门向邻居解释干扰现象，却遭到粗鲁回绝。面对邻居继续高声播放电视，作者将射频遥控器放在卧室，每当邻居电视音量超过一定阈值，便用遥控器关闭其电视。通过数周这种持续的“巴甫洛夫式”条件反射，邻居在无意识中学会了压低音量以避免电视突然关闭。作者从未重设遥控器，而是将信号干扰转化为约束行为的工具，最终在没有进一步冲突的情况下解决了噪音问题。"
  },
  {
    "id": "46848699",
    "title": "TIL: Apple Broke Time Machine Again on Tahoe",
    "url": "https://taoofmac.com/space/til/2026/02/01/1630",
    "summary": "This article details how a macOS update (likely \"Tahoe\") broke Time Machine backups for the author, who uses a Synology NAS as an SMB target. The problem stems from Apple changing its default SMB security settings, which caused compatibility issues with the NAS.\n\nThe author presents two solutions:\n1.  **A temporary fix on the Mac:** Editing the `/etc/nsmb.conf` file to manually configure SMB settings (like enabling signing and setting the protocol version) to be compatible with the NAS.\n2.  **A more robust, long-term plan:** Setting up a dedicated Time Machine server using a Docker container (`mbentley/timemachine`) on a Proxmox server with ZFS storage, to gain control over the SMB implementation and avoid reliance on Synology's software.\n\nThe article criticizes Apple for repeatedly breaking Time Machine with silent changes and poor communication, citing this issue and a persistent iOS restore bug as examples of frustrating user experience.",
    "chinese_title": "今日我学到了：苹果在塔霍湖上再次破坏了时间机器功能。",
    "chinese_summary": "本文详述了macOS更新（可能是“Tahoe”）如何导致作者使用Synology NAS作为SMB目标的Time Machine备份失效。问题的根源在于苹果更改了默认的SMB安全设置，从而引发了与NAS的兼容性问题。\n\n作者提出了两种解决方案：\n1.  **在Mac上的临时修复**：编辑`/etc/nsmb.conf`文件，手动配置SMB设置（如启用签名和设置协议版本），以兼容NAS。\n2.  **更稳健的长期方案**：在配备ZFS存储的Proxmox服务器上，使用Docker容器（`mbentley/timemachine`）设置专用的Time Machine服务器，以控制SMB实现，避免依赖Synology软件。\n\n文章批评苹果公司多次通过静默更改和沟通不畅破坏Time Machine功能，并以此次问题及一个长期存在的iOS恢复错误为例，指出这些都给用户带来了糟糕的体验。"
  },
  {
    "id": "46826011",
    "title": "Efficient String Compression for Modern Database Systems",
    "url": "https://cedardb.com/blog/string_compression/",
    "summary": "This article discusses the importance of efficient string compression in modern databases like CedarDB, where strings are the most common data type and heavily used in queries. The primary goal is not just to save storage space but to significantly boost query performance by reducing data movement and enabling better CPU cache utilization.\n\nCedarDB initially uses dictionary compression, which replaces unique strings with small integer keys. This allows for fast query evaluation using efficient integer comparisons and SIMD instructions, but it performs poorly with many distinct values.\n\nTo address this, the article introduces FSST (Fast Static Symbol Table), a compression method that replaces frequent substrings with 1-byte codes. While FSST compresses repetitive data well, evaluating queries directly on FSST-compressed strings is inefficient.\n\nThe proposed solution is to combine both techniques: first, apply dictionary compression to the data, and then use FSST to compress the dictionary itself. This hybrid approach retains the fast filtering benefits of dictionary keys (small, fixed-size integers) while achieving the superior compression ratios of FSST by exploiting patterns within the dictionary strings, offering an optimal balance for performance and storage.",
    "chinese_title": "现代数据库系统的高效字符串压缩技术",
    "chinese_summary": "本文探讨了在现代数据库（如CedarDB）中高效字符串压缩的重要性，其中字符串是最常见的数据类型，并在查询中被大量使用。其主要目标不仅是节省存储空间，更是通过减少数据移动和提升CPU缓存利用率，显著提高查询性能。\n\nCedarDB最初采用字典压缩，将唯一字符串替换为小型整数键。这使得可以利用高效的整数比较和SIMD指令进行快速查询评估，但在处理大量不同值时表现不佳。\n\n为解决此问题，本文介绍了FSST（快速静态符号表），这是一种通过1字节编码替换频繁出现的子字符串的压缩方法。虽然FSST能有效压缩重复数据，但直接在FSST压缩的字符串上评估查询效率低下。\n\n提出的解决方案是结合两种技术：首先对数据应用字典压缩，然后使用FSST压缩字典本身。这种混合方法既保留了字典键（小型、固定大小的整数）的快速过滤优势，又通过利用字典字符串内部的模式实现了FSST的卓越压缩比，从而在性能和存储之间达到了最佳平衡。"
  },
  {
    "id": "46844822",
    "title": "What I learned building an opinionated and minimal coding agent",
    "url": "https://mariozechner.at/posts/2025-11-30-pi-coding-agent/",
    "summary": "The author built a minimal, opinionated coding agent harness after becoming frustrated with the increasing complexity and unpredictability of tools like Claude Code. Their system, **pi-coding-agent**, is built on three custom components: **pi-ai** (a unified LLM API supporting multiple providers with features like cross-provider context handoff and token tracking), **pi-agent-core** (an agent loop for tool execution), and **pi-tui** (a terminal UI framework).\n\nThe project's philosophy is to include only essential features, deliberately omitting common elements like plan modes, sub-agents, and MCP support. Key design goals were precise control over the model's context, full inspectability of interactions, a clean session format, and reliable support for self-hosted models. The author highlights challenges in creating a unified API, such as provider inconsistencies and the difficulty of accurate cost tracking, but concludes that their focused, minimal approach has proven effective for their workflow.",
    "chinese_title": "构建一个固执己见且极简的编码助手，我学到了什么",
    "chinese_summary": "作者在厌倦了Claude Code等工具日益复杂和不可预测的特性后，构建了一个极简且具有明确设计理念的编程智能体框架。他们的系统 **pi-coding-agent** 基于三个自定义组件构建：**pi-ai**（一个统一的多提供商LLM API，支持跨提供商上下文传递和令牌追踪等功能）、**pi-agent-core**（用于工具执行的智能体循环）以及 **pi-tui**（终端用户界面框架）。\n\n该项目的理念是仅包含核心功能，刻意省略了计划模式、子智能体和MCP支持等常见元素。其关键设计目标包括：精确控制模型上下文、完整的交互可检查性、简洁的会话格式，以及对自托管模型的可靠支持。作者指出了创建统一API过程中的挑战，例如提供商之间的不一致性和精确成本追踪的难度，但总结认为这种专注、极简的方法已在其工作流程中被证明是有效的。"
  },
  {
    "id": "46812795",
    "title": "MicroPythonOS graphical operating system delivers Android-like user experience",
    "url": "https://www.cnx-software.com/2026/01/29/micropythonos-graphical-operating-system-delivers-android-like-user-experience-on-microcontrollers/",
    "summary": "**Summary:**\n\nMicroPythonOS is an open-source, graphical operating system for microcontrollers, heavily inspired by Android and iOS. Built on a native MicroPython foundation, it consists of a core \"Thin OS\" that handles hardware and multitasking, with all other functions—including WiFi configuration and system updates—running as separate apps.\n\nKey features include an Android-like touchscreen UI built with LVGL (supporting gestures and themes), an integrated App Store for easy app installation, and Over-The-Air (OTA) firmware updates. It is designed to be fast and lightweight for resource-constrained devices.\n\nWhile primarily targeting ESP32 microcontrollers (like the ESP32-S3-Touch-LCD-2), it is cross-platform and can also run on systems supporting MicroPython, including Raspberry Pi RP2350, Windows, Linux, and macOS—the latter being useful for development. Pre-installed apps include Launcher, WiFi, AppStore, OSUpdate, and Settings, with additional apps like a Camera and IMU viewer available.\n\nPotential applications range from smart home controllers and educational tools to portable devices and robotics. Hardware support on ESP32 includes WiFi, Bluetooth, touchscreens, cameras, and various sensors. The project will be featured at FOSDEM 2026, and its source code and documentation are available online.",
    "chinese_title": "MicroPythonOS图形操作系统提供类似Android的用户体验",
    "chinese_summary": "**摘要：**\n\nMicroPythonOS 是一款面向微控制器的开源图形操作系统，深受 Android 和 iOS 启发。它基于原生的 MicroPython 构建，由一个处理硬件和多任务的核心“精简操作系统”组成，所有其他功能——包括 WiFi 配置和系统更新——均作为独立应用程序运行。\n\n其主要特点包括：采用 LVGL 构建的类 Android 触摸屏用户界面（支持手势和主题）、便于应用安装的集成应用商店，以及无线固件更新功能。该系统设计为快速轻量，适用于资源受限的设备。\n\n虽然主要面向 ESP32 微控制器（如 ESP32-S3-Touch-LCD-2），但它具有跨平台性，也能在支持 MicroPython 的系统上运行，包括 Raspberry Pi RP2350、Windows、Linux 和 macOS——后者对开发很有用。预装应用包括启动器、WiFi、应用商店、系统更新和设置，此外还有相机和 IMU 查看器等应用可供使用。\n\n其潜在应用范围涵盖智能家居控制器、教育工具、便携式设备和机器人等领域。在 ESP32 上支持的硬件包括 WiFi、蓝牙、触摸屏、摄像头和各种传感器。该项目将在 FOSDEM 2026 上展示，其源代码和文档均可在线获取。"
  },
  {
    "id": "46848260",
    "title": "Clearspace (YC W23) Is Hiring an Applied Researcher (ML)",
    "url": "https://www.ycombinator.com/companies/clearspace/jobs/GOWiDwp-research-engineer-at-clearspace",
    "summary": "Clearspace (YC W23) is hiring a Research Engineer focused on Machine Learning in San Francisco. The company's mission is to build technology that protects human attention from compulsive phone usage and manipulative design features common in social media.\n\nThe role involves owning the implementation of a production model to classify network traffic, creating data-gathering tooling, and defining research direction with the founders. The ideal candidate is a problem-solver who thinks critically about data volume, featurization, and inference requirements.\n\nKey qualifications include a Bachelor's degree in Computer Science or a related field, experience training production-grade sequential models (especially on time-series data), and a willingness to work onsite. Experience with network traffic or graduate research is a plus.\n\nThe position offers a salary range of $150K - $200K plus 0.50% - 1.00% equity. Clearspace is a five-person startup founded in 2022.",
    "chinese_title": "Clearspace（YC W23）正在招聘应用研究员（机器学习方向）",
    "chinese_summary": "Clearspace（YC W23）正在旧金山招聘专注于机器学习的研究工程师。公司使命是开发技术，保护人类注意力免受社交媒体中常见的强迫性手机使用和操控性设计功能的影响。\n\n该职位负责主导生产级网络流量分类模型的实现、创建数据收集工具，并与创始人共同确定研究方向。理想的候选人应具备解决问题的能力，能深入思考数据规模、特征工程和推理需求。\n\n关键要求包括计算机科学或相关领域的学士学位、具备训练生产级序列模型（尤其是时间序列数据）的经验，以及愿意现场办公。有网络流量处理或研究生科研经验者优先。\n\n该职位年薪范围为15万至20万美元，另加0.50%至1.00%的股权。Clearspace是一家成立于2022年的五人初创公司。"
  },
  {
    "id": "46845244",
    "title": "Amiga Unix (Amix)",
    "url": "https://www.amigaunix.com/doku.php/home",
    "summary": "This article is a comprehensive guide to Amiga UNIX (Amix), a port of AT&T System V Release 4 Unix for the Amiga computer, released by Commodore in 1990. It frames Amix primarily as a historical curiosity for enthusiasts, rather than a practical operating system for modern use.\n\nThe main points covered are:\n*   **History & Nature:** Amix was an official but niche SVR4 Unix variant for the Amiga 2500UX and 3000UX, though it can run on other compatible hardware and in the WinUAE emulator.\n*   **Site Purpose:** The wiki aims to preserve Amix's history and provide practical information for running it, acknowledging that installation and administration present significant challenges even for experienced users due to its age and System V differences.\n*   **Content Scope:** It offers resources on hardware compatibility, installation tutorials (for real hardware and emulators), software management (including patches and the X11 GUI), and various tips and tricks.\n*   **Caveats & Audience:** The article strongly cautions readers, stating that Amix is outdated, unsupported, insecure, and not representative of modern Unix-like systems. It is presented as suitable only for those interested in computing history or wanting to experience early-1990s Unix environments, not for general use or learning contemporary Unix.\n*   **Community & Resources:** The guide provides links to download sources, forums for help (notably the English Amiga Board), and other reference sites, while also soliciting contributions to expand its content.",
    "chinese_title": "Amiga Unix（Amix）",
    "chinese_summary": "本文是关于Amiga UNIX（Amix）的全面指南，这是AT&T System V Release 4 Unix为Amiga电脑移植的版本，由Commodore于1990年发布。文章将Amix主要定位为爱好者眼中的历史奇物，而非适合现代使用的实用操作系统。\n\n主要内容涵盖：\n*   **历史与性质：** Amix是Amiga 2500UX和3000UX官方但小众的SVR4 Unix变体，尽管它也能在其他兼容硬件及WinUAE模拟器上运行。\n*   **网站目的：** 该维基旨在保存Amix的历史，并提供运行它的实用信息，同时承认由于其年代久远及与System V的差异，安装和管理即使对经验丰富的用户也构成显著挑战。\n*   **内容范围：** 提供硬件兼容性资源、安装教程（针对真实硬件和模拟器）、软件管理（包括补丁和X11图形界面）以及各种技巧提示。\n*   **注意事项与受众：** 文章强烈提醒读者，Amix已过时、无支持、不安全，且不代表现代类Unix系统。它仅适合对计算历史感兴趣或想体验1990年代早期Unix环境的人士，不适用于一般用途或学习当代Unix。\n*   **社区与资源：** 指南提供了下载源链接、求助论坛（特别是English Amiga Board）及其他参考网站，同时征集内容贡献以扩展其资料库。"
  },
  {
    "id": "46844350",
    "title": "The Book of PF, 4th edition",
    "url": "https://nostarch.com/book-of-pf-4th-edition",
    "summary": "*The Book of PF, 4th Edition* is a comprehensive guide to configuring and managing the PF (Packet Filter) firewall on OpenBSD systems. The book is structured to take readers from foundational concepts to advanced network management.\n\nIt begins with introductory chapters on building a network and PF configuration basics, then progresses to practical applications for real-world, wireless, and complex networks. Key advanced topics include proactive defense strategies, traffic shaping through queues, and ensuring network redundancy and high availability. The later chapters cover essential operational aspects like logging, monitoring, and fine-tuning a PF setup for optimal performance.\n\nThe provided table of contents indicates that this Early Access PDF includes the chapters highlighted in red, offering a substantial preview of the complete work. The book is designed as a practical manual for both learning PF from the ground up and implementing sophisticated firewall and traffic control solutions.",
    "chinese_title": "《PF之书》第四版",
    "chinese_summary": "《PF防火墙配置指南（第四版）》是一本全面指导如何在OpenBSD系统上配置与管理PF（数据包过滤器）防火墙的权威著作。全书结构由浅入深，带领读者从基础概念逐步掌握高级网络管理技能。\n\n开篇章节从网络构建基础与PF配置入门讲起，随后深入探讨实际应用场景，涵盖常规网络、无线网络及复杂网络环境的部署方案。核心进阶主题包括主动防御策略、队列流量整形技术，以及保障网络冗余与高可用性的方法。后续章节聚焦于日志记录、系统监控、性能调优等关键运维实践，帮助读者优化PF配置以实现最佳运行效果。\n\n根据提供的目录说明，此早期访问版PDF包含标红章节，为读者呈现了完整作品的精华预览。本书既适合初学者系统学习PF防火墙知识，也可作为专业人员在复杂网络中部署高级防火墙与流量控制解决方案的实践手册。"
  },
  {
    "id": "46782462",
    "title": "Anciente map of Fairyland. Places from nursery rhymes, fairy tales etc.",
    "url": "https://collections.leventhalmap.org/search/commonwealth:3f463773q",
    "summary": "**Summary:** \"An Anciente Mappe of Fairyland\" is a decorative map created by Bernard Sleigh in 1917, depicting a whimsical landscape populated by locations and characters from global nursery rhymes, fairy tales, and Arthurian legends. Originally sketched to entertain his children, it was later published for nursery decoration. The map proved so popular that after Sleigh's retirement in 1937, the design was adapted into fabric by Rosebank Fabrics, which also commissioned him to create additional fairy tale patterns. The map is part of the Norman B. Leventhal Map & Education Center Collection at the Boston Public Library, is not drawn to scale, and was accompanied by a 16-page guide. It has been featured in exhibitions on literary landscapes. The digital record notes no known copyright restrictions.",
    "chinese_title": "仙境古地图。收录童谣、童话等故事中的地点。",
    "chinese_summary": "**摘要：**《仙境古地图》是伯纳德·斯莱于1917年创作的一幅装饰性地图，描绘了一个充满奇幻色彩的景观，其中汇集了来自全球童谣、童话和亚瑟王传说的地点与角色。这幅地图最初是为娱乐他的孩子而绘制，后作为育儿室装饰品出版。地图大受欢迎，以至于斯莱在1937年退休后，其设计被罗斯班克纺织公司改编为布料图案，该公司还委托他创作了更多童话主题图案。该地图现藏于波士顿公共图书馆的诺曼·B·莱文塔尔地图与教育中心馆藏，未按比例绘制，并附有一份16页的指南。它曾在关于文学景观的展览中展出。数字记录显示该作品无已知版权限制。"
  },
  {
    "id": "46845103",
    "title": "FOSDEM 2026 – Open-Source Conference in Brussels – Day#1 Recap",
    "url": "https://gyptazy.com/blog/fosdem-2026-opensource-conference-brussels/",
    "summary": "FOSDEM 2026 highlighted a significant shift in the open-source community toward digital sovereignty, with a strong focus on self-hosted solutions, open infrastructure, and regaining user control from centralized platforms. The conference featured talks on foundational technologies like Rust-VMM and practical systems such as Garage S3, while projects like SmolBSD and the DN42 network exemplified minimalism and community-driven innovation.\n\nHowever, the event's massive growth presented challenges, with overcrowding threatening its traditionally open and spontaneous atmosphere. The increased urgency around strategic topics like technological independence risked overshadowing niche projects and diverse motivations. Despite these growing pains, FOSDEM retained its core value as a free, community-focused event where in-person connections and hallway conversations proved irreplaceable, even as the need for sustainable scaling becomes increasingly critical.",
    "chinese_title": "FOSDEM 2026 – 布鲁塞尔开源大会 – 首日回顾",
    "chinese_summary": "FOSDEM 2026 凸显了开源社区向数字主权的重大转变，重点关注自托管解决方案、开放基础设施以及从中心化平台夺回用户控制权。会议涵盖了 Rust-VMM 等基础技术和 Garage S3 等实用系统的演讲，而 SmolBSD 和 DN42 网络等项目则体现了极简主义与社区驱动的创新。\n\n然而，活动的迅猛发展也带来了挑战，过度拥挤威胁到其传统开放、自发的氛围。技术独立性等战略议题的紧迫性增强，可能掩盖了小众项目和多元动机。尽管面临这些成长中的阵痛，FOSDEM 仍坚守其作为免费、以社区为核心的活动的核心价值——现场交流与走廊对话依旧无可替代，尽管可持续扩展的需求正变得日益关键。"
  },
  {
    "id": "46799435",
    "title": "VisualJJ – Jujutsu in Visual Studio Code",
    "url": "https://www.visualjj.com/",
    "summary": "VisualJJ is a Visual Studio Code extension designed to simplify version control by integrating with Jujutsu (JJ) and Git. It provides an interactive, visual change tree that allows developers to manage their commit history, rebase, and resolve conflicts without disrupting their workflow.\n\nKey features include an effortless rebase and edit interface where commits can be dragged and dropped, deferred conflict resolution that keeps work in a safe draft state, and seamless GitHub integration for tracking and creating pull requests directly from the editor. The tool is promoted as a way to move away from the complexities of Git, offering a clearer and more intuitive interface for managing code changes.\n\nThe article includes positive testimonials from users who praise its intuitiveness and power. It positions VisualJJ as a solution for engineers who want to maintain productivity and confidence while shipping code, whether they are experienced with Jujutsu or simply seeking an alternative to traditional Git tools.",
    "chinese_title": "VisualJJ – Visual Studio Code中的柔术",
    "chinese_summary": "VisualJJ是一款Visual Studio Code扩展，旨在通过与Jujutsu（JJ）和Git集成来简化版本控制。它提供了一个交互式的可视化变更树，使开发者能够在不中断工作流程的情况下管理提交历史、进行变基和解决冲突。\n\n其主要功能包括：支持拖放操作的轻松变基与编辑界面、可将工作保持在安全草稿状态的延迟冲突解决机制，以及直接在编辑器中跟踪和创建拉取请求的无缝GitHub集成。该工具被宣传为摆脱Git复杂性的解决方案，为管理代码变更提供了更清晰、更直观的界面。\n\n文章收录了用户积极评价，称赞其直观性和强大功能。VisualJJ被定位为面向工程师的解决方案，无论他们是否熟悉Jujutsu，或只是寻求传统Git工具的替代方案，都能在交付代码时保持生产力和信心。"
  },
  {
    "id": "46842603",
    "title": "List animals until failure",
    "url": "https://rose.systems/animalist/",
    "summary": "This is a description of a web-based word game titled \"List animals until failure.\" The core gameplay involves players listing as many unique animal names as possible under a time limit. The game has two key rules: each animal must have a Wikipedia article, and players cannot list overlapping terms (e.g., \"bear\" and \"polar bear\" would be invalid, but two distinct bear species would be acceptable).\n\nThe game uses a dynamic timer that starts with a set initial duration and increases with each correctly listed animal. The game ends when the timer reaches zero. The interface includes a score counter, settings to adjust the initial time and time increment, and options to reset, share results, or try again.\n\nThe creator, Vivian Rose, specifies that the game is built using Wikipedia and Wikidata data with manual adjustments and explicitly states that no large language models (LLMs) are involved in its operation.",
    "chinese_title": "列举动物直到失败",
    "chinese_summary": "这是一款名为“列举动物直至失败”的网页文字游戏。核心玩法是玩家在限时内尽可能多地列出不重复的动物名称。游戏有两条关键规则：每种动物必须拥有维基百科条目，且玩家不能列出重叠术语（例如“熊”和“北极熊”视为无效，但两种不同的熊科动物可被接受）。\n\n游戏采用动态计时器，初始设定固定时长，每正确列出一个动物名称即增加时间。计时器归零时游戏结束。界面包含分数计数器、可调整初始时间和时间增量的设置选项，以及重置、分享结果或重新开始的功能。\n\n创作者薇薇安·罗斯说明，该游戏基于维基百科和维基数据构建，并经过人工调整，同时明确表示其运行过程中未使用任何大型语言模型。"
  },
  {
    "id": "46846697",
    "title": "Show HN: Voiden – an offline, Git-native API tool built around Markdown",
    "url": "https://github.com/VoidenHQ/voiden",
    "summary": "**Voiden** is an offline-first, Git-native API client designed for developers, testers, and technical writers. It treats API workflows like code, allowing users to build, test, and link requests as reusable blocks, comment on responses (JSON/XML), and preview various content types (PDFs, video). All work is managed locally without requiring cloud accounts or sync.\n\nThe tool is available for download (v1.1.0) on Windows, macOS, and Linux. Beta versions are also accessible. The project is open-source (Apache 2.0) and encourages community involvement through bug reports, feature requests, and contributions.\n\nFor local development, prerequisites include Node.js, Yarn, and on Windows, specific Visual Studio Build Tools. The repository structure separates the Electron app, UI, core extensions, and documentation. Full setup guides and troubleshooting help are provided in the project's documentation.",
    "chinese_title": "展示 HN：Voiden——一款围绕 Markdown 构建的离线、Git 原生 API 工具",
    "chinese_summary": "**Voiden** 是一款面向开发者、测试人员和技术文档工程师的离线优先、Git原生的API客户端。它将API工作流视为代码，允许用户将请求构建、测试和链接为可复用的模块，对响应（JSON/XML）进行注释，并预览多种内容类型（PDF、视频）。所有工作均在本地管理，无需云账户或同步。\n\n该工具可在Windows、macOS和Linux系统下载（v1.1.0），测试版亦可获取。项目采用开源协议（Apache 2.0），鼓励社区通过提交错误报告、功能建议和代码贡献参与其中。\n\n本地开发需预先安装Node.js、Yarn，在Windows上还需特定版本的Visual Studio生成工具。仓库结构将Electron应用、用户界面、核心扩展和文档分离。完整设置指南和故障排除帮助均可在项目文档中查阅。"
  },
  {
    "id": "46847746",
    "title": "Aging muscle stem cells shift from rapid repair to long-term survival",
    "url": "https://phys.org/news/2026-01-sprint-marathon-aging-muscle-stem.html",
    "summary": "**Summary of \"Aging muscle stem cells shift from rapid repair to long-term survival\"**\n\nA new study reveals that the primary function of muscle stem cells (MuSCs) shifts fundamentally with age, explaining why muscle regeneration declines in older adults. In young muscles, these stem cells are primed for rapid activation and repair following injury, functioning like \"sprinters.\" However, as muscles age, the stem cells enter a deeper state of quiescence, becoming \"marathoners\" focused on long-term survival and self-maintenance at the expense of quick repair.\n\nThe research identified a key protein, β1-integrin, as the molecular switch controlling this transition. In youth, high levels of β1-integrin on the cell surface anchor MuSCs to their niche, keeping them alert and ready to respond to injury signals. With age, these integrins are internalized, severing a critical communication link with the external environment. This disconnection causes the stem cells to retreat into a deeper, more dormant state to preserve themselves.\n\nThis survival-oriented shift comes at a cost: aged stem cells are much slower and less effective at activating, proliferating, and generating new muscle tissue when injury occurs, leading to poorer recovery.\n\nThe findings suggest that promoting muscle health in aging may not be about simply forcing old stem cells to act young. Instead, potential therapies could aim to therapeutically manipulate the β1-integrin pathway to temporarily restore a more alert state in these cells, potentially improving their regenerative capacity when needed.",
    "chinese_title": "衰老的肌肉干细胞从快速修复转向长期存活。",
    "chinese_summary": "**《衰老肌肉干细胞从快速修复转向长期生存》摘要**\n\n一项新研究揭示，肌肉干细胞的主要功能随年龄发生根本性转变，这解释了为何老年人的肌肉再生能力会下降。在年轻肌肉中，这些干细胞如同\"短跑选手\"，随时准备在受伤后快速激活并修复组织。但随着肌肉衰老，干细胞会进入更深的静息状态，转变为专注于长期生存和自我维持的\"马拉松选手\"，代价是牺牲快速修复能力。\n\n研究发现关键蛋白β1-整合素是控制这一转变的分子开关。年轻时，细胞表面高水平的β1-整合素将肌肉干细胞锚定在微环境中，使其保持警觉并随时响应损伤信号。随着年龄增长，这些整合素被内化，切断了与外界环境的关键通讯连接。这种失联导致干细胞退入更深层的休眠状态以维持自身存续。\n\n这种以生存为导向的转变需付出代价：当损伤发生时，衰老干细胞的激活、增殖及生成新肌肉组织的速度显著变慢、效率降低，导致恢复能力变差。\n\n研究提示，促进衰老期的肌肉健康可能并非简单地迫使衰老干细胞恢复年轻行为。未来疗法或可着眼于通过调控β1-整合素通路，暂时恢复这些细胞的警觉状态，从而在需要时提升其再生能力。"
  },
  {
    "id": "46848343",
    "title": "Light exposure and aspects of cognitive function in everyday life",
    "url": "https://www.nature.com/articles/s44271-025-00373-9",
    "summary": "This study investigated the relationship between real-world light exposure and cognitive function in 58 UK adults over seven days. Using wearable light sensors and a smartphone app, researchers measured participants' light exposure patterns alongside their performance on tasks assessing vigilance, working memory, and visual search, as well as subjective sleepiness.\n\nKey findings revealed that recent exposure to brighter light was associated with reduced sleepiness and faster reaction times on vigilance and memory tasks. Furthermore, individuals' overall light exposure patterns mattered: those with brighter daytime light and more stable, less fragmented daily light patterns showed better cognitive performance across all tasks. The study also found that the beneficial effect of recent light on reducing sleepiness was stronger in people who had brighter daytime exposure and earlier bedtimes.\n\nA subset of 41 participants underwent lab tests to measure retinal sensitivity to light, but the summary does not detail these results. The research concludes that both short-term bright light and habitual patterns of light exposure—characterized by bright days and stable routines—meaningfully influence cognitive performance in everyday life. This underscores the importance of light for optimizing alertness and cognitive function outside controlled laboratory settings.",
    "chinese_title": "光照暴露与日常生活中的认知功能方面",
    "chinese_summary": "本研究调查了58名英国成年人在七天内的实际光照暴露与认知功能之间的关系。研究人员使用可穿戴光照传感器和智能手机应用程序，测量了参与者的光照暴露模式，同时评估了他们在警觉性、工作记忆和视觉搜索任务中的表现，以及主观嗜睡程度。\n\n主要发现表明，近期暴露于较亮光线与嗜睡程度降低、警觉性和记忆任务反应时间加快相关。此外，个体的整体光照模式也很重要：白天光照更充足、每日光照模式更稳定且更少碎片化的人在所有任务中均表现出更好的认知能力。研究还发现，近期光照对减少嗜睡的有益影响在白天光照更充足、就寝时间更早的人群中更为明显。\n\n其中41名参与者接受了实验室测试以测量视网膜对光的敏感性，但摘要未详细说明这些结果。研究得出结论，短期强光暴露和以白天明亮、作息稳定为特征的习惯性光照模式，均对日常生活中的认知能力产生显著影响。这强调了光照在非受控实验室环境下对优化警觉性和认知功能的重要性。"
  },
  {
    "id": "46828907",
    "title": "Jack Kerouac's 37 metre-long, first draft scroll of On the Road to be auctioned",
    "url": "https://www.theguardian.com/books/2026/jan/30/jack-kerouac-on-the-road-first-draft-scroll-to-be-auctioned",
    "summary": "The original 37-meter-long scroll manuscript of Jack Kerouac’s *On the Road*, typed in a three-week burst in 1951, will be auctioned at Christie’s in New York on March 12. It is a centerpiece of the late Jim Irsay’s private collection of cultural memorabilia, with an estimated sale price between £1.8m and £2.9m ($2.5m-$4m). The scroll, a defining artefact of the Beat Generation, features the real names of characters and lacks paragraphs, visually resembling a road.\n\nThe auction also includes Kerouac’s *The Dharma Bums* scroll and nearly 400 other items from the Irsay Collection, such as Paul McCartney’s handwritten “Hey Jude” lyrics and Sylvester Stallone’s *Rocky* notebook. These items will be publicly exhibited at Christie’s from March 6-12.\n\nThe sale revives a past controversy, as Kerouac’s circle previously argued the scroll belongs in a public institution. Christie’s specialist Heather Weintraub expressed hope that a public buyer would acquire it or that a private owner would continue Irsay’s practice of lending it for public display.",
    "chinese_title": "杰克·凯鲁亚克37米长的《在路上》初稿手卷即将拍卖",
    "chinese_summary": "杰克·凯鲁亚克《在路上》的原始37米长卷轴手稿，于1951年以三周时间一气呵成完成打字，将于3月12日在纽约佳士得拍卖。这份手稿是已故吉姆·伊尔赛私人文化纪念品收藏的核心藏品，预计售价在180万至290万英镑（250万至400万美元）之间。作为“垮掉的一代”的标志性文物，该卷轴保留了人物的真实姓名且无段落分隔，视觉上宛如一条延伸的道路。\n\n此次拍卖还包括凯鲁亚克的《达摩流浪者》卷轴及伊尔赛收藏中近400件其他物品，例如保罗·麦卡特尼手写的《Hey Jude》歌词稿、西尔维斯特·史泰龙的《洛奇》剧本笔记。这些藏品将于3月6日至12日在佳士得公开展出。\n\n此次拍卖重启了过去的争议——凯鲁亚克的亲友曾主张卷轴应收藏于公共机构。佳士得专家希瑟·温特劳布表示，希望由公共买家购得，或私人藏家能延续伊尔赛出借展品的做法，使其继续向公众开放。"
  },
  {
    "id": "46804754",
    "title": "A web server on a single floppy disk",
    "url": "http://floppy.ddns.net/",
    "summary": "**Summary of \"A web server on a single floppy disk\"**\n\nThe article details a technical project to create a functional, self-contained web server that fits entirely on a standard 1.44MB floppy disk. The core achievement is running a modern, minimalist web stack—including the Linux kernel, BusyBox utilities, and the `httpd` web server—within the severe storage constraints of a floppy.\n\nKey points include:\n*   **Core Components:** The system uses a specially compiled, tiny Linux kernel (≈700KB), the BusyBox multi-call binary to provide essential Unix tools, and the lightweight `httpd` server from BusyBox.\n*   **Technical Constraints & Solutions:** Significant effort went into stripping down and configuring each component to minimize size. The filesystem is a compressed RAM disk (initrd); after boot, the system runs entirely in memory, allowing the floppy drive to be ejected.\n*   **Functionality:** Despite its size, the server can host static HTML pages and even simple CGI scripts. The article demonstrates it serving a basic website.\n*   **Purpose:** The project is primarily a proof-of-concept and learning exercise in extreme software minimization, optimization, and retro-computing. It highlights how much can be achieved with very limited resources by using efficient, purpose-built tools.\n\nIn essence, the project successfully demonstrates a bootable, networked web server from a single floppy, serving as an example of minimalist system design.",
    "chinese_title": "一张软盘上的网络服务器",
    "chinese_summary": "**《一张软盘上的网络服务器》摘要**\n\n本文详述了一个技术项目，旨在创建一套功能完备、自成一体的网络服务器，其全部内容可容纳于一张标准的1.44MB软盘之中。项目的核心成就在于，在软盘极其有限的存储空间内，运行了一个现代、极简的网络服务栈——包括Linux内核、BusyBox工具集以及`httpd`网络服务器。\n\n要点包括：\n*   **核心组件：** 系统采用了特别编译的微型Linux内核（约700KB）、提供基本Unix工具的BusyBox多调用二进制文件，以及BusyBox中的轻量级`httpd`服务器。\n*   **技术限制与解决方案：** 项目投入大量精力对每个组件进行精简和配置以最小化体积。文件系统采用压缩的RAM磁盘（initrd）；启动后，系统完全在内存中运行，从而可以弹出软盘驱动器。\n*   **功能：** 尽管体积微小，该服务器能够托管静态HTML页面，甚至运行简单的CGI脚本。文章演示了它如何提供基础网站服务。\n*   **目的：** 该项目主要是一个概念验证和学习实践，旨在探索极致的软件精简、优化以及复古计算。它突显了通过使用高效、专为特定目的构建的工具，在资源极其有限的情况下所能实现的成果。\n\n本质上，该项目成功演示了从一张软盘启动并联网的网络服务器，是极简系统设计的一个范例。"
  },
  {
    "id": "46782872",
    "title": "The history of C# and TypeScript with Anders Hejlsberg [video]",
    "url": "https://www.youtube.com/watch?v=uMqx8NNT4xY",
    "summary": "This text appears to be the standard legal footer from a YouTube video page, not the actual content of the video titled \"The history of C# and TypeScript with Anders Hejlsberg.\"\n\nTherefore, a summary of the video's content cannot be provided based on the given text. The provided \"Content\" section contains only generic YouTube platform information, including:\n*   Copyright and legal policies.\n*   Contact information for Google/YouTube.\n*   Disclaimers about products featured in videos.\n\nTo summarize the video, the actual transcript, description, or key points from the discussion with Anders Hejlsberg—the lead architect of both the C# language and TypeScript—would be required. The intended video likely covers the evolution, design principles, and impact of these two influential programming languages.",
    "chinese_title": "C#与TypeScript的历史：与安德斯·海尔斯伯格一同探讨 [视频]",
    "chinese_summary": "这段文字似乎是YouTube视频页面的标准法律页脚，而非视频《与安德斯·海尔斯伯格探讨C#和TypeScript的历史》的实际内容。\n\n因此，无法根据给定文本提供视频内容的摘要。所提供的“内容”部分仅包含通用的YouTube平台信息，包括：\n*   版权和法律政策\n*   谷歌/YouTube的联系方式\n*   视频中展示产品的免责声明\n\n若要总结视频内容，需要获取实际字幕、视频描述或与C#语言和TypeScript首席架构师安德斯·海尔斯伯格讨论的关键要点。该视频可能涵盖这两种影响深远的编程语言的演变历程、设计理念及其影响。"
  },
  {
    "id": "46842178",
    "title": "Cells use 'bioelectricity' to coordinate and make group decisions",
    "url": "https://www.quantamagazine.org/cells-use-bioelectricity-to-coordinate-and-make-group-decisions-20260112/",
    "summary": "This article describes how cells use bioelectricity—differences in electrical charge across their membranes—to coordinate collective behaviors, specifically the process of cell extrusion in epithelial tissues.\n\nThe key discovery is that as epithelial cells become crowded, they squeeze each other, opening pressure-sensitive ion channels. Healthy cells use energy to restore their normal membrane voltage, but weak or stressed cells cannot. This failure triggers a rapid loss of membrane potential, causing water to rush out and the cell to shrink, marking it for expulsion from the tissue. This bioelectrical mechanism allows the tissue to identify and remove the least healthy cells to maintain balance and prevent disease.\n\nThe research highlights that bioelectricity is not exclusive to nerves and muscles but is a fundamental, fast-acting communication tool used across biology. Examples include bacteria coordinating in biofilms, electric fields guiding cell migration in developing embryos, and even potential roles in controlling growth and body plans.\n\nThe article suggests that breakdowns in these bioelectrical processes may contribute to diseases like cancer, where cells might fail to signal for their own removal. Ultimately, the ubiquity of bioelectric signaling points to its deep evolutionary roots as a core method for cellular coordination and decision-making.",
    "chinese_title": "细胞利用“生物电”进行协调并做出集体决策。",
    "chinese_summary": "本文阐述了细胞如何利用生物电——即细胞膜两侧的电荷差异——来协调集体行为，具体而言是上皮组织中的细胞挤出过程。\n\n关键发现是：当上皮细胞变得拥挤时，它们会相互挤压，从而打开压力敏感的离子通道。健康细胞会消耗能量以恢复正常的膜电位，但虚弱或受压的细胞则无法做到这一点。这种失效会引发膜电位的快速丧失，导致水分迅速流出、细胞收缩，从而标记该细胞并将其从组织中排出。这种生物电机制使得组织能够识别并清除最不健康的细胞，以维持平衡并预防疾病。\n\n研究强调，生物电并非神经和肌肉所独有，而是生物学中一种基础且快速生效的通讯工具。例如，细菌在生物膜中协调行动，电场引导发育中胚胎的细胞迁移，甚至可能在控制生长和体型规划中发挥作用。\n\n文章指出，这些生物电过程的紊乱可能导致癌症等疾病的发生，因为细胞可能无法发出信号以启动自身清除程序。最终，生物电信号的普遍性揭示了其作为细胞协调与决策核心机制的深远进化根源。"
  },
  {
    "id": "46840612",
    "title": "In praise of –dry-run",
    "url": "https://henrikwarne.com/2026/01/31/in-praise-of-dry-run/",
    "summary": "This article advocates for the value of adding a `--dry-run` option to command-line applications, based on the author's experience developing a reporting tool.\n\nThe author explains that their application performs a series of actions like generating reports, zipping files, and uploading to an SFTP server. Inspired by tools like Subversion, they implemented a `--dry-run` mode that prints all intended actions without executing them.\n\nThe key benefits highlighted are:\n*   **Safety and Sanity Checking:** It provides a risk-free way to verify configurations, file accessibility, and application state before a real run.\n*   **Faster Development and Testing:** It allows for rapid testing of logic (e.g., date-based report triggers) without waiting for the full, time-consuming execution.\n\nThe main acknowledged downside is that the `dryRun` flag can \"pollute\" the code, requiring checks in major control phases to skip actual operations. However, the author notes this doesn't permeate deeply into core logic.\n\nThe conclusion is that while not suitable for all applications (like reactive, event-driven systems), `--dry-run` is extremely useful for batch-oriented command-line tools. The author recommends adding it early in development to maximize its benefits for debugging and validation.",
    "chinese_title": "赞扬–dry-run",
    "chinese_summary": "本文基于作者开发报告工具的经验，主张为命令行应用程序添加`--dry-run`选项的价值。\n\n作者解释其应用会执行一系列操作，如生成报告、压缩文件并上传至SFTP服务器。受Subversion等工具启发，他们实现了`--dry-run`模式，该模式会打印所有计划执行的操作而不实际运行。\n\n强调的主要优点包括：\n*   **安全性与合理性检查**：在实际运行前，提供无风险的方式来验证配置、文件可访问性及应用程序状态。\n*   **更快的开发与测试速度**：允许快速测试逻辑（例如基于日期的报告触发机制），无需等待耗时的完整执行流程。\n\n文中承认的主要缺点是`dryRun`标志可能“污染”代码，需要在主要控制阶段进行检查以跳过实际操作。但作者指出这不会深入渗透到核心逻辑中。\n\n结论是，虽然并非适用于所有应用（如响应式、事件驱动型系统），但`--dry-run`对于面向批处理的命令行工具极为有用。作者建议在开发早期就添加此功能，以最大化其在调试和验证方面的效益。"
  },
  {
    "id": "46847958",
    "title": "Towards a science of scaling agent systems: When and why agent systems work",
    "url": "https://research.google/blog/towards-a-science-of-scaling-agent-systems-when-and-why-agent-systems-work/",
    "summary": "This research challenges the common assumption that adding more AI agents always improves performance. Through a controlled study of 180 configurations, it establishes the first quantitative scaling principles for agent systems.\n\nThe key finding is that multi-agent coordination dramatically improves performance on parallelizable tasks (e.g., financial analysis, +81%) but degrades it on sequential ones (e.g., planning, -70%). The overhead of communication can fragment reasoning, harming complex workflows.\n\nThe study evaluated five architectures: Single-Agent, Independent, Centralized, Decentralized, and Hybrid. It also revealed that architecture impacts safety; independent multi-agent systems amplified errors by 17.2x, while centralized systems with an orchestrator contained errors to 4.4x.\n\nFinally, the researchers developed a predictive model (R² = 0.513) that uses task properties like tool count and decomposability to recommend the optimal architecture, correctly predicting the best strategy for 87% of unseen tasks. This moves agent design from heuristics to a principled science based on task structure.",
    "chinese_title": "迈向规模化智能体系统的科学：智能体系统何时及为何有效",
    "chinese_summary": "这项研究挑战了“增加更多AI代理总能提升性能”的普遍假设。通过对180种配置的对照实验，研究首次建立了代理系统的定量扩展原则。\n\n核心发现表明：多代理协作能显著提升可并行任务（如财务分析，+81%）的性能，但会降低顺序任务（如规划，-70%）的效率。通信开销可能割裂推理过程，损害复杂工作流。\n\n研究评估了五种架构：单代理、独立式、集中式、分布式和混合式。同时发现架构影响安全性：独立多代理系统将错误放大17.2倍，而配备协调器的集中式系统能将错误控制在4.4倍。\n\n最后，研究者开发了预测模型（R² = 0.513），通过工具数量、可分解性等任务属性推荐最优架构，对87%的新任务能准确预测最佳策略。这标志着代理设计从经验主义转向了基于任务结构的系统性科学。"
  },
  {
    "id": "46847924",
    "title": "A Crisis comes to Wordle: Reusing old words",
    "url": "https://forkingmad.blog/wordle-crisis/",
    "summary": "The article criticizes The New York Times' 2026 announcement that Wordle will begin reusing old answer words. The author argues the announcement's tone is falsely cheerful and that the news is not \"exciting,\" as it has upset parts of the Wordle community.\n\nTo investigate the stated reason, the author analyzes the potential pool of five-letter words. Starting with a large dictionary, they filter out plurals, proper nouns, and obscure or misspelled words, concluding there are approximately 5,437 viable candidate words.\n\nGiven that Wordle launched in 2021, this pool would provide unique daily puzzles until around 2036. Therefore, the author finds the decision to reuse words premature and concludes by directly questioning the New York Times' motive for the change.",
    "chinese_title": "《Wordle遭遇危机：旧词复用》",
    "chinese_summary": "这篇文章批评了《纽约时报》2026年宣布Wordle将开始重复使用旧答案词的决定。作者认为该公告的语气虚假欢快，并指出这则消息并不“令人兴奋”，因为它已经引起了Wordle部分用户的不满。\n\n为探究官方给出的理由，作者分析了可能的五个字母单词库。从一部大型词典入手，他们筛选掉了复数形式、专有名词以及生僻或拼写错误的单词，最终得出大约有5,437个可用候选词。\n\n鉴于Wordle于2021年推出，这个词库足以提供独特的每日谜题直至2036年左右。因此，作者认为重复使用单词的决定为时过早，并在结尾直接质疑《纽约时报》作出这一改变的动机。"
  },
  {
    "id": "46848497",
    "title": "The philosophy behind ODF: openness, freedom and control – TDF Community Blog",
    "url": "https://blog.documentfoundation.org/blog/2026/01/24/the-philosophy-behind-odf/",
    "summary": "The Open Document Format (ODF) is more than a technical standard; it is a statement of openness, freedom, and user control over digital information. As an open standard, its specifications are publicly available, allowing anyone to develop compatible software without legal or financial barriers. This ensures long-term accessibility and prevents data from being locked into a single vendor's tools.\n\nODF promotes user freedom by enabling choice. Unlike proprietary formats, which can create dependency through compatibility issues, ODF allows documents to be opened and edited across multiple applications. This is crucial for public institutions and governments to ensure equal access to information.\n\nControl is central to ODF's philosophy. The format is governed transparently, preventing unilateral changes by any single company. ODF files are inspectable (as ZIP archives containing XML), allowing for validation, automation, and secure archiving—essential for legal, scientific, and historical documents.\n\nEven in the cloud era, ODF remains vital. It acts as a safeguard, ensuring data integrity and user ownership regardless of the platform used, and serves as a check against market power. Ultimately, ODF ensures that digital documents serve their creators, not the other way around.",
    "chinese_title": "ODF背后的理念：开放、自由与控制——TDF社区博客",
    "chinese_summary": "开放文档格式（ODF）不仅是一项技术标准，更是对开放性、自由度和用户掌控数字信息的宣言。作为开放标准，其规范完全公开，允许任何人开发兼容软件，不受法律或经济壁垒的限制。这确保了信息的长期可访问性，避免了数据被锁定在单一厂商的工具中。\n\nODF通过赋予选择权来促进用户自由。与可能因兼容性问题造成依赖的专有格式不同，ODF允许文档在多种应用程序中打开和编辑。这对公共机构和政府确保信息平等获取至关重要。\n\n控制权是ODF理念的核心。该格式的治理过程透明公开，防止任何单一公司单方面修改标准。ODF文件可被查验（因其本质是包含XML的ZIP归档），支持验证、自动化处理和安全存档——这对法律、科学和历史文档至关重要。\n\n即使在云时代，ODF依然不可或缺。它如同安全护栏，无论使用何种平台都能确保数据完整性和用户所有权，并对抗市场垄断力量。归根结底，ODF确保数字文档服务于其创建者，而非相反。"
  },
  {
    "id": "46848594",
    "title": "'Right-to-Compute' Laws May Be Coming to Your State This Year",
    "url": "https://www.vktr.com/ai-ethics-law-risk/right-to-compute-laws/",
    "summary": "**Summary:**\n\nSeveral U.S. states are considering \"Right-to-Compute\" legislation, which would grant individuals a legal right to access and use computing resources, including high-performance computing (HPC) and cloud services, for tasks like AI model training and data analysis. Proponents argue these laws are necessary to prevent monopolistic control by large tech companies over critical computational infrastructure, ensuring equitable access for startups, researchers, and individuals. They frame computing power as an essential utility for innovation in the AI era.\n\nOpponents, including major cloud providers and some business groups, warn that such mandates could stifle investment, create regulatory uncertainty, and lead to complex and potentially unworkable resource allocation schemes. They contend the market already provides sufficient access and that forced sharing could compromise security, performance, and intellectual property.\n\nThe push reflects a growing political focus on the foundational resources of the digital economy, similar to debates over net neutrality. The outcome of these state-level efforts could significantly influence the competitive landscape for AI development and set a precedent for future technology regulation.",
    "chinese_title": "“计算权”法案或将于今年在您所在州推行。",
    "chinese_summary": "**摘要：**\n\n美国多个州正在考虑出台\"计算权\"法案，该法案将赋予个人合法权利，使其能够访问和使用包括高性能计算（HPC）和云服务在内的计算资源，用于人工智能模型训练和数据分析等任务。支持者认为，这些法律对于防止大型科技公司垄断关键计算基础设施、确保初创企业、研究人员和个人能够公平获取资源是必要的。他们将计算能力视为人工智能时代创新的基本要素。\n\n包括主要云服务提供商和一些商业团体在内的反对者警告称，此类强制规定可能会抑制投资、造成监管不确定性，并导致复杂且可能难以实施的资源分配方案。他们认为，市场已经提供了足够的访问途径，强制共享可能会损害安全性、性能以及知识产权。\n\n这一推动反映了数字经济社会基础资源日益受到政治关注，类似于关于网络中立性的辩论。这些州级层面的努力结果可能会显著影响人工智能发展的竞争格局，并为未来的技术监管开创先例。"
  },
  {
    "id": "46840924",
    "title": "Generative AI and Wikipedia editing: What we learned in 2025",
    "url": "https://wikiedu.org/blog/2026/01/29/generative-ai-and-wikipedia-editing-what-we-learned-in-2025/",
    "summary": "In 2025, Wiki Education investigated the use of generative AI (GenAI) by its program participants, who contribute significantly to English Wikipedia. Their key finding is that editors should **never copy and paste AI-generated text directly into articles**.\n\nUsing the detection tool Pangram, they analyzed contributions and discovered that while AI-hallucinated citations were rare (7%), a more serious problem existed: **over two-thirds of AI-flagged articles failed verification**. This means the text, though plausible and cited to real sources, contained information not actually present in those sources, making its truthfulness impossible to confirm.\n\nIn response, Wiki Education implemented real-time AI detection, created training modules, and intervened when participants used AI. These measures successfully reduced the rate of participants adding AI content to live articles from an anticipated 25% to just 5%.\n\nThe organization acknowledges that AI can be a helpful research tool when used critically—for identifying content gaps, finding sources, or checking grammar—but **must not replace human writing and verification**. Their conclusion is that the time required to fact-check AI-generated text far exceeds the effort of writing accurate content from scratch, making AI unsuitable for drafting Wikipedia articles.",
    "chinese_title": "生成式人工智能与维基百科编辑：我们在2025年的收获",
    "chinese_summary": "2025年，维基教育基金会调查了其项目参与者对生成式人工智能（GenAI）的使用情况，这些参与者为英文维基百科作出了重要贡献。他们的核心发现是：编辑者**绝不应将AI生成的文本直接复制粘贴到条目中**。\n\n通过检测工具Pangram，他们分析了相关贡献并发现：虽然AI虚构引用的情况较少（7%），但存在一个更严重的问题——**超过三分之二被AI标记的条目无法通过验证**。这意味着，尽管这些文本看似合理且引用了真实来源，但其中包含的信息实际上并未出现在所引用的资料中，导致其真实性无法确认。\n\n为此，维基教育基金会实施了实时AI检测机制，创建了培训模块，并在参与者使用AI时进行干预。这些措施成功将参与者向在线条目添加AI内容的预期比例从25%降至仅5%。\n\n该组织承认，若以审慎态度使用，AI可以成为有用的研究工具——例如用于识别内容空白、查找资料或检查语法——但**绝不能替代人工撰写与核查**。他们的结论是：核实AI生成文本所需的时间远超从头撰写准确内容的工作量，因此AI不适合用于起草维基百科条目。"
  },
  {
    "id": "46804009",
    "title": "Pg_tracing: Distributed Tracing for PostgreSQL",
    "url": "https://github.com/DataDog/pg_tracing",
    "summary": "**Summary**\n\npg_tracing is a PostgreSQL extension that enables distributed tracing by generating detailed server-side spans for database operations. It supports PostgreSQL versions 14, 15, and 16.\n\nThe extension tracks a wide range of events, including internal PostgreSQL functions (like Planner and Executor), SQL statements, execution plan nodes, nested queries, triggers, parallel workers, and transaction commits. Spans can be accessed via dedicated views (`pg_tracing_consume_spans`, `pg_tracing_peek_spans`) or a function (`pg_tracing_json_spans`) that outputs data in OTLP JSON format.\n\nTrace context can be propagated using SQLCommenter syntax within SQL comments or via the `pg_tracing.trace_context` GUC parameter. Alternatively, random query sampling can be enabled using the `pg_tracing.sample_rate` parameter.\n\nInstallation requires adding `pg_tracing` to `shared_preload_libraries` in `postgresql.conf` and restarting the server. The extension consumes shared memory based on the configured `pg_tracing.max_span`. Spans can be automatically sent to an OpenTelemetry collector by configuring the `pg_tracing.otel_endpoint` and `pg_tracing.otel_naptime` parameters, which starts a background worker to periodically export traces.\n\nThe extension is currently in early development and may be unstable.",
    "chinese_title": "Pg_tracing：PostgreSQL分布式追踪系统",
    "chinese_summary": "**摘要**\n\npg_tracing 是一个 PostgreSQL 扩展，通过为数据库操作生成详细的服务器端跨度，实现分布式追踪。它支持 PostgreSQL 14、15 和 16 版本。\n\n该扩展追踪多种事件，包括内部 PostgreSQL 函数（如 Planner 和 Executor）、SQL 语句、执行计划节点、嵌套查询、触发器、并行工作进程和事务提交。跨度可通过专用视图（`pg_tracing_consume_spans`、`pg_tracing_peek_spans`）或输出 OTLP JSON 格式数据的函数（`pg_tracing_json_spans`）进行访问。\n\n追踪上下文可通过 SQL 注释中的 SQLCommenter 语法或 `pg_tracing.trace_context` GUC 参数进行传播。此外，也可通过 `pg_tracing.sample_rate` 参数启用随机查询采样。\n\n安装需将 `pg_tracing` 添加到 `postgresql.conf` 的 `shared_preload_libraries` 中并重启服务器。该扩展根据配置的 `pg_tracing.max_span` 占用共享内存。通过配置 `pg_tracing.otel_endpoint` 和 `pg_tracing.otel_naptime` 参数，可自动将跨度发送到 OpenTelemetry 收集器，系统将启动后台工作进程定期导出追踪数据。\n\n该扩展目前处于早期开发阶段，可能不稳定。"
  },
  {
    "id": "46847456",
    "title": "Real engineering failures instead of success stories",
    "url": "https://failhub.substack.com/p/failhub-issue-1",
    "summary": "This article from FailHub presents three common engineering failures to illustrate how seemingly minor issues can derail projects.\n\n**Failure #1: Silent Scope Growth** highlights the danger of unacknowledged feature creep. The team accepted small, incremental additions without communicating their cumulative impact, leading to a loss of focus and misaligned priorities. The lesson is that clear boundaries and open dialogue about scope changes are essential for maintaining effectiveness.\n\n**Failure #2: False Alignment** describes a team that agreed on tasks but had different, unspoken definitions of \"done.\" This resulted in late-stage rework and broken trust. The solution is to establish an explicit, measurable Definition of Done and validate progress through frequent, small demos to catch misalignment early.\n\n**Failure #3: Architecture Without Context** warns against applying ideal architectural patterns without considering the existing system. An attempt to \"clean up\" a legacy wrapper class made the code more complex and less maintainable. The takeaway is that architectural decisions must respect the project's history, constraints, and practical needs over theoretical purity.\n\nOverall, the article emphasizes that failures often stem from poor communication, unclear expectations, and a lack of contextual awareness, rather than technical incompetence.",
    "chinese_title": "真实的工程失败案例而非成功故事",
    "chinese_summary": "FailHub的这篇文章通过三个常见的工程失败案例，阐述了看似微小的问题如何导致项目脱轨。\n\n**失败一：隐性范围蔓延**揭示了未被察觉的需求蔓延风险。团队接受了零散的增量需求，却未沟通其累积影响，导致焦点模糊与优先级错位。教训是：清晰的边界和关于范围变更的开放对话对保持效率至关重要。\n\n**失败二：虚假共识**描述了一个团队虽就任务达成一致，却对“完成”标准存在心照不宣的分歧。这导致了后期返工和信任破裂。解决方案是建立明确、可衡量的“完成定义”，并通过频繁的小型演示验证进展，及早发现认知偏差。\n\n**失败三：脱离语境的架构**警示了不考虑现有系统而套用理想架构模式的问题。试图“清理”遗留封装类的操作反而让代码更复杂、更难以维护。关键在于：架构决策必须尊重项目历史、实际约束与需求，而非追求理论上的纯粹性。\n\n全文强调，失败往往源于沟通不畅、期望不明和缺乏情境意识，而非技术能力不足。"
  }
]