[
  {
    "id": "46619030",
    "title": "So, you've hit an age gate. what now?",
    "url": "https://www.eff.org/deeplinks/2026/01/so-youve-hit-age-gate-what-now",
    "summary": "This article from the Electronic Frontier Foundation (EFF) is a guide for users encountering age verification mandates online. It explains that while EFF opposes such mandates, they are already in effect, forcing users to choose between accessing services and protecting their privacy.\n\nThe core advice is to submit the least amount of personal data possible. The guide evaluates common verification methods:\n*   **Facial age estimation:** Often inaccurate for marginalized groups. Some services (like Yoti) upload your photo to their servers, while others (like Private ID) process it on your device.\n*   **Document upload (ID):** Requires proving both age and identity, creating a high-risk data trail if breached (as happened with Discord).\n*   **Credit card or email checks:** Lower immediate risk than ID, but still undermine anonymity and can link your activity across databases.\n\nThe article provides specific breakdowns for major platforms:\n*   **Meta (Facebook, Instagram):** Uses Yoti for face scans (uploads photos) or ID verification. Meta states it deletes IDs after 30 days.\n*   **Google/YouTube:** Offers multiple options, prioritizing less intrusive methods like on-device face scans with Private ID, credit card checks, or email verification via third-party data brokers.\n*   **TikTok:** Uses Incode for ID verification, which retains images indefinitely by default, though TikTok claims to initiate deletion.\n\nThroughout, the guide urges users to ask critical questions about what data is collected, who can access it, how long it's retained, and what audits are in place, emphasizing that no method is fully safe for privacy and free speech.",
    "chinese_title": "那么，你遇到了年龄限制。现在该怎么办？",
    "chinese_summary": "这篇来自电子前沿基金会（EFF）的文章是为遇到网络年龄验证要求的用户提供的指南。文章指出，尽管EFF反对此类强制要求，但它们已然生效，迫使用户在获取服务和保护隐私之间做出选择。\n\n核心建议是尽可能提交最少的个人数据。指南评估了常见的验证方法：\n*   **面部年龄估算：** 对边缘群体往往不准确。部分服务（如Yoti）会将您的照片上传至其服务器，而其他服务（如Private ID）则在您的设备上处理。\n*   **证件上传（身份证）：** 需要同时证明年龄和身份，一旦泄露（如Discord曾发生的情况）会形成高风险的数据痕迹。\n*   **信用卡或邮箱验证：** 即时风险低于身份证验证，但仍会破坏匿名性，并可能将您的活动关联到不同数据库。\n\n文章针对主要平台提供了具体分析：\n*   **Meta（Facebook、Instagram）：** 使用Yoti进行面部扫描（上传照片）或身份证验证。Meta声称会在30天后删除身份证信息。\n*   **Google/YouTube：** 提供多种选项，优先选择侵入性较低的方法，如使用Private ID在设备上进行面部扫描、信用卡验证或通过第三方数据经纪商进行邮箱验证。\n*   **TikTok：** 使用Incode进行身份证验证，该服务默认无限期保留图像，尽管TikTok声称会启动删除程序。\n\n指南始终敦促用户提出关键问题：收集了哪些数据、谁有权访问、数据保留多久以及存在何种审计机制，并强调没有哪种方法对隐私和言论自由是完全安全的。"
  },
  {
    "id": "46572307",
    "title": "Why some clothes shrink in the wash and how to unshrink them",
    "url": "https://www.swinburne.edu.au/news/2025/08/why-some-clothes-shrink-in-the-wash-and-how-to-unshrink-them/",
    "summary": "This article explains why clothes shrink in the wash and offers a method to potentially reverse it. Shrinkage occurs due to the natural properties of textile fibres.\n\nNatural fibres like cotton and linen have a \"memory\" and tend to return to their original, crinkled state when exposed to heat, moisture, and mechanical agitation during washing. This relaxes the stretched fibres, causing the fabric to contract. Wool shrinks differently, through a process called felting, where its scaly surface fibres interlock.\n\nSynthetic fibres like polyester are engineered to be more stable and crystalline, making them far more resistant to shrinkage.\n\nTo minimise shrinkage, the article recommends using cold water, gentle cycles, and low spin speeds.\n\nIf a garment does shrink, a rescue method is suggested: soak it in lukewarm water with a tablespoon of hair conditioner or baby shampoo per litre. The conditioner lubricates the fibres, allowing you to gently stretch the fabric back into shape before drying it flat. This may not fully reverse severe shrinkage but can often make the item wearable again.",
    "chinese_title": "为什么有些衣服洗后会缩水以及如何恢复原状",
    "chinese_summary": "本文解释了衣物在洗涤时缩水的原因，并提供了一种可能逆转缩水的方法。缩水现象源于纺织纤维的自然特性。\n\n棉、麻等天然纤维具有“记忆性”，在洗涤过程中受热、潮湿和机械搅动的影响时，往往会恢复原本卷曲的状态。这会使被拉伸的纤维松弛，导致织物收缩。羊毛的缩水方式不同，它通过称为“毡化”的过程实现，其表面鳞片状纤维会相互缠结。\n\n聚酯等合成纤维经过设计更具稳定性和结晶度，因此抗缩水性远优于天然纤维。\n\n为减少缩水，文章建议使用冷水、轻柔模式和低转速脱水。\n\n若衣物已缩水，可尝试补救方法：按每升温水配一汤匙护发素或婴儿洗发露的比例浸泡衣物。护发素能润滑纤维，使您在平铺晾干前轻柔地将织物拉伸回原形。此法虽未必能完全逆转严重缩水，但常可使衣物恢复穿着功能。"
  },
  {
    "id": "46620835",
    "title": "Verizon outages reported across U.S.",
    "url": "https://www.firstcoastnews.com/article/news/nation-world/verizon-outage-reported/507-ef3cb3d0-f595-432f-9f84-d1690a5085a7",
    "summary": "On Wednesday, February 22, 2024, Verizon experienced a widespread mobile service outage affecting the eastern half of the United States. The disruption, which began around noon ET, impacted voice and data services for tens of thousands of customers in major cities including New York, Chicago, Atlanta, and Washington D.C.\n\nVerizon confirmed the issue and stated its engineering teams were working to resolve the service interruptions as quickly as possible. The outage was significant enough that Washington D.C.'s alert system warned that some Verizon users might be unable to call 911, advising them to use a landline, a device from another carrier, or go directly to a police or fire station in an emergency.\n\nThe article also explains that iPhones may display \"SOS\" mode during such outages, indicating a lack of cellular connection but still allowing emergency calls. It notes that phones can still use Wi-Fi for calls, texts, and internet browsing if available, and recommends enabling Wi-Fi calling in settings as a workaround when cellular service is down.",
    "chinese_title": "美国多地报告威瑞森通信服务中断。",
    "chinese_summary": "2024年2月22日星期三，Verizon在美国东部地区发生大规模移动服务中断。此次故障始于美国东部时间中午左右，影响了包括纽约、芝加哥、亚特兰大和华盛顿特区在内的主要城市数万名客户的语音和数据服务。\n\nVerizon确认了该问题，并表示其工程团队正在尽快解决服务中断。此次中断影响严重，以至于华盛顿特区的警报系统警告称，部分Verizon用户可能无法拨打911，建议他们在紧急情况下使用固定电话、其他运营商的设备，或直接前往警察局或消防站。\n\n文章还解释说，在此类中断期间，iPhone可能会显示“SOS”模式，表示蜂窝网络连接中断但仍可拨打紧急电话。文章指出，如果可用，手机仍可使用Wi-Fi进行通话、发送短信和浏览互联网，并建议在蜂窝服务中断时，在设置中启用Wi-Fi通话作为临时解决方案。"
  },
  {
    "id": "46570811",
    "title": "Meet ski map artist James Niehues, the 'Monet of the mountains'",
    "url": "https://adventure.com/ski-map-artist-james-niehues/",
    "summary": "**Summary of \"Meet ski map artist James Niehues, the 'Monet of the mountains'\"**\n\nJames Niehues is a renowned artist who has hand-painted over 200 ski resort trail maps, defining the visual identity of mountains from Vail to Whistler. His career began in 1987 when he took over from the genre's pioneer, Bill Brown. Niehues is celebrated for his unique \"planimetric\" style, which masterfully combines an aerial perspective with the artistic feel of a landscape painting, making slopes appear both accurate and inviting.\n\nHis meticulous process involves studying aerial photos, visiting resorts, and creating detailed pencil sketches before painting with gouache and acrylics. A single map can take up to three weeks to complete. His signature techniques include \"tree lines\" to define trails and careful shading to depict slope steepness and sunlight.\n\nNiehues’s work is cherished for its artistry and functionality, evoking nostalgia and helping skiers navigate and dream of their next run. Despite the rise of digital mapping, his hand-painted aesthetic remains highly valued. His legacy was cemented with the 2021 book *The Man Behind the Maps* and a documentary. Having officially retired, Niehues has passed his craft to a small group of artists he mentored, ensuring his distinctive and beloved style continues to grace ski resort guides for years to come.",
    "chinese_title": "认识滑雪地图艺术家詹姆斯·尼休斯，人称“山间莫奈”。",
    "chinese_summary": "**《“山间莫奈”——滑雪地图艺术家詹姆斯·尼胡斯作品概述》**\n\n詹姆斯·尼胡斯是一位著名艺术家，他手绘了超过200幅滑雪场雪道地图，从韦尔到惠斯勒，定义了群山的视觉形象。他的职业生涯始于1987年，当时他接替了该领域的先驱比尔·布朗。尼胡斯以其独特的“平面立体”风格而备受赞誉，这种风格巧妙地将鸟瞰视角与风景画的艺术感相结合，使雪道既精确又诱人。\n\n他创作过程一丝不苟，包括研究航拍照片、实地考察滑雪场，先用铅笔绘制精细草图，再用水粉和丙烯颜料作画。一幅地图的完成可能需要长达三周时间。他的标志性技法包括用“树木线”界定雪道，以及通过细致的明暗处理来描绘坡道陡峭度和阳光照射。\n\n尼胡斯的作品因其艺术性和功能性而备受珍视，既能唤起怀旧之情，又能帮助滑雪者规划路线并憧憬下一次滑行。尽管数字地图日益兴起，他手绘的美学风格依然备受推崇。2021年出版的书籍《地图背后的人》以及一部纪录片巩固了他的传奇地位。现已正式退休的尼胡斯，已将技艺传授给他指导过的一小群艺术家，确保其独特而备受喜爱的风格，在未来岁月里继续为滑雪场指南增添光彩。"
  },
  {
    "id": "46621945",
    "title": "Why Every Country Should Set 16 as the Minimum Age for Social Media Accounts",
    "url": "https://www.afterbabel.com/p/why-every-country-should-set-16",
    "summary": "This article argues that all countries should follow Australia's lead and set the minimum age for social media accounts at 16, without parental consent exceptions. The core rationale is to protect adolescents during the sensitive period of puberty, when their brains are highly malleable and vulnerable to the documented harms of social media, such as anxiety, bullying, and exposure to harmful content.\n\nThe authors present four key policy recommendations: 1) Set the age at 16 or higher, as most teens are still in puberty at 15; 2) Avoid parental consent loopholes, which plunge families back into peer-pressure traps; 3) Focus on restricting account creation and data-sharing contracts, not content access, to avoid censorship debates; and 4) Define \"social media\" by its harmful design features (like addictive algorithms and messaging) rather than specific platforms.\n\nThey contend that a simple, uniform global standard is easier to enforce and provides a clear norm for families, freeing parents from pressure and giving companies a straightforward rule to implement. The goal is to delay adolescents' immersion in a manipulative commercial environment until they are more developmentally equipped to handle it.",
    "chinese_title": "为什么每个国家都应设定16岁为社交媒体账号的最低年龄限制",
    "chinese_summary": "本文主张，各国都应效仿澳大利亚的做法，将社交媒体账号的最低年龄限制设为16岁，且不设家长同意例外。其核心理由在于保护青春期敏感阶段的青少年——此时他们的大脑可塑性极强，易受社交媒体已证实的危害影响，如焦虑、欺凌及接触有害内容。\n\n作者提出四项关键政策建议：1）将年龄门槛设为16岁或更高，因为大多数15岁青少年仍处于青春期；2）避免设置家长同意漏洞，否则将使家庭重新陷入同伴压力的困境；3）重点限制账号创建和数据共享协议，而非内容访问，以回避审查争议；4）根据有害设计特征（如成瘾性算法和即时通讯功能）而非具体平台来定义“社交媒体”。\n\n他们认为，简单统一的全球标准更易于执行，能为家庭提供明确规范，既减轻家长压力，也便于企业直接落实规则。其目标是推迟青少年陷入具有操纵性的商业环境，直至他们在成长过程中更具应对能力。"
  },
  {
    "id": "46618087",
    "title": "The Unbearable Frustration of Figuring Out APIs",
    "url": "https://blog.ar-ms.me/thoughts/translation-cli/",
    "summary": "This article details the author's frustrating journey to create a simple command-line translation tool for macOS using Swift. The goal was to translate Chinese text to English without relying on external APIs, instead tapping into macOS's built-in translation service.\n\nThe initial attempt using Zig failed due to incompatibility with Swift's async functions. Switching to Swift, the author encountered several hurdles: configuring the Swift package for a newer macOS version, correctly handling async functions within the ArgumentParser framework, and figuring out the poorly documented `TranslationSession` API.\n\nA key breakthrough came from watching the related WWDC video, which revealed the need for the `NaturalLanguage` framework to auto-detect the input language and the `LanguageAvailability` API to check if translation models were installed. Despite the system's right-click translation feature working, the command-line tool required manually downloading the specific language models via System Settings, a confusing and separate process.\n\nAfter resolving these issues—including language detection, model installation checks, and proper async/await patterns—the author successfully built a functional tool. The experience highlighted the challenges of navigating Apple's frameworks outside their primary SwiftUI context, where documentation for lower-level, programmatic use is often sparse and unintuitive.",
    "chinese_title": "弄懂API的难以忍受的挫败感",
    "chinese_summary": "本文详细记录了作者使用Swift为macOS创建一个简单的命令行翻译工具的曲折历程。目标是实现中文到英文的翻译，且不依赖外部API，而是调用macOS内置的翻译服务。\n\n最初尝试使用Zig因与Swift异步函数不兼容而失败。改用Swift后，作者遇到了多重障碍：为较新的macOS版本配置Swift包、在ArgumentParser框架中正确处理异步函数，以及摸索文档匮乏的`TranslationSession` API。\n\n关键的突破来自观看相关的WWDC视频，其中揭示了需要使用`NaturalLanguage`框架自动检测输入语言，以及通过`LanguageAvailability` API检查翻译模型是否已安装。尽管系统的右键翻译功能正常，但命令行工具需要通过系统设置手动下载特定语言模型，这一过程独立且令人困惑。\n\n在解决了语言检测、模型安装检查和正确的async/await模式等问题后，作者最终成功构建了一个可用的工具。这次经历凸显了在苹果框架的主要应用场景SwiftUI之外进行开发的挑战——对于底层编程使用，相关文档往往稀少且不够直观。"
  },
  {
    "id": "46617668",
    "title": "Starlink roam 50GB is now 100GB with unlimited slow speed after that",
    "url": "https://starlink.com/support/article/58c9c8b7-474e-246f-7e3c-06db3221d34d",
    "summary": "Starlink has upgraded its \"Roam 50GB\" plan to \"Roam 100GB,\" doubling the monthly high-speed data allowance at no extra cost in most markets as of January 13, 2026.\n\nOnce the 100GB of high-speed data is used, service does not stop. Instead, customers automatically receive unlimited data at reduced speeds for the rest of their billing cycle, suitable for basic tasks like email and texts but not for streaming or large downloads. Users are notified at 80% and 100% usage.\n\nTo restore high-speed service before the next billing cycle, customers must upgrade to the \"Roam Unlimited\" plan, a change that will persist for future cycles unless manually switched back. The previous option to purchase additional high-speed data by the gigabyte has been discontinued, except for Ocean Mode.\n\nThe Roam 100GB plan can be used on the ocean under the same previous conditions: within 12 nautical miles of shore for limited durations. Extended offshore use requires Ocean Mode, which is only available with the Roam Unlimited plan and is billed per GB.\n\nThe new 100GB plan is not yet available in several listed countries, including Austria, Hungary, Croatia, the UAE, and many nations in Africa and Asia, where the 50GB plan remains.",
    "chinese_title": "Starlink漫游套餐现升级为50GB流量，之后可享无限低速网络。",
    "chinese_summary": "星链已于2026年1月13日起，在多数市场将其\"漫游50GB\"套餐升级为\"漫游100GB\"，月高速数据流量翻倍且不加价。\n\n当100GB高速流量用尽后，服务不会中断。用户将在当前账单周期内自动获得不限量的低速数据，适用于邮件、短信等基础需求，但不支持视频流媒体或大文件下载。系统会在流量使用达80%和100%时发送通知。\n\n若想在下一个账单周期前恢复高速服务，用户需升级至\"漫游无限量\"套餐，此变更将延续至后续周期，除非手动切换回原套餐。此前按GB购买额外高速流量的选项已取消（海洋模式除外）。\n\n漫游100GB套餐可在相同原有条件下于近海使用：距岸12海里内短期连接。长期离岸使用需启用海洋模式，该模式仅限\"漫游无限量\"套餐用户按GB计费使用。\n\n新版100GB套餐尚未在奥地利、匈牙利、克罗地亚、阿联酋及亚非多国上线，这些地区仍保留50GB套餐。"
  },
  {
    "id": "46599403",
    "title": "Show HN: HyTags – HTML as a Programming Language",
    "url": "https://hytags.org",
    "summary": "**Summary of \"Show HN: HyTags – HTML as a Programming Language\"**\n\nHyTags is a novel, experimental programming language that repurposes standard HTML syntax to write functional code. Its core idea is to treat HTML tags as functions, attributes as arguments, and the document structure as the program's execution flow.\n\n**Key Concepts:**\n*   **HTML as Syntax:** Programs are written in valid HTML. For example, a `<div>` tag might function as a `print` command.\n*   **Declarative Logic:** Control flow (like loops and conditionals) and data binding are achieved using special HTML attributes, avoiding traditional imperative statements.\n*   **Self-Hosting & Execution:** The HyTags interpreter is itself written in HyTags, demonstrating the language's capability. Code is executed directly by this interpreter.\n\n**Presented Example:** The article likely includes a sample, such as a \"Hello, World!\" program or a simple counter, implemented purely with HTML-like tags and attributes, showcasing how familiar web syntax can define application logic.\n\n**Overall Purpose:** HyTags appears to be a thought experiment and a proof-of-concept that challenges conventional distinctions between markup and programming languages. It explores the potential of using the universally understood HTML paradigm for general-purpose programming, primarily to demonstrate an unconventional approach to language design rather than for practical production use. The project invites discussion on syntax, language paradigms, and the flexibility of HTML.",
    "chinese_title": "Show HN: HyTags – 将HTML作为一种编程语言",
    "chinese_summary": "**《Show HN: HyTags – 以 HTML 作为编程语言》摘要**\n\nHyTags 是一种新颖的实验性编程语言，它重新利用标准 HTML 语法来编写功能代码。其核心理念是将 HTML 标签视为函数，属性视为参数，文档结构视为程序的执行流程。\n\n**核心概念：**\n*   **HTML 即语法：** 程序以有效的 HTML 编写。例如，`<div>` 标签可能充当 `print` 命令。\n*   **声明式逻辑：** 控制流（如循环和条件判断）和数据绑定通过特殊的 HTML 属性实现，避免了传统的命令式语句。\n*   **自托管与执行：** HyTags 解释器本身用 HyTags 编写，展示了该语言的能力。代码直接由此解释器执行。\n\n**展示示例：** 文章很可能包含一个示例，例如一个“Hello, World!”程序或一个简单的计数器，完全使用类似 HTML 的标签和属性实现，展示了熟悉的 Web 语法如何定义应用逻辑。\n\n**总体目的：** HyTags 似乎是一个思想实验和概念验证，旨在挑战标记语言与编程语言之间的传统界限。它探索了使用普遍理解的 HTML 范式进行通用编程的潜力，主要是为了展示一种非常规的语言设计方法，而非用于实际生产。该项目旨在引发关于语法、语言范式以及 HTML 灵活性的讨论。"
  },
  {
    "id": "46622139",
    "title": "Show HN: Harmony – AI notetaker for Discord",
    "url": "https://harmonynotetaker.ai/",
    "summary": "**Summary:**\n\nHarmony is an AI-powered notetaker bot for Discord that automatically records, transcribes, and summarizes voice calls. It aims to help teams and communities capture decisions, insights, and action items from their conversations.\n\n**Key Features:**\n*   **Automated Recording & Transcription:** Joins and records calls on command, providing transcripts in 57+ languages.\n*   **AI Summaries & Analysis:** Generates summaries, speaker analytics, and action items.\n*   **Conversational AI:** Allows users to ask questions about the call content via \"AskHarmony.\"\n*   **Multi-Channel Support & Smart Search:** Works across channels and enables searching through past transcripts.\n\n**How It Works:** Users invite the bot to their server, start a recording with a `/join` command, and later access AI-generated transcripts and summaries.\n\n**Pricing:**\n*   **Free:** 60 minutes of transcription, basic AI summaries, unlimited transcript history.\n*   **Pro ($10/seat/month):** 600 transcription minutes per seat, detailed summaries, priority support.\n*   **Team (Custom):** Unlimited transcription, advanced analytics, and enterprise support.\n\nThe tool is marketed as a solution for remote teams, gaming communities, and individuals (notably highlighting a user with ADHD) who need to stay organized and present during Discord calls. It claims over 6,000 users.",
    "chinese_title": "Show HN：Harmony —— Discord的AI笔记助手",
    "chinese_summary": "**摘要：**\n\nHarmony是一款Discord平台的AI笔记机器人，能够自动录制、转录并总结语音通话内容。它旨在帮助团队和社区从对话中捕捉决策、见解和行动事项。\n\n**核心功能：**\n*   **自动录制与转录：** 按指令加入并录制通话，提供57种以上语言的转录文本。\n*   **AI总结与分析：** 生成总结、发言人分析和行动事项。\n*   **对话式AI：** 用户可通过“AskHarmony”功能就通话内容提问。\n*   **多频道支持与智能搜索：** 支持跨频道工作，并能搜索过往转录记录。\n\n**运作方式：** 用户将机器人邀请至服务器，使用`/join`指令开始录制，之后即可访问AI生成的转录文本和总结。\n\n**定价：**\n*   **免费版：** 60分钟转录时长，基础AI总结，无限转录历史记录。\n*   **专业版（10美元/席位/月）：** 每席位600分钟转录时长，详细总结，优先支持。\n*   **团队版（定制）：** 无限转录时长，高级分析功能，企业级支持。\n\n该工具主要面向远程团队、游戏社区以及需要保持条理并专注参与Discord通话的个人（特别提及ADHD用户群体），宣称已拥有超过6,000名用户。"
  },
  {
    "id": "46617705",
    "title": "Show HN: A 10KiB kernel for cloud apps",
    "url": "https://github.com/ReturnInfinity/BareMetal-Cloud",
    "summary": "This article introduces **BareMetal-Cloud**, a minimal 10KB kernel designed for running cloud applications. It is a stripped-down version of the BareMetal exokernel, containing only essential drivers and using just 4MB of memory, leaving the rest available for the application payload.\n\nThe project is currently compatible with **Digital Ocean** and **Proxmox**, with plans to extend support to AWS, Azure, and Google Cloud. A live demo is running on Digital Ocean, responding to HTTP and ICMP requests.\n\nThe system consists of two core components: **Pure64** (the bootloader) and the **BareMetal** kernel itself. The provided `baremetal.sh` script automates setup, building, installation, and local testing using QEMU.\n\nFor deployment, users can generate a `.vmdk` disk image. The article provides specific instructions for launching this image on **Digital Ocean** (as a custom image droplet) and on **Proxmox** (by importing and attaching the disk to a new VM). The setup requires basic tools like NASM, QEMU, and Git, which can be installed on Debian-based Linux or macOS via Homebrew.",
    "chinese_title": "Show HN：适用于云应用的10KiB微内核",
    "chinese_summary": "本文介绍了**BareMetal-Cloud**，这是一个仅为10KB的极简内核，专为运行云应用程序设计。它是BareMetal exokernel的精简版本，仅包含必要的驱动程序，仅占用4MB内存，其余内存全部留给应用程序负载。\n\n该项目目前兼容**Digital Ocean**和**Proxmox**，并计划扩展支持AWS、Azure和Google Cloud。在Digital Ocean上已部署实时演示，可响应HTTP和ICMP请求。\n\n该系统由两个核心组件构成：**Pure64**（引导程序）和**BareMetal**内核本身。提供的`baremetal.sh`脚本可自动完成设置、构建、安装以及使用QEMU进行本地测试。\n\n部署时，用户可生成`.vmdk`磁盘映像。文章详细说明了在**Digital Ocean**（作为自定义映像Droplet）和**Proxmox**（通过导入磁盘并挂载至新虚拟机）上启动该映像的具体步骤。配置需要NASM、QEMU和Git等基础工具，可在基于Debian的Linux系统或通过Homebrew在macOS上安装。"
  },
  {
    "id": "46616496",
    "title": "Edge of Emulation: Game Boy Sewing Machines (2020)",
    "url": "https://shonumi.github.io/articles/art22.html",
    "summary": "This article details the author's three-year effort to reverse-engineer and emulate three Game Boy-compatible sewing machines: the Jaguar JN-100, JN-2000, and the Singer IZEK 1500. These devices, released around 2000-2001, used Game Boy cartridges as interfaces to transfer digital stitching and embroidery patterns, representing an innovative and historically significant consumer product.\n\nThe author faced significant challenges, including acquiring the rare and expensive hardware and software. The technical emulation proved unexpectedly difficult, primarily due to the machines' unique serial communication protocol, which toggles between internal and external clocking. The core puzzle was decoding the coordinate data packets sent from the Game Boy to control the needle. While X-coordinates were straightforward absolute positions, interpreting the Y-coordinates, which control vertical fabric movement, was highly counterintuitive and defied initial logical assumptions, requiring extensive physical testing and analysis.\n\nThe project successfully preserved the functionality of these exotic peripherals, allowing their patterns to be recreated digitally. The article underscores the Game Boy's versatility beyond gaming and highlights the technical hurdles involved in emulating non-standard hardware, marking it as one of the author's most complex preservation endeavors.",
    "chinese_title": "模拟边缘：Game Boy缝纫机（2020）",
    "chinese_summary": "本文详细记述了作者历时三年对三款兼容Game Boy的缝纫机——Jaguar JN-100、JN-2000以及Singer IZEK 1500——进行逆向工程与模拟的历程。这些设备于2000至2001年间发布，通过Game Boy卡带作为接口传输数字缝纫与刺绣图案，是极具创新性且具有历史意义的消费产品。\n\n作者在项目中面临了重大挑战，包括获取稀有且昂贵的硬件与软件。技术模拟的难度远超预期，主要源于这些机器独特的串行通信协议——该协议会在内部与外部时钟源之间切换。核心难题在于解码从Game Boy发送至机器、用以控制针头的坐标数据包。其中X坐标是直观的绝对位置，而控制布料纵向移动的Y坐标却极反直觉，其逻辑与初步假设完全相悖，必须通过大量实体测试与分析才能解析。\n\n该项目成功保留了这些特殊外设的功能，使其图案得以数字化重现。文章不仅彰显了Game Boy超越游戏领域的多功能性，也凸显了模拟非标准硬件所需克服的技术障碍，堪称作者迄今最复杂的数字保存实践之一。"
  },
  {
    "id": "46617744",
    "title": "I built Vector. Now I'm answering the question your observability vendor won't",
    "url": "https://usetero.com/blog/the-question-your-observability-vendor-wont-answer",
    "summary": "The author, founder of Vector, argues that the observability industry is fundamentally broken due to vendors' misaligned incentives, which prioritize revenue over customer success. The core problem is cost, driven by massive data waste that vendors refuse to help identify.\n\nHe discovered this by building a tool to analyze a client's logs, finding that an average of **40% of their observability data was waste**. This waste creates a cascade of problems: complex cost-control pipelines, ineffective debugging tools, and stressful renewals with steep price hikes.\n\nThe article asserts that if vendors truly understood their customers' data, they could answer the simple question, \"How much of my data is waste?\" Their refusal to do so reveals a systemic failure. The solution is not more data or products, but **achieving understanding with less data**, aligning vendor success with customer efficiency.\n\nThe author concludes by introducing his new company, Tero, which aims to build this aligned future by helping teams quantify and eliminate their data waste.",
    "chinese_title": "我创造了Vector。现在我来回答你的可观测性供应商不愿回答的问题。",
    "chinese_summary": "Vector创始人指出，可观测性行业已从根本上崩坏，根源在于供应商的激励错位——他们将收入置于客户成功之上。核心问题是成本失控，而这源于供应商拒绝协助识别的大规模数据浪费。\n\n作者通过构建日志分析工具发现，客户平均有**40%的可观测数据属于浪费**。这种浪费引发连锁问题：复杂的成本管控流程、低效的调试工具，以及伴随价格飙升的续约压力。\n\n文章强调，若供应商真正理解客户数据，就应能回答“我的数据有多少是浪费”这一基本问题。他们的回避态度暴露了系统性缺陷。解决方案不是堆砌更多数据或产品，而是**用更少数据实现深度洞察**，让供应商的成功与客户效率同频共振。\n\n文末作者介绍了其新公司Tero，旨在通过帮助团队量化并消除数据浪费，构建这种利益协同的未来。"
  },
  {
    "id": "46618027",
    "title": "GitHub should charge everyone $1 more per month to fund open source",
    "url": "https://blog.greg.technology/2025/11/27/github-should-charge-1-dollar-more-per-month.html",
    "summary": "This article argues that the current model for funding open-source software is unsustainable and proposes a new system. The author contends that it is unfair for businesses to rely on free, labor-intensive open-source software without contributing financially.\n\nThe core proposal is for GitHub to implement an automatic, usage-based funding mechanism. Specifically, the author suggests GitHub could charge every organization an extra $1 per user per month, pooling the money into an \"Open Source Fund.\" This fund would then be distributed to developers based on how often their projects (like those listed in `package.json` or `requirements.txt` files) are used as dependencies by paying organizations.\n\nThe author acknowledges the idea is rough and draws a parallel to Spotify's flawed but existing royalty model. They emphasize that the goal is to move away from the current reliance on donations and \"busking\" for support, toward a more systematic and fair compensation structure for the critical infrastructure that open source provides. The tone is one of frustration with the status quo, urging for a better solution to sustain open-source development.",
    "chinese_title": "GitHub应该向每位用户每月多收取1美元来资助开源项目。",
    "chinese_summary": "本文认为，当前开源软件的资助模式不可持续，并提出了一种新体系。作者指出，企业依赖免费但劳动密集型的开源软件却不提供资金支持，这是不公平的。\n\n核心建议是GitHub实施一种基于使用量的自动资助机制。具体而言，作者建议GitHub可以向每个组织每月额外收取每位用户1美元，将资金汇集到一个“开源基金”中。该基金将根据付费组织在依赖项（如`package.json`或`requirements.txt`文件中列出的项目）中使用开发者项目的频率进行分配。\n\n作者承认这一想法尚不完善，并类比了Spotify虽有缺陷但已存在的版税模式。他们强调，目标是摆脱当前依赖捐赠和“街头卖艺”式寻求支持的现状，转向一种更系统、更公平的补偿机制，以回报开源所提供的关键基础设施。全文语气透露出对现状的沮丧，并呼吁寻找更好的解决方案来维持开源开发。"
  },
  {
    "id": "46614037",
    "title": "I’m leaving Redis for SolidQueue",
    "url": "https://www.simplethread.com/redis-solidqueue/",
    "summary": "This article announces a significant shift in Rails 8, which replaces Redis with new database-native solutions: SolidQueue for job queuing, SolidCache for caching, and SolidCable for messaging. The author argues that while Redis is fast and robust, it adds operational complexity, requiring separate deployment, monitoring, high-availability setups, and debugging across two data stores.\n\nThe core of the article explains how SolidQueue works, leveraging PostgreSQL's `FOR UPDATE SKIP LOCKED` feature to efficiently manage job concurrency without lock contention. It highlights key benefits: built-in support for recurring jobs, free concurrency limiting (a paid feature in Sidekiq Enterprise), and integration with the free, open-source Mission Control dashboard for monitoring.\n\nA practical migration guide from Sidekiq to SolidQueue is provided, outlining steps to change the queue adapter, install the gem, convert schedules, and update the Procfile. The article also advises when *not* to use SolidQueue—specifically for applications requiring ultra-low latency (under 1ms) or processing thousands of jobs per second sustained.\n\nIn conclusion, the author presents this shift as a simplification for most Rails applications, reducing infrastructure overhead by consolidating on the relational database while maintaining capability for typical workloads.",
    "chinese_title": "我正从Redis转向SolidQueue。",
    "chinese_summary": "本文宣布了Rails 8的一项重大变革：用全新的原生数据库方案取代Redis——SolidQueue用于任务队列，SolidCache用于缓存，SolidCable用于消息传递。作者指出，尽管Redis快速且稳定，但它增加了运维复杂性，需要独立部署、监控、高可用配置，并需在两个数据存储之间进行调试。\n\n文章核心解释了SolidQueue如何利用PostgreSQL的`FOR UPDATE SKIP LOCKED`特性高效管理任务并发而无需锁竞争，并突出其关键优势：内置定期任务支持、免费的并发限制（此为Sidekiq Enterprise的付费功能），以及与免费开源监控面板Mission Control的集成。\n\n文章提供了从Sidekiq迁移到SolidQueue的实践指南，包括更换队列适配器、安装gem、转换调度配置及更新Procfile等步骤。同时指出不适用SolidQueue的场景——特别是需要亚毫秒级超低延迟或需持续每秒处理数千任务的应用。\n\n最后，作者认为这一变革简化了大多数Rails应用的架构，通过统一使用关系型数据库降低了基础设施开销，同时保持了常规工作负载的处理能力。"
  },
  {
    "id": "46621786",
    "title": "Show HN: A fast CLI and MCP server for managing Lambda cloud GPU instances",
    "url": "https://github.com/Strand-AI/lambda-cli",
    "summary": "This article introduces **Lambda CLI**, an unofficial community tool for managing Lambda Cloud GPU instances via command line or AI assistants. It offers two main components: a **CLI** (`lambda`) for direct terminal commands and an **MCP server** (`lambda-mcp`) that allows AI assistants like Claude to manage GPU infrastructure.\n\nKey features include:\n- **Authentication** via API key (from environment variable or command like 1Password).\n- **Instance management**: list available GPUs, start/stop instances, and poll for availability with `lambda find`.\n- **Optional notifications** via Slack, Discord, or Telegram when instances are ready.\n- **MCP integration**: AI assistants can execute commands like launching instances automatically.\n\nThe tool is installable via Homebrew, pre-built binaries, or from source. The MCP server can be run easily with `npx` and configured in Claude Code. All functionality supports automated notifications if configured, with an option to disable them via `--no-notify`.",
    "chinese_title": "Show HN：用于管理Lambda云GPU实例的快速CLI与MCP服务器",
    "chinese_summary": "本文介绍**Lambda CLI**，这是一款非官方的社区工具，可通过命令行或AI助手管理Lambda Cloud GPU实例。它包含两个主要组件：用于直接终端命令的**CLI**（`lambda`），以及允许Claude等AI助手管理GPU基础设施的**MCP服务器**（`lambda-mcp`）。\n\n主要功能包括：\n- 通过API密钥进行**身份验证**（可从环境变量或1Password等命令行工具获取）。\n- **实例管理**：列出可用GPU、启动/停止实例，并通过`lambda find`轮询实例可用性。\n- 实例就绪时可通过Slack、Discord或Telegram发送**可选通知**。\n- **MCP集成**：AI助手可自动执行启动实例等命令。\n\n该工具可通过Homebrew、预编译二进制文件或源码安装。MCP服务器可通过`npx`轻松运行，并在Claude Code中配置。所有功能在配置后均支持自动通知，也可通过`--no-notify`选项禁用。"
  },
  {
    "id": "46618272",
    "title": "How have prices changed in a year? NPR checked 114 items at Walmart",
    "url": "https://www.npr.org/2026/01/14/nx-s1-5638908/walmart-prices-inflation-affordability-shrinkflation",
    "summary": "NPR's annual price check of 114 items at a Walmart in Georgia found that prices in its basket rose an average of 5% in 2025, despite a national inflation slowdown. Nearly half of the items increased in cost, driven by three main factors: tariffs, climate change, and strategic pricing.\n\nTariffs on imports led to significant price jumps for items like paper folders (up 46%) and fish fillets (up 34%). Climate-related disruptions to harvests caused steep increases for coffee (up 46%), chocolate (around 26%), and beef (up 30%). Meanwhile, some manufacturers continued \"shrinkflation,\" reducing package sizes while maintaining prices, as seen with Tide detergent.\n\nHowever, about a quarter of items became cheaper. Egg prices fell 30% after bird flu impacts eased, and butter dropped 16% due to a dairy surplus. Facing consumer pressure, major brands like PepsiCo and General Mills began cutting prices, with Cheerios costing 19% less. Walmart also increased its discounts to attract budget-conscious shoppers.\n\nThe analysis highlights how global trade policies, environmental factors, and retail competition collectively shape the prices of everyday goods.",
    "chinese_title": "一年间物价如何变化？美国国家公共电台核对了沃尔玛的114件商品价格。",
    "chinese_summary": "美国国家公共电台在佐治亚州一家沃尔玛对114种商品进行的年度价格调查发现，尽管全国通胀放缓，但其购物篮中的商品价格在2025年平均上涨了5%。近半数商品价格上涨主要由三大因素驱动：关税、气候变化和战略定价。\n\n进口关税导致纸质文件夹（上涨46%）和鱼片（上涨34%）等商品价格大幅跃升。气候相关收成中断造成咖啡（上涨46%）、巧克力（约26%）和牛肉（上涨30%）价格急剧攀升。与此同时，部分制造商持续进行“缩水式通胀”，在维持价格的同时缩减包装规格，汰渍洗衣粉便是典型例子。\n\n然而，约四分之一商品价格有所下降。禽流感影响缓解后鸡蛋价格下跌30%，乳制品过剩使黄油价格下降16%。面对消费者压力，百事可乐和通用磨坊等主要品牌开始降价，Cheerios麦片价格降低19%。沃尔玛也加大折扣力度以吸引注重预算的消费者。\n\n该分析揭示了全球贸易政策、环境因素和零售竞争如何共同影响日常商品的价格走势。"
  },
  {
    "id": "46617149",
    "title": "Government drops plans for mandatory digital ID to work in UK",
    "url": "https://www.bbc.com/news/articles/c3385zrrx73o",
    "summary": "The UK government has abandoned its plan to make a new, mandatory digital ID system a requirement for proving the right to work. Instead, existing checks using documents like biometric passports will be fully digitised by 2029.\n\nThe reversal is part of a series of recent policy U-turns. While ministers, including Business Secretary Peter Kyle, stated the government remains \"absolutely committed\" to mandatory digital right-to-work checks to combat illegal working, they acknowledged the need to better explain policies. The focus will now shift to promoting digital ID as a tool for easier public service access, rather than solely an immigration measure.\n\nThe initial plan faced significant opposition, with public support plummeting after its announcement and nearly three million people signing a petition against it. Critics, including Conservative leader Kemi Badenoch and Reform UK's Nigel Farage, welcomed the climbdown, while some Labour MPs expressed frustration over the policy reversal.\n\nThe government clarified that digital ID will be developed using its existing Gov.uk One Login and a forthcoming Gov.uk Wallet app, storing personal details like name and photo. The aim is to replace the current \"paper-based\" system, which is seen as open to fraud, with a more secure and efficient digital process.",
    "chinese_title": "英国政府放弃强制推行数字身份证工作许可计划。",
    "chinese_summary": "英国政府已放弃推行新的强制性数字身份识别系统作为工作权利证明的计划。相反，到2029年，现有使用生物识别护照等文件的核查将全面数字化。\n\n这一政策逆转是近期一系列立场转变的一部分。尽管包括商业大臣彼得·凯尔在内的部长们表示，政府仍“坚决致力于”通过强制性数字工作权利核查打击非法就业，但他们承认需要更好地解释政策。今后的重点将转向推广数字身份识别作为便捷获取公共服务的工具，而非仅作为移民管控措施。\n\n原计划曾遭遇强烈反对，公布后公众支持率骤降，近三百万人签署请愿书予以抵制。包括保守党领袖凯米·巴德诺克和英国改革党领袖奈杰尔·法拉奇在内的批评者对政府的让步表示欢迎，而部分工党议员则对政策反复表示失望。\n\n政府澄清称，数字身份识别系统将基于现有的Gov.uk统一登录平台和即将推出的Gov.uk数字钱包应用开发，存储姓名、照片等个人信息。此举旨在以更安全高效的数字流程取代当前“易受欺诈的纸质系统”。"
  },
  {
    "id": "46621518",
    "title": "The string theory hype machine will never die",
    "url": "https://www.math.columbia.edu/~woit/wordpress/?p=15407",
    "summary": "This blog post criticizes the persistent promotion, or \"hype,\" surrounding string theory despite its lack of experimental confirmation. The author, Peter Woit, cites recent examples from early 2026 where press releases and science media outlets claimed string theory was being used to explain brain architecture and dark energy.\n\nWoit argues this type of exaggerated coverage has damaged public trust in science and the credibility of scientists for over twenty years. He also notes it has harmed string theory's reputation within physics, making its practitioners \"virtually unemployable\" unless they pivot to other fields. The post references a string theorist who laments the field is in a \"fast contracting phase.\"\n\nThe author dismisses the specific claims, stating the research on dark energy describes a five-dimensional universe unlike our own, and the work on brain networks is another instance of overreach. His core conclusion is that this promotional cycle is perpetual (\"will never die\") but ultimately irrelevant as the scientific world moves on.",
    "chinese_title": "弦理论的炒作机器永远不会消亡。",
    "chinese_summary": "这篇博客文章批评了弦理论在缺乏实验证实的情况下仍被持续推广或\"炒作\"的现象。作者彼得·沃伊特引用了2026年初的几个近期案例，指出当时新闻稿和科学媒体宣称弦理论被用于解释大脑结构和暗能量。\n\n沃伊特认为，这种夸大报道二十多年来损害了公众对科学的信任以及科学家的信誉。他还指出，这破坏了弦理论在物理学界的声誉，使其研究者\"几乎无法就业\"，除非他们转向其他领域。文章提到一位弦理论学者感叹该领域正处于\"快速收缩阶段\"。\n\n作者驳斥了相关主张，指出关于暗能量的研究描述的是一个与我们的宇宙不同的五维空间，而关于大脑网络的研究则是另一个过度延伸的例子。他的核心结论是：这种宣传循环永无止境（\"永远不会消亡\"），但随着科学界不断向前发展，它终将无关紧要。"
  },
  {
    "id": "46617492",
    "title": "Xoscript",
    "url": "https://xoscript.com/history.xo",
    "summary": "Xoscript is a server-side scripting language first developed in 1993 for the C64. It was rebooted in 2009 with a focus on research and education. Between 2020 and 2025, server migrations highlighted the growing complexity of other languages, leading to the release of a new version in 2026 named xoscript.\n\nThe language is built on three core principles: **Simplicity** (minimal, easy-to-learn syntax), **Security** (designed for server environments), and **Backward Compatibility** (ensuring existing code remains functional). It is intentionally neutral, with no social or political stance.\n\nXoscript incorporates several unconventional design choices, including typeless data, dynamic scoping, treating all data as references, Smalltalk-like message passing, and a focus on fault tolerance. These features are deliberate and aim to offer a distinct, lightweight alternative for server-side scripting. Its primary goal is to provide a simple, efficient, and practical programming experience.",
    "chinese_title": "Xoscript",
    "chinese_summary": "Xoscript是一种服务器端脚本语言，最初于1993年为C64开发。该语言于2009年重启，专注于研究与教育。2020年至2025年间，服务器迁移凸显了其他语言日益增长的复杂性，促使2026年发布了名为xoscript的新版本。\n\n该语言基于三大核心原则：**简洁性**（极简、易学的语法）、**安全性**（专为服务器环境设计）和**向后兼容性**（确保现有代码持续可用）。它刻意保持中立，不涉及任何社会或政治立场。\n\nXoscript包含多项非常规设计选择：无类型数据、动态作用域、将所有数据视为引用、类似Smalltalk的消息传递机制，以及专注于容错性。这些特性均为有意设计，旨在为服务器端脚本提供一种独特、轻量级的替代方案。其主要目标是提供简单、高效且实用的编程体验。"
  },
  {
    "id": "46614558",
    "title": "I Hate GitHub Actions with Passion",
    "url": "https://xlii.space/eng/i-hate-github-actions-with-passion/",
    "summary": "The author expresses intense frustration with GitHub Actions, describing a specific incident where a CI/CD pipeline failed due to platform-specific issues. While building a Rust project (`tmplr`) for multiple architectures, the Linux ARM runner failed because a required CUE binary, installed on the host, was inaccessible to the isolated ARM runner.\n\nThis triggered a slow and inefficient debugging loop—editing YAML, pushing, and waiting minutes for results—which the author compares to outdated, slow technology. The experience highlights a core criticism: GitHub Actions forces complex logic into hard-to-debug YAML configurations, making iteration painful.\n\nThe solution was to move build logic out of GitHub Actions entirely, into a local GNU Makefile, and commit the generated files. This aligns with the advocated best practice of keeping complex scripts under direct developer control and using Actions only to execute them.\n\nDespite acknowledging benefits like easy macOS builds, the author concludes that GitHub Actions is a frustrating but currently unavoidable tool, responsible for significant lost time and hindering development efficiency.",
    "chinese_title": "我极其痛恨GitHub Actions。",
    "chinese_summary": "作者对GitHub Actions表达了强烈不满，讲述了一次因平台特定问题导致CI/CD流水线故障的具体事件。在为多架构构建Rust项目（`tmplr`）时，Linux ARM运行器因无法访问主机上已安装的必要CUE二进制文件而失败。\n\n这引发了缓慢低效的调试循环——编辑YAML、推送代码、等待数分钟查看结果——作者将其比作过时的低效技术。该经历突显了一个核心批评：GitHub Actions将复杂逻辑强行塞入难以调试的YAML配置中，使得迭代过程异常痛苦。\n\n解决方案是将构建逻辑完全移出GitHub Actions，转至本地的GNU Makefile中，并提交生成的文件。这符合倡导的最佳实践：将复杂脚本置于开发者直接控制之下，仅用Actions来执行它们。\n\n尽管承认其便捷的macOS构建等优点，作者最终认为GitHub Actions是个令人沮丧但目前无法回避的工具，它导致了大量时间浪费并阻碍了开发效率。"
  },
  {
    "id": "46547400",
    "title": "Virginia Faulkner: Writer, Editor and Ghostwriter?",
    "url": "https://lithub.com/virginia-faulkner-writer-editor-and-ghostwriter/",
    "summary": "This article details how writer Virginia Faulkner secretly ghostwrote Polly Adler's bestselling 1953 memoir, *A House Is Not a Home*. After a period of personal and professional struggle, Faulkner was recruited by friends to salvage Adler's dull, unwieldy manuscript about her life as a famed New York madam.\n\nFaulkner undertook a massive revision, cutting, restructuring, and injecting her trademark wit into the narrative. Her work involved extensive historical research, fact-checking Adler's often-inaccurate recollections, and even creatively inventing dialogue and scenes to improve the story's flow while maintaining its authentic spirit. She worked closely with Adler and their agent, Ann Watkins, navigating Adler's demanding personality and legal concerns over libel.\n\nThe book was a critical and commercial success upon release, with few aware of Faulkner's extensive role. Although columnist Dorothy Kilgallen later revealed Faulkner as the ghostwriter, the claim was long disputed due to a lack of evidence. This changed when historian Debby Applegate, while researching a Polly Adler biography, discovered correspondence in Watkins's archives and a private notebook kept by Faulkner that meticulously documented her authorship.\n\nThe project marked the end of Faulkner's own writing career. She subsequently returned to Nebraska and shifted her focus to editorial work, having proven her exceptional skill as a collaborator and editor on a major bestseller.",
    "chinese_title": "弗吉尼亚·福克纳：作家、编辑与代笔人？",
    "chinese_summary": "本文详述了作家弗吉尼亚·福克纳如何秘密代笔波莉·阿德勒1953年的畅销回忆录《房子不是家》。在经历了一段个人与职业的挣扎后，福克纳受朋友之邀，接手挽救阿德勒那本关于其纽约名妓生涯的枯燥冗长手稿。\n\n福克纳进行了大规模修订，删减内容、调整结构，并将她标志性的机智融入叙事。她不仅进行了大量历史研究，核实阿德勒时常失实的回忆，甚至创造性地编撰对话与场景，在保持故事真实神韵的同时提升其流畅度。她与阿德勒及其经纪人安·沃特金斯紧密合作，既要应对阿德勒苛刻的个性，又要处理涉及诽谤的法律顾虑。\n\n该书出版后获得评论与商业双重成功，却鲜有人知福克纳的深度参与。尽管专栏作家多萝西·基尔加伦后来揭露福克纳的代笔身份，但因缺乏证据，这一说法长期存在争议。直到历史学家黛比·阿普尔盖特在研究波莉·阿德勒传记时，于沃特金斯的档案中发现往来信件，并找到福克纳私人笔记中对其作者身份的详细记录，真相才得以证实。\n\n该项目标志着福克纳个人创作生涯的终结。在成功证明自己作为畅销书合作者与编辑的卓越才能后，她回到内布拉斯加州，转而专注于编辑工作。"
  },
  {
    "id": "46585372",
    "title": "A Brief Introduction to the Basics of Game Theory",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1968579",
    "summary": "This article, \"A Brief Introduction to the Basics of Game Theory,\" is a concise primer written by Matthew O. Jackson of Stanford University and the Santa Fe Institute. Its primary purpose is to serve as a quick reference guide for students who need foundational knowledge of game theory for courses that assume but do not require it as a formal prerequisite.\n\nThe paper, originally posted in December 2011 and revised in January 2017, is a 21-page overview. It covers essential game theory concepts, providing a streamlined entry point to the subject. The content is categorized under the JEL code C72 (Noncooperative Games), indicating its focus on strategic interactions where binding agreements are not possible.\n\nKey information includes its high accessibility, evidenced by substantial download and abstract view statistics on SSRN. The article is part of several curated eJournals related to education in social sciences, economics, and finance. The provided citation and permanent links (URL and DOI) ensure stable, long-term access to the resource.",
    "chinese_title": "博弈论基础简介",
    "chinese_summary": "本文《博弈论基础简介》由斯坦福大学及圣塔菲研究所的马修·O·杰克逊撰写，是一份精炼的入门指南。其主要目的是为那些在课程中需要博弈论基础知识、但该课程未将其设为正式先修条件的学生提供快速参考。\n\n该论文最初发布于2011年12月，并于2017年1月修订，共21页，概述了博弈论的核心概念，为这一学科提供了简明的入门路径。内容归类于JEL代码C72（非合作博弈），侧重于探讨无法达成具有约束力协议的策略互动情境。\n\n关键信息显示其具有较高的可获取性，这在SSRN上的大量下载量和摘要浏览数据中得以体现。本文被收录于多个社会科学、经济学及金融学教育主题的精选电子期刊中。文末附有的引用信息及永久链接（URL与DOI）确保了该资源的长期稳定访问。"
  },
  {
    "id": "46614285",
    "title": "System Programming in Linux: A Hands-On Introduction \"Demo\" Programs",
    "url": "https://github.com/stewartweiss/intro-linux-sys-prog",
    "summary": "This repository contains the source code for the demo programs featured in the book *\"System Programming in Linux: A Hands-On Introduction\"* by Stewart Weiss. The code is organized into chapter-specific directories (e.g., `ChapterNN`) and relies on shared library files located in the `common/` directory.\n\nTo build any program, users must first compile and install the common utilities by running `make` and then `make install` within the `common/` directory. This step places necessary headers and a static library (`libutils.a`) into the repository's `include/` and `lib/` folders. After this setup, users can navigate to any chapter directory and run `make` to compile its programs.\n\nThe repository may contain updates not present in the printed book; code from the first printing is available in a separate branch. Complete programs are licensed under the GNU General Public License v3, while library source code uses the GNU Lesser General Public License v3. The author welcomes feedback, bug reports, and improvements via the repository's issue tracker.",
    "chinese_title": "Linux系统编程：动手实践入门“演示”程序",
    "chinese_summary": "本仓库包含斯图尔特·韦斯所著《Linux系统编程：动手实践入门》一书中演示程序的源代码。代码按章节组织为独立目录（例如`ChapterNN`），并依赖于`common/`目录中的共享库文件。\n\n构建任何程序前，用户需先在`common/`目录中运行`make`和`make install`命令编译并安装公共工具。此步骤会将必要的头文件和静态库（`libutils.a`）放置到仓库的`include/`和`lib/`文件夹中。完成设置后，用户可进入任意章节目录运行`make`命令编译该章节的程序。\n\n仓库可能包含印刷版书籍中未收录的更新内容；第一版印刷对应的代码存放于独立分支中。完整程序遵循GNU通用公共许可证v3授权，库源代码则采用GNU宽通用公共许可证v3。作者欢迎通过仓库问题跟踪系统提交反馈、错误报告和改进建议。"
  },
  {
    "id": "46617360",
    "title": "Find a pub that needs you",
    "url": "https://www.ismypubfucked.com/",
    "summary": "This article urges public support for UK pubs facing financial strain due to business rates, despite a potential government policy change.\n\nIts core message is that pubs still need immediate help. It encourages readers to use a postcode search or map to find their local pub and buy a pint. The tone is informal and urgent, using the deliberately provocative \"Fucked Pub Index™\" to highlight the crisis. This index, humorously described as using \"advanced geospatial analysis (Google Maps)\" and \"basic maths,\" identifies pubs most at risk based on official Valuation Office Agency data.\n\nThe article states that data for over 2,000 verified pubs shows many are \"Facing Increases\" in rates, with 2026 noted as the next revaluation year. It warns that industry experts believe the number of affected pubs is even higher.\n\nWhile noting the government has \"signalled a potential u-turn\" and \"signalled support is coming,\" the piece emphasises that no details are confirmed, making direct customer patronage vital now.",
    "chinese_title": "找到一家需要你的酒吧",
    "chinese_summary": "本文呼吁公众支持因商业税率面临财务压力的英国酒吧，尽管政府政策可能出现转变。\n\n其核心信息是：酒吧仍急需即时援助。文章鼓励读者通过邮编搜索或地图找到本地酒吧并购买一品脱啤酒。语气非正式且紧迫，刻意使用具有挑衅性的“濒危酒吧指数™”来突显危机。该指数被幽默地描述为运用“先进地理空间分析（谷歌地图）”和“基础数学”，依据英国评估办公室机构的官方数据识别风险最高的酒吧。\n\n文章指出，超过2000家已验证酒吧的数据显示许多正“面临税率上涨”，并提到2026年是下一个重估年份。它警告称，行业专家认为受影响的酒吧数量可能更高。\n\n尽管提到政府已“暗示可能转变态度”并“表示支持即将到来”，但文章强调具体细节尚未确认，因此当前顾客的直接支持至关重要。"
  },
  {
    "id": "46614688",
    "title": "Show HN: Tiny FOSS Compass and Navigation App (<2MB)",
    "url": "https://github.com/CompassMB/MBCompass",
    "summary": "**Summary**\n\nMBCompass is a free, open-source Android app (under 2MB) that combines compass and basic navigation features. It provides a privacy-focused alternative to larger map apps by displaying cardinal directions (magnetic and true north), live GPS location on OpenStreetMap, and magnetic field strength.\n\nKey features include sensor fusion for accuracy, light/dark themes, landscape support, and a screen-on option for navigation. The app has no ads, in-app purchases, or tracking. It requires Android 5.0+ and only uses location permission for map display.\n\nThe project is community-driven, welcoming translations and contributions. An updated UI design (v2.0) is proposed, featuring a speedometer and visual improvements. The app has gained recognition on platforms like Product Hunt and Hacker News.\n\nDevelopment is supported by user donations, and the software is licensed under GPLv3, requiring any modifications to remain open-source.",
    "chinese_title": "展示HN：微型开源指南针与导航应用（<2MB）",
    "chinese_summary": "**摘要**\n\nMBCompass 是一款免费、开源的安卓应用（小于 2MB），集成了指南针和基础导航功能。它通过显示基本方位（磁北与真北）、在 OpenStreetMap 上实时显示 GPS 位置以及磁场强度，为用户提供了一个注重隐私的替代方案，以取代那些庞大的地图应用。\n\n其主要特点包括：传感器融合以提高准确性、支持浅色/深色主题、横屏模式以及导航时保持屏幕常亮的选项。该应用无广告、无应用内购买、无追踪行为。它需要安卓 5.0 及以上系统，并且仅在使用地图显示功能时才需要位置权限。\n\n该项目由社区驱动，欢迎翻译和贡献。新版 UI 设计（v2.0）正在规划中，将加入速度计和视觉改进。该应用已在 Product Hunt 和 Hacker News 等平台获得关注。\n\n开发由用户捐赠支持，软件采用 GPLv3 许可证，要求任何修改版本必须保持开源。"
  },
  {
    "id": "46591810",
    "title": "There's a ridiculous amount of tech in a disposable vape",
    "url": "https://blog.jgc.org/2026/01/theres-ridiculous-amount-of-tech-in.html",
    "summary": "This article details the author's discovery of a discarded disposable vape, the \"Fizzy Max III 60K,\" which contains a surprisingly sophisticated amount of electronics. The author was shocked to find it featured a USB-C port for recharging, a small display showing battery and e-liquid levels, and a rechargeable 800 mAh battery—all in a supposedly disposable device.\n\nUpon disassembling it, they found the vape uses three microphones to detect suction from six different positions on the mouthpiece. This input controls three transistors that heat specific pairs of pins inserted into e-liquid chambers, allowing for six flavor combinations.\n\nThe author notes the irony and waste of discarding such complex hardware, which includes microprocessors and circuit boards, after its single use. They attempted to hack the main microprocessor (labelled B0081S1) via its exposed pads and USB-C connection but were unsuccessful in establishing communication with debugging tools. The post concludes with comments from readers discussing the wastefulness of consumerism and sharing a link to a related project about hacking vape hardware.",
    "chinese_title": "一次性电子烟里蕴含的技术含量高得离谱",
    "chinese_summary": "本文详细描述了作者发现的一款被丢弃的一次性电子烟“Fizzy Max III 60K”，其内部电子元件复杂程度令人惊讶。作者震惊地发现，这款号称一次性的设备竟配备USB-C充电接口、显示电量和烟油余量的小屏幕，以及一块800mAh的可充电电池。\n\n拆解后发现，该电子烟通过三个麦克风检测烟嘴上六个不同位置的吸力。这些信号控制着三个晶体管，加热插入烟油仓的特定引脚组合，从而实现六种风味调配。\n\n作者指出，这种包含微处理器和电路板的复杂硬件仅使用一次便被丢弃，既讽刺又浪费。他们尝试通过暴露的焊盘和USB-C接口破解主控芯片（标识为B0081S1），但未能与调试工具建立通信。文末附有读者评论，探讨消费主义造成的浪费现象，并分享了关于破解电子烟硬件的相关项目链接。"
  },
  {
    "id": "46579387",
    "title": "Systematically generating tests that would have caught Anthropic's top‑K bug",
    "url": "https://theorem.dev/blog/anthropic-bug-test/",
    "summary": "This article introduces \"fractional proof decomposition,\" a systematic method for generating targeted unit tests that catch rare software bugs, such as the recent approximate top-K bug in Anthropic's TPU implementation. Traditional testing methods—like unit-level property-based tests (PBTs), formal proofs, and end-to-end PBTs—often miss edge cases, require excessive reasoning, or are computationally inefficient.\n\nThe approach works in three steps: First, encode a high-level correctness property (a \"theorem\") as an end-to-end PBT. Second, recursively decompose this theorem into smaller, more manageable sub-theorems using logical reasoning. Third, continue decomposition until the resulting unit tests are fast and efficient enough to detect rare bugs with minimal compute.\n\nThe method is demonstrated by automatically generating a test for the top-K bug, which incorrectly excluded the most likely token. The core property tested was that the maximum value from an approximate top-K operation must equal the true maximum of the input array. By breaking down the end-to-end property, the system created focused unit tests that caught the bug in about 10 minutes of sampling, and a related precision bug in seconds.\n\nThe key advantage is efficiency: instead of scaling compute proportionally to a bug's rarity, fractional proofs scale logarithmically. The authors at Theorem are developing models to automate this reasoning process, aiming to help developers catch elusive bugs earlier without sacrificing speed or computational resources.",
    "chinese_title": "系统性地生成能够发现Anthropic公司top‑K漏洞的测试",
    "chinese_summary": "本文介绍了“分数证明分解”——一种系统化生成针对性单元测试的方法，能够捕获罕见软件缺陷，例如近期Anthropic TPU实现中的近似Top-K错误。传统测试方法（如单元级基于属性的测试、形式化证明和端到端基于属性的测试）往往遗漏边界情况、需要过度推理或计算效率低下。\n\n该方法分三步进行：首先，将高层正确性属性（即“定理”）编码为端到端基于属性的测试；其次，运用逻辑推理将该定理递归分解为更小、更易处理的子定理；最后，持续分解直至生成的单元测试足够快速高效，能以最小计算量检测罕见错误。\n\n该方法通过自动生成针对Top-K错误的测试得到验证，该错误曾导致最可能标记被错误排除。测试的核心属性是：近似Top-K操作的最大值必须等于输入数组的真实最大值。通过分解端到端属性，系统创建了聚焦式单元测试，仅用约10分钟采样就捕获了该错误，并在数秒内发现了一个相关精度错误。\n\n该方法的核心优势在于效率：不同于传统方法需要按错误罕见程度比例增加计算量，分数证明分解仅需对数级计算资源。Theorem团队正在开发自动化该推理过程的模型，旨在帮助开发者在早期捕获隐蔽错误，同时不牺牲速度或计算资源。"
  },
  {
    "id": "46616569",
    "title": "Never-before-seen Linux malware is \"more advanced than typical\"",
    "url": "https://arstechnica.com/security/2026/01/never-before-seen-linux-malware-is-far-more-advanced-than-typical/",
    "summary": "Researchers have discovered a new, sophisticated Linux malware framework called **VoidLink**. Unlike typical Linux malware, it is a highly advanced, modular system with over 30 plugins, allowing attackers to customize capabilities for reconnaissance, privilege escalation, and lateral movement within compromised networks.\n\nA key focus of VoidLink is targeting **Linux systems in cloud environments** like AWS, Azure, and Google Cloud. It can detect the hosting provider and whether a machine is running in a container (e.g., Docker, Kubernetes).\n\nThe framework's design suggests it is intended for **long-term, stealthy access** by professional threat actors. Its interface is localized for Chinese operators, and its source code indicates it is still under development. Notably, there is **no evidence yet of active infections** in the wild; it was discovered in malware samples on VirusTotal.\n\nVoidLink's advanced features include:\n*   Cloud environment detection and extensive system profiling.\n*   A plugin system and development API for expanding functionality.\n*   Stealth measures, including rootkit functions and anti-analysis techniques.\n*   Credential harvesting for SSH keys, passwords, and API tokens.\n\nWhile no immediate defensive action is required, the discovery underscores the growing threat to Linux and cloud infrastructure, urging defenders to maintain vigilance.",
    "chinese_title": "前所未见的Linux恶意软件“比典型病毒更高级”",
    "chinese_summary": "研究人员发现了一种名为**VoidLink**的新型复杂Linux恶意软件框架。与典型的Linux恶意软件不同，它是一个高度先进的模块化系统，拥有超过30个插件，允许攻击者定制功能，用于在被入侵网络内进行侦察、权限提升和横向移动。\n\nVoidLink的一个关键重点是针对**云环境中的Linux系统**，如AWS、Azure和Google Cloud。它能够检测托管服务提供商以及机器是否在容器（如Docker、Kubernetes）中运行。\n\n该框架的设计表明，它旨在为专业威胁行为者提供**长期、隐蔽的访问**。其界面已针对中文操作者本地化，其源代码表明它仍在开发中。值得注意的是，**目前尚无证据表明存在活跃感染**；它是在VirusTotal的恶意软件样本中被发现的。\n\nVoidLink的高级功能包括：\n*   云环境检测和广泛的系统分析。\n*   用于扩展功能的插件系统和开发API。\n*   隐蔽措施，包括rootkit功能和反分析技术。\n*   用于收集SSH密钥、密码和API令牌的凭据窃取。\n\n虽然目前无需立即采取防御行动，但这一发现凸显了Linux和云基础设施面临的日益增长的威胁，敦促防御者保持警惕。"
  },
  {
    "id": "46621668",
    "title": "US to suspend immigrant visa processing for 75 nations, State Department says",
    "url": "https://www.reuters.com/world/us/us-suspend-visa-processing-75-nations-next-week-fox-news-reports-2026-01-14/",
    "summary": "Based on the provided URL, I am unable to access the article content. The date in the URL (2026-01-14) suggests it is a future-dated or hypothetical link, as this date has not yet occurred. Reuters' current website does not contain an article at this address.\n\nTherefore, my response is: **Unable to access the article link.**",
    "chinese_title": "美国国务院称将暂停对75个国家的移民签证办理。",
    "chinese_summary": "根据提供的URL，我无法访问文章内容。URL中的日期（2026-01-14）表明这是一个未来日期或假设性链接，因为该日期尚未到来。路透社当前网站并未在此地址收录文章。\n\n因此，我的回复是：**无法访问文章链接。**"
  },
  {
    "id": "46616745",
    "title": "FBI raids Washington Post reporter's home",
    "url": "https://www.theguardian.com/us-news/2026/jan/14/fbi-raid-washington-post-hannah-natanson",
    "summary": "On June 27, 2024, the FBI raided the Virginia home of *Washington Post* reporter Hannah Natanson, seizing her electronic devices. The raid was part of an investigation into a government contractor, Aurelio Perez-Lugones, accused of illegally retaining classified materials. Agents stated Natanson was not the target or accused of wrongdoing.\n\nThe *Post* and press freedom groups condemned the action as a \"highly unusual and aggressive\" intrusion on press freedoms. They argued such searches endanger confidential sources and intimidate journalists, with critics calling it an escalation of the Trump administration's stance toward the media.\n\nThe warrant was executed at the Pentagon's request, according to Attorney General Pam Bondi, who stated the administration \"will not tolerate illegal leaks of classified information.\" However, the criminal complaint against Perez-Lugones does not accuse him of leaking information to the press.\n\nNatanson covers the federal workforce and has cultivated many sources within government agencies. The raid has raised significant constitutional and legal concerns about the limits of government power in investigating journalists and protecting a free press.",
    "chinese_title": "联邦调查局突袭《华盛顿邮报》记者住所",
    "chinese_summary": "2024年6月27日，美国联邦调查局突袭了《华盛顿邮报》记者汉娜·纳坦森的弗吉尼亚住所，并扣押了她的电子设备。此次行动是针对政府承包商奥雷利奥·佩雷斯-卢戈内斯涉嫌非法持有机密材料的调查的一部分。探员表示纳坦森并非调查目标，也未涉嫌任何不当行为。\n\n《华盛顿邮报》及新闻自由组织谴责此举是对新闻自由的\"极不寻常且具有侵略性\"的侵犯。他们认为此类搜查会危及机密消息来源并恐吓记者，批评者称这标志着特朗普政府对媒体态度的升级。\n\n据司法部长帕姆·邦迪称，此次搜查令应五角大楼要求执行，她表示政府\"不会容忍机密信息的非法泄露\"。然而针对佩雷斯-卢戈内斯的刑事起诉书并未指控其向媒体泄露信息。\n\n纳坦森长期报道联邦政府人事领域，在政府机构内建立了众多消息渠道。此次突袭引发了关于政府调查记者权力边界与保护新闻自由的重大宪法和法律争议。"
  }
]