[
  {
    "id": "47113728",
    "title": "I built Timeframe, our family e-paper dashboard",
    "url": "https://hawksley.org/2026/02/17/timeframe.html",
    "summary": "Over the past decade, Joel Hawksley developed **Timeframe**, a family dashboard system that displays calendar, weather, and smart home data on e-paper screens. The project began with prototypes using a backlit Magic Mirror and jailbroken Kindles to solve the need for unobtrusive, glanceable information in his home.\n\nAfter testing various displays, he settled on Visionect e-paper screens for their readability and low power consumption, powered by a custom Ruby on Rails backend. A market test revealed the high cost was a barrier for others. Following a house fire in 2021, Hawksley rebuilt the system using a new, high-resolution Boox Mira Pro screen, which enabled **real-time updates** and more detailed information.\n\nA major backend overhaul integrated **Home Assistant** as the primary data source, drastically simplifying the code by leveraging its existing integrations. This shift allowed the dashboard to function as a concise **status indicator** for the home, showing only relevant alerts (like open doors or finished laundry) rather than constant data streams.\n\nToday, Timeframe is a reliable part of daily life. Hawksley aims to productize it but notes challenges: further hardening the software, completing Home Assistant integration, and reducing the high cost and complexity of the current hardware setup.",
    "chinese_title": "我创建了Timeframe，我们家的电子纸仪表板。",
    "chinese_summary": "过去十年间，乔尔·霍克斯利开发了名为**Timeframe**的家庭仪表盘系统，该系统能在电子墨水屏上展示日历、天气和智能家居数据。项目最初使用背光魔镜和越狱Kindle制作原型，旨在满足家庭中对无干扰、一瞥即知的信息需求。\n\n经过多种显示屏测试后，他最终选用Visionect电子墨水屏，因其出色的可读性和低功耗特性，并由定制的Ruby on Rails后端驱动。市场测试显示高昂成本是阻碍他人使用的门槛。2021年经历房屋火灾后，霍克斯利采用全新的高分辨率Boox Mira Pro屏幕重建系统，实现了**实时更新**和更精细的信息展示。\n\n一次重大的后端改造将**Home Assistant**集成为主要数据源，通过利用其现有集成功能大幅简化了代码。这一转变使仪表盘成为家庭的简明**状态指示器**，仅显示相关警报（如未关的门或已完成的洗衣），而非持续的数据流。\n\n如今，Timeframe已成为日常生活中可靠的存在。霍克斯利希望将其产品化，但指出仍面临挑战：需要进一步强化软件、完成Home Assistant集成，并降低当前硬件配置的高成本与复杂度。"
  },
  {
    "id": "47110515",
    "title": "Attention Media ≠ Social Networks",
    "url": "https://susam.net/attention-media-vs-social-networks.html",
    "summary": "The article argues that mainstream social media platforms have fundamentally transformed from genuine social networks into \"attention media.\" The author recalls the early, optimistic era of Web 2.0, where platforms like early Twitter facilitated direct connections and meaningful notifications among users.\n\nThis changed with the introduction of features like infinite scroll and manipulative, irrelevant notifications designed to capture user time. The author's core complaint is the degradation of the social feed, which shifted from showing updates from chosen friends to algorithmically promoting content from random strangers, making the experience overwhelming and impersonal.\n\nAs a result, the author abandoned these services, viewing them as hostile to one's precious attention. The article concludes by presenting the decentralized platform Mastodon as a return to the original social networking ideal. On Mastodon, the user's feed consists solely of updates from intentionally chosen accounts, creating a calm, predictable, and user-controlled experience free from algorithmic manipulation and attention-grabbing tactics.",
    "chinese_title": "注意力媒体 ≠ 社交网络",
    "chinese_summary": "文章认为，主流社交媒体平台已从根本上从真正的社交网络转变为“注意力媒体”。作者回顾了Web 2.0早期乐观的时代，那时像早期的推特这样的平台促进了用户之间的直接联系和有意义的通知。\n\n随着无限滚动和旨在占用用户时间的操纵性、无关通知等功能的引入，情况发生了变化。作者的核心不满在于社交信息流的退化——它从显示所选朋友的更新，转变为算法推广随机陌生人的内容，使体验变得令人不堪重负且缺乏人情味。\n\n因此，作者放弃了这些服务，认为它们对人们宝贵的注意力充满敌意。文章最后提出，去中心化平台Mastodon是对原始社交网络理想的回归。在Mastodon上，用户的信息流仅包含有意选择的账户的更新，创造了一种平静、可预测且由用户控制的体验，不受算法操纵和注意力攫取策略的影响。"
  },
  {
    "id": "47112174",
    "title": "Fix your tools",
    "url": "https://ochagavia.nl/blog/fix-your-tools/",
    "summary": "The author recounts a frustrating experience debugging an open-source library. After a breakpoint in their debugger was mysteriously ignored, they fell into \"tunnel vision,\" bypassing the tool issue to write extra logging code—an ineffective and time-consuming approach.\n\nThe key realization was that the immediate desire to solve the core bug was hindering progress. The author paused to fix the debugger itself, which required only a simple configuration change. With the tool working properly, they quickly gained the insights needed to diagnose and resolve the original problem.\n\nThe article’s core lesson is a paradox: the urgency to fix a problem can blind programmers to broken tools that are essential for the task. The author advises developers to prioritize fixing their tools first, as this investment in foundational efficiency ultimately saves time and leads to better results.",
    "chinese_title": "修复你的工具",
    "chinese_summary": "作者讲述了一次调试开源库的挫败经历。当调试器中的断点被莫名忽略后，他们陷入了“隧道视野”，绕过了工具问题转而编写额外的日志代码——这是一种低效且耗时的方法。\n\n关键顿悟在于：急于解决核心缺陷的迫切感反而阻碍了进展。作者暂停下来修复调试器本身，而这仅需一个简单的配置调整。工具恢复正常后，他们迅速获得了诊断和解决原始问题所需的洞察。\n\n文章的核心教训是一个悖论：修复问题的紧迫性可能使程序员忽视那些对任务至关重要的故障工具。作者建议开发者优先修复工具，因为这种对基础效率的投资终将节省时间，并带来更好的结果。"
  },
  {
    "id": "47113567",
    "title": "Show HN: Local-First Linux MicroVMs for macOS",
    "url": "https://shuru.run",
    "summary": "This article introduces **Shuru**, a local-first tool for running lightweight, ephemeral Linux microVMs on macOS, specifically designed for AI agent workloads.\n\nBuilt natively on Apple Silicon using Apple's Virtualization.framework, it provides near-native performance without requiring Docker or an emulation layer. Its core philosophy is **ephemeral by default**: each VM starts from a clean Alpine Linux root filesystem, ensuring no persistent changes unless explicitly saved.\n\nKey features include:\n*   **Checkpointing:** Users can save a VM's disk state as a named snapshot (like a git commit), allowing for instant restoration, branching, and reuse.\n*   **Security:** VMs are offline by default, with opt-in NAT networking and configurable resources (CPU, memory, disk).\n*   **Port Forwarding:** Guest ports can be exposed to the host via a vsock tunnel, even without full network access.\n\nThe simple CLI (`shuru run`) lets users boot VMs, execute commands, and manage checkpoints. Primary use cases focus on providing safe, isolated sandboxes for AI agents to execute code, use tools, run evaluations, and for general development testing.\n\nInstallation is a one-line command, positioning Shuru as a fast, disposable infrastructure layer for AI-driven tasks on macOS.",
    "chinese_title": "展示 HN：适用于 macOS 的本地优先 Linux 微虚拟机",
    "chinese_summary": "本文介绍**Shuru**——一款专为AI智能体工作负载设计的本地优先工具，可在macOS上运行轻量级临时Linux微虚拟机。\n\n它基于Apple Silicon原生构建，采用苹果Virtualization.framework框架，无需Docker或模拟层即可实现接近原生的性能。其核心理念是**默认临时性**：每个虚拟机都从纯净的Alpine Linux根文件系统启动，确保除非显式保存，否则不会产生持久化变更。\n\n主要特性包括：\n*   **检查点功能：** 用户可将虚拟机磁盘状态保存为命名快照（类似git提交），支持即时恢复、分支创建与复用\n*   **安全性：** 虚拟机默认离线运行，提供可选的NAT网络连接与可配置资源（CPU、内存、磁盘）\n*   **端口转发：** 即使没有完整网络访问权限，仍可通过vsock隧道将客户机端口暴露给主机\n\n通过简洁的命令行工具（`shuru run`），用户可启动虚拟机、执行命令并管理检查点。主要应用场景是为AI智能体提供安全隔离的沙箱环境，用于执行代码、使用工具、运行评估测试，以及常规开发测试。\n\n仅需一行命令即可完成安装，Shuru致力于成为macOS上AI驱动任务的快速可弃置基础设施层。"
  },
  {
    "id": "47113527",
    "title": "Linuxulator on FreeBSD Feels Like Magic",
    "url": "https://hayzam.com/blog/02-linuxulator-is-awesome/",
    "summary": "The author, a Visual Studio Code user, describes overcoming a major productivity barrier when working on FreeBSD and OpenWRT projects by using VS Code's Remote SSH extension, which is not officially supported on these platforms.\n\nOn FreeBSD, the solution involved enabling the Linuxulator emulation layer (`linux_base-rl9`) and configuring the SSH connection to use a Linux environment path. A key trick was setting the `BASH_ENV` variable via the SSH client to source a custom path file (`.bash_linux`) only for the VS Code session, keeping the main system environment clean.\n\nTo their surprise, the setup worked flawlessly. All essential VS Code extensions and language servers functioned without issue. The only minor hiccup was with Rollup, which lacks a FreeBSD binary, but this was easily resolved by forcing the use of its WASM build via an npm override.\n\nThe author concludes that this \"magical\" setup, leveraging FreeBSD's robust Linux ABI compatibility, provides a fast and fully-featured remote development experience, eliminating the previous frustrations and performance issues of using NFS or SSHFS mounts.",
    "chinese_title": "FreeBSD上的Linux模拟器体验如同魔法般神奇",
    "chinese_summary": "作者是一名Visual Studio Code用户，描述了在FreeBSD和OpenWRT项目中通过使用VS Code的Remote SSH扩展（这些平台官方并不支持该扩展）克服了重大生产力障碍的经历。\n\n在FreeBSD上，解决方案包括启用Linuxulator模拟层（`linux_base-rl9`）并配置SSH连接以使用Linux环境路径。一个关键技巧是通过SSH客户端设置`BASH_ENV`变量，使其仅针对VS Code会话加载自定义路径文件（`.bash_linux`），从而保持主系统环境的整洁。\n\n令人惊讶的是，该配置运行得非常完美。所有重要的VS Code扩展和语言服务器均无故障运行。唯一的小问题是Rollup缺少FreeBSD二进制文件，但通过npm覆盖强制使用其WASM构建版本，这个问题也轻松解决了。\n\n作者总结道，这种利用FreeBSD强大的Linux ABI兼容性的“神奇”配置提供了快速且功能齐全的远程开发体验，消除了之前使用NFS或SSHFS挂载时的挫败感和性能问题。"
  },
  {
    "id": "47113325",
    "title": "Fresh File Explorer – VS Code extension for navigating recent work",
    "url": "https://github.com/FreHu/vscode-fresh-file-explorer",
    "summary": "**Fresh File Explorer** is a VS Code extension that helps developers navigate their recent work by focusing on pending changes and recent Git history. Its core feature is a **Smart File Tree** that groups modified files by directory, showing file counts and deleted files (which can be restored with one click). Users can switch between viewing uncommitted changes or files modified within configurable time windows.\n\nKey features include **heatmap coloring** to visualize edit recency, a **pinned section** for important files or notes, and **filtering** by author or commit to exclude noise from large automated changes. It supports **multi-repository** setups and offers specialized **search tools**, like searching only within \"fresh\" files or chaining searches.\n\nThe extension addresses common workflow pain points, such as losing context after a commit or needing to restore deleted files, by keeping recent changes visually accessible. It positions itself as a focused, single-view alternative to more comprehensive tools like GitLens, prioritizing an immediate overview of active work.",
    "chinese_title": "新鲜文件资源管理器 – 用于导航近期工作的VS Code扩展",
    "chinese_summary": "**Fresh File Explorer** 是一款 VS Code 扩展，旨在帮助开发者通过聚焦待处理的更改和最近的 Git 历史来导航近期工作。其核心功能是**智能文件树**，可按目录分组显示已修改的文件，同时展示文件数量和已删除文件（可一键恢复）。用户可在查看未提交的更改或可配置时间窗口内修改的文件之间切换。\n\n主要功能包括：通过**热图着色**可视化编辑的新近程度、用于重要文件或笔记的**置顶区域**，以及按作者或提交进行**筛选**以排除大型自动化更改带来的干扰。它支持**多仓库**设置，并提供专门的**搜索工具**，例如仅在“新鲜”文件中搜索或链式搜索。\n\n该扩展通过保持近期更改的视觉可访问性，解决了工作流中的常见痛点，例如提交后丢失上下文或需要恢复已删除文件。它定位为专注于单一视图的替代方案，相较于 GitLens 等更全面的工具，更优先提供对当前工作的即时概览。"
  },
  {
    "id": "47111981",
    "title": "Show HN: 3D Mahjong, Built in CSS",
    "url": "https://voxjong.com",
    "summary": "This is a \"Show HN\" post announcing **VoxJong**, a 3D Mahjong Solitaire game built primarily with CSS.\n\nThe developer's key achievement is creating a fully playable, three-dimensional tile-matching game using **CSS for the core 3D rendering and layout**, likely enhanced with minimal JavaScript for game logic. The project demonstrates advanced CSS techniques, including 3D transforms and isometric projections.\n\nA main feature highlighted is the **toggle between Isometric and Top-Down camera views**, allowing players to change their perspective on the tile layout. The post also mentions a zoom control, indicating attention to user interaction and visual clarity.\n\nIn essence, this submission showcases a technical experiment that turns a classic 2D puzzle game into an interactive 3D experience, emphasizing the creative and powerful use of web technologies (specifically CSS) for game development.",
    "chinese_title": "展示 HN：用 CSS 构建的 3D 麻将",
    "chinese_summary": "这是一篇“Show HN”帖子，宣布推出**VoxJong**——一款主要使用CSS构建的3D麻将接龙游戏。\n\n开发者的主要成就是利用**CSS实现核心的3D渲染与布局**（可能辅以少量JavaScript处理游戏逻辑），创建了完全可玩的三维牌面匹配游戏。该项目展示了先进的CSS技术，包括3D变换和等距投影。\n\n重点突出的功能是**等距视角与俯视视角的切换**，允许玩家改变对牌面布局的观察角度。帖子还提到了缩放控制功能，体现出对用户交互和视觉清晰度的关注。\n\n本质上，这个项目展示了一项将经典2D益智游戏转化为交互式3D体验的技术实验，凸显了在游戏开发中对网页技术（特别是CSS）的创新与高效运用。"
  },
  {
    "id": "47110473",
    "title": "What is a database transaction?",
    "url": "https://planetscale.com/blog/database-transactions",
    "summary": "A database transaction is a sequence of operations (reads, writes, updates, deletes) performed as a single, atomic unit of work. It begins with a `BEGIN` statement and ends with either a `COMMIT` (applying all changes) or a `ROLLBACK` (undoing all changes). This atomicity ensures data integrity, especially when multiple users access the database concurrently.\n\nA key feature is **consistent reads**, which isolate a transaction's view of the data from changes made by other simultaneous transactions until they commit. MySQL and Postgres achieve this differently: Postgres uses **multi-version concurrency control (MVCC)**, creating new row versions, while MySQL uses an **undo log** to reconstruct previous row states.\n\nDatabases offer four **isolation levels** that control this visibility and the trade-off between consistency and performance: Serializable (strictest), Repeatable Read, Read Committed, and Read Uncommitted (weakest, allows \"dirty reads\"). These levels define which phenomena—like phantom reads or non-repeatable reads—are permitted.\n\nFor handling **concurrent writes** to the same data under the strict Serializable level, the two databases also differ. MySQL uses **row-level locking** (which can cause deadlocks), while Postgres uses **Serializable Snapshot Isolation (SSI)**, which detects and resolves conflicts optimistically by aborting one transaction.\n\nIn summary, transactions provide the critical foundation for reliable, concurrent data operations in SQL databases, with different systems implementing the core guarantees through distinct architectural mechanisms.",
    "chinese_title": "什么是数据库事务？",
    "chinese_summary": "数据库事务是作为单一原子工作单元执行的一系列操作（读取、写入、更新、删除）。它以`BEGIN`语句开始，以`COMMIT`（应用所有更改）或`ROLLBACK`（撤销所有更改）结束。这种原子性确保了数据完整性，尤其是在多用户并发访问数据库时。\n\n其关键特性是**一致性读取**，它隔离了事务对数据的视图，使其不受其他并发事务在提交前所做更改的影响。MySQL和Postgres以不同方式实现这一点：Postgres采用**多版本并发控制（MVCC）**，创建新的行版本；而MySQL使用**撤销日志**来重建先前的行状态。\n\n数据库提供四种**隔离级别**来控制这种可见性，并在一致性与性能之间进行权衡：可串行化（最严格）、可重复读、读已提交和读未提交（最弱，允许\"脏读\"）。这些级别定义了允许出现哪些现象——如幻读或不可重复读。\n\n在严格的可串行化级别下处理对相同数据的**并发写入**时，两种数据库也有差异。MySQL采用**行级锁定**（可能导致死锁），而Postgres使用**可串行化快照隔离（SSI）**，通过乐观检测冲突并中止其中一个事务来解决冲突。\n\n总之，事务为SQL数据库中可靠、并发的数据操作提供了关键基础，不同系统通过独特的架构机制来实现核心保证。"
  },
  {
    "id": "47074287",
    "title": "International box-sizing Awareness Day (2014)",
    "url": "https://css-tricks.com/international-box-sizing-awareness-day/",
    "summary": "This article announces February 1st as \"International box-sizing Awareness Day,\" celebrating the CSS property `box-sizing: border-box`. The date commemorates Paul Irish's influential post advocating for its universal application.\n\nThe author recommends applying it globally using the selector `*, *:before, *:after` to ensure all elements and their pseudo-elements use the border-box model, overriding the default `content-box`. This model is praised because it makes an element's specified width its final rendered width, inclusive of any padding and borders. This eliminates the cumbersome math required under the default model, where padding and borders add to the total width, making layout—especially with percentages—far more predictable and manageable.\n\nThe post includes a detailed, version-specific CSS block with vendor prefixes for broad browser support but notes that tools like Autoprefixer can handle this. It concludes by reiterating the property's fundamental benefit: it simplifies CSS development by ensuring box dimensions behave intuitively, a principle especially valuable for creating grid columns and consistent layouts.",
    "chinese_title": "国际盒模型认知日（2014年）",
    "chinese_summary": "本文宣布将2月1日定为“国际盒模型认知日”，以庆祝CSS属性`box-sizing: border-box`。这一日期旨在纪念保罗·爱尔兰（Paul Irish）倡导该属性全面应用的有影响力的文章。\n\n作者建议通过选择器`*, *:before, *:after`全局应用此属性，确保所有元素及其伪元素均采用border-box模型，从而覆盖默认的content-box模型。该模型备受推崇，因为它使元素指定的宽度即为最终渲染宽度，包含内边距和边框。这消除了默认模型下所需的繁琐计算——在默认模型中，内边距和边框会增加总宽度，而border-box模型让布局（尤其是使用百分比时）变得更加可预测和易于管理。\n\n文章提供了一个详细、针对特定版本且包含浏览器厂商前缀的CSS代码块，以确保广泛的浏览器兼容性，但也指出Autoprefixer等工具可自动处理此类问题。最后再次强调该属性的核心优势：通过确保盒子尺寸的行为符合直觉来简化CSS开发，这一原则对于创建网格列和保持布局一致性尤为宝贵。"
  },
  {
    "id": "47111626",
    "title": "Xweather Live – Interactive global vector weather map",
    "url": "https://live.xweather.com/",
    "summary": "**Summary:**\n\nXweather Live is an interactive, web-based global weather map that visualizes real-time and forecast weather data using animated vector graphics. The core feature is its dynamic map that displays key meteorological elements like wind patterns (using streamlines), precipitation, pressure systems, and temperature in a clear, fluid animation.\n\nThe platform emphasizes user interaction, allowing individuals to zoom, pan, and toggle different weather layers to customize their view. It provides practical forecasting by showing conditions for the upcoming days, making it useful for planning.\n\nAimed at both weather enthusiasts and the general public, it transforms complex data into an accessible and engaging visual format. The service is available directly through a web browser, requiring no specialized software, and is typically free to access. In essence, Xweather Live functions as an animated, interactive atlas of global weather.",
    "chinese_title": "Xweather Live – 交互式全球矢量天气地图",
    "chinese_summary": "**概述：**\n\nXweather Live 是一款基于网页的交互式全球天气地图，通过动态矢量图形可视化实时及预报天气数据。其核心特色在于动态地图，能以清晰流畅的动画展示关键气象要素，如风场模式（采用流线显示）、降水、气压系统和温度。\n\n该平台注重用户交互，允许个人缩放、平移和切换不同天气图层以自定义视图。它通过展示未来几天的天气状况提供实用预报，便于用户规划行程。\n\n面向天气爱好者和普通大众，它将复杂数据转化为易于理解且引人入胜的可视化形式。该服务可直接通过网页浏览器访问，无需专业软件，通常可免费使用。本质上，Xweather Live 是一个动态交互的全球天气动态图集。"
  },
  {
    "id": "47113731",
    "title": "NanoClaw Moved from Apple Containers to Docker",
    "url": "https://twitter.com/Gavriel_Cohen/status/2025603982769410356",
    "summary": "**Summary:**\n\nThe article announces that the NanoClaw application has been migrated from its original deployment environment (Apple Containers) to Docker containers. This technical shift suggests a move towards greater platform independence, as Docker is a widely adopted containerization platform that runs across multiple operating systems, unlike Apple-specific solutions. The change likely aims to improve portability, simplify deployment workflows, and potentially facilitate scaling and management within broader development and infrastructure ecosystems.\n\nThe main body of the provided text is not the article content itself, but a standard browser message stating that JavaScript is disabled and is required to view the content of X.com (formerly Twitter). The footer contains standard website links for Help Center, Terms of Service, and copyright information. Therefore, the core announcement about NanoClaw's migration is the only substantive information available from the given text.",
    "chinese_title": "NanoClaw已从苹果容器迁移至Docker平台。",
    "chinese_summary": "**摘要：**\n\n文章宣布，NanoClaw应用已从原有的部署环境（Apple容器）迁移至Docker容器。这一技术转变意味着向更强的平台独立性迈进，因为Docker是一种广泛采用的容器化平台，可在多种操作系统上运行，不同于苹果专用的解决方案。此次变更可能旨在提升应用的可移植性、简化部署流程，并有望在更广泛的开发和基础设施生态中促进扩展与管理。\n\n正文部分并非文章内容本身，而是标准的浏览器提示信息，说明JavaScript已被禁用，而浏览X.com（原Twitter）内容需要启用JavaScript。页脚包含帮助中心、服务条款和版权信息等标准网站链接。因此，关于NanoClaw迁移的核心公告是所提供文本中唯一可获取的实质性信息。"
  },
  {
    "id": "47113793",
    "title": "Symplex, an open-source protocol semantic negotiation between distributed agents",
    "url": "https://github.com/olserra/symplex",
    "summary": "**Symplex** is an open-source protocol designed to enable semantic interoperability between distributed AI agents. It extends the Model Context Protocol (MCP) to allow agents to communicate based on meaning rather than rigid schemas.\n\nInstead of exchanging predefined JSON tool calls, agents share **intent vectors**—compact embeddings that semantically describe a goal. This allows agents to spontaneously negotiate, delegate, and collaborate without pre-registered APIs. Key features include:\n*   **Dynamic Discovery**: A TTL-based registry for runtime agent availability.\n*   **Federated Trust**: Agents use Decentralized Identifiers (DIDs) backed by Ed25519 key pairs.\n*   **Distributed Workflows**: Accepted intents can unfold into multi-step workflows orchestrated across a peer-to-peer (P2P) mesh via libp2p transport.\n\nCompared to MCP or Google's A2A, Symplex emphasizes semantic routing via vector similarity, spontaneous negotiation, and a decentralized P2P topology rather than client-server models.\n\nThe project is in active development (v0.1 core is stable) and includes a Go implementation with core protocol logic, P2P networking, and example integrations. The roadmap includes future support for QUIC/WebRTC transport, enhanced security verification, and multi-language SDKs.",
    "chinese_title": "Symplex，一种分布式代理间的开源协议语义协商机制。",
    "chinese_summary": "**Symplex** 是一个开源协议，旨在实现分布式AI代理之间的语义互操作性。它扩展了模型上下文协议（MCP），使代理能够基于含义而非固定模式进行通信。\n\n代理之间不交换预定义的JSON工具调用，而是共享**意图向量**——一种紧凑的嵌入表示，用于语义化描述目标。这使得代理能够无需预注册API即可自发协商、委托和协作。主要特性包括：\n*   **动态发现**：基于TTL的运行时代理可用性注册机制。\n*   **联邦信任**：代理使用由Ed25519密钥对支持的去中心化标识符（DID）。\n*   **分布式工作流**：已接受的意图可展开为多步骤工作流，通过libp2p传输在点对点（P2P）网络中编排执行。\n\n与MCP或谷歌的A2A相比，Symplex强调通过向量相似性进行语义路由、自发协商以及去中心化的P2P拓扑结构，而非客户端-服务器模型。\n\n该项目正在积极开发中（v0.1核心已稳定），包含采用Go语言实现的协议核心逻辑、P2P网络及示例集成。未来路线图包括支持QUIC/WebRTC传输、增强安全验证以及多语言SDK。"
  },
  {
    "id": "47112925",
    "title": "Hello Worg, the Org-Mode Community",
    "url": "https://orgmode.org/worg/",
    "summary": "This article introduces Worg, the community-driven documentation and resource hub for Org-mode, a powerful plain-text organizational system within Emacs. It explains that Org-mode integrates notes, tasks, calendars, and project planning, and can even be used for authoring documents and web pages.\n\nThe article serves as a portal to extensive resources for learning, using, and contributing to Org-mode. Key sections guide users to tutorials, manuals, and help channels like the mailing list and IRC. It also highlights advanced uses like task management (GTD), blogging, and literate programming with Babel.\n\nA core message is that both Org-mode and Worg are volunteer-run projects. It encourages community participation by contributing to Worg, joining meetups, or making donations. The article concludes by directing readers to community member pages and events, reinforcing its role as a central hub for the Org-mode ecosystem.",
    "chinese_title": "你好，Worg，Org-Mode 社区",
    "chinese_summary": "本文介绍了Worg，这是一个由社区驱动的文档和资源中心，专门服务于Org-mode——Emacs中一个强大的纯文本组织系统。文章指出，Org-mode集笔记、任务、日历和项目规划于一体，甚至可用于撰写文档和网页。\n\n本文是通往学习、使用和贡献Org-mode的丰富资源的门户。关键部分引导用户访问教程、手册以及邮件列表和IRC等帮助渠道。文章还重点介绍了高级应用，如任务管理（GTD）、博客和通过Babel实现的文学编程。\n\n核心信息是，Org-mode和Worg都是由志愿者运营的项目。文章鼓励社区参与，包括为Worg贡献内容、参加聚会或进行捐赠。最后，文章引导读者访问社区成员页面和活动信息，强化了其作为Org-mode生态系统核心枢纽的角色。"
  },
  {
    "id": "47111218",
    "title": "Git's Magic Files",
    "url": "https://nesbitt.io/2026/02/05/git-magic-files.html",
    "summary": "This article explains the various special files that Git and related tools use to control repository behavior, which are committed and travel with the code. Key files include:\n\n*   **.gitignore**: Lists file patterns Git should not track, with support for wildcards and negation. It is read from multiple locations, including per-directory and global files.\n*   **.gitattributes**: Configures how Git handles specific files, including line endings, diff/merge drivers, and overrides for language detection tools like GitHub Linguist.\n*   **.lfsconfig**: Stores Git LFS configuration, such as server endpoints, ensuring consistent settings across all clones.\n*   **.gitmodules**: Defines Git submodules, specifying the path, URL, and branch for embedded repositories.\n*   **.mailmap**: Maps author names and emails to canonical identities, ensuring accurate contributor attribution in logs and statistics.\n*   **.git-blame-ignore-revs**: Lists commits (e.g., formatting changes) that `git blame` should skip to show meaningful authorship.\n*   **.gitmessage**: A commit message template, though it requires manual per-repository configuration.\n\nThe article also notes forge-specific folders (like `.github/`), conventions like `.gitkeep`, and related tooling files such as `.editorconfig` and version manager files (`.node-version`). The core takeaway is that developers and tool builders should be aware of and respect these files to ensure proper repository management and consistent behavior across environments.",
    "chinese_title": "Git的神奇文件",
    "chinese_summary": "本文解释了Git及相关工具用于控制仓库行为的各种特殊文件，这些文件会随代码一同提交和传播。关键文件包括：\n\n*   **.gitignore**：列出Git不应跟踪的文件模式，支持通配符和排除规则。该文件可从多个位置读取，包括各目录专用文件和全局文件。\n*   **.gitattributes**：配置Git处理特定文件的方式，包括换行符处理、差异/合并驱动程序，以及覆盖GitHub Linguist等语言检测工具的设置。\n*   **.lfsconfig**：存储Git LFS配置（如服务器端点），确保所有克隆仓库的设置一致。\n*   **.gitmodules**：定义Git子模块，指定嵌入仓库的路径、URL和分支。\n*   **.mailmap**：将作者姓名和邮箱映射到规范身份，确保日志和统计中的贡献者归属准确。\n*   **.git-blame-ignore-revs**：列出`git blame`应跳过的提交（例如格式化更改），以显示有意义的作者信息。\n*   **.gitmessage**：提交信息模板，但需要针对每个仓库手动配置。\n\n文章还提到了平台专用文件夹（如`.github/`）、`.gitkeep`等约定，以及相关工具文件如`.editorconfig`和版本管理器文件（`.node-version`）。核心要点是：开发者和工具构建者应了解并尊重这些文件，以确保正确的仓库管理和跨环境行为一致性。"
  },
  {
    "id": "47108989",
    "title": "Back to FreeBSD: Part 1",
    "url": "https://hypha.pub/back-to-freebsd-part-1",
    "summary": "Based on the article, here is a concise summary:\n\nThe author, a long-time Linux user, details their decision to return to FreeBSD for their primary desktop operating system, driven by a desire for stability, consistency, and a cohesive system design. They express frustration with the increasing complexity and rapid, sometimes disruptive, changes in modern Linux distributions, particularly around systemd, package management, and kernel updates.\n\nKey reasons for the switch include:\n*   **The Base System:** FreeBSD's clear separation between the base OS (maintained as a single unit) and third-party packages/ports is praised for its stability and predictability.\n*   **ZFS and Boot Environments:** Native ZFS support, combined with boot environments (via `beadm`), allows for safe, atomic system updates and easy rollbacks, which the author finds superior to Linux solutions.\n*   **Documentation and Simplicity:** The comprehensive, high-quality `man` pages and handbook are highlighted as major strengths. The author appreciates that core system configuration is done via well-documented text files in `/etc`.\n*   **Performance & Hardware:** The author notes excellent performance, especially for desktop use, and found hardware support (for their Intel-based laptop) to be flawless with the `linuxulator` for running essential Linux applications.\n\nThe article concludes that the installation and setup were straightforward, resulting in a fast, clean, and understandable system that \"just stays out of the way,\" fulfilling the author's goal of a reliable and maintainable workstation.",
    "chinese_title": "重返FreeBSD：第一部分",
    "chinese_summary": "根据文章内容，以下是简明摘要：\n\n作者作为一名长期Linux用户，详细阐述了他决定将FreeBSD作为主要桌面操作系统的原因，主要是出于对稳定性、一致性以及系统设计整体性的追求。他对现代Linux发行版日益增长的复杂性以及频繁、有时甚至带来破坏性的更新感到沮丧，尤其是围绕systemd、软件包管理和内核更新方面。\n\n切换的关键理由包括：\n*   **基础系统：** FreeBSD将基础操作系统（作为一个整体维护）与第三方软件包/端口清晰分离，作者称赞这种设计带来了稳定性和可预测性。\n*   **ZFS与启动环境：** 原生的ZFS支持，结合启动环境（通过`beadm`工具），能够实现安全、原子性的系统更新和轻松回滚，作者认为这优于Linux的解决方案。\n*   **文档与简洁性：** 全面且高质量的`man`手册页和手册被强调为主要优势。作者赞赏核心系统配置是通过`/etc`目录下文档齐全的文本文件完成的。\n*   **性能与硬件：** 作者指出其性能卓越，尤其适用于桌面环境，并且发现硬件支持（对于其基于Intel的笔记本电脑）非常完美，通过`linuxulator`运行必要的Linux应用程序毫无问题。\n\n文章总结道，安装和设置过程直接明了，最终获得了一个快速、干净且易于理解的系统，能够“安静地待在后台”，满足了作者对可靠且易于维护的工作站的需求。"
  },
  {
    "id": "47111440",
    "title": "We hid backdoors in ~40MB binaries and asked AI + Ghidra to find them",
    "url": "https://quesma.com/blog/introducing-binaryaudit/",
    "summary": "This article details a benchmark study where researchers hid backdoors in large (~40MB) binary executables and tested AI agents (like Claude Opus) combined with reverse-engineering tools (Ghidra, Radare2) to find them.\n\n**Key Findings:**\n*   **Limited Success:** The best AI model (Claude Opus 4.6) found obvious backdoors in small/mid-size binaries only 49% of the time.\n*   **High False Positives:** Models incorrectly flagged clean binaries as malicious 28% of the time, generating unreliable noise.\n*   **Strategic Weakness:** AI agents lack the high-level intuition of human reverse engineers. They often fail to prioritize critical code paths (like network parsers) and instead decompile random functions or rely on simplistic keyword searches.\n*   **Rationalization Errors:** In one case, a model correctly identified a backdoor function but then rationalized it as legitimate code, missing the threat entirely.\n\n**Conclusion:** While AI shows some capability in binary analysis, it is not yet reliable for production-level malware detection due to low detection rates and unacceptably high false positives. The \"needle-in-a-haystack\" problem of finding small malicious code in large binaries remains a significant challenge for current AI agents.",
    "chinese_title": "我们在约40MB的二进制文件中隐藏了后门，并让AI和Ghidra来寻找它们。",
    "chinese_summary": "本文详述了一项基准研究，研究人员在大型（约40MB）二进制可执行文件中隐藏后门，并测试了结合逆向工程工具（Ghidra、Radare2）的AI智能体（如Claude Opus）来发现这些后门的能力。\n\n**主要发现：**\n*   **成功率有限：** 最佳AI模型（Claude Opus 4.6）仅在49%的情况下能在中小型二进制文件中发现明显的后门。\n*   **高误报率：** 模型在28%的情况下错误地将干净二进制文件标记为恶意，产生了不可靠的干扰信息。\n*   **策略性弱点：** AI智能体缺乏人类逆向工程师的高层直觉。它们往往无法优先处理关键代码路径（如网络解析器），而是反编译随机函数或依赖简单的关键词搜索。\n*   **合理化错误：** 在某个案例中，模型正确识别了一个后门函数，却将其合理化为合法代码，从而完全忽略了威胁。\n\n**结论：** 尽管AI在二进制分析中展现出一定能力，但由于检测率低且误报率高得难以接受，目前尚不可靠用于生产级恶意软件检测。在大型二进制文件中寻找微小恶意代码的“大海捞针”问题，对当前AI智能体而言仍是重大挑战。"
  },
  {
    "id": "47113769",
    "title": "An Unbothered Jimmy Wales Calls Grokipedia a 'Cartoon Imitation' of Wikipedia",
    "url": "https://gizmodo.com/an-unbothered-jimmy-wales-calls-grokipedia-a-cartoon-imitation-of-wikipedia-2000725070",
    "summary": "Wikipedia co-founder Jimmy Wales dismissed Elon Musk's AI-powered competitor, Grokipedia, as a \"cartoon imitation of an encyclopedia.\" Speaking at a summit, Wales argued that Wikipedia's strength lies in its human-vetted knowledge and volunteer subject-matter experts, who ensure accuracy and context. He cited AI's high \"hallucination\" rates—where models generate false or misleading information—as a primary reason AI is unfit to write encyclopedia articles, especially on niche topics.\n\nWhile the article positions Wikipedia as a reliable, donation-supported bastion of free knowledge, it presents Grokipedia as a reaction from those who believe Wikipedia has a political bias. The author suggests the larger concern is not competition but the creation of a rival information platform that deepens societal divides over a shared reality.",
    "chinese_title": "从容不迫的吉米·威尔士称格罗基百科为维基百科的“卡通仿制品”",
    "chinese_summary": "维基百科联合创始人吉米·威尔士在峰会上驳斥了埃隆·马斯克推出的AI竞争对手Grokipedia，称其为“卡通化的百科全书仿制品”。威尔士强调，维基百科的优势在于其经过人工审核的知识体系和由志愿者组成的领域专家团队，这确保了内容的准确性与语境完整性。他指出，AI存在高“幻觉率”——即模型常生成虚假或误导性信息——是AI不适合撰写百科全书条目（尤其是小众主题）的主要原因。\n\n文章将维基百科定位为依靠捐赠支持、值得信赖的自由知识堡垒，同时将Grokipedia描述为部分认为维基百科存在政治偏见者的回应。作者指出，更值得关注的并非竞争本身，而是可能加剧社会对共同现实认知分裂的对抗性信息平台的出现。"
  },
  {
    "id": "47103661",
    "title": "How Taalas “prints” LLM onto a chip?",
    "url": "https://www.anuragk.com/blog/posts/Taalas.html",
    "summary": "Taalas has developed a fixed-function ASIC chip that runs the Llama 3.1 8B model at 17,000 tokens per second, claiming 10x improvements in cost, energy efficiency, and speed over GPU-based systems.\n\nThe key innovation is \"hardwiring\" the model's weights directly onto the chip's silicon as physical transistors, eliminating the need to fetch weights from external memory (DRAM/HBM). This bypasses the major \"memory wall\" bottleneck of GPUs, where constant data transfer between compute cores and VRAM consumes significant time and energy.\n\nIn Taalas's design, an input vector flows sequentially through the etched layers of the model. Using a proprietary \"magic multiplier\" scheme, computations happen as the electrical signal passes directly from one layer's transistors to the next via on-chip wiring. A small amount of on-chip SRAM is retained only for the KV cache and LoRA adapters, not for the main model weights.\n\nWhile fabricating a custom chip for each model is typically expensive and slow, Taalas uses a base chip with a generic grid of transistors. Customizing it for a new model requires modifying only the top two manufacturing layers, a process that took two months for Llama 3.1 8B. This approach promises highly efficient, specialized hardware for mass-produced AI models.",
    "chinese_title": "Taalas如何将LLM“打印”到芯片上？",
    "chinese_summary": "Taalas开发了一款固定功能ASIC芯片，能以每秒17,000个令牌的速度运行Llama 3.1 8B模型，宣称其成本、能效和速度相比基于GPU的系统提升了10倍。\n\n其核心创新在于将模型权重以物理晶体管形式\"固化\"在芯片硅基上，无需从外部存储器（DRAM/HBM）获取权重。这绕过了GPU的主要\"内存墙\"瓶颈——计算核心与显存间持续的数据传输会消耗大量时间和能源。\n\n在Taalas的设计中，输入向量按序流经蚀刻在芯片上的模型层级。通过专有的\"魔法乘法器\"方案，电信号通过片上布线直接从一层晶体管传递至下一层时完成计算。仅保留少量片上SRAM用于KV缓存和LoRA适配器，而非存储主模型权重。\n\n虽然为每个模型定制芯片通常成本高昂且耗时，但Taalas采用具有通用晶体管阵列的基础芯片。为新模型定制仅需修改顶部两层制造层，Llama 3.1 8B的定制过程耗时两个月。这种方法有望为大规模生产的AI模型提供高效专用硬件。"
  },
  {
    "id": "47096167",
    "title": "Gamedate – A site to revive dead multiplayer games",
    "url": "https://gamedate.org/",
    "summary": "**Summary:**\n\nGameDate is a website designed to help players find and schedule multiplayer sessions for older, \"dead,\" or niche online games whose active player bases have dwindled. Its core function is to act as a centralized hub where players can propose specific game sessions by naming the game, setting a date and time, and choosing a platform (e.g., PC, console). Other users can then browse these scheduled \"gamedates\" and commit to joining, ensuring a critical mass of players for a planned time.\n\nThe site addresses the common frustration of wanting to play an older multiplayer title but finding empty servers or matchmaking lobbies. By moving from hoping for random players to coordinating planned events, GameDate aims to temporarily revive these games' communities. It is particularly useful for cooperative games, older competitive titles, or games with small but dedicated fanbases.\n\nKey features include a calendar view of upcoming sessions, the ability to filter by game and platform, and a commitment system to gauge interest. The concept emphasizes community-driven scheduling over automated matchmaking, relying on players to initiate and fill events. The overall goal is to breathe new life into beloved but less-populous multiplayer experiences by making organized play sessions easy to find and join.",
    "chinese_title": "游戏日期——一个让已逝多人游戏重获新生的网站",
    "chinese_summary": "**摘要：**\n\nGameDate 是一个旨在帮助玩家寻找并安排多人游戏会话的网站，主要针对那些活跃玩家群体已逐渐减少的老旧、“过气”或小众在线游戏。其核心功能是作为一个集中枢纽，玩家可以在此提议具体的游戏会话，包括指定游戏名称、设定日期时间以及选择平台（如PC、游戏主机）。其他用户则可浏览这些已安排的“游戏约会”并承诺加入，从而确保在计划时间内有足够数量的玩家参与。\n\n该网站解决了玩家想玩老旧多人游戏却常遇到服务器空置或匹配大厅无人的普遍困扰。通过将随机匹配的希望转变为协调规划的活动，GameDate 旨在暂时重振这些游戏的社区。它尤其适用于合作游戏、老旧的竞技游戏或拥有小众但忠实粉丝群体的游戏。\n\n主要功能包括：即将到来会话的日历视图、按游戏和平台筛选的能力，以及用于评估兴趣的承诺系统。该概念强调社区驱动的日程安排而非自动匹配，依赖玩家主动发起并参与活动。总体目标是通过让有组织的游戏会话易于查找和加入，为深受喜爱但玩家较少的多人游戏体验注入新的活力。"
  },
  {
    "id": "47111400",
    "title": "Man accidentally gains control of 7k robot vacuums",
    "url": "https://www.popsci.com/technology/robot-vacuum-army/",
    "summary": "A software engineer accidentally discovered a major security flaw in DJI's Romo robot vacuum that exposed nearly 7,000 devices worldwide. While building a custom remote-control app, Sammy Azdoufal found that the credentials granting access to his own vacuum also provided him with live camera feeds, microphone audio, floor maps, and status data from thousands of other units across 24 countries.\n\nAzdoufal responsibly reported the vulnerability to DJI via *The Verge*, and the company resolved the issue with server updates in February 2026. DJI stated the fix was automatic and required no user action.\n\nThe incident highlights persistent cybersecurity concerns with internet-connected smart home devices, which often operate in private spaces while having a history of security weaknesses. It also underscores how AI coding tools can lower the barrier for exploiting such flaws. This discovery coincides with broader public unease over data privacy and the surveillance capabilities of smart home technology, as more sophisticated devices—including future humanoid home robots—require deep access to personal environments to function.",
    "chinese_title": "男子意外获得七千台扫地机器人的控制权",
    "chinese_summary": "一名软件工程师意外发现大疆Romo扫地机器人存在重大安全漏洞，导致全球近7000台设备暴露风险。在开发定制遥控应用时，Sammy Azdoufal发现，用于访问自己扫地机器人的登录凭证，竟能同时获取24个国家数千台设备的实时摄像头画面、麦克风音频、家庭地图和状态数据。\n\nAzdoufal通过《The Verge》杂志向大疆负责任地报告了该漏洞，该公司于2026年2月通过服务器更新解决了问题。大疆表示修复程序会自动生效，无需用户操作。\n\n该事件凸显了联网智能家居设备长期存在的网络安全隐忧——这些常在私人空间运行的设备历史上屡现安全缺陷。同时表明AI编程工具可能降低利用此类漏洞的技术门槛。此次发现恰逢公众对数据隐私及智能家居监控能力的普遍忧虑加剧，随着包括未来人形家庭机器人在内的更精密设备需要深度接入个人生活环境以实现功能，相关风险日益凸显。"
  },
  {
    "id": "47108977",
    "title": "What's the best way to learn a new language?",
    "url": "https://www.bbc.com/future/article/20260220-whats-the-best-way-to-learn-a-new-language",
    "summary": "This article explores the most effective methods for learning a new language by combining a personal experiment with expert insights. The author, a multilingual individual, tests a scientific approach called cross-situational learning (CSL) over six days, learning basic Portuguese and Mandarin through tasks that mimic immersion by having her deduce word meanings from patterns and context without direct instruction.\n\nThe experiment, designed by linguistics researchers, demonstrates that our brains naturally use statistical learning to pick up language fundamentals quickly. While the author showed strong aptitude, the experts clarify that true fluency requires years of sustained practice and social interaction. They caution against apps promising rapid fluency, arguing that while new technologies like microlearning and AI chatbots are useful supplementary tools, they cannot replace the nuanced cultural understanding and conversational feedback gained from human interaction.\n\nThe core conclusion is that effective language learning blends our brain's innate pattern-recognition abilities with traditional, immersive methods that involve real communication and cultural context over a long period.",
    "chinese_title": "学习一门新语言的最佳方法是什么？",
    "chinese_summary": "本文通过结合个人实验与专家见解，探讨了学习新语言最高效的方法。作者作为一名多语言者，在六天内测试了一种名为“跨情境学习”的科学方法——通过模仿沉浸式环境，在没有直接指导的情况下从规律和语境中推断词义，从而学习基础葡萄牙语和普通话。\n\n这项由语言学家设计的实验表明，人类大脑天生能运用统计学习快速掌握语言基础。尽管作者展现出较强的学习天赋，但专家指出，真正的流利掌握需要多年持续练习和社会互动。他们提醒人们警惕那些承诺快速达成流利的应用程序，认为虽然微学习和人工智能聊天机器人等新技术是有用的辅助工具，但无法替代人际互动带来的细腻文化理解和对话反馈。\n\n核心结论是：有效的语言学习，需要将大脑天生的模式识别能力，与长期基于真实交流和文化语境的传统沉浸式方法相结合。"
  },
  {
    "id": "47059516",
    "title": "Monkey Patching in VBA",
    "url": "https://ecp-solutions.github.io/ASF/Language%20reference.html",
    "summary": "ASF (Advanced Scripting Framework) is a JavaScript-like scripting language embedded in VBA, designed to bring modern programming features to Office applications like Excel and Access. It offers a familiar syntax for web developers, including object-oriented programming, functional programming with first-class functions and closures, and modern array methods such as map, filter, and reduce.\n\nKey features include template literals for string interpolation, regular expression support, and seamless integration with VBA. A notable capability is \"monkey patching\" for extending COM objects, allowing developers to modify or enhance Office objects dynamically.\n\nThe language supports standard data types (numbers, strings, booleans, arrays, objects), control flow structures (if/else, loops), and functions with recursion and closures. It uses 1-based indexing by default and provides extensive array manipulation methods. ASF code is compiled and executed via an engine instance, enabling complex logic within Office environments while maintaining interoperability with existing VBA code.",
    "chinese_title": "VBA中的猴子补丁",
    "chinese_summary": "ASF（高级脚本框架）是一种嵌入VBA的类JavaScript脚本语言，旨在为Excel和Access等Office应用程序带来现代编程特性。它为Web开发者提供了熟悉的语法，包括面向对象编程、支持一等函数和闭包的函数式编程，以及map、filter和reduce等现代数组方法。\n\n关键特性包括用于字符串插值的模板字面量、正则表达式支持，以及与VBA的无缝集成。其显著能力是通过\"猴子补丁\"扩展COM对象，允许开发者动态修改或增强Office对象。\n\n该语言支持标准数据类型（数字、字符串、布尔值、数组、对象）、控制流结构（if/else、循环）以及支持递归和闭包的函数。默认采用基于1的索引，并提供丰富的数组操作方法。ASF代码通过引擎实例编译执行，可在Office环境中实现复杂逻辑，同时保持与现有VBA代码的互操作性。"
  },
  {
    "id": "47113892",
    "title": "Factory-built housing hasn't taken off in California",
    "url": "https://www.latimes.com/california/story/2026-02-14/factory-built-housing-hasnt-taken-off-in-california-yet-but-this-year-might-be-different",
    "summary": "Despite decades of predictions, factory-built housing has never become mainstream in the U.S., even as California faces a severe housing shortage. State lawmakers, led by Assemblymember Buffy Wicks, are now pushing to make 2026 a turning point, exploring policies to promote off-site construction as a way to reduce costs and speed up building.\n\nProponents argue that factory production can cut construction timelines by 10-50% and reduce hard costs by 10-25% through efficiency, bulk purchasing, and parallel work. However, major barriers persist. Factories require huge, steady demand to be profitable, which clashes with the project-by-project, boom-and-bust nature of real estate. High upfront costs and unfamiliarity make lenders and developers wary, a caution reinforced by high-profile failures like Katerra's bankruptcy. Labor unions are also divided on the issue.\n\nProposed state interventions focus on three areas: guaranteeing a pipeline of projects (e.g., for affordable housing or universities), providing public insurance against bankruptcy risks for factories and developers, and standardizing building codes to reduce local inspection delays. Ultimately, the success of factory-built housing may depend less on revolutionary assembly-line promises and more on broader reforms that simply make building easier and cheaper.",
    "chinese_title": "工厂预制房屋在加利福尼亚州尚未普及。",
    "chinese_summary": "尽管数十年来一直有预测，但工厂预制住房在美国从未成为主流，即便在加州面临严重住房短缺的当下也是如此。由州议员布菲·威克斯领导的立法者们正努力推动将2026年作为转折点，探索通过推广场外建筑来降低成本和加快建设的政策。\n\n支持者认为，工厂化生产能通过效率提升、批量采购和并行作业，将施工周期缩短10%-50%，并将硬性成本降低10%-25%。然而，重大障碍依然存在。工厂需要庞大且稳定的需求才能盈利，这与房地产行业按项目推进、周期起伏的特性相冲突。高昂的前期成本和行业陌生感令贷款方和开发商望而却步，卡泰拉公司破产等知名失败案例更强化了这种谨慎态度。劳工工会在此问题上也存在分歧。\n\n州政府提出的干预措施聚焦三个领域：保障项目来源（如经济适用房或大学建设项目）、为工厂和开发商提供公共保险以抵御破产风险，以及统一建筑规范以减少地方审查延误。归根结底，工厂预制住房的成功可能并不取决于革命性的流水线承诺，而更依赖于那些能让建筑变得更简单、更经济的系统性改革。"
  },
  {
    "id": "47104667",
    "title": "Show HN: Llama 3.1 70B on a single RTX 3090 via NVMe-to-GPU bypassing the CPU",
    "url": "https://github.com/xaskasdf/ntransformer",
    "summary": "This article introduces **NTransformer**, a high-efficiency C++/CUDA inference engine that enables running large language models like **Llama 3.1 70B** on a single consumer GPU (e.g., an RTX 3090 with 24GB VRAM). The core innovation is a **3-tier adaptive caching system** that streams model layers through GPU memory, system RAM, and NVMe storage, allowing models far larger than VRAM to run.\n\nKey features include:\n*   **SLEP Streaming:** A double-buffered pipeline that overlaps storage reads, PCIe data transfers, and GPU computation.\n*   **NVMe Direct I/O (Experimental):** A backend that can bypass the CPU entirely by performing GPU-initiated reads directly from an NVMe SSD, though this requires significant system modifications and carries hardware risks.\n*   **Layer Skipping:** Uses cosine similarity to identify and skip redundant layers, speeding up inference with minimal quality loss.\n*   **Self-Speculative Decoding:** Uses the VRAM-resident portion of the model as its own draft model.\n\nThe project is dependency-light (only CUDA Toolkit required) and supports GGUF model formats. While it achieves significant speedups (e.g., 83x over a baseline for a 70B model), the primary bottleneck remains PCIe bandwidth. The system setup for the advanced NVMe direct mode is complex, involves patching drivers and disabling security features like IOMMU, and carries warnings about potential hardware instability or data loss.",
    "chinese_title": "展示 HN：通过 NVMe 直连 GPU 绕过 CPU，在单张 RTX 3090 上运行 Llama 3.1 70B",
    "chinese_summary": "本文介绍了**NTransformer**，这是一款高效的C++/CUDA推理引擎，能够在单张消费级GPU（例如配备24GB显存的RTX 3090）上运行**Llama 3.1 70B**等大型语言模型。其核心创新在于**三层自适应缓存系统**，该系统通过GPU显存、系统内存和NVMe存储流式传输模型层，从而支持运行远超显存容量的模型。\n\n主要特性包括：\n*   **SLEP流式传输：** 采用双缓冲流水线，重叠存储读取、PCIe数据传输和GPU计算。\n*   **NVMe直接I/O（实验性）：** 该后端可通过GPU直接从NVMe SSD发起读取，完全绕过CPU，但这需要大量系统修改并存在硬件风险。\n*   **层跳过：** 利用余弦相似度识别并跳过冗余层，以最小质量损失加速推理。\n*   **自推测解码：** 使用模型驻留于显存的部分作为其自身的草稿模型。\n\n该项目依赖轻量（仅需CUDA工具包）并支持GGUF模型格式。虽然它实现了显著的加速（例如，对于70B模型比基线快83倍），但主要瓶颈仍是PCIe带宽。高级NVMe直接模式的系统设置复杂，涉及修补驱动程序和禁用IOMMU等安全功能，并存在潜在硬件不稳定或数据丢失的风险警告。"
  },
  {
    "id": "47046647",
    "title": "Show HN: Data Studio – Open-Source Data Notebooks",
    "url": "https://github.com/dataspren-analytics/data-studio",
    "summary": "**Data Studio** is an open-source data notebook application that runs entirely in the user's browser. It enables data exploration and visualization without requiring a backend server, cloud account, or data upload, keeping all information on the local machine.\n\nKey features include a multi-cell notebook interface supporting Python, SQL, and Markdown, with SQL cells automatically creating views for Python. Execution is handled in-browser via WebAssembly using Pyodide (Python) and DuckDB (SQL engine). The tool supports various file formats (CSV, Parquet, JSON, Excel) for upload and querying, includes built-in data validation, and provides visualization charts through ECharts. A notable feature is the ability to directly query and transform Excel files with SQL.\n\nThe project is ideal for quick data exploration, working with sensitive data that cannot leave the local environment, and offline analysis. Notebooks are saved in the standard Jupyter `.ipynb` format for sharing. The roadmap includes plans for external storage (e.g., S3 buckets) and AI-powered SQL functions.\n\nBuilt with Next.js, React, and Tailwind CSS, Data Studio can be run locally with Node.js/pnpm or via Docker. The project is open for contributions and licensed under MIT.",
    "chinese_title": "展示 HN：Data Studio – 开源数据笔记本",
    "chinese_summary": "**Data Studio** 是一款完全在用户浏览器中运行的开源数据笔记本应用。它支持数据探索和可视化，无需后端服务器、云账户或数据上传，所有信息均保留在本地机器上。\n\n主要功能包括支持 Python、SQL 和 Markdown 的多单元格笔记本界面，其中 SQL 单元格可自动为 Python 创建视图。执行通过浏览器内的 WebAssembly 使用 Pyodide（Python）和 DuckDB（SQL 引擎）处理。该工具支持多种文件格式（CSV、Parquet、JSON、Excel）上传和查询，内置数据验证功能，并通过 ECharts 提供可视化图表。一个显著特点是能够直接用 SQL 查询和转换 Excel 文件。\n\n该项目非常适合快速数据探索、处理不能离开本地环境的敏感数据以及离线分析。笔记本以标准的 Jupyter `.ipynb` 格式保存以便分享。未来规划包括支持外部存储（如 S3 存储桶）和基于 AI 的 SQL 功能。\n\nData Studio 基于 Next.js、React 和 Tailwind CSS 构建，可通过 Node.js/pnpm 在本地运行或通过 Docker 部署。项目开放贡献，采用 MIT 许可证。"
  },
  {
    "id": "47106686",
    "title": "How I use Claude Code: Separation of planning and execution",
    "url": "https://boristane.com/blog/how-i-use-claude-code/",
    "summary": "This article outlines a disciplined workflow for using Claude Code that separates planning from execution to produce better, more controlled results. The core principle is to never let Claude write code until a detailed, reviewed plan is in place.\n\nThe process has three main phases. First, **Research**: Claude is instructed to deeply understand the relevant codebase and document its findings in a persistent `research.md` file, preventing changes that break the surrounding system. Second, **Planning**: Claude creates a detailed `plan.md` file. The author then reviews and annotates this plan directly in the document, correcting assumptions and adding domain knowledge over several cycles. This \"annotation cycle\" is key for injecting human judgment. Before coding, a granular todo list is added to the plan for tracking.\n\nFinally, **Implementation**: With a single command, Claude executes the entire approved plan, marking off tasks as it goes. During this phase, the author provides only terse, corrective feedback. The entire workflow is run in a single, long session, with the plan document serving as a persistent, shared reference point.\n\nThe author emphasizes that this method keeps them in the driver's seat for architectural decisions, prevents wasted effort from wrong assumptions, and results in higher-quality implementations with minimal token usage.",
    "chinese_title": "我如何使用Claude Code：规划与执行的分离",
    "chinese_summary": "本文概述了一种使用Claude Code的严谨工作流程，通过将规划与执行分离来获得更好、更可控的结果。其核心原则是：在制定出详细且经过审核的计划之前，绝不让Claude编写代码。\n\n该流程包含三个主要阶段。首先是**研究阶段**：指导Claude深入理解相关代码库，并将其发现记录在持久的`research.md`文件中，以防止对周边系统造成破坏性更改。其次是**规划阶段**：Claude创建详细的`plan.md`文件。随后，作者直接在文档中审阅并批注该计划，经过多轮循环修正假设并补充领域知识。这种“批注循环”是注入人类判断的关键步骤。在编码之前，计划中会添加一份细粒度的待办事项列表以便追踪进度。\n\n最后是**实施阶段**：通过单一指令，Claude执行整个已批准的计划，并在此过程中逐一标记已完成的任务。在此阶段，作者仅提供简洁的纠正性反馈。整个工作流程在单个长时间会话中运行，计划文档作为持久且共享的参考点。\n\n作者强调，这种方法能确保其在架构决策中保持主导地位，避免因错误假设而浪费精力，并以最少的令牌使用量实现更高质量的代码实施。"
  },
  {
    "id": "47110946",
    "title": "Show HN: TLA+ Workbench skill for coding agents (compat. with Vercel skills CLI)",
    "url": "https://github.com/younes-io/agent-skills/tree/main/skills/tlaplus-workbench",
    "summary": "This article introduces a **TLA+ Workbench skill** for AI coding agents, compatible with the Vercel AI SDK's skills CLI. The skill, created by **younes-io**, is hosted in a public GitHub repository named `agent-skills`.\n\nThe core function of the skill is to enable AI agents to **create, edit, and verify TLA+ specifications**. TLA+ is a formal specification language used for designing, modeling, and verifying concurrent and distributed systems. The workbench provides a structured environment for this process, which is crucial for ensuring system correctness.\n\nKey capabilities of the skill include:\n*   **Specification Management**: Creating new TLA+ modules or editing existing ones.\n*   **Model Checking**: Running the TLA+ model checker (TLC) to verify specifications against defined properties.\n*   **Integration**: It is designed to be easily added to an AI agent's toolkit using the Vercel skills CLI (`vc skills add`), promoting a modular approach to extending agent functionality.\n\nIn summary, this tool bridges advanced formal methods (TLA+) with AI-assisted development, allowing coding agents to rigorously analyze and validate complex system designs programmatically.",
    "chinese_title": "展示 HN：适用于编码代理的 TLA+ 工作台技能（兼容 Vercel 技能 CLI）",
    "chinese_summary": "本文介绍了一项适用于AI编码代理的**TLA+ Workbench技能**，该技能兼容Vercel AI SDK的技能命令行工具。该技能由**younes-io**创建，托管于名为`agent-skills`的公开GitHub仓库中。\n\n该技能的核心功能是使AI代理能够**创建、编辑和验证TLA+规范**。TLA+是一种用于设计、建模和验证并发与分布式系统的形式化规范语言。该工作台为此过程提供了结构化环境，这对确保系统正确性至关重要。\n\n该技能的主要能力包括：\n*   **规范管理**：创建新的TLA+模块或编辑现有模块。\n*   **模型检验**：运行TLA+模型检验器（TLC）以根据定义的属性验证规范。\n*   **集成性**：可通过Vercel技能命令行工具（`vc skills add`）轻松添加到AI代理工具包中，支持以模块化方式扩展代理功能。\n\n总之，该工具将高级形式化方法（TLA+）与AI辅助开发相结合，使编码代理能够以编程方式严格分析和验证复杂的系统设计。"
  },
  {
    "id": "47107781",
    "title": "Japanese Woodblock Print Search",
    "url": "https://ukiyo-e.org/",
    "summary": "This article introduces **Ukiyo-e Search**, a comprehensive online database and search tool for Japanese woodblock prints. Its primary feature is the ability to search for prints by uploading an image or pasting a URL, allowing users to find visually similar works across multiple collections.\n\nThe database is extensive, containing **over 223,000 prints**. The article organizes the artists within a historical timeline of ukiyo-e, from the Early period (1700s) through the Golden Age, Popularization, Meiji Period, the Shin Hanga/Sosaku Hanga movements, and up to Modern and Contemporary works.\n\nIt highlights the most prolific artists in the database, such as **Utagawa Kunisada (37,275 prints), Utagawa Hiroshige (17,865), and Kitagawa Utamaro (3,372)**, providing a clear sense of the collection's scope and focus. The tool is presented as a dynamic resource, with plans for improved data, more images, and enhanced search features in the future.",
    "chinese_title": "日本木版画搜索",
    "chinese_summary": "本文介绍了**浮世绘搜索**，这是一个全面的日本木版画在线数据库和搜索工具。其主要功能是通过上传图片或粘贴网址来搜索版画，使用户能够在多个馆藏中找到视觉上相似的作品。\n\n该数据库规模庞大，收录了**超过22.3万幅版画**。文章将艺术家置于浮世绘的历史时间线中梳理，涵盖早期（18世纪）、黄金时代、普及期、明治时期、新版画与创作版画运动，直至现代与当代作品。\n\n文中重点介绍了数据库中作品最丰富的艺术家，如**歌川国贞（37,275幅）、歌川广重（17,865幅）和喜多川歌麿（3,372幅）**，清晰展现了该馆藏的规模与侧重点。该工具被定位为动态发展的资源，未来计划完善数据、扩充图像并增强搜索功能。"
  },
  {
    "id": "47100232",
    "title": "zclaw: personal AI assistant in under 888 KB, running on an ESP32",
    "url": "https://github.com/tnm/zclaw",
    "summary": "**zclaw** is a compact, open-source AI personal assistant designed specifically for ESP32 microcontrollers, with a strict firmware size limit of 888 KB. This cap includes the entire system: the assistant's logic, the ESP-IDF/FreeRTOS runtime, Wi-Fi, TLS cryptography, and certificate bundles.\n\nIts core features include natural language interaction via Telegram or a web relay, timezone-aware task scheduling, GPIO control with safety measures, persistent memory, and support for multiple AI providers (Anthropic, OpenAI, OpenRouter). It is tested on ESP32-C3, S3, and C6 boards, with the Seeed XIAO ESP32-C3 recommended for starters.\n\nDevelopment is streamlined with provided scripts for one-line setup, building, flashing, and provisioning credentials. The project emphasizes a fun, hackable experience for both practical automation and experimentation. The current firmware image is approximately 850 KB, well under its size constraint, with the app logic itself taking up only about 35 KB.",
    "chinese_title": "zclaw：个人AI助手，不足888KB，运行于ESP32平台",
    "chinese_summary": "**zclaw** 是一款专为 ESP32 微控制器设计的紧凑型开源 AI 个人助手，其固件大小严格限制在 888 KB 以内。此上限包含整个系统：助手逻辑、ESP-IDF/FreeRTOS 运行时、Wi-Fi、TLS 加密及证书包。\n\n其核心功能包括通过 Telegram 或网页中继的自然语言交互、支持时区的任务调度、带有安全措施的 GPIO 控制、持久化存储，以及多 AI 服务商支持（Anthropic、OpenAI、OpenRouter）。它已在 ESP32-C3、S3 和 C6 开发板上通过测试，推荐初学者使用 Seeed XIAO ESP32-C3。\n\n开发流程通过提供的脚本实现一键设置、构建、烧录和凭证配置，强调为实用自动化和实验提供有趣且可灵活修改的体验。当前固件映像约为 850 KB，远低于其大小限制，其中应用逻辑本身仅占约 35 KB。"
  },
  {
    "id": "47112892",
    "title": "Emulated Windows 3.11 in the Browser",
    "url": "https://pieter.com/",
    "summary": "This article presents an emulated version of Windows 3.11, the classic 1990s operating system, that runs directly in a web browser. Created by Pieter™ and based on work by @levelsio and @bai0, the project aims to recreate the nostalgic experience of using an early Windows PC with dial-up internet.\n\nThe core feature is a fully functional, interactive emulation that users can access online without installing any software. The provided text shows the detailed layout of an on-screen keyboard, indicating that the emulator is designed for direct interaction, mimicking the original system's interface and controls.\n\nThe project includes common emulator commands (like ESC for fullscreen and keyboard shortcuts) and invites user participation through links for help, ideas, and bug reporting. This suggests it is an ongoing, community-involved project meant for both retro computing enthusiasts and those curious about early personal computing history.",
    "chinese_title": "在浏览器中模拟Windows 3.11",
    "chinese_summary": "本文介绍了一个在网页浏览器中直接运行的Windows 3.11模拟版本，这款经典操作系统诞生于1990年代。该项目由Pieter™创建，基于@levelsio和@bai0的工作成果，旨在重现早期Windows电脑通过拨号上网使用的怀旧体验。\n\n其核心功能是一个完全可交互的在线模拟环境，用户无需安装任何软件即可访问。界面中展示了详细的屏幕键盘布局，表明模拟器旨在通过直接交互来模仿原始系统的界面与操作方式。\n\n该项目包含常见的模拟器指令（如ESC键切换全屏模式及键盘快捷键），并通过帮助、建议与错误报告链接鼓励用户参与。这暗示其为一个持续开发、社区共同参与的项目，既适合复古计算爱好者，也适合对早期个人计算机历史感兴趣的探索者。"
  }
]