[
  {
    "id": "47017138",
    "title": "Internet Increasingly Becoming Unarchivable",
    "url": "https://www.niemanlab.org/2026/01/news-publishers-limit-internet-archive-access-due-to-ai-scraping-concerns/",
    "summary": "In response to concerns that AI companies are using its archives as a source of free training data, major news publishers are increasingly limiting the Internet Archive's ability to crawl and preserve their content.\n\nPublishers like The Guardian, The New York Times, and Gannett (USA Today Co.) are taking steps to block the nonprofit's web crawlers. They fear the Archive's structured data and APIs provide an easy backdoor for AI firms to scrape copyrighted journalism. While supportive of the Archive's preservation mission, these outlets are prioritizing the protection of their intellectual property.\n\nThis creates a significant tension. The Internet Archive, through its Wayback Machine, is a crucial repository of the digital historical record. Its founder, Brewster Kahle, warns that limiting libraries undermines public access to information. However, evidence shows its archives have been used to train large language models, and it has previously faced server overloads from aggressive AI scraping.\n\nAn analysis of over 1,100 news sites' robots.txt files found that 241 explicitly block at least one Internet Archive bot, with Gannett-owned sites leading this trend. Nearly all of these sites also block crawlers from AI firms like OpenAI and other data collectors like Common Crawl.\n\nThe trend highlights a collateral dilemma: in safeguarding content from commercial AI, publishers are inadvertently making the modern web less archivable, potentially erasing a vital public record.",
    "chinese_title": "互联网日益变得难以存档。",
    "chinese_summary": "针对人工智能公司利用其档案作为免费训练数据来源的担忧，主要新闻出版商正日益限制互联网档案馆对其内容的抓取和保存能力。\n\n《卫报》《纽约时报》和甘尼特（《今日美国》母公司）等出版商正采取措施屏蔽这家非营利机构的网络爬虫。他们担心档案馆的结构化数据和应用程序接口为人工智能公司抓取受版权保护的新闻内容提供了便捷后门。尽管支持档案馆的保存使命，但这些媒体机构仍将保护知识产权置于优先位置。\n\n这引发了显著矛盾。互联网档案馆通过其“时光机”服务，是数字历史记录的关键存储库。其创始人布鲁斯特·卡勒警告称，限制图书馆将损害公众获取信息的权利。然而，有证据表明其档案已被用于训练大语言模型，且该机构此前曾因人工智能公司的过度抓取导致服务器超载。\n\n对超过1100家新闻网站robots.txt文件的分析显示，有241家明确屏蔽至少一个互联网档案馆爬虫，其中甘尼特旗下网站在此趋势中领先。几乎所有相关网站也同时屏蔽了OpenAI等人工智能公司及Common Crawl等数据收集机构的爬虫。\n\n这一趋势凸显出连带困境：在保护内容免受商业人工智能利用的同时，出版商无意中降低了现代网络的可归档性，可能导致重要公共记录的永久消失。"
  },
  {
    "id": "47017682",
    "title": "Gemini 3 Deep Think drew me a good SVG of a pelican riding a bicycle",
    "url": "https://simonwillison.net/2026/Feb/12/gemini-3-deep-think/",
    "summary": "The author tested Google's new Gemini 3 Deep Think AI model by asking it to generate an SVG image of a pelican riding a bicycle. They were impressed with the result, calling it the best version they had seen compared to previous attempts from other AI models.\n\nEncouraged by this success, they then gave the AI a more detailed and challenging prompt. This second request specified a California brown pelican in full breeding plumage, with visible feathers and its characteristic throat pouch, clearly pedaling a bicycle with accurate spokes and frame geometry.\n\nThe article notes that the author received a successful output for this complex request. It also references their established interest in this specific, whimsical image concept by linking to both a prior collection of similar AI-generated images and a related FAQ.",
    "chinese_title": "双子座3号深度思考为我画了一幅很好的鹈鹕骑自行车的SVG图。",
    "chinese_summary": "作者通过让谷歌新推出的Gemini 3 Deep Think AI模型生成一幅鹈鹕骑自行车的SVG图像来测试其性能。他们对生成结果印象深刻，认为与其他AI模型之前的尝试相比，这是目前看到的最佳版本。\n\n受此成功的鼓舞，他们随后向AI提出了一个更详细、更具挑战性的指令。第二个要求具体描述了一只处于完整繁殖羽状态的加州褐鹈鹕，需清晰展现羽毛特征和标志性的喉囊，并准确描绘出它蹬骑自行车的动作，包括精确的自行车辐条和车架几何结构。\n\n文章指出，作者这一复杂请求最终获得了成功的输出结果。文中还通过链接至先前一系列类似的AI生成图像集及相关问答，提及了作者长期以来对这一奇幻图像概念的持续兴趣。"
  },
  {
    "id": "47016443",
    "title": "uBlock filter list to hide all YouTube Shorts",
    "url": "https://github.com/i5heu/ublock-hide-yt-shorts/",
    "summary": "This article provides a uBlock Origin filter list designed to completely hide YouTube Shorts videos from the platform's interface. The primary resource is a maintained list hosted on GitHub, which users can subscribe to by pasting the provided URL into the uBlock Origin dashboard under the \"Filter Lists\" section.\n\nA secondary, optional filter list is also offered to hide YouTube comments. The article notes that the original creator is no longer active and that the project is now maintained by a user named i5heu. It explicitly states that this is an independent, open-source project with no affiliation to Alphabet, Google, or YouTube. Readers are directed to the project's GitHub repository for information on contributing and the license details.",
    "chinese_title": "屏蔽所有YouTube短片的uBlock过滤列表",
    "chinese_summary": "本文提供了一个uBlock Origin过滤器列表，旨在完全隐藏YouTube Shorts视频在平台界面中的显示。主要资源是一个托管在GitHub上的维护列表，用户可通过将提供的URL粘贴到uBlock Origin仪表板的“过滤器列表”部分进行订阅。\n\n此外，还提供了一个可选的次要过滤器列表，用于隐藏YouTube评论。文章指出，原始创建者已不再活跃，该项目现由名为i5heu的用户维护。文中明确说明这是一个独立的开源项目，与Alphabet、Google或YouTube无关。读者可前往该项目的GitHub仓库了解贡献方式和许可证详情。"
  },
  {
    "id": "47017545",
    "title": "Descent, Ported to the Web",
    "url": "https://mrdoob.github.io/three-descent/",
    "summary": "This article discusses the process and significance of porting the classic 1995 first-person shooter game *Descent* to modern web browsers. The original game, known for its pioneering 3D graphics and six-degrees-of-freedom flight mechanics, is made playable online through the use of advanced web technologies.\n\nThe key technical achievement is the use of **Emscripten**, a toolchain that compiles the original C++ game code into **WebAssembly**. This allows the complex game logic and rendering to run at near-native speed directly within a web browser, without requiring plugins or downloads. The port also utilizes **WebGL** for hardware-accelerated 3D graphics, replicating the visual experience of the original.\n\nThe article highlights the broader implications of this project. It demonstrates the powerful capabilities of the modern web platform for **software preservation**, making historically important games accessible to new audiences with minimal friction. Furthermore, it serves as a case study in **retro game emulation and porting**, showing how legacy software can be given a new life on contemporary systems.\n\nIn summary, the web port of *Descent* is a technical feat that preserves a landmark game and showcases the web's potential as a viable platform for running complex, legacy applications.",
    "chinese_title": "《血祭》移植至网页版",
    "chinese_summary": "本文探讨了将1995年经典第一人称射击游戏《Descent》移植至现代网络浏览器的过程与意义。这款以开创性3D画面和六自由度飞行机制闻名的原作，通过先进的网络技术得以在线上运行。\n\n此次移植的核心技术成就在于运用**Emscripten**工具链，将原版C++游戏代码编译为**WebAssembly**，使复杂的游戏逻辑与渲染能以接近原生的速度直接在浏览器中运行，无需插件或下载。同时，移植版本采用**WebGL**实现硬件加速的3D图形渲染，还原了原作的视觉体验。\n\n文章强调了该项目的深远影响：它展现了现代网络平台在**软件保存**方面的强大能力，让具有历史意义的游戏能以极低门槛触达新世代玩家；同时，项目也为**复古游戏模拟与移植**提供了范例，展示了如何让遗留软件在当代系统中重获新生。\n\n总之，《Descent》的网络移植版不仅是一项保存里程碑游戏的技术壮举，更证明了网络作为运行复杂遗留应用程序平台的巨大潜力。"
  },
  {
    "id": "47017727",
    "title": "You can't trust the internet anymore",
    "url": "https://nicole.express/2026/not-my-casual-hobby.html",
    "summary": "In this blog post, the author laments the proliferation of AI-generated misinformation on the internet, using a personal example to illustrate the problem.\n\nWhile researching the obscure 1994 Sega Genesis game *Phantasy Star Fukkokuban*—a re-release of the original Master System title—the author encountered an article from an unfamiliar website. This article falsely claimed the game featured updated graphics, weather effects, and day-night cycles. Recognizing this as a hallucination typical of large language models (LLMs), the author confirmed their suspicion by querying ChatGPT, which also provided incorrect information.\n\nThe post argues that LLMs, when generating content on obscure topics with limited training data, often produce plausible-sounding but fabricated details. This practice is exploited by low-quality \"SEO-monger\" websites that use AI to mass-produce content for ad revenue, with no regard for accuracy. While such misinformation predates AI, the technology has drastically increased its scale and ease of production.\n\nThe author concludes that the internet's \"commons\" of reliable information is being degraded, forcing readers to rely only on trusted, pre-LLM sources. They note this is not the worst consequence of the AI boom but is a significant shame for those seeking to learn genuine new information online.",
    "chinese_title": "你再也不能相信互联网了。",
    "chinese_summary": "在这篇博客文章中，作者哀叹了互联网上人工智能生成错误信息的泛滥，并以个人经历为例说明了这一问题。\n\n作者在研究冷门的1994年世嘉Genesis游戏《梦幻之星复刻版》——即原版Master System游戏的再发行版本时，偶然看到一篇来自陌生网站的文章。该文章错误地声称这款游戏拥有升级后的图像、天气效果和昼夜循环系统。作者意识到这很可能是大语言模型典型的“幻觉”现象，并通过查询ChatGPT证实了这一猜测——后者同样提供了错误信息。\n\n文章指出，大语言模型在训练数据有限的冷门话题上生成内容时，常常会编造出听起来合理实则虚构的细节。这种做法被低质量的“SEO投机者”网站利用，它们通过人工智能批量生产内容以获取广告收益，完全不顾信息准确性。虽然这类错误信息在人工智能出现前就已存在，但该技术极大提升了其生产规模和便利性。\n\n作者总结道，互联网上可靠信息的“公共资源”正在遭到侵蚀，迫使读者只能依赖人工智能时代前就已可信的信息源。他们指出，这虽非人工智能热潮最严重的后果，但对于那些试图在网上获取真实新知的人来说，无疑是巨大的遗憾。"
  },
  {
    "id": "47015294",
    "title": "My smart sleep mask broadcasts users' brainwaves to an open MQTT broker",
    "url": "https://aimilios.bearblog.dev/reverse-engineering-sleep-mask/",
    "summary": "This article details a significant security vulnerability discovered in a smart sleep mask from a Chinese company. The author, attempting to build a custom control interface, used an AI assistant to reverse-engineer the device.\n\nThe investigation revealed that the mask's official Android app contained hardcoded login credentials for the company's central MQTT message broker. Using these credentials, the author connected to the broker and discovered they could access real-time data from approximately 25 active devices worldwide, including the brainwave (EEG) readings of other sleep mask users.\n\nMore alarmingly, because the system used a shared, open broker, the same access allowed for sending commands *to* any connected device. This meant the author could theoretically remotely activate features like Electrical Muscle Stimulation (EMS) around a stranger's eyes while they slept.\n\nThe core security failures were the use of universal hardcoded credentials and an improperly secured MQTT server, allowing anyone with those credentials to both spy on and control all user devices. The author has anonymously disclosed the issue to the manufacturer. The case serves as a stark warning about the privacy and safety risks in poorly secured Internet of Things (IoT) products.",
    "chinese_title": "我的智能睡眠面具将用户的脑电波广播至开放的MQTT代理服务器。",
    "chinese_summary": "本文详述了一家中国公司智能睡眠眼罩中发现的一个重大安全漏洞。作者试图构建自定义控制界面，使用人工智能助手对该设备进行了逆向工程。\n\n调查发现，该眼罩的官方安卓应用程序中硬编码了公司中央MQTT消息代理的登录凭证。利用这些凭证，作者连接到代理服务器，发现可以访问全球约25台活跃设备的实时数据，包括其他睡眠眼罩用户的脑电波（EEG）读数。\n\n更令人担忧的是，由于系统使用了共享的开放式代理，相同的访问权限允许向任何已连接的设备发送指令。这意味着作者理论上可以在陌生人睡觉时，远程激活其眼周的电肌肉刺激（EMS）等功能。\n\n核心安全漏洞在于使用了通用的硬编码凭证以及未妥善保护的MQTT服务器，使得任何获得这些凭证的人都能监视和控制所有用户设备。作者已匿名向制造商披露了该问题。此案例为安全性薄弱的物联网产品所面临的隐私与安全风险敲响了警钟。"
  },
  {
    "id": "47014449",
    "title": "Ooh.directory: a place to find good blogs that interest you",
    "url": "https://ooh.directory/",
    "summary": "**Summary of Ooh.directory**\n\nOoh.directory is a curated, human-edited directory designed to help users discover interesting and high-quality personal blogs. It organizes blogs into thematic categories—such as Arts and Media, Computers/Tech, Personal Blogs, Science, and Society—each showing the number of listed blogs. The site emphasizes \"good blogs,\" focusing on independent, voice-driven writing rather than commercial sites.\n\nKey features include:\n*   **Categorization:** Blogs are sorted into intuitive topics for easy browsing.\n*   **Freshness Indicators:** It highlights recently added or updated blogs and marks blog anniversaries (e.g., \"Four years old today!\").\n*   **Blog Previews:** Each listing includes a brief description, author/name, country flag, and a \"More info\" link, with snippets from recent posts.\n*   **Curated Vibe:** The selections, like \"Split Lip Magazine\" which loves \"voice-driven writing,\" reflect a preference for authentic, personal content over generic sites.\n\nIn essence, Ooh.directory acts as a discovery engine and curated showcase for the independent web, helping readers find blogs with distinct voices and sustained passion.",
    "chinese_title": "Ooh.directory：一个发现你感兴趣的好博客的地方",
    "chinese_summary": "**Ooh.directory 简介**\n\nOoh.directory 是一个精心策划、人工编辑的目录网站，旨在帮助用户发现有趣且高质量的个人博客。它将博客按主题分类——如艺术与媒体、计算机/科技、个人博客、科学和社会等——每个类别都显示收录的博客数量。该网站强调“优质博客”，重点关注独立、有个人声音的写作，而非商业网站。\n\n主要特点包括：\n*   **分类清晰：** 博客按直观主题分类，便于浏览。\n*   **新鲜度提示：** 突出显示最近新增或更新的博客，并标记博客周年纪念（例如，“今天满四岁！”）。\n*   **博客预览：** 每个列表包含简短描述、作者/名称、国旗图标和“更多信息”链接，并附有近期文章片段。\n*   **精选风格：** 其选择（例如偏爱“有个人声音的写作”的《Split Lip Magazine》）体现了对真实、个人化内容的偏好，而非普通网站。\n\n本质上，Ooh.directory 充当了独立网络的发现引擎和精选展示平台，帮助读者找到那些具有独特声音和持久热情的博客。"
  },
  {
    "id": "47016008",
    "title": "Amsterdam Compiler Kit",
    "url": "https://github.com/davidgiven/ack",
    "summary": "The Amsterdam Compiler Kit (ACK) is a complete, multi-language compiler toolchain originally developed at the Vrije Universiteit Amsterdam. It includes front-end compilers for ANSI C, Pascal, Modula-2, and Basic, along with code generators and support libraries to produce executables for a wide range of historical and modern platforms, such as CP/M, MS-DOS, Linux (on x86, 68k, MIPS, and PowerPC), and classic systems like PDP-11 V7 Unix.\n\nInstallation requires standard development tools (ANSI C compiler, flex, yacc, GNU make, Lua with posix, Python 3.4+) and is managed via a Makefile. The main `ack` command automatically selects the language based on file extension and supports cross-compilation to different targets using the `-m` flag.\n\nWhile mature, the ACK's library support is limited (roughly ANSI C level), it uses its own object file format, and some legacy components in the distribution may not build. Users are encouraged to join the project's mailing list for support and to report issues. The software is released under a BSD-like license.",
    "chinese_title": "阿姆斯特丹编译器套件",
    "chinese_summary": "阿姆斯特丹编译器套件（ACK）是一个完整的多语言编译器工具链，最初由阿姆斯特丹自由大学开发。它包含针对ANSI C、Pascal、Modula-2和Basic的前端编译器，以及代码生成器和支持库，能够为广泛的历史和现代平台生成可执行文件，例如CP/M、MS-DOS、Linux（支持x86、68k、MIPS和PowerPC架构）以及PDP-11 V7 Unix等经典系统。\n\n安装需要标准开发工具（ANSI C编译器、flex、yacc、GNU make、支持posix的Lua、Python 3.4+），并通过Makefile进行管理。主命令`ack`会根据文件扩展名自动选择语言，并支持使用`-m`标志进行跨平台编译。\n\n尽管ACK已相当成熟，但其库支持有限（大致符合ANSI C标准），使用自有的目标文件格式，且发行版中的某些遗留组件可能无法编译。建议用户加入项目邮件列表以获取支持并报告问题。该软件采用类BSD许可证发布。"
  },
  {
    "id": "47016530",
    "title": "A header-only C vector database library",
    "url": "https://github.com/abdimoallim/vdb",
    "summary": "vdb is a lightweight, header-only C library for building and querying vector databases. It stores high-dimensional vector embeddings and supports nearest-neighbor searches using cosine, Euclidean, or dot product distance metrics.\n\nKey features include its single-file (`vdb.h`) design with no dependencies, optional multithreading support (enabled via a compile-time flag), and the ability to save/load databases to disk. The API provides functions for creating a database, adding/removing vectors with optional IDs and metadata, and performing k-NN searches.\n\nThe library allows for custom memory allocators and, when multithreading is enabled, uses read-write locks to allow concurrent searches while making add/remove operations exclusive. It uses a custom binary file format for persistence, though metadata is not saved. The project is released under the Apache 2.0 license.",
    "chinese_title": "一个仅包含头文件的C向量数据库库",
    "chinese_summary": "vdb是一个轻量级、仅头文件的C语言库，用于构建和查询向量数据库。它存储高维向量嵌入，并支持使用余弦距离、欧氏距离或点积距离度量进行最近邻搜索。\n\n核心特性包括：采用无依赖的单文件设计（`vdb.h`），支持通过编译时标志启用可选的多线程功能，以及能够将数据库保存到磁盘或从磁盘加载。API提供了创建数据库、添加/删除带可选ID和元数据的向量，以及执行k近邻搜索的函数。\n\n该库支持自定义内存分配器，并在启用多线程时使用读写锁，以实现并发搜索的同时使添加/删除操作互斥。它采用自定义二进制文件格式实现数据持久化，但元数据不会被保存。项目基于Apache 2.0许可证发布。"
  },
  {
    "id": "46965462",
    "title": "Fun with Algebraic Effects – From Toy Examples to Hardcaml Simulations",
    "url": "https://blog.janestreet.com/fun-with-algebraic-effects-hardcaml/",
    "summary": "This article discusses the transition from using monads to algebraic effects in OCaml 5, particularly within Jane Street's Hardcaml simulation library. It highlights two main drawbacks of monads: they complicate code readability by requiring pervasive syntactic sugar and special library functions, and they hinder the use of advanced OCaml features like unboxed types and the local mode.\n\nAlgebraic effects offer a more elegant alternative by allowing computations to suspend and yield control to a handler, which can then resume execution. This eliminates the need for monadic wrappers, resulting in cleaner, more straightforward code. The article provides a simple example of an effect-based computation for basic arithmetic operations and contrasts it with a monadic approach.\n\nThe core application is in Hardcaml simulations for FPGA design, where effects manage the synchronization between digital circuits and testbench threads. This demonstrates the versatility of algebraic effects beyond their original purpose for concurrency, showcasing their ability to simplify complex, stateful interactions in a way that monads cannot.",
    "chinese_title": "代数效应的趣味之旅——从玩具示例到Hardcaml仿真",
    "chinese_summary": "本文探讨了在OCaml 5中从使用单子（monads）转向代数效应（algebraic effects）的过程，特别是在Jane Street的Hardcaml仿真库中的应用。文章指出单子的两个主要缺点：它们通过需要普遍使用的语法糖和特殊库函数使代码可读性变得复杂，并且阻碍了未装箱类型（unboxed types）和局部模式（local mode）等高级OCaml特性的使用。\n\n代数效应提供了一种更优雅的替代方案，允许计算暂停并将控制权交给处理器（handler），然后处理器可以恢复执行。这消除了对单子包装器的需求，从而产生了更简洁、更直接的代码。文章通过一个基于效应的基本算术运算计算示例，并与单子方法进行了对比。\n\n核心应用在于Hardcaml的FPGA设计仿真中，其中效应管理数字电路与测试平台线程之间的同步。这展示了代数效应在并发原始目的之外的多样性，突显了其以单子无法实现的方式简化复杂、有状态交互的能力。"
  },
  {
    "id": "47014500",
    "title": "Show HN: Sameshi – a ~1200 Elo chess engine that fits within 2KB",
    "url": "https://github.com/datavorous/sameshi",
    "summary": "This article introduces **Sameshi**, a minimalist chess engine designed to fit within a 2KB file size. The core code is contained in a single 1.95 KB header file (`sameshi.h`).\n\nThe engine implements fundamental chess AI components, including a 120-cell mailbox board representation, a negamax search with alpha-beta pruning, and a basic material-only evaluation function. It performs full legal move validation for check, mate, and stalemate, with capture-first move ordering to improve search efficiency.\n\nHowever, Sameshi is a **constrained subset** of chess. Notably, it does **not** implement castling, en passant, pawn promotion, threefold repetition, or the 50-move rule.\n\nDespite these limitations and a fixed search depth of 5 plies (with a maximum game length of 60 plies), the engine achieves an estimated playing strength of **~1170 Elo**. This rating, with a 95% confidence interval of 1110-1225, was derived from 240 test games against various skill levels of Stockfish.",
    "chinese_title": "展示 HN：Sameshi——一个约1200等级分的国际象棋引擎，仅占用2KB空间",
    "chinese_summary": "本文介绍了一款名为**Sameshi**的极简国际象棋引擎，其设计目标是将文件大小控制在2KB以内。核心代码仅包含在一个1.95 KB的头文件（`sameshi.h`）中。\n\n该引擎实现了国际象棋AI的基本组件，包括基于120格邮箱模型的棋盘表示、带α-β剪枝的负极大值搜索算法，以及仅考虑子力价值的基础评估函数。它支持完整的合法走子验证（包括将军、将死和逼和检测），并通过优先搜索吃子走子来提升搜索效率。\n\n但Sameshi是国际象棋的**受限子集**：它**未实现**王车易位、吃过路兵、兵升变、三次重复局面规则和五十步规则。\n\n尽管存在这些限制，且搜索深度固定为5层（最大对局长度为60步），该引擎仍达到了约**1170 Elo**的预估棋力评级。此评级（95%置信区间为1110-1225）是通过与不同水平Stockfish引擎进行的240局测试对局得出的。"
  },
  {
    "id": "47016058",
    "title": "Show HN: Arcmark – macOS bookmark manager that attaches to browser as sidebar",
    "url": "https://github.com/Geek-1001/arcmark",
    "summary": "Arcmark is a native macOS bookmark manager that attaches to any browser window (like Chrome, Safari, or Arc) as a sidebar, providing instant access to bookmarks without switching apps. Inspired by the Arc browser's sidebar, it allows users to organize bookmarks into multiple, color-coded workspaces with nested folders, supporting drag-and-drop reorganization and inline editing.\n\nThe app is local-first, storing all data in a single JSON file. Key features include automatic attachment to browser windows (requiring macOS accessibility permissions), an always-on-top mode, and the ability to import bookmarks directly from the Arc browser. It can also function as a standalone window if preferred.\n\nAvailable for macOS 13.0+, Arcmark can be downloaded as a DMG from its release page. The project is open-source (MIT licensed), built with Swift and AppKit, and can be compiled from source using Swift 6.2 and swift-bundler.",
    "chinese_title": "Show HN: Arcmark – 一款可侧边栏形式附加到浏览器的macOS书签管理器",
    "chinese_summary": "Arcmark是一款原生macOS书签管理器，它能以侧边栏形式附着在任何浏览器窗口（如Chrome、Safari或Arc）旁，无需切换应用即可快速访问书签。其设计灵感源自Arc浏览器的侧边栏，支持用户将书签按颜色标记的多个工作空间进行分类，并采用嵌套文件夹结构，同时提供拖拽重组和行内编辑功能。\n\n该应用采用本地优先架构，将所有数据存储于单一JSON文件中。核心功能包括自动附着浏览器窗口（需macOS辅助功能权限）、置顶显示模式，以及直接从Arc浏览器导入书签的能力。用户也可选择将其作为独立窗口使用。\n\nArcmark支持macOS 13.0及以上系统，可通过发布页面的DMG文件下载。该项目为开源（MIT许可证），基于Swift和AppKit构建，可使用Swift 6.2和swift-bundler从源码编译。"
  },
  {
    "id": "47015330",
    "title": "Vim 9.2 Released",
    "url": "https://www.vim.org/vim-9.2-released.php",
    "summary": "Vim 9.2 introduces significant enhancements across several areas. Key improvements include advanced completion features with fuzzy matching and register-based word completion, alongside a new interactive tutor plugin for learning. The Vim9 scripting language gains native support for enums, generics, and tuples.\n\nThe diff mode is substantially upgraded with a \"linematch\" algorithm for better alignment and inline highlighting options for granular change visualization. Platform support is modernized with full Wayland UI and clipboard integration, adherence to XDG Base Directory on Unix-like systems, and native dark mode for the Windows GUI.\n\nSeveral default settings have been updated for modern workflows, such as increased history limits and enabling the ruler by default. The release also highlights the maturity of Vim9 script through AI-assisted plugin development examples.\n\nFinally, the announcement notes the transition of Vim's charity support from the dissolved ICCF Holland to its new partner, Kuwasha, ensuring the continuation of aid for children in Uganda.",
    "chinese_title": "Vim 9.2 版本发布",
    "chinese_summary": "Vim 9.2 在多个领域引入了显著增强。主要改进包括支持模糊匹配和基于寄存器的单词补全的高级完成功能，以及一个用于学习的新交互式教程插件。Vim9 脚本语言新增对枚举、泛型和元组的原生支持。\n\n差异模式通过“linematch”算法大幅升级，以实现更好的对齐效果，并提供内联高亮选项以精细可视化变更。平台支持实现现代化，包括完整的 Wayland 用户界面和剪贴板集成、在类 Unix 系统上遵循 XDG 基础目录规范，以及为 Windows 图形界面提供原生深色模式。\n\n多项默认设置已针对现代工作流程进行更新，例如增加历史记录限制和默认启用标尺。此版本还通过 AI 辅助插件开发示例，凸显了 Vim9 脚本的成熟度。\n\n最后，公告指出 Vim 的慈善支持已从已解散的 ICCF Holland 转移至其新合作伙伴 Kuwasha，以确保对乌干达儿童的援助得以延续。"
  },
  {
    "id": "46968641",
    "title": "Windows NT/OS2 Design Workbook",
    "url": "https://computernewb.com/~lily/files/Documents/NTDesignWorkbook/",
    "summary": "This is an index of the **Windows NT/OS2 Design Workbook**, a collection of internal Microsoft design documents detailing the architecture of the Windows NT operating system. The files, dated May 27, 2022, cover a comprehensive range of core NT subsystems and components.\n\nKey topics documented include:\n*   **Kernel & Executive:** Kernel (KE), Executive Support, Processes/Threads (PROC), Object Manager (OB), and Synchronization (MUTANT, SEM).\n*   **I/O & Drivers:** I/O Manager (IO), Driver Design (DD), I/O Request Packets (IRP), and File Systems (FSDESIGN, FSRTL).\n*   **Memory & Cache:** Virtual Memory (VM, VMDESIGN) and Cache Manager.\n*   **Inter-process Communication:** Local Procedure Call (LPC), Mailslots, and Named Pipes.\n*   **System Mechanisms:** Asynchronous Procedure Calls (APC), Exceptions, Alerts, Startup, and Timers.\n*   **Support & Libraries:** Support Routines, User Library Code, and the NT Design Run-Time Library (NTDESRTL).\n*   **Compatibility:** Specific documentation for OS/2 subsystem support.\n*   **File Formats:** Details on the Common Object File Format (COFF).\n\nThe workbook provides foundational design specifications for developers working on the NT kernel, drivers, and core system services, offering deep technical insight into the operating system's internal structure.",
    "chinese_title": "Windows NT/OS2 设计工作手册",
    "chinese_summary": "这是 **Windows NT/OS2 设计工作手册** 的索引，该手册是一系列微软内部设计文档的合集，详细阐述了 Windows NT 操作系统的架构。这些文件日期为 2022 年 5 月 27 日，涵盖了 NT 核心子系统与组件的广泛内容。\n\n文档记录的关键主题包括：\n*   **内核与执行体：** 内核 (KE)、执行体支持、进程/线程 (PROC)、对象管理器 (OB) 以及同步机制 (MUTANT, SEM)。\n*   **I/O 与驱动程序：** I/O 管理器 (IO)、驱动程序设计 (DD)、I/O 请求包 (IRP) 以及文件系统 (FSDESIGN, FSRTL)。\n*   **内存与缓存：** 虚拟内存 (VM, VMDESIGN) 和缓存管理器。\n*   **进程间通信：** 本地过程调用 (LPC)、邮件槽和命名管道。\n*   **系统机制：** 异步过程调用 (APC)、异常、警报、启动和计时器。\n*   **支持与库：** 支持例程、用户库代码以及 NT 设计运行时库 (NTDESRTL)。\n*   **兼容性：** 针对 OS/2 子系统支持的具体文档。\n*   **文件格式：** 关于通用对象文件格式 (COFF) 的详细信息。\n\n该工作手册为从事 NT 内核、驱动程序及核心系统服务开发的工程师提供了基础性的设计规范，深入揭示了操作系统的内部结构。"
  },
  {
    "id": "47012717",
    "title": "Zig – io_uring and Grand Central Dispatch std.Io implementations landed",
    "url": "https://ziglang.org/devlog/2026/#2026-02-13",
    "summary": "This Zig devlog from February 2026 highlights three major developments:\n\n1.  **New I/O Implementations:** The `std.Io.Evented` module now includes experimental `io_uring` (Linux) and Grand Central Dispatch (macOS) backends. These use \"fibers\" or green threads, allowing developers to swap I/O implementations (e.g., between threaded and evented) with minimal code changes. The feature is still in development, requiring better error handling, performance optimization, and more testing.\n\n2.  **Package Management Enhancements:**\n    *   **Local `zig-pkg` Directory:** Dependencies are now stored locally in a `zig-pkg` folder within the project, making it easier to inspect, edit, and create self-contained source distributions. A compressed copy is still cached globally.\n    *   **`--fork` Flag:** A new `zig build --fork=[path]` command allows temporary overriding of specific dependencies with local source checkouts, streamlining the workflow for testing fixes or modifications to upstream packages.\n\n3.  **Windows Native API Usage:** The standard library is increasingly bypassing higher-level Win32 APIs (like those in `kernel32.dll`) in favor of lower-level, more robust Native APIs (from `ntdll.dll`). Examples show this improves reliability and performance for system operations like generating entropy and performing file I/O, providing better error handling and resource management.",
    "chinese_title": "Zig – io_uring与Grand Central Dispatch的std.Io实现已正式落地",
    "chinese_summary": "这份2026年2月的Zig开发日志重点介绍了三大进展：\n\n1.  **全新I/O实现**：`std.Io.Evented`模块现已包含实验性的`io_uring`（Linux）和Grand Central Dispatch（macOS）后端。这些后端采用“纤程”或绿色线程技术，使开发者能够以最少的代码改动切换I/O实现（例如在线程模型与事件驱动模型之间切换）。该功能仍在开发中，需要改进错误处理、性能优化并增加测试覆盖。\n\n2.  **包管理功能增强**：\n    *   **本地`zig-pkg`目录**：依赖项现存储在项目内的`zig-pkg`文件夹中，便于检查、编辑及创建自包含的源码分发。全局缓存中仍保留压缩副本。\n    *   **`--fork`标志**：新增的`zig build --fork=[路径]`命令允许用本地源码临时覆盖特定依赖项，简化了测试上游软件包修复或修改的工作流程。\n\n3.  **Windows原生API应用**：标准库正逐步绕过高层Win32 API（如`kernel32.dll`中的接口），转而采用更底层、更稳健的原生API（来自`ntdll.dll`）。实际案例表明，这在生成随机熵和执行文件I/O等系统操作中提升了可靠性与性能，同时提供了更完善的错误处理和资源管理。"
  },
  {
    "id": "47014405",
    "title": "How many registers does an x86-64 CPU have? (2020)",
    "url": "https://blog.yossarian.net/2020/11/30/How-many-registers-does-an-x86-64-cpu-have",
    "summary": "This article explores the complex question of how many registers an x86-64 CPU has, establishing specific counting rules to navigate the architecture's layered history. It systematically tallies registers across several categories.\n\nThe count begins with 16 general-purpose registers (GPRs like RAX), which, due to backward compatibility, fan out into 68 total registers when including their 32-, 16-, and 8-bit sub-registers. To these, it adds special registers (RIP, RFLAGS), segment registers, and various groups for floating-point (x87), SIMD (MMX, SSE, AVX), debugging, bounds checking (MPX), and system control.\n\nA significant portion comes from Model-Specific Registers (MSRs), which are accessed indirectly. While architectural MSR identifiers go up to over 6000, many are reserved or undocumented. The article also notes registers like Memory-Type Range Registers (MTRRs) that are shared across CPU cores.\n\nApplying its methodology, the running count reaches over 156 unique, directly-addressable architectural registers before even fully accounting for the thousands of MSRs and core-shared registers. The final takeaway is that there is no single simple number; the total is context-dependent and very large, reflecting the x86-64 ISA's exceptional complexity and evolutionary legacy.",
    "chinese_title": "x86-64 CPU有多少个寄存器？(2020年)",
    "chinese_summary": "本文探讨了x86-64 CPU究竟有多少寄存器这一复杂问题，通过建立具体的计数规则来梳理该架构的层次化历史脉络，并系统性地对多个类别的寄存器进行了统计。\n\n统计从16个通用寄存器（如RAX）开始，由于向后兼容性，当包含其32位、16位和8位子寄存器时，总数扩展至68个。在此基础上，又增加了特殊寄存器（RIP、RFLAGS）、段寄存器，以及浮点运算（x87）、SIMD（MMX、SSE、AVX）、调试、边界检查（MPX）和系统控制等多个专用寄存器组。\n\n其中占比较大的是通过间接方式访问的模型特定寄存器（MSR）。虽然架构定义的MSR标识符超过6000个，但许多是保留或未公开的。文章还提及了如内存类型范围寄存器（MTRR）这类在CPU核心间共享的寄存器。\n\n采用文中的统计方法，在尚未完全计入数千个MSR和核心共享寄存器的情况下，可直接寻址的独立架构寄存器数量已超过156个。最终结论是：并不存在一个简单的单一数字答案——寄存器总数取决于具体语境且极其庞大，这正体现了x86-64指令集架构非凡的复杂性和演进历史。"
  },
  {
    "id": "47012964",
    "title": "YouTube as Storage",
    "url": "https://github.com/PulseBeat02/yt-media-storage",
    "summary": "**YouTube as Storage** is a software tool that enables users to store any file on YouTube by converting it into a lossless video and later decoding it back to the original file. It offers both a command-line interface (CLI) and a graphical user interface (GUI).\n\nThe core functionality involves encoding files into videos using the FFV1 codec in an MKV container at 4K resolution. For reliability, it uses Wirehair fountain codes to add redundancy, allowing for data repair. Optional encryption via libsodium (XChaCha20-Poly1305) is also supported. The GUI facilitates batch processing, progress tracking, and real-time logging.\n\nTo build the software, users need CMake, a C++23 compiler, and dependencies including FFmpeg, libsodium, OpenMP, and Qt6. Pre-built binaries are available via the project's CI/CD pipeline. After building, the `media_storage` CLI or `media_storage_gui` can be used to encode or decode files.\n\nKey commands include `./media_storage encode` and `./media_storage decode`. The GUI allows users to browse files, select outputs, and process batches. Common troubleshooting points involve ensuring correct versions of FFmpeg (version 8+ for MP4) and proper installation of all dependencies.\n\nThe project is open-source, licensed under the GNU General Public License v3.0 or later.",
    "chinese_title": "YouTube作为存储空间",
    "chinese_summary": "**YouTube 作为存储工具**是一款软件工具，允许用户将任意文件通过无损视频格式存储在 YouTube 上，并能将其解码还原为原始文件。该工具提供命令行界面（CLI）和图形用户界面（GUI）两种操作方式。\n\n其核心功能是使用 FFV1 编解码器将文件编码为 4K 分辨率的 MKV 容器视频。为确保可靠性，该工具采用 Wirehair 喷泉码添加冗余以实现数据修复，并支持通过 libsodium（XChaCha20-Poly1305）进行可选加密。图形界面支持批量处理、进度跟踪和实时日志记录。\n\n构建该软件需要 CMake、C++23 编译器以及 FFmpeg、libsodium、OpenMP 和 Qt6 等依赖项。项目通过 CI/CD 流水线提供预编译二进制文件。构建完成后，可使用 `media_storage` 命令行工具或 `media_storage_gui` 图形界面进行文件编码或解码。\n\n主要命令包括 `./media_storage encode` 和 `./media_storage decode`。图形界面允许用户浏览文件、选择输出路径并处理批量任务。常见故障排查点包括确保 FFmpeg 版本正确（MP4 格式需版本 8 以上）以及所有依赖项安装无误。\n\n该项目为开源项目，采用 GNU 通用公共许可证 v3.0 或更高版本授权。"
  },
  {
    "id": "46959531",
    "title": "Shades of Halftone",
    "url": "https://blog.maximeheckel.com/posts/shades-of-halftone/",
    "summary": "This article explores the artistic and technical aspects of implementing halftone effects using shaders (GLSL). Halftone, originally a printing technique using dots to simulate gradients, is now a popular digital post-processing effect for adding texture.\n\nThe core implementation involves two steps: first, rendering a grid of circles using distance fields and the `fract` function to tile UV coordinates. Second, applying this grid as a filter by pixelating an underlying image to match the grid and varying each dot's size based on the pixel's luminance (brightness). This creates the illusion of continuous tones.\n\nThe article then explores creative variations beyond simple dots:\n*   **Shape Variations:** Using squares, rings (created by combining two circles), or inverted patterns (white dots on color).\n*   **Grid Manipulation:** Offsetting rows to create staggered, denser patterns.\n*   **Multichannel Halftoning:** Applying separate halftone grids to individual color channels (e.g., RGB or CMYK), which can introduce visually interesting **Moiré patterns**—interference effects caused by overlapping similar grids.\n\nOverall, the piece presents halftone as a versatile and accessible shader effect, breaking down its fundamental principles while encouraging experimentation with its many aesthetic possibilities for images, video, and 3D scenes.",
    "chinese_title": "半色调的渐变",
    "chinese_summary": "本文探讨了使用着色器（GLSL）实现半调效果的艺术与技术层面。半调最初是一种通过网点模拟渐变的印刷技术，如今已成为一种流行的数字后期处理效果，用于增添纹理感。\n\n核心实现分为两步：首先，利用距离场和 `fract` 函数平铺UV坐标，渲染出圆形网格；其次，将此网格作为滤镜，将底层图像像素化以匹配网格，并根据像素的亮度调整每个网点的大小，从而营造出连续色调的错觉。\n\n文章随后探讨了超越简单圆点的创意变体：\n*   **形状变化**：使用方形、圆环（由两个圆形组合而成）或反转图案（彩色背景上的白点）。\n*   **网格操控**：偏移行以创建交错、更密集的图案。\n*   **多通道半调**：将独立的半调网格应用于各个颜色通道（如RGB或CMYK），这可能会引入视觉上引人注目的**莫尔条纹**——由相似网格重叠产生的干涉效应。\n\n总体而言，本文展示了半调作为一种多功能且易于实现的着色器效果，在解析其基本原理的同时，鼓励读者在图像、视频和3D场景中探索其丰富的美学可能性。"
  },
  {
    "id": "47015579",
    "title": "A Review of M Disc Archival Capability. With long term testing results",
    "url": "http://www.microscopy-uk.org.uk/mag/artsep16/mol-mdisc-review.html",
    "summary": "This article reviews the M Disc, an optical storage medium marketed for exceptional archival durability. The author, concerned about the short lifespan of hard drives, flash memory, and standard DVDs/Blu-rays, investigates M Disc's claim to last 1,000 years.\n\nThe M Disc uses an inorganic, \"glassy carbon\" recording layer that is physically etched by a high-powered laser, making it resistant to oxidation and environmental damage. To test this, the author burned a copy of a film onto both a standard Blu-ray disc and an M Disc Blu-ray. He then subjected both discs to harsh outdoor conditions for seven months (February to September 2016), including freezing temperatures, heat, hail, rain, wind, direct sunlight, and being partially buried in soil.\n\nThe result was stark: the standard Blu-ray was completely destroyed, its data layer cracked and peeling. The M Disc, however, was only superficially dirty. After cleaning, it played back the film perfectly with no data corruption.\n\nThe author concludes that while no digital medium guarantees future readability, the M Disc demonstrably withstood extreme environmental stress far better than conventional media. He therefore endorses it as an excellent choice for long-term data archiving of valuable files like images, documents, and video masters.",
    "chinese_title": "M光盘归档能力评测：长期测试结果分析",
    "chinese_summary": "本文评测了M Disc——一种以卓越存档耐久性为卖点的光存储介质。作者因担忧硬盘、闪存及标准DVD/蓝光光盘的短暂寿命，对M Disc宣称的千年保存能力展开调查。\n\nM Disc采用无机\"玻璃碳\"记录层，通过高功率激光进行物理蚀刻，从而具备抗氧化和抵御环境损害的特性。为验证此技术，作者将同一部电影分别刻录至标准蓝光光盘和M Disc蓝光光盘，随后将两者置于严酷户外环境暴露七个月（2016年2月至9月），经历冰冻、高温、冰雹、雨水、大风、阳光直射及半掩埋于土壤等考验。\n\n结果对比鲜明：标准蓝光盘完全损毁，数据层开裂剥落；而M Disc仅表面污损，清洁后影片播放完好无损，未出现数据损坏。\n\n作者总结指出，虽然没有任何数字介质能保证未来可读性，但M Disc在极端环境压力下的表现明显优于传统存储介质。因此他推荐将其作为图像、文档和母版视频等珍贵文件长期归档的优选方案。"
  },
  {
    "id": "46954696",
    "title": "Show HN: I spent 3 years reverse-engineering a 40 yo stock market sim from 1986",
    "url": "https://www.wallstreetraider.com/story.html",
    "summary": "For nearly 40 years, *Wall Street Raider* stood as an \"impossible object\"—the most comprehensive financial simulator ever made, created by Michael Jenkins, a former tax attorney and CPA. Starting as a board game concept at Harvard Law in 1967, Jenkins taught himself to code in the 1980s and spent decades single-handedly building a staggeringly complex game featuring 1,600 companies, realistic markets, and intricate tax and legal systems.\n\nDespite its cult following and proven role in launching hundreds of finance careers, the game's dated interface and 115,000 lines of dense, idiosyncratic BASIC code defied all attempts at modernization. Multiple professional teams with significant budgets tried and failed to reverse-engineer it, deeming the source code indecipherable.\n\nBy 2023, facing technical and business hurdles, Jenkins, then 80, was considering shutting down. In 2024, 29-year-old software developer Ben Ward contacted him. Against all odds, Ward succeeded where others had failed, dedicating three years to reverse-engineering the 1986 game. His work has resurrected the classic, bridging a 50-year age gap to preserve a unique piece of software history and its educational legacy.",
    "chinese_title": "Show HN：我花了三年时间逆向工程一款1986年的40年老股票市场模拟游戏",
    "chinese_summary": "近40年来，《华尔街突袭者》一直被视为一个“不可能的存在”——这款由前税务律师兼注册会计师迈克尔·詹金斯打造的最全面的金融模拟游戏，始于1967年哈佛法学院的一个桌游构想。詹金斯在1980年代自学编程，耗费数十年独立构建出这款令人惊叹的复杂游戏，涵盖1600家公司、真实市场模拟以及精细的税务法律体系。\n\n尽管拥有忠实拥趸，并成功助推数百人开启金融职业生涯，但游戏过时的界面和11.5万行晦涩难懂的特有BASIC代码，让所有现代化尝试均告失败。多个拥有雄厚预算的专业团队曾试图反编译均未成功，认定其源代码无法破译。\n\n截至2023年，面临技术与商业双重困境，时年80岁的詹金斯考虑关停项目。2024年，29岁的软件开发者本·沃德联系了他。沃德完成了众人未竟之事，历时三年成功反编译了这款1986年的游戏。他的工作让经典重生，跨越50年的时代鸿沟，保存了这段独特的软件历史及其教育遗产。"
  },
  {
    "id": "47016920",
    "title": "Dr. Oz pushes AI avatars as a fix for rural health care",
    "url": "https://www.npr.org/2026/02/14/nx-s1-5704189/dr-oz-ai-avatars-replace-rural-health-workers",
    "summary": "In a speech, CMS Administrator Dr. Mehmet Oz proposed using AI avatars and robotic tools as a solution to the rural healthcare crisis, arguing they could multiply doctors' reach without burnout. This is part of a broader $50 billion Trump administration plan to modernize rural care.\n\nCritics, like rural health expert Carrie Henning-Smith, strongly oppose the idea. They argue it strips away essential human connection and trust, risks treating underserved rural populations as test subjects for unproven technology, and could worsen existing inequities due to unreliable broadband. There is also concern about the economic impact of replacing local healthcare jobs with technology developed elsewhere.\n\nSome health tech leaders, however, contend AI could help by automating administrative burdens that consume clinician time, freeing them up for patient care and allowing small clinics to operate more efficiently. They suggest AI could also assist with initial patient triage.\n\nThe debate occurs against a backdrop of severe strain on rural hospitals, with over 190 closures since 2005 due to financial pressures exacerbated by recent federal Medicaid cuts. Rural residents already face higher preventable death rates due to limited access to care.\n\nWhile CMS stated Oz was advocating for tools to extend, not replace, clinicians, the agency has not confirmed if AI avatars will become formal policy. The proposal has sparked significant public backlash, with critics framing it as creating a two-tiered healthcare system.",
    "chinese_title": "奥兹博士推广AI虚拟形象作为农村医疗保健的解决方案。",
    "chinese_summary": "在一次演讲中，美国医疗保险和医疗补助服务中心（CMS）负责人穆罕默德·奥兹博士提出，将人工智能虚拟形象和机器人工具作为解决农村医疗危机的方案，认为它们可以在不让医生过度劳累的情况下扩大医疗服务覆盖范围。这是特朗普政府一项更广泛的500亿美元农村医疗现代化计划的一部分。\n\n然而，农村健康专家卡丽·亨宁-史密斯等批评者强烈反对这一想法。他们认为，这会剥夺至关重要的人际联系和信任，可能将医疗服务不足的农村人口当作未经证实技术的试验对象，并且由于宽带网络不可靠，可能加剧现有的不平等。还有人担心，用外地开发的技术取代本地医疗岗位会对经济造成影响。\n\n不过，一些医疗科技领域的领导者认为，人工智能可以通过自动化消耗临床医生时间的行政负担来提供帮助，让他们能更专注于患者护理，并使小型诊所更高效地运作。他们还建议人工智能可用于初步的患者分诊。\n\n这场辩论的背景是农村医院承受着巨大压力：自2005年以来，由于近期联邦医疗补助削减加剧了财务压力，已有超过190家农村医院关闭。农村居民因就医机会有限，本已面临更高的可预防死亡率。\n\n尽管CMS表示奥兹是在倡导用工具来扩展而非取代临床医生，但该机构尚未确认人工智能虚拟形象是否会成为正式政策。该提案已引发强烈的公众反对，批评者认为这是在制造一个两级分化的医疗体系。"
  },
  {
    "id": "47010823",
    "title": "NPMX – a fast, modern browser for the NPM registry",
    "url": "https://npmx.dev",
    "summary": "**Summary:**\n\nNPMX is a new, fast, and modern web browser designed specifically for exploring the npm (Node Package Manager) registry. It aims to provide a better user experience for developers searching for and discovering JavaScript packages.\n\nThe article is primarily a call to action for the developer community to get involved with the project. It outlines three main ways to participate:\n\n1.  **Contribute:** Developers are invited to help build the browser by contributing to its codebase, which is hosted on GitHub.\n2.  **Join the Community:** Users can engage with the team and other developers by joining the project's Discord server for discussion and support.\n3.  **Stay Updated:** To follow news and announcements, the project recommends following its account on the social platform Bluesky.\n\nIn essence, NPMX is presented as an open-source initiative in its early stages, actively seeking community collaboration to improve the npm browsing experience.",
    "chinese_title": "NPMX – 一款面向NPM注册表的快速现代浏览器",
    "chinese_summary": "**摘要：**\n\nNPMX是一款专为探索npm（Node包管理器）注册表而设计的新型、快速、现代化的网页浏览器。它旨在为开发者搜索和发现JavaScript包提供更佳的用户体验。\n\n本文主要呼吁开发者社区参与该项目。文章概述了三种主要的参与方式：\n\n1.  **贡献代码：** 欢迎开发者通过GitHub上的代码库为构建该浏览器贡献力量。\n2.  **加入社区：** 用户可以加入项目的Discord服务器，与团队及其他开发者交流讨论并获得支持。\n3.  **保持关注：** 为跟进新闻和公告，项目建议关注其在社交平台Bluesky上的账号。\n\n本质上，NPMX作为一个处于早期阶段的开源项目，正积极寻求社区协作，以改善npm浏览体验。"
  },
  {
    "id": "47011567",
    "title": "Show HN: SQL-tap – Real-time SQL traffic viewer for PostgreSQL and MySQL",
    "url": "https://github.com/mickamy/sql-tap",
    "summary": "**sql-tap** is a real-time SQL traffic monitoring tool that consists of a proxy daemon and a terminal user interface (TUI). It sits transparently between an application and its PostgreSQL or MySQL database, capturing all queries without requiring code changes.\n\n**Key Features:**\n*   **Real-time Monitoring:** Displays live SQL queries, transactions, execution times, and errors in an interactive TUI.\n*   **Protocol-Level Interception:** The proxy (`sql-tapd`) parses the native database wire protocols, handling prepared statements and parameter bindings.\n*   **Query Analysis:** Allows users to run `EXPLAIN` and `EXPLAIN ANALYZE` on captured queries directly from the TUI.\n*   **Flexible Deployment:** Available via Homebrew, Go install, Docker, or source build. The proxy forwards traffic from a configurable listen port to the upstream database.\n\n**How to Use:**\n1.  Start the proxy daemon, pointing it to your database.\n2.  Reconfigure your application to connect to the proxy's port instead of the database's port.\n3.  Launch the TUI client to connect to the proxy's gRPC stream and view traffic.\n\nThe tool provides keyboard shortcuts for navigation, searching, sorting, copying queries, and toggling between list, inspector, analytics, and explain plan views. It is open-source under the MIT license.",
    "chinese_title": "Show HN: SQL-tap – PostgreSQL 和 MySQL 的实时 SQL 流量查看器",
    "chinese_summary": "**sql-tap** 是一款实时 SQL 流量监控工具，由代理守护进程和终端用户界面（TUI）组成。它透明地部署在应用程序与其 PostgreSQL 或 MySQL 数据库之间，无需修改代码即可捕获所有查询。\n\n**主要特性：**\n*   **实时监控：** 在交互式 TUI 中实时显示 SQL 查询、事务、执行时间和错误。\n*   **协议级拦截：** 代理程序（`sql-tapd`）解析原生数据库有线协议，处理预处理语句和参数绑定。\n*   **查询分析：** 允许用户直接在 TUI 中对捕获的查询运行 `EXPLAIN` 和 `EXPLAIN ANALYZE`。\n*   **灵活部署：** 可通过 Homebrew、Go install、Docker 或源码构建获取。代理将流量从可配置的监听端口转发到上游数据库。\n\n**使用方法：**\n1.  启动代理守护进程，将其指向您的数据库。\n2.  重新配置您的应用程序，使其连接到代理的端口而非数据库的端口。\n3.  启动 TUI 客户端以连接到代理的 gRPC 流并查看流量。\n\n该工具提供键盘快捷键用于导航、搜索、排序、复制查询，以及在列表视图、检查器视图、分析视图和执行计划视图之间切换。它基于 MIT 许可证开源。"
  },
  {
    "id": "47000505",
    "title": "Babylon 5 is now free to watch on YouTube",
    "url": "https://cordcuttersnews.com/babylon-5-is-now-free-to-watch-on-youtube/",
    "summary": "Warner Bros. Discovery has begun uploading full episodes of the classic sci-fi series *Babylon 5* to YouTube for free. This move coincides with the show's removal from the ad-supported streaming service Tubi as of February 10, 2026.\n\nThe company is releasing one episode per week, starting with the pilot, \"The Gathering.\" This paced, weekly schedule aims to build audience engagement and foster community discussion. The episodes are hosted on an official Warner Bros. channel, which also provides links to purchase the series.\n\nThis strategy represents a shift in content distribution, using a free platform like YouTube to revitalize a legacy property and potentially increase its visibility. The move has sparked speculation about future plans for the franchise, including possible reboots.\n\nThe article provides background on *Babylon 5*, noting its original run from 1993-1998, its innovative serialized storytelling, and its lasting influence on the sci-fi genre. For now, the YouTube uploads offer fans a new, free way to revisit the iconic space opera.",
    "chinese_title": "《巴比伦5号》现可在YouTube免费观看。",
    "chinese_summary": "华纳兄弟探索公司已开始在YouTube上免费上传经典科幻剧集《巴比伦5号》的完整剧集。此举恰逢该剧将于2026年2月10日从广告支持的流媒体平台Tubi下架。\n\n公司正以每周一集的速度发布剧集，从试播集《集结号》开始。这种节奏性的周更计划旨在提升观众参与度并促进社群讨论。剧集发布在华纳兄弟官方频道，该频道同时提供剧集购买链接。\n\n这一策略标志着内容分发方式的转变，通过YouTube等免费平台重新激活经典IP并提升其曝光度。此举引发了关于该系列未来计划的猜测，包括可能的重启计划。\n\n文章回顾了《巴比伦5号》的背景，提及该剧于1993-1998年首播，其创新的连续性叙事方式以及对科幻类型的持久影响。目前，YouTube的上传为粉丝提供了免费重温这部标志性太空歌剧的新途径。"
  },
  {
    "id": "46965829",
    "title": "The three year myth",
    "url": "https://green.spacedino.net/the-three-year-myth/",
    "summary": "The author introduces the \"Three Year Myth,\" a pattern they've observed where employees are promised promotions, raises, or process changes in \"two to three years\" if they wait patiently. The author argues this is a deliberate tactic used by organizations to maintain the status quo and preserve the power of incumbents, often at the employee's expense.\n\nThey illustrate this with personal experiences: being let go after waiting for promised advancements, only to see others later receive credit for their ideas, and being penalized for proposing efficient solutions that conflicted with pre-established leadership visions. The core lesson is that being asked to wait without clear justification is not a delay but a threat, signaling that the employee is viewed as a potential disruption rather than an asset.\n\nThe conclusion is that career rewards are dependent on stakeholder support, not arbitrary timelines. The author advises against trusting vague future promises, emphasizing that employers show little loyalty and that employees should not sacrifice present recognition and growth for empty assurances. The key takeaway is to act immediately when you've earned a reward, rather than waiting for a future that may never materialize.",
    "chinese_title": "三年神话",
    "chinese_summary": "作者提出了“三年神话”这一概念，指出一种常见模式：企业常向员工许诺，只要耐心等待“两到三年”，就会获得晋升、加薪或流程改进。作者认为，这其实是组织为维持现状、巩固现有掌权者地位而刻意采用的策略，往往以牺牲员工利益为代价。\n\n作者通过亲身经历加以说明：在苦等承诺的晋升机会后反遭解雇，随后却看到他人因自己的创意获得认可；或因提出高效解决方案与领导既定规划冲突而受到排挤。核心教训在于，当被要求无明确理由地等待时，这并非简单的延迟，而是一种警示——表明员工被视作潜在威胁而非宝贵资产。\n\n结论是职业回报取决于利益相关者的支持，而非空洞的时间表。作者建议不要轻信模糊的未来承诺，强调雇主鲜少忠诚，员工不应为虚幻的保证牺牲当下的认可与成长。关键启示在于：当你应得回报时，务必立即行动，而非等待可能永不会到来的未来。"
  },
  {
    "id": "47016639",
    "title": "Gamma Function: Visualization for Complex Arguments",
    "url": "https://vanilla-gamma-graph.netlify.app/",
    "summary": "This article introduces \"vanilla-gamma-graph,\" a dynamic visualization tool for exploring the complex Euler gamma function, Γ(x + i·c). It begins by displaying the classic real-valued gamma function when the imaginary component c is zero. As c increases, the tool plots both the real (blue) and imaginary (purple) parts of the complex result, allowing users to observe how the function evolves in the complex plane. For example, to find Γ(-2.3 + 0.18i), one would read the blue and purple curve values at x = -2.3.\n\nThe visualization cycles automatically: after c increases to a point of diminishing insight, it resets to zero and then sweeps into negative values, showing a mirrored imaginary part. The core computational engine is the `vanilla_gamma()` JavaScript function, adapted from a zeta function calculator on zeta-calculator.com and released under a permissive Creative Commons Zero license. The article positions this tool as a practical application of that function, offering an intuitive graphical understanding of the gamma function's behavior and inviting users to test the straightforward `vanilla_gamma()` code themselves.",
    "chinese_title": "伽玛函数：复参数的可视化",
    "chinese_summary": "本文介绍了一款名为“vanilla-gamma-graph”的动态可视化工具，用于探索复杂的欧拉伽马函数Γ(x + i·c)。该工具首先展示当虚部c为零时的经典实值伽马函数。随着c逐渐增大，它会同时绘制出复数结果的实部（蓝色曲线）和虚部（紫色曲线），使用户能够观察函数在复平面上的演变过程。例如，要计算Γ(-2.3 + 0.18i)，用户只需读取x = -2.3处蓝色与紫色曲线的对应数值。\n\n可视化过程自动循环：当c增大至信息增量趋缓时，系统会重置c为零值，随后向负值方向扫描，此时虚部呈现镜像对称。工具的核心计算引擎是`vanilla_gamma()` JavaScript函数，该函数改编自zeta-calculator.com上的ζ函数计算器，并采用宽松的Creative Commons Zero许可协议发布。文章将该工具定位为该函数的实际应用案例，既提供了对伽马函数行为的直观图形化理解，也鼓励用户直接测试简洁明了的`vanilla_gamma()`代码。"
  },
  {
    "id": "47014995",
    "title": "7zip.com Is Serving Malware",
    "url": "https://www.malwarebytes.com/blog/threat-intel/2026/02/fake-7-zip-downloads-are-turning-home-pcs-into-proxy-nodes",
    "summary": "A malicious website impersonating the legitimate 7-Zip archiver (7zip[.]com vs. 7-zip.org) has been distributing a trojanized installer that turns victims' computers into residential proxy nodes. The installer, signed with a now-revoked certificate, deploys a working version of 7-Zip alongside hidden malware components in the `C:\\Windows\\SysWOW64\\hero\\` directory.\n\nThe malware establishes persistence as a Windows service with SYSTEM privileges, modifies firewall rules, profiles the host system, and reports to command-and-control (C2) servers. Its primary function is to enroll the infected machine into a proxy network, allowing third parties to route internet traffic through the victim's IP address for activities like ad fraud or web scraping.\n\nThis campaign is part of a broader operation using similar tactics to impersonate other software brands. It employs advanced evasion techniques, including virtual machine detection and encrypted communications via DNS-over-HTTPS. Security researchers have linked the activity to a proxyware operation dubbed \"upStage Proxy.\"\n\nUsers who downloaded 7-Zip from the .com domain should consider their systems compromised. While security software like Malwarebytes can remove the threat, a full OS reinstall may be recommended for high-security systems. The incident underscores the critical importance of verifying official software sources.",
    "chinese_title": "7zip.com正在分发恶意软件",
    "chinese_summary": "一个恶意网站冒充合法的7-Zip压缩软件（7zip[.]com对比7-zip.org），正在分发带有木马的安装程序，将受害者的计算机变为住宅代理节点。该安装程序使用现已吊销的证书签名，在部署正常7-Zip版本的同时，将隐藏的恶意软件组件植入`C:\\Windows\\SysWOW64\\hero\\`目录。\n\n该恶意软件以SYSTEM权限注册为Windows服务实现持久化，修改防火墙规则，分析主机系统配置，并向命令与控制（C2）服务器发送数据。其主要功能是将受感染设备纳入代理网络，使第三方能够通过受害者IP地址路由网络流量，用于广告欺诈或网络爬虫等活动。\n\n此次攻击属于更广泛行动的一部分，攻击者采用类似手法冒充其他软件品牌。其运用了高级规避技术，包括虚拟机检测和基于DNS-over-HTTPS的加密通信。安全研究人员已将此次活动与名为\"upStage Proxy\"的代理软件行动相关联。\n\n从.com域名下载7-Zip的用户应视其系统已遭入侵。虽然Malwarebytes等安全软件可清除该威胁，但对高安全性系统仍建议完全重装操作系统。该事件凸显了验证软件官方来源的极端重要性。"
  },
  {
    "id": "47015987",
    "title": "Audiophiles can't distinguish audio sent through copper, banana or mud",
    "url": "https://www.tomshardware.com/speakers/in-a-blind-test-audiophiles-couldnt-tell-the-difference-between-audio-signals-sent-through-copper-wire-a-banana-or-wet-mud-the-mud-should-sound-perfectly-awful-but-it-doesnt-notes-the-experiment-creator",
    "summary": "This article reports on an experiment conducted by a moderator on the diyAudio forum to test whether listeners could distinguish between audio signals transmitted through different materials. The test compared the original CD audio to recordings passed through professional copper wire, wet mud, and a banana.\n\nThe results showed that listeners could not reliably identify which recording used which medium. Out of 43 guesses, only six were correct (13.95%), a success rate statistically consistent with random chance. The experiment's creator noted that the poor conductors (mud and banana) essentially acted like resistors, lowering the signal level without causing perceptible distortion to the average listener.\n\nThe article suggests that for typical listening conditions, extreme claims about the sonic importance of premium cables may be unfounded, as even highly unconventional conductors produced indistinguishable results in this blind test. The piece concludes by linking the experiment to the creator's curiosity about historical telegraph systems that used the earth as a return path.",
    "chinese_title": "发烧友无法分辨通过铜线、香蕉或泥土传输的音频。",
    "chinese_summary": "本文报道了diyAudio论坛版主进行的一项实验，旨在测试听众是否能区分通过不同材料传输的音频信号。实验将原始CD音频与经过专业铜线、湿泥土和香蕉传输的录音进行了对比。\n\n结果显示，听众无法可靠识别每种录音所使用的介质。在43次猜测中，仅六次正确（13.95%），这一成功率在统计学上与随机猜测无异。实验设计者指出，不良导体（泥土和香蕉）实际上起到了电阻的作用，降低了信号电平，但未对普通听众造成可感知的失真。\n\n文章认为，在典型听音条件下，关于高端线材对音质具有决定性影响的极端主张可能缺乏依据，因为即便使用非常规导体，在此次盲听测试中也产生了无法区分的结果。文章最后将实验与设计者对历史上使用大地作为回流路径的电报系统的探索兴趣联系起来。"
  },
  {
    "id": "46971273",
    "title": "What color are your bits? (2004)",
    "url": "https://ansuz.sooke.bc.ca/entry/23",
    "summary": "The article \"What Colour are your bits?\" uses the metaphor of \"Colour\" from the game *Paranoia* to explain a fundamental conflict between computer science and law regarding digital information.\n\nBits themselves—the 1s and 0s—have no inherent \"Colour.\" To a computer scientist, two identical files are indistinguishable; they are the same object. This \"Colour-blindness\" is a core principle of computing.\n\nHowever, the law is deeply concerned with Colour—the intangible attributes of where bits came from, who created them, and their legal history. Identical bits can have different legal statuses (e.g., original work vs. plagiarism, admissible evidence vs. inadmissible data) based solely on their provenance.\n\nThe article illustrates this clash through examples like creating identical silent MP3 files via different methods, and critiques schemes like \"Monolith\" that try to use mathematical operations to erase copyright. It argues such attempts fail because they inconsistently apply legal rules (which track Colour through transformations) and mathematical rules (which ignore it).\n\nUltimately, the piece frames this disconnect as a major communication barrier: lawyers see computer scientists as unhelpful for denying Colour's importance, while computer scientists see lawyers as misguided for insisting on a property that bits cannot intrinsically possess.",
    "chinese_title": "你的比特是什么颜色？（2004）",
    "chinese_summary": "文章《你的比特是什么颜色？》借用游戏《偏执狂》中的“颜色”隐喻，阐释了计算机科学与法律在数字信息领域的一个根本冲突。\n\n比特本身——即1和0——并无内在的“颜色”。对计算机科学家而言，两个完全相同的文件无法区分；它们就是同一个对象。这种“颜色盲”是计算领域的核心原则。\n\n然而，法律却极度关注颜色——即比特从何而来、由谁创造、有何法律历史等无形属性。完全相同的比特仅凭其来源，就可能具有不同的法律地位（例如原创作品与抄袭、可采纳证据与无效数据）。\n\n文章通过以不同方法生成相同的无声MP3文件等实例阐明这一冲突，并批判了试图用数学运算抹除版权的“Monolith”等方案。文章指出，这类尝试之所以失败，是因为它们不一致地适用了法律规则（追踪颜色在转化中的延续）与数学规则（忽略颜色）。\n\n最终，文章将这种脱节视为重要的沟通障碍：律师认为计算机科学家否认颜色的重要性而无助于事，而计算机科学家则认为律师执迷于比特本质上无法拥有的属性，实属误入歧途。"
  },
  {
    "id": "46957629",
    "title": "Code Storage by the Pierre Computer Company",
    "url": "https://code.storage/",
    "summary": "**Code Storage** is a specialized, API-first Git infrastructure service built by the Pierre Computer Company. It is designed to programmatically create and manage Git repositories, eliminating common hurdles like rate limits and complex authentication. The service targets modern, high-volume use cases such as AI-driven coding platforms, agentic frameworks, and code-generation tools.\n\nKey features include ultra-low latency for Git operations (reportedly 60x faster clones than some alternatives), high reliability with a 99.99% SLA, and novel capabilities like ephemeral branches and in-memory writes. It offers SDKs for TypeScript, Python, and Go, along with webhooks and a first-class GitHub sync engine.\n\nPricing is usage-based, with a tiered storage model: \"Warm\" storage for active repositories ($0.50-$1.00/GB/month) and \"Cold\" storage for inactive ones ($0.15/GB/month). Bandwidth costs are separate for inbound and outbound data. The company emphasizes security with fine-grained controls, audits, and per-tenant deployment options.\n\nBacked by $23M in funding, Code Storage positions itself as the scalable, reliable backend for applications that need to store and manage code or code-like artifacts at scale.",
    "chinese_title": "皮埃尔计算机公司的代码存储",
    "chinese_summary": "**代码存储**是由Pierre计算机公司构建的专业化、API优先的Git基础设施服务。它旨在通过编程方式创建和管理Git仓库，消除速率限制和复杂身份验证等常见障碍。该服务面向现代化、高流量的使用场景，如AI驱动的编码平台、智能体框架和代码生成工具。\n\n主要特性包括极低延迟的Git操作（据称克隆速度比某些替代方案快60倍）、99.99%服务等级协议的高可靠性，以及临时分支和内存写入等创新功能。它提供TypeScript、Python和Go的SDK，同时支持Webhooks和原生GitHub同步引擎。\n\n定价采用基于用量的分层存储模式：活跃仓库使用“温存储”（0.50-1.00美元/GB/月），非活跃仓库使用“冷存储”（0.15美元/GB/月）。带宽成本按入站和出站数据分别计费。公司通过细粒度控制、审计日志和按租户部署选项强调安全性。\n\n在获得2300万美元资金支持下，代码存储定位为可扩展、可靠的后端服务，适用于需要大规模存储和管理代码或类代码产物的应用程序。"
  }
]