[
  {
    "id": "46455872",
    "title": "Cameras and Lenses (2020)",
    "url": "https://ciechanow.ski/cameras-and-lenses/",
    "summary": "This article explains the fundamental principles of how digital cameras work, building a simple camera from first principles. It begins by describing how an image sensor uses a grid of photodetectors to record light intensity, and how color filters (like a Bayer filter) and demosaicing are used to create a color image.\n\nThe core problem identified is that a bare sensor captures light from all directions, creating a meaningless image. The solution is a pinhole camera, which uses a small hole to restrict light paths, forming a sharp but dim and inverted image. The article explains key effects: image inversion, field of view changes with sensor distance, and the **cosine-fourth-power law** causing dark corners.\n\nThe major limitation of a pinhole is the trade-off between sharpness and brightness: a smaller hole sharpens the image but makes it dimmer. To overcome this, the article introduces the need for a lens to gather more light and focus it precisely onto the sensor, allowing control over sharpness and blur (depth of field). It concludes by introducing glass and the refraction of light waves as the foundation for building such a lens.",
    "chinese_title": "相机与镜头（2020）",
    "chinese_summary": "本文从基本原理出发，解释数码相机的工作原理，并构建一个简易相机模型。首先描述图像传感器如何通过光电探测器网格记录光强，以及如何使用彩色滤镜（如拜耳滤镜）和去马赛克技术生成彩色图像。\n\n文章指出的核心问题是：裸传感器会捕捉所有方向的光线，导致图像模糊不清。解决方案是针孔相机——它通过小孔限制光路，形成清晰但昏暗且倒立的图像。文中解释了关键效应：图像倒置、传感器距离改变视野范围，以及**余弦四次方定律**导致的暗角现象。\n\n针孔相机的主要局限在于清晰度与亮度之间的权衡：孔越小图像越清晰，但亮度越低。为解决这一问题，文章引入透镜的必要性——它能汇聚更多光线并精确聚焦于传感器，从而实现对清晰度与虚化（景深）的控制。最后，文章以玻璃材质和光波折射原理作为构建此类透镜的基础作结。"
  },
  {
    "id": "46454693",
    "title": "Show HN: OpenWorkers – Self-hosted Cloudflare workers in Rust",
    "url": "https://openworkers.com/introducing-openworkers",
    "summary": "**OpenWorkers** is an open-source, self-hosted runtime built in Rust that replicates the functionality of Cloudflare Workers. It allows developers to execute JavaScript in secure V8 isolates on their own infrastructure, enabling edge computing without vendor lock-in.\n\nThe platform supports key Cloudflare Workers features, including:\n*   **Bindings:** KV storage, PostgreSQL, S3/R2-compatible storage, service bindings, and environment variables.\n*   **Web APIs:** `fetch`, `Request`, `Response`, `ReadableStream`, `crypto.subtle`, and timers.\n*   **Architecture:** A microservices design (managed via Docker Compose) with components for an API, dashboard, log management, and isolated worker runners.\n*   **Sandboxing:** Enforces strict per-worker limits (100ms CPU, 128MB memory).\n*   **Scheduling:** Built-in support for cron jobs.\n\nDeployment is streamlined, requiring only a PostgreSQL database and a Docker Compose file. The project, which has evolved over seven years and is now built directly on `rusty_v8`, emphasizes data sovereignty, predictable costs, and compatibility with the Cloudflare Workers developer experience. Future plans include execution recording for debugging.",
    "chinese_title": "Show HN：OpenWorkers – 基于 Rust 的自托管 Cloudflare Workers 实现",
    "chinese_summary": "**OpenWorkers** 是一个基于 Rust 构建的开源、自托管运行时，它复现了 Cloudflare Workers 的功能。该平台允许开发者在自己的基础设施上，于安全的 V8 隔离环境中执行 JavaScript，从而实现无供应商锁定的边缘计算。\n\n该平台支持 Cloudflare Workers 的核心功能，包括：\n*   **绑定：** KV 存储、PostgreSQL、S3/R2 兼容存储、服务绑定以及环境变量。\n*   **Web API：** `fetch`、`Request`、`Response`、`ReadableStream`、`crypto.subtle` 和计时器。\n*   **架构：** 采用微服务设计（通过 Docker Compose 管理），包含 API、仪表板、日志管理和隔离的工作线程运行器等组件。\n*   **沙箱机制：** 强制执行严格的单工作线程限制（100 毫秒 CPU，128MB 内存）。\n*   **调度：** 内置支持定时任务。\n\n部署流程经过简化，仅需一个 PostgreSQL 数据库和一个 Docker Compose 文件。该项目历经七年发展，现已直接构建于 `rusty_v8` 之上，并强调数据主权、成本可预测性以及与 Cloudflare Workers 开发者体验的兼容性。未来计划包括为调试而设计的执行记录功能。"
  },
  {
    "id": "46454470",
    "title": "Python numbers every programmer should know",
    "url": "https://mkennedy.codes/posts/python-numbers-every-programmer-should-know/",
    "summary": "This article provides a comprehensive benchmark of Python's performance across various operations, data structures, and libraries. The key takeaway is that while Python is slower than compiled languages like C, its fundamental operations are still remarkably fast, often measured in nanoseconds.\n\nThe benchmarks reveal critical insights for performance-sensitive code:\n*   **Memory:** Python objects have significant overhead (e.g., an int is 28 bytes). Using `__slots__` or `dataclass(slots=True)` can drastically reduce memory usage for large collections of objects.\n*   **Data Structures:** Choosing the right one is crucial. A `set` or `dict` membership check is ~200x faster than a `list` check for 1,000 items.\n*   **Serialization:** Optimized libraries like `orjson` and `msgspec` are significantly faster (up to 11x) than the standard `json` module.\n*   **Web Frameworks:** Async frameworks like FastAPI, Starlette, and Litestar offer roughly 2x the request throughput of synchronous frameworks like Flask and Django for simple JSON endpoints.\n*   **Database Access:** In-process options like SQLite and `diskcache` provide microsecond-level reads, while network-based databases like MongoDB incur millisecond latency due to round trips.\n\nOverall, the article emphasizes that understanding these relative performance characteristics—rather than absolute numbers—is essential for writing efficient Python code. The source benchmarks are available on GitHub for verification and further exploration.",
    "chinese_title": "每个程序员都应该知道的Python数字",
    "chinese_summary": "本文对Python在各种操作、数据结构和库中的性能进行了全面基准测试。关键结论是：虽然Python比C等编译型语言慢，但其基础操作仍然非常快，通常以纳秒计。\n\n基准测试揭示了性能敏感代码的关键洞察：\n*   **内存：** Python对象具有显著开销（例如一个int占28字节）。使用`__slots__`或`dataclass(slots=True)`能大幅减少大量对象集合的内存占用。\n*   **数据结构：** 选择合适的数据结构至关重要。对于包含1000个元素的集合，`set`或`dict`的成员检查比`list`快约200倍。\n*   **序列化：** 优化库如`orjson`和`msgspec`比标准`json`模块快得多（最高达11倍）。\n*   **Web框架：** 对于简单的JSON接口，异步框架（如FastAPI、Starlette和Litestar）的请求吞吐量约为同步框架（如Flask和Django）的2倍。\n*   **数据库访问：** 进程内选项（如SQLite和`diskcache`）提供微秒级读取速度，而基于网络的数据库（如MongoDB）因往返延迟会产生毫秒级延迟。\n\n总体而言，文章强调理解这些相对性能特征（而非绝对数值）对编写高效Python代码至关重要。相关基准测试源码已在GitHub开源，可供验证和进一步探究。"
  },
  {
    "id": "46453950",
    "title": "iOS allows alternative browser engines in Japan",
    "url": "https://developer.apple.com/support/alternative-browser-engines-jp/",
    "summary": "In iOS 26.2 and later, Apple will allow the use of alternative browser engines (like Blink or Gecko) in Japan, a significant change from the previous WebKit-only rule. This applies to two specific app categories: dedicated browser apps and apps from \"browser engine stewards\" that offer in-app browsing.\n\nTo qualify, developers must apply for one of two new entitlements and meet strict, ongoing privacy and security criteria. These include:\n*   **Functional Requirements:** The engine must pass high percentages of industry-standard web compatibility tests (90% of Web Platform Tests, 80% of Test262).\n*   **Security Requirements:** Developers must commit to secure development practices, timely vulnerability patches (often within 30 days), use of memory-safe languages, and adoption of Apple's latest security mitigations.\n*   **Privacy Requirements:** Engines must block third-party cookies by default, partition website storage, and not share device identifiers without explicit user consent.\n\nThe **Web Browser Engine Entitlement** is for full browser apps, which must also have the Default Browser entitlement. The **Embedded Browser Engine Entitlement** is for in-app browsing within apps from engine stewards; these apps cannot be the default browser and must have a primary focus on web browsing.\n\nApple emphasizes that browser engines are major attack vectors and will only authorize developers who demonstrate a robust commitment to user safety. The policy is currently limited to Japan, with no indication of a broader rollout.",
    "chinese_title": "iOS在日本允许使用替代浏览器引擎",
    "chinese_summary": "在iOS 26.2及更高版本中，苹果将允许在日本使用替代浏览器引擎（如Blink或Gecko），这标志着其打破了此前仅允许WebKit的规则。该政策适用于两类特定应用：专用浏览器应用以及来自“浏览器引擎管理方”且提供应用内浏览功能的应用。\n\n开发者需申请以下两项新权限之一，并满足严格且持续的隐私与安全标准，方可获得资格。这些标准包括：\n*   **功能\n\n**Web浏览器引擎权限**适用于完整浏览器应用，此类应用还必须拥有默认浏览器权限。**嵌入式浏览器引擎权限**适用于引擎管理方应用中的应用内浏览功能；此类应用不能设为默认浏览器，且其主要功能必须聚焦于网页浏览。\n\n苹果强调，浏览器引擎是主要的攻击途径，因此仅会授权那些展现出对用户安全有坚定承诺的开发者。该政策目前仅限于日本，尚无更广泛推广的迹象。"
  },
  {
    "id": "46392095",
    "title": "C-events, yet another event loop, simpler, smaller, faster, safer",
    "url": "https://zelang-dev.github.io/c-events/",
    "summary": "**Summary:**  \nc-events is a lightweight, high-performance, cross-platform event loop library designed for non-blocking file I/O. It provides a unified interface for Linux’s epoll, macOS’s kqueue, and Windows’s IOCP (via wepoll), focusing on simplicity, speed, and fine-grained control. Unlike larger libraries like libuv or libevent, c-events avoids unnecessary overhead by exposing low-level OS mechanisms directly, allowing developers to manage events and callbacks with minimal abstraction.\n\nKey features include support for read/write events, timeouts, signals, and user-triggered events, all managed through a persistent event registration model. The library also integrates coroutine-like behavior for concurrency, thread pools for offloading CPU-intensive tasks, and pseudo file descriptors for Windows compatibility. It includes utilities for non-blocking I/O, TCP proxying, and task scheduling, emphasizing efficiency and cross-platform consistency.\n\nThe project is actively evolving, with planned enhancements such as improved Windows support, file system monitoring, and expanded thread pool functionality. c-events is positioned as a complementary tool for developers needing precise control over asynchronous operations without the bloat of full-featured frameworks.",
    "chinese_title": "C-events，又一个事件循环，更简单、更小巧、更快速、更安全",
    "chinese_summary": "**摘要：**  \nc-events 是一款轻量级、高性能、跨平台的事件循环库，专为非阻塞文件 I/O 设计。它为 Linux 的 epoll、macOS 的 kqueue 和 Windows 的 IOCP（通过 wepoll 实现）提供了统一接口，注重简洁性、速度和细粒度控制。与 libuv 或 libevent 等大型库不同，c-events 通过直接暴露底层操作系统机制，避免了不必要的开销，使开发者能够以最小的抽象层级管理事件和回调。\n\n其核心功能包括对读写事件、超时、信号和用户触发事件的支持，所有功能均通过持久化事件注册模型进行管理。该库还集成了类似协程的并发行为、用于卸载 CPU 密集型任务的线程池，以及为 Windows 兼容性设计的伪文件描述符。它包含非阻塞 I/O、TCP 代理和任务调度等实用工具，强调效率与跨平台一致性。\n\n该项目正在积极发展，计划中的改进包括增强 Windows 支持、文件系统监控和扩展线程池功能。c-events 定位为一种补充工具，适用于需要精确控制异步操作、又不愿承受全功能框架臃肿开销的开发者。"
  },
  {
    "id": "46456215",
    "title": "Memory Subsystem Optimizations",
    "url": "https://johnnysswlab.com/memory-subsystem-optimizations/",
    "summary": "This blog series presents 18 posts focused on optimizing software performance through better use of the memory subsystem. The core idea is that by managing how data is stored and accessed, programs—especially those handling large datasets—can run significantly faster.\n\nThe key optimization strategies covered include:\n*   **Reducing Memory Accesses:** Keeping data in fast CPU registers and minimizing loads from slower main memory.\n*   **Improving Data Locality:** Changing data access patterns and layouts (in classes and data structures) to increase cache hits.\n*   **Managing Memory Efficiently:** Decreasing dataset sizes, using custom allocators for better memory layout, and employing techniques like software prefetching and huge pages to reduce latency and TLB misses.\n*   **Addressing System Interactions:** Exploring how instruction-level parallelism, branch prediction, and multithreading interact with memory performance.\n*   **Specialized Goals:** Techniques for saving memory bandwidth and optimizing for low-latency applications.\n*   **Measurement:** Tools and methods for analyzing memory subsystem performance.\n\nThe series concludes with a collection of miscellaneous optimization topics. The author invites feedback and offers consulting and training services on software performance.",
    "chinese_title": "内存子系统优化",
    "chinese_summary": "本博客系列包含18篇文章，专注于通过更高效地利用内存子系统来优化软件性能。核心观点是：通过管理数据的存储和访问方式，程序——尤其是处理大型数据集的程序——可以显著提升运行速度。\n\n涵盖的关键优化策略包括：\n*   **减少内存访问：** 将数据保留在快速的CPU寄存器中，并尽量减少从较慢的主内存加载数据。\n*   **提高数据局部性：** 改变数据访问模式和布局（在类和数据结构中），以增加缓存命中率。\n*   **高效管理内存：** 减小数据集大小，使用自定义分配器以改善内存布局，并采用软件预取和大页等技术来降低延迟和TLB未命中。\n*   **处理系统交互：** 探讨指令级并行、分支预测和多线程如何与内存性能相互作用。\n*   **特定目标优化：** 节省内存带宽以及为低延迟应用优化的技术。\n*   **性能测量：** 分析内存子系统性能的工具和方法。\n\n系列文章最后汇集了各种其他优化主题。作者欢迎反馈，并提供软件性能相关的咨询和培训服务。"
  },
  {
    "id": "46453204",
    "title": "Bluetooth Headphone Jacking: A Key to Your Phone [video]",
    "url": "https://media.ccc.de/v/39c3-bluetooth-headphone-jacking-a-key-to-your-phone",
    "summary": "**Summary:**\n\nSecurity researchers Dennis Heinze and Frieder Steinmetz discovered three critical vulnerabilities (CVE-2025-20700, CVE-2025-20701, CVE-2025-20702) in Bluetooth audio chips manufactured by Airoha. These chips are widely used in popular headphones and earbuds from brands like Sony, Marshall, Beyerdynamic, and Jabra.\n\nThe vulnerabilities, found in a proprietary protocol called RACE, allow an attacker to fully compromise the headphones—reading from and writing to their memory and firmware. This compromise can then be leveraged to attack a paired smartphone by exploiting the trusted Bluetooth relationship, potentially stealing authentication keys to impersonate the peripheral.\n\nThe presentation aims to raise awareness about the risks, criticizing some manufacturers for poor communication regarding threats and security updates. It also discusses the broader security implication: as smartphones become more secure, attackers may increasingly target less-secure peripheral devices like headphones as a gateway.\n\nThe researchers are releasing tools to help users check if their devices are affected and to enable further research. They also highlight challenges encountered during the vulnerability disclosure and patching process with vendors.",
    "chinese_title": "蓝牙耳机插孔：手机的关键所在 [视频]",
    "chinese_summary": "**摘要：**\n\n安全研究员丹尼斯·海因策和弗里德·施泰因梅茨在络达（Airoha）生产的蓝牙音频芯片中发现了三个严重漏洞（CVE-2025-20700、CVE-2025-20701、CVE-2025-20702）。这些芯片广泛应用于索尼、马歇尔、拜雅、捷波朗等品牌的流行头戴式耳机和耳塞中。\n\n这些漏洞存在于一个名为RACE的专有协议中，允许攻击者完全控制耳机——读取和写入其内存与固件。随后，攻击者可利用这种控制，通过受信任的蓝牙连接攻击配对的智能手机，可能窃取认证密钥以伪装成该外围设备。\n\n本次演示旨在提高人们对相关风险的认识，批评部分制造商在威胁通报和安全更新方面沟通不足。同时，它也探讨了更广泛的安全影响：随着智能手机安全性提高，攻击者可能越来越多地将耳机等安全性较低的外围设备作为攻击入口。\n\n研究人员正在发布工具，以帮助用户检查其设备是否受影响，并支持进一步研究。他们还强调了在漏洞披露和与厂商的补丁修复过程中遇到的挑战。"
  },
  {
    "id": "46457027",
    "title": "Dell's version of the DGX Spark fixes pain points",
    "url": "https://www.jeffgeerling.com/blog/2025/dells-version-dgx-spark-fixes-pain-points",
    "summary": "The Dell GB10 is a $4,000+ mini workstation built around Nvidia's Grace Blackwell 10 \"AI Superchip,\" which combines a 20-core Arm CPU with a Blackwell GPU and 128GB of shared LPDDR5X memory. While not a cost-effective option for general LLM use or as a desktop, it targets developers in Nvidia's ecosystem who need to deploy code to high-end servers.\n\nKey improvements over the similar Nvidia DGX Spark include a power LED, a larger 280W power supply, and a better thermal design that prevents throttling. Its primary value lies in the built-in 200GbE ConnectX-7 networking ports, which support high-speed InfiniBand/RDMA for clustering—a feature costly to add elsewhere.\n\nAs a general-purpose Arm Linux workstation, it performs well for coding and browsing, though software support can be limited. In AI benchmarks, it excels at prompt processing but is competitive, not leading, in overall inference speed against systems like the Apple M3 Ultra or AMD Ryzen AI Max+ 395. The author notes that while powerful for its niche, its high price and Nvidia's limited software support timeline make it a specialized tool rather than a broad-market product.",
    "chinese_title": "戴尔版DGX Spark解决了痛点问题。",
    "chinese_summary": "戴尔GB10是一款售价超过4000美元的迷你工作站，其核心是英伟达的Grace Blackwell 10“AI超级芯片”。该芯片集成了20核Arm CPU、Blackwell GPU以及128GB共享LPDDR5X内存。虽然作为通用大语言模型应用或台式机性价比不高，但它主要面向英伟达生态中需要将代码部署到高端服务器的开发者。\n\n相比类似的英伟达DGX Spark，其主要改进包括电源指示灯、更大的280W电源供应器，以及可防止降频的优化散热设计。其核心价值在于内置的200GbE ConnectX-7网络端口，支持用于集群部署的高速InfiniBand/RDMA——这项功能在其他设备上添加成本高昂。\n\n作为通用Arm Linux工作站，它在编程和网页浏览方面表现良好，但软件支持可能有限。在AI基准测试中，其提示词处理能力突出，但在整体推理速度方面（对比苹果M3 Ultra或AMD Ryzen AI Max+ 395等系统）仅具备竞争力而非领先。作者指出，虽然在该细分领域性能强大，但其高昂价格及英伟达有限的软件支持周期，使其更偏向专业工具而非大众市场产品。"
  },
  {
    "id": "46454958",
    "title": "Common Lisp SDK for the Datastar Hypermedia Framework",
    "url": "https://github.com/fsmunoz/datastar-cl",
    "summary": "The Datastar Common Lisp SDK is a library that implements the Datastar Hypermedia Framework for Common Lisp, adhering closely to its architectural specifications. It provides core functionality for handling Server-Sent Events (SSE) and JSON parsing, using CLOS and the JZON library.\n\nThe SDK supports two main web server backends: a native **Hunchentoot** implementation and a **Clack**-based adapter, which has been tested with both Hunchentoot and Woo. A key consideration is that using Clack with Woo imposes a connection limit, as each SSE connection occupies a worker thread; Hunchentoot is recommended for applications requiring many concurrent connections.\n\nThe library includes features like **zstd compression** and is distributed under the MIT license. Practical usage examples are provided in the `test/` directory and in companion projects like the Data SPICE simulation and the Horizons JPL API explorer, which demonstrate SSE streaming and basic integration.",
    "chinese_title": "Datastar超媒体框架的通用Lisp SDK",
    "chinese_summary": "Datastar Common Lisp SDK 是一个实现了 Datastar 超媒体框架的 Common Lisp 库，严格遵循其架构规范。它利用 CLOS 和 JZON 库，提供了处理服务器发送事件（SSE）和 JSON 解析的核心功能。\n\n该 SDK 支持两种主要的 Web 服务器后端：原生的 **Hunchentoot** 实现和基于 **Clack** 的适配器，后者已通过 Hunchentoot 和 Woo 测试。需注意，当 Clack 与 Woo 结合使用时，由于每个 SSE 连接会占用一个工作线程，因此存在连接数限制；对于需要大量并发连接的应用，推荐使用 Hunchentoot。\n\n该库包含 **zstd 压缩** 等功能，并基于 MIT 许可证分发。实际使用示例可在 `test/` 目录以及配套项目（如 Data SPICE 模拟器和 Horizons JPL API 浏览器）中找到，这些示例展示了 SSE 流式传输和基本集成方法。"
  },
  {
    "id": "46430815",
    "title": "Quickemu: Quickly create and run optimised Windows, macOS and Linux VMs",
    "url": "https://github.com/quickemu-project/quickemu",
    "summary": "**Quickemu** is a user-friendly wrapper for QEMU that simplifies the creation and running of optimized virtual machines (VMs) for Windows, macOS, Linux, and many other operating systems. Its core goal is to automate VM setup, requiring minimal configuration from the user.\n\nThe process involves two main commands: `quickget` automatically downloads the desired OS image and generates a VM configuration file, while `quickemu` launches the VM with hardware-optimized settings. It runs without elevated permissions, allowing VMs to be stored on external drives or home directories.\n\nKey features include support for nearly 1000 OS editions, SPICE integration for clipboard sharing, VirtIO and Samba file sharing, USB pass-through, automatic SSH port forwarding, and optional EFI/SecureBoot. It is compatible with Linux and macOS hosts.\n\nOriginally designed for quick Linux distribution testing, Quickemu has expanded to offer comprehensive support for macOS versions (Sonoma to Mojave), Windows 10/11 (including TPM 2.0), and various BSDs and niche operating systems.",
    "chinese_title": "Quickemu：快速创建并运行优化的Windows、macOS和Linux虚拟机",
    "chinese_summary": "**Quickemu** 是一款用户友好的 QEMU 封装工具，可简化 Windows、macOS、Linux 及众多其他操作系统的优化虚拟机（VM）的创建与运行。其核心目标是自动化虚拟机设置，仅需用户进行极少配置。\n\n该过程主要涉及两条命令：`quickget` 自动下载所需操作系统镜像并生成虚拟机配置文件，而 `quickemu` 则以硬件优化设置启动虚拟机。它无需提升权限即可运行，允许将虚拟机存储在外置驱动器或主目录中。\n\n主要特性包括支持近 1000 种操作系统版本、集成 SPICE 实现剪贴板共享、VirtIO 与 Samba 文件共享、USB 直通、自动 SSH 端口转发以及可选的 EFI/安全启动。它兼容 Linux 和 macOS 主机。\n\nQuickemu 最初设计用于快速测试 Linux 发行版，现已扩展至全面支持 macOS 版本（从 Sonoma 到 Mojave）、Windows 10/11（包括 TPM 2.0）以及各种 BSD 和冷门操作系统。"
  },
  {
    "id": "46454587",
    "title": "Build a Deep Learning Library",
    "url": "https://zekcrates.quarto.pub/deep-learning-library/",
    "summary": "This article introduces a project-based guide for building a deep learning library from scratch. Instead of using existing frameworks, the reader starts with only NumPy and incrementally constructs core components, including an automatic differentiation engine (autograd) and neural network layer modules. The ultimate goal is to use this self-built library to train models on standard benchmarks like MNIST, a simple CNN, and a simple ResNet. The author notes the guide is free online but offers a pay-what-you-want option for support and provides contact information for feedback.",
    "chinese_title": "构建深度学习库",
    "chinese_summary": "本文介绍了一个从零开始构建深度学习库的基于项目的指南。读者无需使用现有框架，仅从NumPy起步，逐步构建核心组件，包括自动微分引擎（autograd）和神经网络层模块。最终目标是使用这个自建的库在标准基准测试（如MNIST、简单CNN和简单ResNet）上训练模型。作者指出该指南可免费在线获取，但为支持开发提供了自愿付费选项，并提供了反馈联系方式。"
  },
  {
    "id": "46411930",
    "title": "All my Deutschlandtickets gone: Fraud at an industrial scale [video]",
    "url": "https://media.ccc.de/v/39c3-all-my-deutschlandtickets-gone-fraud-at-an-industrial-scale",
    "summary": "This video presentation from the 39th Chaos Communication Congress details systemic fraud plaguing Germany's national public transport subscription, the Deutschlandticket. The speaker explains that the rapid, decentralized rollout of the ticket created a technically vulnerable system, leading to massive financial losses estimated in the hundreds of millions of euros.\n\nTwo primary fraud methods are exposed. The first involves a fraudulent website (d-ticket.su) that issued illegitimate tickets using a compromised private signing key from a legitimate transport company. The origin of the key breach remains unclear, and investigators faced uncooperative responses.\n\nThe second major fraud exploits SEPA Direct Debit. Fraudsters mass-purchase tickets using invalid or stolen bank details (IBANs). Because tickets are issued before the debit is processed, they can be resold at a discount on platforms like Telegram. The system often lacks mechanisms to revoke these fraudulent tickets.\n\nThe talk concludes by framing these issues as a result of political, policy, and technical failures, and discusses efforts to secure the ticket's future.",
    "chinese_title": "我的所有德国通票都不见了：工业级规模的欺诈【视频】",
    "chinese_summary": "这段来自第39届混沌通信大会的视频演讲，详细揭露了困扰德国全国公共交通订阅票“德国票”的系统性欺诈问题。演讲者指出，该票证快速、分散的推行方式导致系统存在技术漏洞，造成了估计高达数亿欧元的巨额财务损失。\n\n视频揭露了两种主要的欺诈手段。第一种涉及一个欺诈网站（d-ticket.su），该网站利用从一家合法运输公司泄露的私人签名密钥签发非法车票。密钥泄露的源头尚不清楚，且调查人员遇到了不合作的回应。\n\n第二种主要欺诈利用了SEPA直接借记系统。欺诈者使用无效或盗取的银行账户信息大规模购买车票。由于车票在扣款处理前就已签发，这些票可以在Telegram等平台上以折扣价转售。系统通常缺乏撤销此类欺诈车票的机制。\n\n演讲最后将这些问题的根源归结为政治、政策和技术层面的多重失误，并讨论了为保障该票证未来安全所做的努力。"
  },
  {
    "id": "46454968",
    "title": "Implementing HNSW (Hierarchical Navigable Small World) Vector Search in PHP",
    "url": "https://centamori.com/index.php?slug=hierarchical-navigable-small-world-hnsw-php&lang=en",
    "summary": "This article explains how to implement the Hierarchical Navigable Small World (HNSW) algorithm for efficient vector search in PHP. It solves the performance problem of linear search (O(N)) by creating a multi-layered graph structure, analogous to a road network with highways and local streets.\n\nThe core process involves a top-down search: starting at a sparse, high-level layer to quickly get near the target, then progressively descending through more detailed layers until reaching the dense base layer (Level 0). Here, a greedy search with a priority queue finds the k nearest neighbors, using a parameter `ef` to balance speed and accuracy by limiting candidate evaluations.\n\nThe index is built dynamically. New vectors are assigned a random maximum layer (higher layers are sparser). The algorithm then searches for the insertion point from the top down and connects the new node to its `M` nearest neighbors at each level, pruning excess connections to maintain efficiency.\n\nThis structure enables fast, approximate nearest neighbor search in O(log N) time, making it foundational for modern applications like recommendation systems and AI retrieval. The article references a full PHP implementation in the open-source Vektor project.",
    "chinese_title": "在PHP中实现HNSW（分层可导航小世界）向量搜索",
    "chinese_summary": "本文阐述了如何在PHP中实现分层可导航小世界（HNSW）算法以实现高效向量搜索。该算法通过构建多层图结构（类似于包含高速公路和地方道路的交通网络），解决了线性搜索（O(N)）的性能瓶颈。\n\n其核心流程采用自上而下的搜索方式：从稀疏的高层级开始快速接近目标，随后逐层深入更密集的层级，直至抵达最稠密的底层（第0层）。在底层通过带优先队列的贪婪搜索寻找k个最近邻，参数`ef`通过限制候选评估数量来平衡搜索速度与精度。\n\n索引采用动态构建方式。新向量被随机分配最高层级（层级越高越稀疏）。算法自上而下搜索插入位置，并在每个层级将新节点与其`M`个最近邻相连接，同时修剪冗余连接以保持效率。\n\n这种结构能以O(log N)时间复杂度实现快速近似最近邻搜索，成为推荐系统和AI检索等现代应用的基石。文中引用的完整PHP实现可见开源项目Vektor。"
  },
  {
    "id": "46456682",
    "title": "Building an internal agent: Code-driven vs. LLM-driven workflows",
    "url": "https://lethain.com/agents-coordinators/",
    "summary": "This article discusses the author's experience building an internal workflow agent and the shift from relying solely on LLMs to adopting a hybrid approach that combines both LLM-driven and code-driven workflows.\n\nInitially, the author believed LLMs with tool usage could solve complex workflows. A real-world example—automatically adding a Slack reaction to merged GitHub pull requests—demonstrated the concept's promise but also a critical flaw: the LLM's non-deterministic nature sometimes caused errors, undermining the workflow's reliability.\n\nTo address this, the team implemented support for two coordinator types in their system:\n1.  **LLM-driven (`coordinator: llm`)**: The default, where a handler uses a prompt and approved tools to orchestrate the LLM's actions.\n2.  **Code-driven (`coordinator: script`)**: A configuration where custom Python scripts take control. These scripts have access to the same tools and data as the LLM but can deterministically execute logic and only delegate to an LLM subagent when explicitly needed.\n\nThe result is a pragmatic, \"progressive enhancement\" model. Teams start with LLM-driven workflows for simplicity and speed. When a workflow requires higher reliability, performance, or determinism, it is rewritten into a code-driven workflow—a task often easily accomplished with AI assistance. The author concludes that using LLMs narrowly for tasks requiring genuine intelligence, while using code for reliable orchestration, is a powerful and sustainable long-term strategy.",
    "chinese_title": "构建内部智能体：代码驱动与LLM驱动的工作流对比",
    "chinese_summary": "本文探讨了作者构建内部工作流代理的经验，以及从单纯依赖大语言模型转向采用结合大语言模型驱动与代码驱动工作流的混合方法。\n\n最初，作者认为具备工具调用能力的大语言模型可以解决复杂工作流问题。一个实际案例——自动为已合并的GitHub拉取请求添加Slack表情——展示了该概念的潜力，但也暴露了关键缺陷：大语言模型的不确定性有时会导致错误，影响工作流的可靠性。\n\n为此，团队在系统中实现了两种协调器类型的支持：\n1.  **大语言模型驱动（`coordinator: llm`）**：默认模式，由处理器通过提示词和授权工具来协调大语言模型的行为。\n2.  **代码驱动（`coordinator: script`）**：通过自定义Python脚本控制的配置模式。这些脚本可访问与大语言模型相同的工具和数据，但能确定性执行逻辑，仅在明确需要时才委托大语言模型子代理处理。\n\n由此形成了务实渐进的增强模式：团队可先采用大语言模型驱动工作流以追求简便快捷；当工作流需要更高可靠性、性能或确定性时，则可将其重写为代码驱动工作流——这一转换过程常能借助人工智能轻松完成。作者总结认为，将大语言模型精准用于需要真正智能的任务，同时用代码实现可靠编排，是一种强大且可持续的长期策略。"
  },
  {
    "id": "46456797",
    "title": "Finland detains ship and its crew after critical undersea cable damaged",
    "url": "https://www.cnn.com/2025/12/31/europe/finland-estonia-undersea-cable-ship-detained-intl",
    "summary": "Finnish authorities have detained a cargo ship, the *Fitburg*, and its 14 crew members after it damaged a critical undersea telecommunications cable between Helsinki and Tallinn on December 31. The vessel, flagged to Saint Vincent and the Grenadines, was found with its anchor lowered in Finnish waters, though the damage occurred in Estonia's maritime zone.\n\nThe crew comprises citizens of Russia, Georgia, Kazakhstan, and Azerbaijan. The ship had departed from St. Petersburg, Russia, and was en route to Israel when it was intercepted by Finnish special forces and the coast guard.\n\nFinnish police are investigating the incident as aggravated criminal damage and interference with telecommunications. While the extent of the damage is unclear, it caused faults detected by the operator, Elisa. A second cable owned by a Swedish company was also damaged. Estonian authorities confirmed that backup connections ensured service continuity.\n\nThis event is part of a broader pattern, with at least 10 undersea cables in the Baltic Sea damaged or cut since 2023. Scandinavian, Baltic, and EU officials have frequently suspected Russian involvement in such incidents as part of a hybrid warfare strategy, though Russia denies it. A similar case from 2023 involving a vessel linked to Russia's shadow fleet was later dismissed by a Finnish court over jurisdiction.",
    "chinese_title": "芬兰扣押船只及其船员，因关键海底电缆受损",
    "chinese_summary": "芬兰当局扣押了一艘货轮“菲特堡号”及其14名船员，原因是该船于12月31日破坏了赫尔辛基与塔林之间一条重要的海底通信电缆。这艘悬挂圣文森特和格林纳丁斯国旗的船只被发现在芬兰水域抛锚，但损坏发生在爱沙尼亚海域。\n\n船员包括俄罗斯、格鲁吉亚、哈萨克斯坦和阿塞拜疆公民。该船从俄罗斯圣彼得堡出发，在前往以色列途中被芬兰特种部队和海岸警卫队拦截。\n\n芬兰警方正以严重刑事损害和干扰通信为由调查此事。虽然损坏程度尚不明确，但运营商Elisa已检测到故障。另一条由瑞典公司所有的电缆也遭到破坏。爱沙尼亚当局确认，备用连接确保了服务连续性。\n\n此次事件是更广泛模式的一部分：自2023年以来，波罗的海至少有10条海底电缆受损或被切断。斯堪的纳维亚、波罗的海和欧盟官员常怀疑俄罗斯参与此类事件，视其为混合战争策略的一部分，但俄方予以否认。2023年曾发生类似案件，涉及一艘与俄罗斯影子船队有关的船只，后因管辖权问题被芬兰法院驳回。"
  },
  {
    "id": "46448527",
    "title": "Love your customers",
    "url": "https://bcantrill.dtrace.org/2025/12/31/love-your-customers/",
    "summary": "In this article, the author reflects on a conversation with a former colleague now at Broadcom, which acquired VMware. The colleague described Broadcom's changes as a \"breath of fresh air\" and claimed most customers are happy, even joking that some who left \"came crawling back.\"\n\nThe author strongly disagrees, drawing a parallel to Oracle's acquisition of Sun, which was marked by contempt for customers. He finds the colleague's attitude—celebrating customer lock-in and dismissing litigation from major companies like AT&T and Fidelity—to be gross and shameful.\n\nThe core argument is that companies that disdain their customers, relying on coercion rather than value, may profit short-term but cannot endure or innovate. In contrast, the author's company, Oxide, explicitly builds its mission around loving customers, striving to solve their problems and be a company both customers and employees are proud to support.",
    "chinese_title": "热爱你的顾客",
    "chinese_summary": "本文中，作者回顾了与一位现就职于博通（VMware的收购方）的前同事的对话。这位同事将博通带来的变革形容为“一股新风”，并声称大多数客户都很满意，甚至开玩笑说一些离开的客户“又爬了回来”。\n\n作者对此强烈反对，并类比了甲骨文收购Sun的交易，指出那场收购充满了对客户的蔑视。他认为这位同事的态度——庆祝客户被锁定、无视AT&T和富达等大公司的诉讼——既粗鄙又可耻。\n\n核心论点是：那些轻视客户、依赖强制而非价值创造的企业，或许能短期获利，但无法持久或创新。相比之下，作者所在的Oxide公司明确将使命建立在关爱客户之上，致力于解决客户问题，努力成为客户和员工都自豪支持的企业。"
  },
  {
    "id": "46455053",
    "title": "Sony PS5 ROM keys leaked – jailbreaking could be made easier with BootROM codes",
    "url": "https://www.tomshardware.com/video-games/playstation/playstation-5-rom-keys-leaked-jailbreaking-could-be-made-easier-with-bootrom-codes",
    "summary": "The PlayStation 5's BootROM encryption keys have been leaked, potentially making it easier for hackers to develop jailbreaks. These keys are permanently embedded in the console's main processor (APU) and cannot be changed via a software update. As a result, existing PS5 consoles cannot be patched against future exploits that might use these keys.\n\nWhile the leak is a significant security breach, it does not mean an immediate jailbreak is available. Hackers would still need to bypass other security layers. However, access to these keys allows for deeper analysis of the PS5's boot system, which could eventually lead to custom firmware or modified operating systems.\n\nSony's options to fix the issue are limited and costly: they would need to manufacture revised hardware with new keys or recall existing consoles to replace their motherboards—both considered unlikely. The situation echoes past security issues with the PlayStation 3 and Nintendo Switch.\n\nThe article concludes with commentary from its forums, expressing hope that Valve's open approach with devices like the Steam Deck pressures other console makers to be less restrictive with their hardware.",
    "chinese_title": "索尼PS5 ROM密钥泄露——BootROM代码或使越狱更易实现",
    "chinese_summary": "PlayStation 5的BootROM加密密钥已遭泄露，这可能使黑客更容易开发越狱程序。这些密钥永久嵌入在主机的主处理器（APU）中，无法通过软件更新更改。因此，现有PS5主机无法针对未来可能利用这些密钥的攻击进行修补。\n\n尽管此次泄露是严重的安全漏洞，但这并不意味着立即会出现可用的越狱方案。黑客仍需绕过其他安全层。然而，获取这些密钥使得对PS5启动系统进行更深入分析成为可能，最终可能催生自定义固件或修改版操作系统。\n\n索尼解决此问题的选择有限且成本高昂：他们需要制造采用新密钥的修订版硬件，或召回现有主机更换主板——这两种方案都被认为不太可能实现。这一情况让人联想到PlayStation 3和任天堂Switch过去的安全问题。\n\n文章最后引用了论坛评论，希望Valve通过Steam Deck等设备采取的开放态度，能促使其他游戏机制造商减少对硬件的限制。"
  },
  {
    "id": "46452916",
    "title": "Show HN: Wario Synth – Turn any song into Game Boy version",
    "url": "https://www.wario.style",
    "summary": "**Wario Synth** is a web-based tool that transforms any song into a version that sounds like it's playing on a Nintendo Game Boy's sound chip.\n\n**How it works:** Users search for a song, select a MIDI source, and click \"Generate.\" The tool's \"Wario Synthesis Engine\" then analyzes the MIDI file and recreates it using browser-based oscillators specifically tuned to emulate the Game Boy's limited 4-channel audio hardware. All processing happens locally in the user's browser.\n\n**Key details:**\n*   **Platform:** A web app, requiring no installation.\n*   **Core Function:** Converts songs into chiptune-style audio reminiscent of classic Game Boy games.\n*   **Technical Note for iPhone Users:** An \"Enable Audio\" button is required due to Apple's autoplay policies; a single tap activates sound.\n*   **Project Nature:** A non-commercial, fun side project created by **@b1rdmania** using **Claude Code**. The creator humorously notes, \"Please don't sue me.\"\n*   **Availability:** The code is open-source and available on GitHub.",
    "chinese_title": "展示 HN：瓦里奥合成器——将任意歌曲转换为 Game Boy 版本",
    "chinese_summary": "**Wario Synth** 是一款基于网络的工具，可将任意歌曲转换为仿佛在任天堂 Game Boy 音效芯片上播放的版本。\n\n**工作原理：** 用户搜索歌曲、选择 MIDI 源文件后点击“生成”。工具的“Wario 合成引擎”会分析 MIDI 文件，并通过专门模拟 Game Boy 有限 4 声道音频硬件的浏览器振荡器重新合成音频。所有处理均在用户浏览器本地完成。\n\n**关键信息：**\n*   **平台：** 无需安装的网页应用。\n*   **核心功能：** 将歌曲转换为让人联想到经典 Game Boy 游戏的芯片音乐风格音频。\n*   **iPhone 用户技术提示：** 因苹果自动播放政策，需点击“启用音频”按钮激活声音。\n*   **项目性质：** 由 **@b1rdmania** 使用 **Claude Code** 创建的非营利趣味副项目。创作者幽默备注：“请别起诉我。”\n*   **可用性：** 代码已在 GitHub 开源。"
  },
  {
    "id": "46454854",
    "title": "Heap Overflow in FFmpeg EXIF",
    "url": "https://bugs.pwno.io/0014",
    "summary": "This article details a four-byte heap buffer overflow vulnerability in FFmpeg's EXIF processing code, affecting multiple image formats (PNG, JPEG, WebP, AVIF). The bug was introduced and discovered shortly after in December 2025.\n\nThe root cause lies in the `av_exif_write` function's handling of \"extra\" Image File Directory (IFD) tags. During EXIF serialization, the code assumes that internally reserved synthetic tags (IDs `0xFFFC` to `0xFFED`) are always contiguous and will be completely removed (\"peeled\") from the main IFD list before writing. The buffer size is calculated (`exif_get_ifd_size`) based on this assumption, assigning zero size to these tags.\n\nHowever, an attacker can craft an EXIF payload that injects one of these reserved tags (e.g., `0xFFFB`) directly into the main IFD during the initial parsing phase (`exif_decode_tag`). This creates a non-contiguous extra IFD entry that the peeling process misses. Consequently, the tag remains in the IFD list during writing, but its 12-byte directory slot was not accounted for in the allocated buffer size. When this tag contains a small inline payload (like a `SHORT` type), the code attempts a 4-byte zero-pad write (`AV_WN32`) that overflows the end of the under-allocated heap buffer.\n\nThe vulnerability is reliably triggered during standard decoding (`ffmpeg -i <file>`) and was promptly reported to and patched by the FFmpeg security team upon disclosure.",
    "chinese_title": "FFmpeg EXIF中的堆溢出漏洞",
    "chinese_summary": "本文详细介绍了FFmpeg的EXIF处理代码中存在的一个四字节堆缓冲区溢出漏洞，该漏洞影响多种图像格式（PNG、JPEG、WebP、AVIF）。此漏洞于2025年12月被引入并很快被发现。\n\n根本原因在于`av_exif_write`函数对“额外”图像文件目录（IFD）标签的处理。在EXIF序列化过程中，代码假设内部保留的合成标签（ID为`0xFFFC`至`0xFFED`）始终是连续的，并会在写入前从主IFD列表中完全移除（“剥离”）。缓冲区大小（`exif_get_ifd_size`）基于此假设计算，为这些标签分配零大小。\n\n然而，攻击者可以构造一个EXIF载荷，在初始解析阶段（`exif_decode_tag`）将其中一个保留标签（例如`0xFFFB`）直接注入主IFD。这会创建一个非连续的额外IFD条目，剥离过程会将其遗漏。因此，在写入时该标签仍保留在IFD列表中，但其12字节的目录槽位未计入分配的缓冲区大小。当该标签包含一个小的内联载荷（如`SHORT`类型）时，代码会尝试进行4字节零填充写入（`AV_WN32`），导致已分配不足的堆缓冲区末端溢出。\n\n该漏洞在标准解码过程中（`ffmpeg -i <文件>`）可稳定触发，并在披露后迅速报告给FFmpeg安全团队并得到修复。"
  },
  {
    "id": "46400158",
    "title": "Simple 3D Packing",
    "url": "https://github.com/Vrroom/psacking",
    "summary": "This article introduces **Spectral 3D Bin Packing**, a Python library implementing a GPU-accelerated algorithm for efficiently packing 3D objects into a container. The core method, based on a SIGGRAPH 2023 paper, uses **Fast Fourier Transform (FFT) operations** for rapid collision detection and optimal placement search, enabling dense, interlocking-free packing.\n\nKey features include a **simple Python API** for packing from voxel arrays or STL files, **CUDA acceleration** for performance, and **Blender export** for visualization. The algorithm works by voxelizing objects, using FFT correlation to find non-colliding placements, and scoring positions based on proximity and height to greedily pack items in descending volume order.\n\nThe library requires a **Linux system with an NVIDIA GPU (CUDA 11.0+)** and dependencies like FFTW3. It is installed from source and includes tools for benchmarking and generating high-quality renderings, as demonstrated by packing 348 objects into a specific tray at 60.8% density. The project is open-source under the MIT license.",
    "chinese_title": "简易三维装箱",
    "chinese_summary": "本文介绍**Spectral 3D Bin Packing**——一个基于GPU加速算法的Python库，用于高效地将三维物体装入容器。其核心方法源自SIGGRAPH 2023论文，采用**快速傅里叶变换（FFT）运算**实现快速碰撞检测与最优位置搜索，从而达成紧密且无交错的装箱效果。\n\n该库主要特性包括：支持体素数组或STL文件输入的**简洁Python API**、提升性能的**CUDA加速**功能，以及用于可视化的**Blender导出**工具。算法通过体素化物体、运用FFT相关性计算寻找无碰撞位置，并根据邻近度与高度对位置评分，最终按物体体积降序进行贪心式装箱。\n\n该库需在**配备NVIDIA GPU（CUDA 11.0+）的Linux系统**中运行，并依赖FFTW3等组件。需通过源码安装，内置性能基准测试与高质量渲染生成工具。实测案例中成功将348个物体以60.8%密度装入特定托盘。项目基于MIT开源协议发布。"
  },
  {
    "id": "46452937",
    "title": "Worlds largest electric ship launched by Tasmanian boatbuilder",
    "url": "https://www.theguardian.com/australia-news/2025/may/02/hull-096-worlds-largest-electric-ship-battery-power-launched",
    "summary": "Tasmanian shipbuilder Incat has launched what it claims is the world's largest battery-electric ship. The 130-meter vessel, named Hull 096, was built for South American ferry operator Buquebus and will operate between Buenos Aires, Argentina, and Uruguay.\n\nThe ship represents a significant step in sustainable shipping, designed to run entirely on battery power. It is equipped with over 250 tonnes of batteries, providing more than 40 megawatt-hours of capacity—reportedly four times larger than any previous maritime installation. This system powers eight electric-driven water jets.\n\nHull 096 can carry up to 2,100 passengers and 225 vehicles. Incat described the project as its most ambitious and complex to date, highlighting its potential to demonstrate the viability of large-scale, low-emission maritime transport for regular ferry routes. The launch comes as the global shipping industry, responsible for about 3% of world emissions, seeks cleaner alternatives.",
    "chinese_title": "塔斯马尼亚造船商推出世界最大电动船。",
    "chinese_summary": "塔斯马尼亚造船公司Incat推出了其宣称的全球最大电池动力船舶。这艘130米长的船舶名为\"Hull 096\"，为南美渡轮运营商Buquebus建造，将运营于阿根廷布宜诺斯艾利斯和乌拉圭之间的航线。\n\n该船标志着可持续航运的重要进展，设计为完全依靠电池动力航行。船上配备超过250吨电池组，提供超过40兆瓦时的储能容量——据称是此前任何船舶电池系统的四倍。该动力系统为八台电动喷水推进器提供能量。\n\nHull 096可搭载2100名乘客和225辆汽车。Incat称该项目是其迄今最具雄心和最复杂的工程，强调其有望证明大规模低排放海运在常规渡轮航线上的可行性。在全球航运业（约占全球排放量3%）寻求清洁替代方案的背景下，该船的推出恰逢其时。"
  },
  {
    "id": "46413256",
    "title": "If you care about security you might want to move the iPhone Camera app",
    "url": "https://blog.jgc.org/2025/12/if-you-care-about-security-you-might.html",
    "summary": "This article, dated December 2025, addresses a specific iPhone security concern. The author explains that lightly touching the Camera app icon—without fully opening the app—causes the camera to briefly activate, triggering the green privacy indicator light. This can easily happen accidentally while swiping between screens or holding the phone.\n\nThe author, initially worried about potential unauthorized camera access by other apps, used Apple’s App Privacy Report to investigate. The report confirmed the green dot was solely caused by the Camera app itself due to these accidental touches.\n\nThe recommended solution is simple: move the Camera app icon to a less prominent location on the home screen, away from where fingers or thumbs are likely to brush against it. This action significantly reduced the false alarms for the author.\n\nThe article concludes by framing this as an important security practice. It warns that becoming accustomed to unexplained behaviors like these \"false positive\" green dots could cause users to overlook a genuine, malicious breach of their camera privacy. Eliminating the accidental triggers helps maintain a clearer security signal.",
    "chinese_title": "如果你在意安全，或许应该移动iPhone的相机应用。",
    "chinese_summary": "这篇2025年12月的文章探讨了一个具体的iPhone安全问题。作者指出，轻触相机应用图标（无需完全打开应用）会短暂激活摄像头，并触发绿色隐私指示灯。在滑动屏幕或握持手机时，这种情况很容易意外发生。\n\n作者起初担心可能是其他应用在未经授权的情况下调用摄像头，于是使用苹果的\"App隐私报告\"进行调查。报告证实，绿色指示灯仅因这些意外触碰而由相机应用自身触发。\n\n建议的解决方案很简单：将相机应用图标移到主屏幕上不那么显眼的位置，远离手指或拇指容易误触的区域。这一操作显著减少了作者的误报情况。\n\n文章最后将此视为一项重要的安全实践。它警告说，如果用户习惯了这类\"误报\"绿色指示灯等不明原因的现象，可能会忽视真正恶意的摄像头隐私侵犯行为。消除意外触发因素有助于维持更清晰的安全警示信号。"
  },
  {
    "id": "46457196",
    "title": "Arpanet standardized TCP/IP on this day in 1983",
    "url": "https://www.tomshardware.com/networking/arpanet-standardized-tcp-ip-on-this-day-in-1983-43-year-old-standard-set-the-foundations-for-todays-internet",
    "summary": "On January 1, 1983, the ARPANET began a pivotal transition from its original Network Control Program (NCP) to the Transmission Control Protocol/Internet Protocol (TCP/IP). This switch, completed by mid-1983, established TCP/IP as the universal standard for global networking, connecting over 100 universities and research facilities by 1984 and forming the foundation of the modern Internet.\n\nTCP/IP, designed by Vinton Cerf and Robert Kahn, solved critical limitations of its predecessor. Unlike the ARPANET-only NCP, TCP/IP was built for internetworking, allowing disparate networks to interconnect seamlessly. Its success was driven by its open, vendor-neutral, and extensible design, which contrasted sharply with the era's proprietary protocols like IBM's SNA, Xerox's XNS, and DEC's DECnet.\n\nKey technical innovations of TCP/IP, such as congestion control, end-to-end reliability, and a layered architecture, enabled the development of essential future protocols like HTTP and DNS. Its ability to run on any hardware, from personal computers to supercomputers, made it the common denominator that unified the networking landscape. The article concludes that TCP/IP ultimately succeeded not necessarily by being the \"best\" in every technical aspect, but by being the most open, scalable, and universally adoptable solution, thereby becoming the indispensable backbone of the Internet.",
    "chinese_title": "阿帕网于1983年的这一天标准化了TCP/IP协议。",
    "chinese_summary": "1983年1月1日，ARPANET开始从原有的网络控制程序（NCP）向传输控制协议/互联网协议（TCP/IP）进行关键转型。这一转换于1983年中完成，确立了TCP/IP作为全球网络通用标准的地位——到1984年已连接超过100所大学和研究机构，奠定了现代互联网的基础。\n\n由文顿·瑟夫与罗伯特·卡恩设计的TCP/IP解决了其前身的核心局限。与仅适用于ARPANET的NCP不同，TCP/IP专为网络互联而构建，能让异构网络无缝连接。其成功得益于开放、厂商中立且可扩展的设计理念，这与当时IBM的SNA、施乐的XNS、DEC的DECnet等专有协议形成鲜明对比。\n\nTCP/IP的关键技术创新——如拥塞控制、端到端可靠性和分层架构——为HTTP、DNS等未来重要协议的诞生创造了条件。它能运行于从个人电脑到超级计算机的任何硬件，成为统一网络格局的通用基础。文章最终指出，TCP/IP的成功并非因其在所有技术层面都是“最优”，而是因其最具开放性、可扩展性和普适性，从而成为互联网不可或缺的支柱。"
  },
  {
    "id": "46449643",
    "title": "2025: The Year in LLMs",
    "url": "https://simonwillison.net/2025/Dec/31/the-year-in-llms/",
    "summary": "2025 was a pivotal year for LLMs, defined by the widespread adoption of \"reasoning\" models. These models, which break down complex problems into steps, made AI agents—systems that use tools in multi-step loops—practically useful for the first time. A key breakthrough was the rise of coding agents, led by the launch of Claude Code, which allow LLMs to autonomously write, execute, and debug code. This drove significant adoption of LLMs on the command line and led to the emergence of premium $200/month subscription tiers.\n\nChinese open-weight models, like DeepSeek and GLM-4.7, became globally competitive, challenging the dominance of Western labs. Agents also demonstrated a new ability to handle long, complex tasks that take humans hours to complete.\n\nThe year saw increased risks, with users often running agents in insecure \"YOLO\" mode, leading to warnings about a \"normalization of deviance\" in AI safety. Overall, 2025 marked a shift from LLMs as conversational tools to capable, autonomous systems for complex work.",
    "chinese_title": "2025：大语言模型之年",
    "chinese_summary": "2025年是大型语言模型的关键一年，其标志是“推理”模型的广泛普及。这类模型将复杂问题分解为多个步骤，使得AI智能体——即通过多步骤循环使用工具的系统——首次真正具备了实用价值。关键突破在于编码智能体的兴起，以Claude Code的发布为代表，它使大型语言模型能够自主编写、执行和调试代码。这极大地推动了大型语言模型在命令行中的广泛应用，并催生了每月200美元的高端订阅服务。\n\n中国开源模型，如DeepSeek和GLM-4.7，已在全球范围内具备竞争力，挑战了西方实验室的主导地位。智能体还展现出处理耗时数小时的长周期复杂任务的新能力。\n\n与此同时，风险也在增加：用户常在缺乏安全防护的“YOLO”模式下运行智能体，引发了关于AI安全领域“偏差常态化”的警告。总体而言，2025年标志着大型语言模型从对话工具转变为能够处理复杂工作的强大自主系统。"
  },
  {
    "id": "46452763",
    "title": "Children and Helical Time",
    "url": "https://moultano.wordpress.com/2025/12/30/children-and-helical-time/",
    "summary": "This article explores how our perception of time changes over a lifetime, feeling slower and more vivid in childhood and accelerating with age. It argues that because childhood constitutes half of our subjective, \"logarithmic\" life experience, we should value it for its own sake and not waste children's time.\n\nFor adults, the author suggests that while seeking new experiences can slow the perceived passage of time, a deeper renewal comes from having children. Kids reintroduce \"firsts\"—both those we've forgotten and those we can recreate for them—and revitalize traditions, making holidays meaningful again. Through their eyes, adults can reconnect with wonder and playfulness.\n\nUltimately, the article posits that raising children offers a profound sense of purpose and continuity. It allows adults to pass on their experiences, create lasting traditions, and achieve a form of legacy, transforming the linear march of time into a meaningful, helical cycle where life is about creating childhoods for others.",
    "chinese_title": "儿童与螺旋时间",
    "chinese_summary": "本文探讨了我们对时间的感知如何随年龄变化：童年时感觉缓慢而鲜活，随着年龄增长却加速流逝。文章指出，由于童年占据了我们主观“对数式”人生体验的一半，我们应当珍视童年本身的价值，而非虚度孩子的时光。\n\n对于成年人，作者认为虽然寻求新体验能减缓时间流逝感，但养育子女能带来更深层的更新。孩子重新带来了“第一次”——既有我们已遗忘的，也有我们能为他们重新创造的——并让传统焕发新生，使节日重获意义。通过孩子的眼睛，成年人能重新连接惊奇与童趣。\n\n最终，文章提出养育子女能带来深刻的目标感与延续性。它让成年人得以传递经验、建立持久传统、实现某种形式的传承，将线性的时间流逝转化为有意义的螺旋循环——在这种循环中，人生的意义在于为他人创造童年。"
  },
  {
    "id": "46453062",
    "title": "Rust--: Rust without the borrow checker",
    "url": "https://github.com/buyukakyuz/rustmm",
    "summary": "**Rust--** is a modified version of the Rust compiler that disables the borrow checker, allowing code that would normally violate Rust's strict ownership and borrowing rules to compile and run.\n\n**Key Points:**\n*   **Purpose:** It bypasses Rust's core safety guarantees (which prevent data races, use-after-free, and other memory errors) to let \"illegal\" code compile.\n*   **Use Case:** Primarily for experimentation, learning, or prototyping without the borrow checker's constraints.\n*   **How it Works:** The compiler is patched to skip borrow-checking analysis, treating all code as valid regardless of ownership violations.\n*   **Examples:** The article shows side-by-side comparisons where standard Rust errors (like moving a value then using it, or creating multiple mutable references) compile and run in Rust--, though this can lead to undefined behavior.\n*   **Availability:** Pre-built binaries are provided for macOS and Linux, with instructions to build from source.\n*   **License:** It retains Rust's dual licensing (Apache 2.0 and MIT).\n\n**Important Note:** Rust-- removes Rust's memory safety guarantees. Code that compiles may contain serious bugs like data races, dangling pointers, or memory corruption, and should not be used for production software.",
    "chinese_title": "Rust--：没有借用检查器的Rust",
    "chinese_summary": "**Rust--** 是 Rust 编译器的一个修改版本，它禁用了借用检查器，允许那些通常违反 Rust 严格所有权和借用规则的代码通过编译并运行。\n\n**关键点：**\n*   **目的：** 它绕过了 Rust 的核心安全保证（这些保证可防止数据竞争、释放后使用和其他内存错误），让“非法”代码得以编译。\n*   **使用场景：** 主要用于实验、学习或原型设计，不受借用检查器的约束。\n*   **工作原理：** 编译器经过修补，跳过了借用检查分析，无论是否存在所有权违规，都将所有代码视为有效。\n*   **示例：** 文章展示了并排比较，其中标准 Rust 会报错的情况（如移动一个值后使用它，或创建多个可变引用）在 Rust-- 中却能编译和运行，尽管这可能导致未定义行为。\n*   **可用性：** 提供了适用于 macOS 和 Linux 的预构建二进制文件，并附有从源代码构建的说明。\n*   **许可证：** 它保留了 Rust 的双重许可（Apache 2.0 和 MIT）。\n\n**重要提示：** Rust-- 移除了 Rust 的内存安全保证。编译通过的代码可能包含严重错误，如数据竞争、悬垂指针或内存损坏，因此不应用于生产软件。"
  },
  {
    "id": "46454413",
    "title": "2025 Letter",
    "url": "https://danwang.co/2025-letter/",
    "summary": "This 2025 year-in-review letter contrasts the cultures of Silicon Valley and the Chinese Communist Party, noting both are powerful, self-serious, and humorless. The author, having moved to Stanford, observes a Bay Area now dominated by AI and a heightened political role, creating a strange, intense atmosphere.\n\nThe piece praises Silicon Valley's core virtues: its meritocracy, openness to immigrants and new ideas, forward-looking energy, and strong community-building. It creates new products and lifestyles, offering unparalleled opportunity for the young and technically skilled.\n\nHowever, the author criticizes the region's significant flaws: a narrow, insular mindset that ignores the broader world, a lack of cultural awareness and investment, and a herd-like mentality intolerant of dissent. This is exemplified by its singular, often apocalyptic focus on AI, driven by a belief in the technology's potential to grant \"decisive strategic advantage\" and reshape global power.\n\nUltimately, the letter portrays Silicon Valley as a place of tremendous innovation and disturbing myopia, open to people but closed in perspective, relentlessly building a future it struggles to understand in a wider context.",
    "chinese_title": "2025年信件",
    "chinese_summary": "这份2025年度回顾信对比了硅谷与中国共产党两种文化，指出两者都强大、严肃且缺乏幽默感。作者移居斯坦福后观察到，如今的湾区已被人工智能和强化的政治角色主导，形成了一种怪异而紧张的氛围。\n\n文章赞扬了硅谷的核心优点：其精英管理制度、对移民与新思想的开放态度、前瞻性的活力以及强大的社区建设能力。它创造了新产品与生活方式，为年轻技术人才提供了无与伦比的机遇。\n\n然而，作者也批评了该地区的显著缺陷：狭隘封闭的思维模式忽视更广阔的世界，文化意识与投入的缺失，以及排斥异见的羊群心态。这体现在其对人工智能单一且常带末世论的聚焦上——这种狂热源于相信该技术能带来“决定性战略优势”并重塑全球权力格局。\n\n最终，这封信将硅谷描绘成一个充满惊人创新与令人不安的短视之地：它向人才敞开大门，却固守狭隘视角；它不懈地构建未来，却难以在更广阔的语境中理解自身。"
  },
  {
    "id": "46453582",
    "title": "Meta made scam ads harder to find instead of removing them",
    "url": "https://sherwood.news/tech/rather-than-fully-cracking-down-on-scam-ads-meta-worked-to-make-them-harder/",
    "summary": "According to internal documents reviewed by Reuters, Meta implemented a strategy to make scam advertisements on its platforms harder to find by regulators, journalists, and investigators, rather than comprehensively removing them. This approach was initially developed in response to pressure from Japanese regulators, who were considering requiring universal advertiser verification—a measure Meta estimated would cost $2 billion and reduce revenue by nearly 5%.\n\nThe tactic, which involved cleaning up search results to reduce the \"discoverability\" of fraudulent ads, was deemed so successful that Meta added it to a \"general global playbook\" for managing regulatory scrutiny in other major markets, including the U.S., Europe, India, Australia, Brazil, and Thailand.\n\nPrevious Reuters reporting indicated that Meta had internally projected approximately 10% of its 2024 revenue would come from ads linked to scams and banned goods, though the company later called that estimate overly broad. The report also stated the rate was double that figure in China. The core revelation is that Meta prioritized containing the visibility of its scam ad problem over implementing more costly, systemic solutions to address it.",
    "chinese_title": "Meta让诈骗广告更难被发现，而非将其移除。",
    "chinese_summary": "根据路透社查阅的内部文件显示，Meta采取了一项策略，使其平台上的诈骗广告更难被监管机构、记者和调查人员发现，而非全面清除这些广告。这一做法最初是为应对日本监管机构的压力而制定的，当时日本正考虑要求对所有广告主进行普遍验证——Meta估计此举将耗费20亿美元，并导致收入减少近5%。\n\n该策略通过清理搜索结果以降低欺诈广告的“可发现性”，被认为效果显著，因此Meta将其纳入了“全球通用应对手册”，用于在美国、欧洲、印度、澳大利亚、巴西和泰国等其他主要市场应对监管审查。\n\n路透社早前报道指出，Meta内部曾预测其2024年约10%的收入将来自与诈骗及违禁商品相关的广告，但该公司后来称这一估算过于宽泛。报道还称，这一比例在中国市场达到该数字的两倍。核心问题在于，Meta优先考虑降低其诈骗广告问题的可见性，而非实施成本更高、更系统化的解决方案来从根本上解决问题。"
  },
  {
    "id": "46402202",
    "title": "Easel Turns One One year of building my own IDE in Clojure",
    "url": "https://blog.phronemophobic.com/easel-one-year.html",
    "summary": "Easel is a Clojure-based IDE that has been in development for one year. Its core philosophy is to function as a modular, library-like platform where independent tools (for text editing, terminals, data inspection, etc.) can be arranged and share data within a single window.\n\nThe project aims to combine features like runtime Clojure extensibility, strong REPL-driven development, and data-oriented tooling—features that exist individually in other IDEs but not together. It builds on the JVM and Clojure to solve foundational hard problems like performance and concurrency, accepting the trade-off of needing to create a new UI library.\n\nThe author highlights social motivations, arguing that modern software lacks the integrated, creative tool ethos of platforms like NeXTSTEP or Emacs, and emphasizes building trustworthy, open-source tools.\n\nAfter a year of dogfooding, Easel is considered \"80% done,\" with core components like the Clobber text editor and various data tools already functional. The near-term roadmap focuses on improving error messages, integrating the FlowStorm debugger, and designing an extension system.\n\nThe project is open source but not yet ready for general use. Interested parties are encouraged to engage via Slack, GitHub, or Bluesky to follow its progress.",
    "chinese_title": "Easel一周年 在Clojure中打造个人IDE的一年历程",
    "chinese_summary": "Easel是一款基于Clojure的集成开发环境，已开发一年。其核心理念是构建一个模块化、类库式的平台，让文本编辑、终端、数据检查等独立工具能在单一窗口内自由排布并共享数据。\n\n该项目旨在融合运行时Clojure可扩展性、强大的REPL驱动开发以及数据导向工具链等特性——这些功能在其他IDE中虽零散存在却从未被整合。项目基于JVM和Clojure构建，以解决性能与并发等底层难题，为此不惜承担开发全新UI库的代价。\n\n作者强调了社会性动机，指出现代软件缺乏NeXTSTEP或Emacs这类平台所具有的集成化创意工具精神，并致力于构建可信赖的开源工具。\n\n经过一年的内部实践，Easel已完成约80%的开发，Clobber文本编辑器与各类数据工具等核心组件均已就绪。近期规划将着重改进错误提示、集成FlowStorm调试器，并设计扩展系统。\n\n该项目已开源但尚未达到通用阶段。感兴趣者可通过Slack、GitHub或Bluesky关注项目进展。"
  },
  {
    "id": "46446815",
    "title": "I canceled my book deal",
    "url": "https://austinhenley.com/blog/canceledbookdeal.html",
    "summary": "In 2023, Austin Z. Henley signed a book deal with a major publisher to write a programming book featuring classic, self-contained project tutorials. While initially motivated by the publisher's structure and distribution, he soon encountered significant drawbacks. The publisher pressured him to simplify content, dilute his personal voice, and pivot the book to include AI, which clashed with the book's core concept. The financial terms were poor—a small advance and low royalties—and the editorial feedback was often formulaic, focusing more on style than substance.\n\nAs deadlines slipped due to work, life commitments, and a lack of enjoyment in the process, Henley grew disillusioned. He was also concerned that AI tools like ChatGPT could render such tutorial books obsolete. After requesting a pause, he eventually terminated the contract, regaining full rights to his work.\n\nDespite canceling the deal, Henley remains committed to the book's idea. In response to reader interest, he has opted to self-publish, offering the e-book for pre-order with chapters to be released progressively, followed by a print version.",
    "chinese_title": "我取消了出书协议。",
    "chinese_summary": "2023年，奥斯汀·Z·亨利与一家大型出版社签约，计划撰写一本以经典、独立项目教程为特色的编程书籍。尽管最初受到出版社的框架和发行渠道吸引，但他很快发现了显著的弊端。出版社施压要求简化内容、淡化他的个人风格，并强行加入人工智能主题，这与书籍的核心理念相冲突。财务条款也颇为苛刻——预付金微薄，版税低廉，且编辑反馈往往流于形式，更关注风格而非实质内容。\n\n由于工作、生活事务以及创作过程中的乐趣缺失，亨利的交稿期限一再推迟，他逐渐感到幻灭。同时，他也担忧像ChatGPT这样的人工智能工具可能会使这类教程书籍过时。在请求暂停合作后，他最终终止了合同，重新获得了作品的完整权利。\n\n尽管取消了出版协议，亨利仍然坚持这本书的创作理念。为回应读者的兴趣，他选择自行出版，开放电子书预购并计划逐步发布章节，随后再推出印刷版本。"
  }
]