[
  {
    "id": "46812933",
    "title": "Project Genie: Experimenting with infinite, interactive worlds",
    "url": "https://blog.google/innovation-and-ai/models-and-research/google-deepmind/project-genie/",
    "summary": "Google is launching **Project Genie**, an experimental research prototype, to Google AI Ultra subscribers in the U.S. It allows users to create, explore, and modify interactive, AI-generated worlds in real time.\n\nPowered by the **Genie 3 world model**, the prototype lets users \"sketch\" worlds using text prompts and images, navigate them as they are generated on the fly, and remix creations from a gallery. The experience includes control over character perspective (first- or third-person) and movement style.\n\nGoogle positions this as a step toward building more general AI systems (AGI) that can understand and simulate diverse environments. The company acknowledges current limitations, including worlds that may not be fully realistic, occasional lag in character control, and a 60-second generation limit. Some previously announced features, like promptable world-changing events, are not yet included.\n\nAccess begins with U.S. subscribers, with plans to expand to more regions. The goal is to gather feedback and eventually make the world-building technology available to more users.",
    "chinese_title": "项目精灵：探索无限互动世界的实验",
    "chinese_summary": "谷歌正在向美国的Google AI Ultra订阅用户推出**Project Genie**，这是一款实验性研究原型。它允许用户实时创建、探索和修改由人工智能生成的互动世界。\n\n该原型基于**Genie 3世界模型**，用户可通过文字提示和图像“绘制”世界，在动态生成的世界中自由探索，并能从作品库中重新组合创作。体验中还包括对角色视角（第一人称或第三人称）和移动风格的控制。\n\n谷歌将此视为朝着构建更通用的人工智能系统（AGI）迈出的一步，这类系统能够理解和模拟多样化的环境。公司承认目前存在一些限制，包括生成的世界可能不够逼真、角色控制偶尔出现延迟，以及生成时间限制在60秒内。一些先前宣布的功能，如可通过提示改变世界事件，目前尚未包含在内。\n\n该服务首先面向美国订阅用户开放，并计划扩展到更多地区。目标是收集反馈，最终将这项世界构建技术推广给更多用户。"
  },
  {
    "id": "46814569",
    "title": "My Mom and Dr. DeepSeek (2025)",
    "url": "https://restofworld.org/2025/ai-chatbot-china-sick/",
    "summary": "This article explores the author's mother, a 57-year-old kidney transplant patient in China, who turns to the AI chatbot DeepSeek for medical advice due to dissatisfaction with her rushed, impersonal hospital visits. Feeling neglected by an overburdened healthcare system, she finds DeepSeek to be a patient, empathetic, and always-available \"doctor\" that analyzes her reports and offers detailed lifestyle and medication guidance.\n\nWhile the chatbot provides her with a sense of control and care, its medical advice is often dangerously flawed. For instance, it suggested she reduce her prescribed immunosuppressant dosage—a move that could jeopardize her transplant. U.S. nephrologists reviewing the conversations identified significant errors in its recommendations.\n\nThe story highlights a broader trend: as AI chatbots weave into healthcare globally, they offer comfort and information to those lacking resources or attention. However, the article underscores the serious risks of outsourcing medical care to systems prone to \"hallucinations\" and bias, emphasizing that these tools are not substitutes for professional medical expertise, despite their convincing and affirming tone.",
    "chinese_title": "我的妈妈与DeepSeek博士（2025）",
    "chinese_summary": "本文讲述了一位57岁的中国肾移植患者——作者的母亲，因不满医院就诊的仓促与冷漠，转而向AI聊天机器人DeepSeek寻求医疗建议的故事。在不堪重负的医疗体系中感到被忽视的她，发现DeepSeek成了一位耐心、共情且随时在线的“医生”，能为她分析检查报告并提供详细的生活与用药指导。\n\n虽然聊天机器人给了她掌控感和关怀，但其医疗建议往往存在严重谬误。例如，它曾建议她减少免疫抑制剂的处方剂量——这一举动可能危及移植肾脏的存活。审阅对话记录的美国肾病专家指出，其建议中存在重大错误。\n\n这个故事反映了一个更广泛的趋势：随着AI聊天机器人逐渐融入全球医疗体系，它们为缺乏资源或关注的患者提供了慰藉与信息。然而，文章也强调了将医疗咨询外包给容易产生“幻觉”和偏见的系统所带来的严重风险，并指出尽管这些工具语气令人信服且富有同理心，但绝不能替代专业医疗判断。"
  },
  {
    "id": "46810282",
    "title": "Claude Code Daily Benchmarks for Degradation Tracking",
    "url": "https://marginlab.ai/trackers/claude-code/",
    "summary": "This article describes an independent daily performance tracker for Claude Code Opus 4.5 on software engineering (SWE) tasks. Its primary goal is to detect statistically significant performance degradations, inspired by a past incident where Anthropic acknowledged model regression.\n\nThe tracker runs daily benchmarks on a curated subset of SWE-Bench-Pro, using the latest Claude Code CLI directly (without custom harnesses) to reflect real user experience. Each day, it evaluates 50 test instances.\n\nKey metrics displayed include:\n*   **Daily, 7-day, and 30-day pass rates** (currently 50%, 53%, and 54%, respectively).\n*   A **historical baseline pass rate** of 58%, used as a reference.\n*   A **\"Degradation detected\"** alert for the past 30 days, where the current 54% pass rate is a statistically significant drop from the 58% baseline.\n\nThe methodology uses statistical testing (95% confidence intervals) to determine significance. The required margin to claim a significant change varies with sample size: ±14.0% for daily results, ±5.6% for weekly, and ±3.4% for monthly. The current 4.1% drop over 30 days exceeds its threshold, confirming a significant regression.",
    "chinese_title": "克劳德代码每日基准测试用于退化追踪",
    "chinese_summary": "本文介绍了一个针对Claude Code Opus 4.5在软件工程任务上的独立日常性能追踪器。其主要目标是检测统计显著的性能下降，灵感来源于Anthropic曾承认模型性能回退的过往事件。\n\n该追踪器每日在精选的SWE-Bench-Pro子集上运行基准测试，直接使用最新的Claude Code CLI（不依赖定制框架）以反映真实用户体验。每日评估50个测试实例。\n\n展示的关键指标包括：\n*   **每日、7日及30日通过率**（当前分别为50%、53%和54%）。\n*   **历史基线通过率**为58%，作为参考标准。\n*   过去30天触发**“检测到性能下降”**警报，当前54%的通过率相较58%的基线存在统计显著下降。\n\n该方法采用统计检验（95%置信区间）判定显著性。判定显著变化所需的误差范围随样本量变化：日结果需±14.0%，周结果需±5.6%，月结果需±3.4%。当前30日周期4.1%的降幅已超出阈值，证实存在显著性能回退。"
  },
  {
    "id": "46812159",
    "title": "Drug trio found to block tumour resistance in pancreatic cancer",
    "url": "https://www.drugtargetreview.com/news/192714/drug-trio-found-to-block-tumour-resistance-in-pancreatic-cancer/",
    "summary": "A preclinical study from the Spanish National Cancer Research Centre has identified a triple-drug combination that induces complete and lasting regression of pancreatic tumours, while also preventing treatment resistance.\n\nThe research targets pancreatic ductal adenocarcinoma (PDAC), a highly lethal cancer with limited treatment options. The strategy involves simultaneously inhibiting three key signalling pathways: downstream KRAS signalling (with RMC-6236/daraxonrasib), upstream EGFR receptors (with afatinib), and the parallel STAT3 survival pathway (with SD36).\n\nIn orthotopic mouse models, this combination therapy drove complete tumour regression. Crucially, no tumour regrowth or resistance was observed for over 200 days post-treatment. The therapy also showed efficacy in genetically engineered mouse models and patient-derived tumour xenografts, and was well-tolerated in the animals.\n\nThe researchers conclude that overcoming resistance in PDAC requires this coordinated, multi-pathway attack. They state these results should guide the development of new clinical trials for pancreatic cancer patients, representing a significant step toward a potential new therapeutic approach.",
    "chinese_title": "研究发现药物组合可阻断胰腺癌肿瘤耐药性",
    "chinese_summary": "西班牙国家癌症研究中心的一项临床前研究发现，一种三药联合疗法能够诱导胰腺肿瘤完全且持久的消退，同时防止治疗耐药性的产生。\n\n该研究针对胰腺导管腺癌（PDAC）——一种治疗选择有限、致死率极高的癌症。该策略同时抑制三个关键信号通路：下游KRAS信号通路（使用RMC-6236/daraxonrasib）、上游EGFR受体（使用阿法替尼）以及平行的STAT3生存通路（使用SD36）。\n\n在原位小鼠模型中，这种联合疗法实现了肿瘤的完全消退。关键的是，治疗后超过200天未观察到肿瘤再生或耐药现象。该疗法在基因工程小鼠模型和患者来源的肿瘤异种移植模型中也显示出疗效，并且在动物体内耐受性良好。\n\n研究人员总结认为，克服PDAC的耐药性需要这种协调的多通路联合攻击。他们指出，这些结果应指导针对胰腺癌患者的新临床试验设计，标志着向潜在新疗法迈出了重要一步。"
  },
  {
    "id": "46811588",
    "title": "OTelBench: AI struggles with simple SRE tasks (Opus 4.5 scores only 29%)",
    "url": "https://quesma.com/blog/introducing-otel-bench/",
    "summary": "This benchmark, OTelBench, tested 14 AI models on 23 realistic tasks to add OpenTelemetry distributed tracing to small microservices across 11 programming languages. The results show that even frontier models struggle significantly with this core Site Reliability Engineering (SRE) task.\n\nThe best-performing model, Claude 4.5 Opus, succeeded only 29% of the time, with GPT 5.2 at 26%. Notably, Gemini 3 Pro showed no advantage over the cheaper Gemini 3 Flash (19%). Performance varied by language, with models failing completely on Java, Ruby, and Swift, while achieving moderate success in Go (20%) and C++ (37%).\n\nCritically, many AI-generated solutions compiled correctly but produced functionally incorrect traces—such as incorrectly merging separate user actions into a single trace—demonstrating that models often apply instrumentation mechanically without understanding the business context.\n\nThe authors conclude that while AI shows promise, current models lack the polyglot skills, long-horizon reasoning, and deep understanding required for reliable production instrumentation. They argue that AI SRE capabilities in 2026 are overhyped and that for now, engineers must still write this code themselves. The benchmark is released as open-source to guide future development.",
    "chinese_title": "OTelBench：AI在简单SRE任务中表现不佳（Opus 4.5仅获29%得分）",
    "chinese_summary": "该基准测试OTelBench在11种编程语言中，针对为小型微服务添加OpenTelemetry分布式追踪的23项实际任务，评估了14个AI模型。结果显示，即使是前沿模型在这一核心站点可靠性工程（SRE）任务上也表现艰难。\n\n表现最佳的Claude 4.5 Opus成功率仅为29%，GPT 5.2为26%。值得注意的是，Gemini 3 Pro并未比更廉价的Gemini 3 Flash（19%）展现出优势。不同语言间性能差异显著：模型在Java、Ruby和Swift上完全失败，而在Go（20%）和C++（37%）中取得有限成功。\n\n关键问题在于，许多AI生成的解决方案虽能正确编译，却产生功能错误的追踪——例如将独立的用户操作错误合并为单个追踪——这表明模型往往机械式实施插装而缺乏业务上下文理解。\n\n研究者总结认为，尽管AI展现潜力，但当前模型仍缺乏可靠生产环境插装所需的多语言技能、长周期推理能力和深层理解。他们指出2026年AI的SRE能力被过度炒作，目前工程师仍需亲自编写这类代码。该基准测试已开源发布，以指导未来开发。"
  },
  {
    "id": "46741602",
    "title": "C++ Modules Are Here to Stay",
    "url": "https://faresbakhit.github.io/e/cpp-modules/",
    "summary": "This article introduces C++20 modules as a modern replacement for traditional header files (`#include`). It explains that modules allow for cleaner encapsulation of libraries (like `std`, Qt, or custom code) by explicitly exporting declarations, improving code organization and reducing compile times.\n\nKey concepts covered include:\n*   **Module Units:** Translation units that declare a module, which can combine interface and implementation.\n*   **Exports:** Explicitly making declarations available to users of the module.\n*   **Partitions:** A way to split a large module into private, interdependent units for better code structure.\n*   **Global Module Fragment:** Allows for backward compatibility by letting modules use legacy `#include` directives.\n\nThe article emphasizes the significant **compilation speed benefits** of modules, citing an 8.6x speedup over standard compilation in a benchmark. It acknowledges that tooling support (from compilers and CMake) is still evolving but is sufficient for many projects, especially personal ones. A minimal CMake configuration and a practical script for using `import std;` with Clang are provided to help readers get started. The core argument is that while header files work, modules offer a faster, more maintainable future for C++ development.",
    "chinese_title": "C++模块化已成定局。",
    "chinese_summary": "本文介绍了C++20模块作为传统头文件（`#include`）的现代替代方案。它阐释了模块如何通过显式导出声明，实现对库（如`std`、Qt或自定义代码）的更清晰封装，从而改善代码组织并减少编译时间。\n\n涵盖的核心概念包括：\n*   **模块单元：** 声明模块的翻译单元，可合并接口与实现。\n*   **导出：** 显式将声明提供给模块使用者。\n*   **分区：** 将大型模块拆分为私有的、相互依赖的单元以优化代码结构。\n*   **全局模块片段：** 通过允许模块使用传统的`#include`指令实现向后兼容。\n\n文章强调了模块带来的显著**编译速度优势**，引用了一项基准测试中相比标准编译8.6倍的加速效果。同时指出工具链支持（编译器和CMake）仍在发展中，但对许多项目（尤其是个人项目）已足够成熟。文中提供了简明的CMake配置示例和一个使用Clang实现`import std;`的实用脚本，以帮助读者快速上手。核心论点是：虽然头文件仍可工作，但模块为C++开发提供了更快速、更易维护的未来方向。"
  },
  {
    "id": "46806773",
    "title": "Europe’s next-generation weather satellite sends back first images",
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Meteorological_missions/meteosat_third_generation/Europe_s_next-generation_weather_satellite_sends_back_first_images",
    "summary": "The first images from the Meteosat Third Generation-Sounder (MTG-S) satellite, released in November 2025, demonstrate its advanced capabilities for revolutionizing weather forecasting over Europe and Africa. Positioned in geostationary orbit, the satellite’s Infrared Sounder instrument captured detailed data on surface/cloud-top temperatures and atmospheric humidity across the entire Earth disc.\n\nThese initial images highlight specific features, such as warm landmasses in Africa and South America, dry air over the Sahara, and humid regions elsewhere. A close-up of Europe shows a weather front over Spain, while an animation tracked a volcanic ash plume in Ethiopia, showcasing the satellite's monitoring potential.\n\nMTG-S is a groundbreaking mission for the European Space Agency (ESA) and its partners. Its key innovation is being Europe’s first hyperspectral sounder in geostationary orbit. Using 1,700 infrared channels, it will soon generate 3D atmospheric maps of temperature, humidity, and trace gases every 30 minutes. This unprecedented data will significantly improve the accuracy and timeliness of weather forecasts, particularly for nowcasting severe storms.\n\nThe satellite, launched in July 2025, also hosts the Copernicus Sentinel-4 instrument. Mission control and data distribution are managed by Eumetsat.",
    "chinese_title": "欧洲新一代气象卫星传回首批图像",
    "chinese_summary": "2025年11月发布的第三代气象卫星探测载荷（MTG-S）首批图像，展现了其革新欧洲和非洲天气预报的先进能力。这颗卫星运行于地球静止轨道，其红外探测仪采集了整个地球圆盘的地表/云顶温度及大气湿度详细数据。\n\n这些初始图像突显了特定气象特征，如非洲和南美洲的温暖陆地、撒哈拉沙漠上空的干燥空气以及其他区域的湿润地带。欧洲特写图像显示了西班牙上空的天气锋面，而一段动画则追踪了埃塞俄比亚的火山灰羽流，彰显了卫星的监测潜力。\n\nMTG-S是欧洲航天局及其合作伙伴的一项开创性任务。其核心创新在于成为欧洲首个地球静止轨道高光谱探测仪。通过1700个红外通道，它将每30分钟生成温度、湿度和痕量气体的三维大气图谱。这种前所未有的数据将显著提升天气预报的准确性和时效性，尤其有助于强风暴的临近预报。\n\n该卫星于2025年7月发射，同时搭载了哥白尼哨兵-4号探测仪。任务控制与数据分发由欧洲气象卫星开发组织负责。"
  },
  {
    "id": "46814115",
    "title": "OpenAI's In-House Data Agent",
    "url": "https://openai.com/index/inside-our-in-house-data-agent",
    "summary": "**Summary of \"OpenAI's In-House Data Agent\"**\n\nOpenAI has developed an internal AI agent to automate and improve its data labeling processes, which are critical for training and evaluating AI models. The agent, built using GPT-4, interprets complex natural language instructions to perform a variety of data tasks that were previously manual, time-consuming, and difficult to scale.\n\nKey points include:\n\n*   **Purpose:** The agent addresses the bottleneck of high-quality data labeling, a major challenge in AI development. It handles tasks like filtering, categorization, evaluation, and annotation.\n*   **How it Works:** Engineers provide the agent with natural language directives (e.g., \"label all conversations where the assistant is deceptive\"). The agent then writes and executes code, primarily Python, to complete these data-processing jobs.\n*   **Impact:** This automation has significantly accelerated OpenAI's research and development cycle. It allows small teams to execute large-scale data projects in hours instead of weeks, enabling faster iteration on model training and safety evaluations.\n*   **Human-in-the-Loop:** The system is designed for collaboration. Humans review the agent's code and results, providing oversight and refining instructions in an iterative feedback loop to ensure quality and accuracy.\n*   **Broader Implication:** OpenAI sees this as a case study in using AI to build better AI—a \"data flywheel\" where improved models create better tools for processing data, which in turn leads to even better models.\n\nIn essence, the article details an internal tool that leverages OpenAI's own technology to streamline its core development workflow, demonstrating a practical application of AI for scaling and enhancing AI research itself.",
    "chinese_title": "OpenAI的内部数据代理",
    "chinese_summary": "**《OpenAI内部数据代理工具概述》**\n\nOpenAI开发了一款内部AI代理工具，旨在自动化并改进其数据标注流程，这对AI模型的训练和评估至关重要。该代理基于GPT-4构建，能够解析复杂的自然语言指令，执行多种以往依赖人工、耗时且难以规模化的数据任务。\n\n主要要点包括：\n\n*   **目的：** 该代理旨在解决高质量数据标注这一AI发展中的主要瓶颈，可处理数据筛选、分类、评估和标注等任务。\n*   **工作原理：** 工程师向代理提供自然语言指令（例如：“标注所有助手存在欺骗性的对话”），代理随后编写并执行代码（主要是Python）来完成这些数据处理工作。\n*   **影响：** 这种自动化显著加速了OpenAI的研发周期。它使得小型团队能够在数小时内而非数周内执行大规模数据项目，从而更快地进行模型训练和安全评估的迭代。\n*   **人机协同：** 该系统专为协作设计。人类会审查代理生成的代码和结果，通过迭代反馈循环进行监督并优化指令，以确保质量和准确性。\n*   **更广泛的意义：** OpenAI将此视为利用AI构建更好AI的一个案例研究——一个“数据飞轮”：改进的模型能创造出更好的数据处理工具，进而催生出更优秀的模型。\n\n本质上，这篇文章详细介绍了一款利用OpenAI自身技术来优化其核心开发工作流程的内部工具，展示了AI在规模化与增强AI研究本身方面的实际应用。"
  },
  {
    "id": "46812173",
    "title": "US cybersecurity chief leaked sensitive government files to ChatGPT: Report",
    "url": "https://www.dexerto.com/entertainment/us-cybersecurity-chief-leaked-sensitive-government-files-to-chatgpt-report-3311462/",
    "summary": "In July 2025, acting CISA director Madhu Gottumukkala uploaded sensitive government documents marked \"For Official Use Only\" into a public version of ChatGPT, according to a Politico investigation. This triggered internal security alerts and a federal damage assessment, as inputs to public ChatGPT are shared with its developer, OpenAI, creating a potential data breach.\n\nGottumukkala had been granted a special exemption to use the AI tool, which is otherwise blocked for Department of Homeland Security staff. A CISA spokesperson stated his use was \"short-term and limited\" with DHS controls in place.\n\nThe incident adds to scrutiny of Gottumukkala's tenure, which includes a reported prior failure of a counterintelligence polygraph test—a claim he rejected in recent congressional testimony. He has led CISA in an acting capacity since May 2025, pending Senate confirmation of a permanent director.\n\nThe report emerges amid the Trump administration's push for broader AI adoption across federal agencies, including a recent Pentagon \"AI-first\" strategy and an executive order aimed at limiting state-level AI regulation.",
    "chinese_title": "美国网络安全主管向ChatGPT泄露敏感政府文件：报道称",
    "chinese_summary": "据《政治报》调查，2025年7月，代理CISA局长马杜·戈图穆卡拉将标有“仅限官方使用”的敏感政府文件上传至公开版ChatGPT。此举触发了内部安全警报并引发联邦损害评估，因为公开版ChatGPT的输入内容会与其开发商OpenAI共享，可能造成数据泄露。\n\n戈图穆卡拉此前获准特例使用该人工智能工具——国土安全部其他员工均被禁止使用。CISA发言人表示，其使用是“短期且有限的”，且国土安全部已实施管控措施。\n\n该事件使戈图穆卡拉的任期受到更多审视。据报道，他此前曾未通过反情报测谎测试，但他在近期国会听证中否认了这一说法。自2025年5月起，他一直以代理身份领导CISA，等待参议院对常任局长的确认。\n\n此报告发布之际，特朗普政府正推动人工智能在联邦机构中的广泛应用，包括五角大楼近期提出的“人工智能优先”战略，以及一项旨在限制州级人工智能监管的行政命令。"
  },
  {
    "id": "46729139",
    "title": "EmulatorJS",
    "url": "https://github.com/EmulatorJS/EmulatorJS",
    "summary": "**Summary:**\n\nEmulatorJS is a self-hosted, open-source JavaScript emulator for a wide range of classic gaming systems. As of version 4.0, it is a complete rewrite and no longer includes emulation cores within its main repository. Users must obtain these cores separately via project releases or a dedicated CDN.\n\nKey operational points include:\n*   **Deployment:** For production, using official releases or the CDN is recommended over cloning the repository.\n*   **Versioning:** It uses three distinct version tracks: **stable** (tested releases), **latest** (newest code with stable cores), and **nightly** (cutting-edge, potentially unstable builds).\n*   **CDN:** A public CDN (`cdn.emulatorjs.org`) simplifies setup by hosting all necessary files.\n*   **Integration:** Designed as a plugin, it is meant to be integrated into other front-end projects, with several third-party implementations available.\n*   **Development:** Includes tools for local testing and minification for production optimization.\n\nThe project supports emulation for numerous systems from Nintendo, Sega, Atari, Commodore, Sony PlayStation, and others like 3DO and MAME. It is ad-free, funded via Patreon and optional demo page ads, and encourages detailed bug reports to assist development.",
    "chinese_title": "EmulatorJS",
    "chinese_summary": "**概述：**\n\nEmulatorJS 是一款自托管、开源的 JavaScript 模拟器，支持多种经典游戏系统。截至 4.0 版本，它已完全重写，主仓库不再包含模拟核心。用户必须通过项目发布版本或专用 CDN 单独获取这些核心。\n\n主要操作要点包括：\n*   **部署：** 生产环境中，建议使用官方发布版本或 CDN，而非克隆仓库。\n*   **版本管理：** 采用三个独立的版本分支：**stable**（经过测试的发布版）、**latest**（最新代码搭配稳定核心）和 **nightly**（前沿但可能不稳定的构建版）。\n*   **CDN：** 公共 CDN（`cdn.emulatorjs.org`）托管所有必需文件，简化了设置过程。\n*   **集成：** 设计为插件形式，旨在集成到其他前端项目中，已有多个第三方实现可用。\n*   **开发：** 包含本地测试工具和生产环境优化所需的代码压缩功能。\n\n该项目支持模拟任天堂、世嘉、雅达利、康懋达、索尼 PlayStation 以及 3DO 和 MAME 等多种系统。它无广告，通过 Patreon 和可选演示页面广告获得资助，并鼓励提交详细的错误报告以协助开发。"
  },
  {
    "id": "46814614",
    "title": "County pays $600k to pentesters it arrested for assessing courthouse security",
    "url": "https://arstechnica.com/security/2026/01/county-pays-600000-to-pentesters-it-arrested-for-assessing-courthouse-security/",
    "summary": "In 2019, penetration testers Gary DeMercurio and Justin Wynn were arrested while performing an authorized security assessment of the Dallas County Courthouse in Iowa. Their employer, Coalfire Labs, had a contract with the Iowa Judicial Branch explicitly permitting physical security tests, including lockpicking.\n\nDespite presenting their authorization letter to deputies—who initially confirmed its legitimacy and even chatted with the testers—Sheriff Chad Leonard intervened upon arrival. Asserting jurisdiction over the courthouse, he had the men arrested on felony burglary charges. They spent 20 hours in jail before posting bail. Although charges were later reduced and eventually dismissed, Sheriff Leonard continued publicly alleging illegal activity, damaging the professionals' reputations.\n\nDeMercurio and Wynn sued the county and sheriff for false arrest, defamation, and malicious prosecution. Just before trial was set to begin in 2024, Dallas County agreed to a $600,000 settlement. The testers argued the incident sent a chilling message to security professionals and undermined public safety by punishing those hired to find vulnerabilities. The settlement affirmed their work was authorized and lawful.",
    "chinese_title": "县府向评估法院安全而被捕的渗透测试者支付60万美元",
    "chinese_summary": "2019年，渗透测试员加里·德默库里奥和贾斯汀·温恩在对爱荷华州达拉斯县法院进行授权安全评估时被捕。他们的雇主Coalfire实验室与爱荷华州司法部门签有合同，明确允许包括开锁在内的实体安全测试。\n\n尽管测试人员向警员出示了授权书——警员最初确认了其合法性，甚至与测试人员交谈——但警长查德·伦纳德抵达后介入此事。他坚称对该法院拥有管辖权，并以重罪盗窃罪名逮捕了两人。他们在缴纳保释金前被关押了20小时。尽管指控后来被减轻并最终撤销，伦纳德警长仍继续公开指控其非法活动，损害了这些专业人士的声誉。\n\n德默库里奥和温恩以非法逮捕、诽谤和恶意起诉为由起诉该县及警长。就在2024年庭审即将开始前，达拉斯县同意支付60万美元和解金。测试人员认为，此事向安全专业人员发出了令人寒心的信号，通过惩罚受雇发现漏洞的人员破坏了公共安全。和解协议确认了他们的工作具有授权且合法。"
  },
  {
    "id": "46812892",
    "title": "Reflex (YC W23) Senior Software Engineer Infra",
    "url": "https://www.ycombinator.com/companies/reflex/jobs/Jcwrz7A-lead-software-engineer-infra",
    "summary": "**Job Summary: Lead Software Engineer, Infrastructure at Reflex (YC W23)**\n\nReflex is hiring a Lead Software Engineer for Infrastructure in San Francisco to own and develop their entire infrastructure stack. The role requires 3+ years of experience and expertise in Kubernetes, Helm, Terraform, Python, and AWS. The position offers a salary range of $130K-$200K plus equity (0.15%-0.50%).\n\n**Key Responsibilities:** Leading the infrastructure team, maintaining and improving the observability and monitoring stack, and pushing technical boundaries.\n\n**Interview Process:** A fully remote process involving an intro call, a technical take-home test, 2-3 remote technical interviews, and a final team decision.\n\n**About Reflex:** The company provides a unified platform for building, deploying, and managing enterprise applications, aiming to replace fragmented toolchains. It combines an open-source framework with a managed platform.\n\n**Why Join:** Reflex reports significant traction with over 1 million applications built, 28,000+ GitHub stars, and use by 30% of Fortune 500 companies. The founding team includes experienced open-source maintainers and competitive programmers, and the company is in a high-growth phase following a recent funding round.",
    "chinese_title": "Reflex（YC W23）高级基础设施软件工程师",
    "chinese_summary": "**职位概述：Reflex（YC W23）基础设施首席软件工程师**\n\nReflex正在旧金山招聘一名基础设施首席软件工程师，负责全面掌管并开发其整个基础设施技术栈。该职位要求具备3年以上经验，并精通Kubernetes、Helm、Terraform、Python和AWS。薪资范围为13万至20万美元，另加股权（0.15%-0.50%）。\n\n**主要职责：** 领导基础设施团队，维护并改进可观测性与监控技术栈，推动技术边界。\n\n**面试流程：** 完全远程进行，包括介绍电话、技术性带回家测试、2-3轮远程技术面试以及最终团队决策。\n\n**关于Reflex：** 该公司提供统一的平台，用于构建、部署和管理企业应用程序，旨在取代碎片化的工具链。它结合了开源框架与托管平台。\n\n**加入理由：** Reflex报告已取得显著进展，构建了超过100万个应用程序，GitHub星标超过28,000个，并被30%的财富500强公司使用。创始团队包括经验丰富的开源维护者和竞赛程序员，公司在最近一轮融资后正处于高速增长阶段。"
  },
  {
    "id": "46814129",
    "title": "MakuluLinux (6.4M Downloads) Ships Persistent Backdoor from Developer's Own C2",
    "url": "https://werai.ca/security-disclosure.html",
    "summary": "**Summary**\n\nSecurity researchers have discovered a critical backdoor in the MakuluLinux operating system, which has over 6.4 million downloads. The backdoor is not a third-party compromise but is deliberately embedded by the sole developer, Jacque Montague Raymer.\n\n**Key Findings:**\n\n*   **Persistent Backdoor:** The OS installer places a binary (`check.bin`) that creates an autostart entry and establishes a persistent, hidden TCP connection to a Command-and-Control (C2) server at IP `217.77.8.210:2006`.\n*   **Developer-Linked Infrastructure:** This IP address hosts the developer's domain (`makulu.online`), definitively linking the backdoor to the developer's own server.\n*   **Critical Security Flaws:** The system uses insecure update mechanisms, downloading and executing scripts over plain HTTP with `sudo` privileges every five minutes, making it vulnerable to man-in-the-middle attacks.\n*   **Business Model:** Analysis suggests MakuluLinux acts as a funnel for a centralized AI-as-a-service platform. Most of its 40+ \"AI features\" are thin clients that proxy user data and requests through the developer's server, allowing potential data harvesting and control.\n*   **Immediate Mitigation:** Users are advised to kill the backdoor process, delete related files, block the C2 server IP/domains, disable update scripts, change passwords, and migrate to a trusted Linux distribution.\n\nThe disclosure portrays an operating system that functions as a Trojan horse, giving its developer unauthorized remote access and control over users' systems while monetizing through a hidden AI service layer.",
    "chinese_title": "MakuluLinux（下载量达640万次）通过开发者自有C2服务器分发持久性后门程序。",
    "chinese_summary": "**摘要**\n\n安全研究人员在拥有超过640万次下载量的MakuluLinux操作系统中发现了一个关键后门。该后门并非第三方入侵所致，而是由唯一开发者Jacque Montague Raymer故意嵌入。\n\n**主要发现：**\n\n*   **持久性后门：** 操作系统安装程序会放置一个二进制文件（`check.bin`），该文件会创建自启动项，并与IP地址为`217.77.8.210:2006`的命令与控制（C2）服务器建立持久的、隐藏的TCP连接。\n*   **与开发者关联的基础设施：** 该IP地址托管着开发者的域名（`makulu.online`），确凿地将后门与开发者自己的服务器联系起来。\n*   **关键安全漏洞：** 系统使用不安全的更新机制，每五分钟就以`sudo`权限通过纯HTTP下载并执行脚本，使其易受中间人攻击。\n*   **商业模式：** 分析表明，MakuluLinux充当了一个集中式AI即服务平台的中介。其40多项“AI功能”大多是瘦客户端，通过开发者的服务器代理用户数据和请求，从而可能实现数据收集和控制。\n*   **即时缓解措施：** 建议用户终止后门进程、删除相关文件、屏蔽C2服务器IP/域名、禁用更新脚本、更改密码，并迁移至可信的Linux发行版。\n\n此次披露揭示了一个作为特洛伊木马运作的操作系统，使其开发者能够未经授权远程访问和控制用户系统，同时通过隐藏的AI服务层进行牟利。"
  },
  {
    "id": "46801419",
    "title": "Apple to soon take up to 30% cut from all Patreon creators in iOS app",
    "url": "https://www.macrumors.com/2026/01/28/patreon-apple-tax/",
    "summary": "Apple has set a new deadline of November 1, 2026, for Patreon to move all creator payments on its iOS app to Apple’s in-app purchase system. This means Apple will take a commission of up to 30% on those transactions (reducing to 15% for subscriptions lasting over a year).\n\nPatreon creators using the app must now choose between raising their subscription prices for iOS users to cover Apple’s fee or absorbing the cost themselves to keep prices consistent. Supporters can avoid Apple’s commission by subscribing directly through Patreon’s website instead of the app.\n\nThis policy enforcement follows a postponed deadline, as Apple considers these payments to be for digital goods subject to its standard App Store commission. Patreon has expressed disappointment with Apple’s approach, though the company notes that only 4% of its creators remain on the legacy billing system affected by the change.",
    "chinese_title": "苹果将很快在iOS应用中向所有Patreon创作者收取高达30%的分成。",
    "chinese_summary": "苹果为Patreon设定了新的截止日期——2026年11月1日，要求其将所有创作者在iOS应用内的支付迁移至苹果的应用内购买系统。这意味着苹果将从这些交易中抽取高达30%的佣金（若订阅时长超过一年，则降至15%）。\n\n使用该应用的Patreon创作者现在面临选择：要么为iOS用户提高订阅价格以覆盖苹果的费用，要么自行承担成本以保持价格统一。支持者若想避免苹果佣金，可直接通过Patreon网站订阅，而非使用应用内支付。\n\n此次政策执行源于一项推迟的截止期限，苹果认为这些支付属于数字商品交易，需遵守其标准应用商店佣金规则。Patreon对苹果的做法表示失望，但该公司指出，仅有4%的创作者仍在使用受此变更影响的旧版支付系统。"
  },
  {
    "id": "46760546",
    "title": "Usenet personality",
    "url": "https://en.wikipedia.org/wiki/Usenet_personality",
    "summary": "This Wikipedia article defines a \"Usenet personality\" as a type of early internet celebrity who gained notoriety through prolific or distinctive posting on the Usenet network. These individuals often became famous within specific online communities for their unusual ideas, humorous or bizarre writing, or disruptive behavior.\n\nThe article categorizes several notable examples:\n*   **Eccentric believers:** Such as mathematician Alexander Abian, known for his theory of blowing up the Moon to stop natural disasters, and Archimedes Plutonium, who proposed the universe is a giant plutonium atom.\n*   **Criminal and eccentric personalities:** Including figures like Serdar Argic, who used a bot to spam denial of the Armenian genocide, and David D'Amato, who was convicted for email bombing campaigns.\n*   **Unusual personalities:** Like the fictional newbie \"B1FF,\" the automated poster \"Mark V Shaney,\" and the anonymous puzzle-setter \"Publius\" of the Pink Floyd enigma.\n*   **Other personalities:** Recognized for valuable contributions, such as physicist John C. Baez and software entrepreneur Brad Templeton.\n\nOverall, the article portrays Usenet personalities as a foundational part of early internet culture, highlighting how the platform's anonymity and wide reach allowed both insightful contributors and provocative eccentrics to achieve a unique form of online fame.",
    "chinese_title": "Usenet人物",
    "chinese_summary": "这篇维基百科文章将“Usenet名人”定义为一种早期的网络红人，他们通过在Usenet网络上大量或独特的发帖而声名鹊起。这些人通常因其奇特的想法、幽默或怪异的文风、或破坏性行为在特定的网络社区中成名。\n\n文章列举了几类典型例子：\n*   **古怪的信徒：** 如数学家亚历山大·阿比安，以其“炸毁月球以阻止自然灾害”的理论闻名；以及阿基米德·钚，他提出宇宙是一个巨大的钚原子。\n*   **犯罪与怪诞人物：** 包括像塞尔达尔·阿尔吉奇这样使用机器人程序否认亚美尼亚种族灭绝的人物，以及因邮件炸弹攻击被判有罪的大卫·达马托。\n*   **特立独行者：** 如虚构的新手“B1FF”、自动发帖程序“Mark V Shaney”，以及平克·弗洛伊德谜题的匿名出题人“Publius”。\n*   **其他名人：** 因宝贵贡献而受认可的人物，例如物理学家约翰·C·贝兹和软件企业家布拉德·坦普尔顿。\n\n总体而言，文章将Usenet名人描绘为早期网络文化的基础部分，强调了该平台的匿名性和广泛影响力如何让富有洞见的贡献者和挑衅性的怪才都能获得一种独特的网络名声。"
  },
  {
    "id": "46751460",
    "title": "Box64 Expands into RISC-V and LoongArch territory",
    "url": "https://boilingsteam.com/box64-expands-into-risc-v-and-loong-arch-territory/",
    "summary": "Box64 version 0.4, released in early 2026, significantly expands its x86/64 translation capabilities to new CPU architectures. A key development is the official support for the LoongArch architecture, a unique ISA developed independently by China's Loongson, which now has official Linux distribution support. The update also brings major enhancements to RISC-V support, including a revamped dynamic recompiler (Dynarec) for better performance and compatibility with legacy games.\n\nThe release focuses on three areas: broader platform support, performance improvements, and better compatibility. For the first time, the Linux Steam client runs on RISC-V and LoongArch hardware. Performance gains come from a rewritten opcode decoder, a more efficient DynaCache that recycles memory, and experimental support for the NTSync mechanism, which can drastically boost frame rates.\n\nCompatibility is improved for major game launchers like Battle.net, EA App, and Rockstar Launcher, and the internal Box32 component for 32-bit apps is more stable. The article notes that while Box64 is thriving, it faces competition from Valve-supported projects like FEX, signaling a broader industry shift toward reducing dependency on traditional x86 hardware for PC gaming.",
    "chinese_title": "Box64扩展至RISC-V与龙芯架构领域",
    "chinese_summary": "Box64版本0.4于2026年初发布，显著扩展了其x86/64指令翻译能力，支持更多CPU架构。关键进展包括正式支持龙芯公司独立研发的独特指令集架构——龙架构（LoongArch），该架构现已获得官方Linux发行版支持。此次更新还大幅增强了对RISC-V的支持，包括重构动态重编译器（Dynarec），以提升性能并改善对经典游戏的兼容性。\n\n本次发布聚焦三大方向：更广泛的平台支持、性能优化与兼容性提升。Linux版Steam客户端首次可在RISC-V和龙架构硬件上运行。性能提升源于重写的操作码解码器、更高效的可回收内存动态缓存（DynaCache），以及实验性的NTSync机制支持，这些改进能显著提高游戏帧率。\n\n软件兼容性方面，战网、EA App和Rockstar Launcher等主流游戏启动器支持得到改善，用于32位应用程序的内部Box32组件也更为稳定。文章指出，尽管Box64发展势头良好，但仍面临Valve支持的FEX等项目的竞争，这标志着行业正朝着减少PC游戏对传统x86硬件依赖的方向广泛转型。"
  },
  {
    "id": "46815297",
    "title": "Flameshot",
    "url": "https://github.com/flameshot-org/flameshot",
    "summary": "Flameshot is a powerful, open-source screenshot tool for Linux, Windows, and macOS, known for its balance of advanced features and ease of use. Its core functionality includes an in-app editor for annotations (like arrows, text, and blurring), GUI and command-line operation, and image uploads to Imgur.\n\nKey features highlighted are its customizable appearance, DBus interface, and extensive keyboard shortcuts for efficient editing. The article provides detailed setup instructions for configuring global hotkeys (like Print Screen) on various desktop environments, including KDE Plasma, GNOME, XFCE, and Fluxbox.\n\nInstallation is versatile, offering prebuilt packages, distribution repository packages (e.g., for Arch, Debian, Fedora), Snap/Flatpak formats, and compilation from source with listed dependencies. Specific guidance is given for macOS security workarounds and ensuring the system tray icon appears.\n\nThe summary covers essential usage commands, CLI configuration options, file locations, and considerations for use in minimal window managers or on Wayland.",
    "chinese_title": "火焰截图",
    "chinese_summary": "Flameshot是一款功能强大、开源的截图工具，适用于Linux、Windows和macOS系统，以其高级功能与易用性的平衡而著称。其核心功能包括内置标注编辑器（如箭头、文本和模糊处理）、图形界面与命令行操作，以及支持将图片上传至Imgur。\n\n主要亮点包括可自定义外观、DBus接口以及大量高效的键盘快捷键编辑功能。文章详细介绍了在不同桌面环境（如KDE Plasma、GNOME、XFCE和Fluxbox）中配置全局快捷键（例如Print Screen）的设置步骤。\n\n安装方式灵活多样，提供预编译包、发行版仓库包（如Arch、Debian、Fedora）、Snap/Flatpak格式包以及列明依赖项的源码编译安装。针对macOS系统，文章特别给出了安全设置解决方案，并确保系统托盘图标正常显示。\n\n总结部分涵盖了基本使用命令、命令行配置选项、文件存储位置，以及在极简窗口管理器或Wayland环境下使用的注意事项。"
  },
  {
    "id": "46810828",
    "title": "Run Clawdbot/Moltbot on Cloudflare with Moltworker",
    "url": "https://blog.cloudflare.com/moltworker-self-hosted-ai-agent/",
    "summary": "This article introduces **Moltworker**, a proof-of-concept adaptation that allows the popular self-hosted AI agent **Moltbot** (formerly Clawdbot) to run on **Cloudflare's Developer Platform** instead of requiring local hardware like a Mac mini.\n\nThe core of the solution leverages several Cloudflare services:\n*   **Sandboxes**: Provides a secure, isolated environment to run the Moltbot runtime and its integrations, replacing the need for a dedicated local machine.\n*   **AI Gateway**: Manages connections to AI providers (like Anthropic's Claude), offering centralized control, cost visibility, and the ability to easily switch models.\n*   **R2 Object Storage**: Offers persistent storage for the agent's memory and data, which is essential since containers are ephemeral.\n*   **Browser Rendering**: Enables web automation tasks (like browsing and taking screenshots) through a programmatic API, simplifying the need to run a browser within the sandbox.\n*   **Zero Trust Access**: Secures the administrative interface and APIs with built-in authentication.\n\nThe article highlights how Cloudflare's growing **Node.js compatibility** and suite of products make it a viable platform for complex AI applications. Moltworker demonstrates how these services can be combined to run an AI agent efficiently and securely on the global edge network, with built-in observability and scalability.\n\nThe implementation is open-sourced on GitHub, allowing users to deploy their own instance, though it is emphasized as a showcase of Cloudflare's capabilities rather than an official product.",
    "chinese_title": "使用Moltworker在Cloudflare上运行Clawdbot/Moltbot",
    "chinese_summary": "本文介绍了**Moltworker**——一个概念验证性适配方案，它使得流行的自托管AI智能体**Moltbot**（原名Clawdbot）能够运行在**Cloudflare开发者平台**上，而无需依赖Mac mini等本地硬件。\n\n该解决方案的核心利用了多项Cloudflare服务：\n*   **沙盒环境**：提供安全隔离的运行环境，用于执行Moltbot运行时及其集成组件，替代了对专用本地设备的需求。\n*   **AI网关**：管理对接AI服务商（如Anthropic的Claude）的连接，提供集中管控、成本可视化及便捷切换模型的能力。\n*   **R2对象存储**：为智能体的记忆与数据提供持久化存储，这对瞬态容器环境至关重要。\n*   **浏览器渲染**：通过编程接口实现网页自动化任务（如浏览与截图），简化了在沙盒内运行浏览器的需求。\n*   **零信任访问**：通过内置身份验证机制保障管理界面与API的安全性。\n\n文章重点阐述了Cloudflare日益完善的**Node.js兼容性**及其产品套件如何使其成为复杂AI应用的可行平台。Moltworker展示了如何将这些服务组合运用，在全球边缘网络上高效安全地运行AI智能体，并具备内置可观测性与扩展性。\n\n该项目已在GitHub开源，用户可部署自有实例，但需注意其本质是Cloudflare平台能力的展示案例，而非官方产品。"
  },
  {
    "id": "46772132",
    "title": "Making niche solutions is the point",
    "url": "https://ntietz.com/blog/making-niche-solutions-is-the-point/",
    "summary": "This article argues that the true value of 3D printing and software development lies in the ability to create highly customized, niche solutions for specific personal needs.\n\nThe author illustrates this with their 3D printing experience, moving beyond printing generic models to designing a custom organizer for their physical therapy supplies. This highlights the core benefit: the rapid creation of a perfect, tailored object that wouldn't exist otherwise.\n\nThe essay then draws a direct parallel to software engineering, where professionals use the same malleable medium (code) to build their own tools and applications. The author cites a personal, low-maintenance web app built for their family as an example of a niche software solution that perfectly fits a unique set of requirements.\n\nWhile acknowledging that using pre-existing designs or code is often the pragmatic choice (a \"build vs. buy\" decision), the article’s central thesis is that the unique power and joy of both disciplines is the freedom to invent precisely what you need. The ability to make niche things is presented not as a side effect, but as the essential point.",
    "chinese_title": "打造小众解决方案才是关键所在",
    "chinese_summary": "本文认为，3D打印与软件开发的真正价值，在于能够针对具体的个人需求创造高度定制化的小众解决方案。\n\n作者以自身3D打印经历为例，从打印通用模型转向为理疗用品设计专属收纳盒，以此凸显其核心优势：快速创造出原本不存在、却完美契合需求的定制物品。\n\n文章进而将这一逻辑直接类比至软件工程领域——从业者同样利用可塑性媒介（代码）构建专属工具与应用。作者以自建的家庭用低维护网络应用为例，说明如何通过小众软件方案精准满足独特需求。\n\n尽管文章承认使用现有设计或代码往往是务实之选（即“自建与购买”之辩），但其核心论点是：这两门学科的独特力量与乐趣，正源于自由创造所需之物的能力。制造小众产品并非附带效果，而是其本质意义所在。"
  },
  {
    "id": "46810904",
    "title": "How to Choose Colors for Your CLI Applications (2023)",
    "url": "https://blog.xoria.org/terminal-colors/",
    "summary": "This article provides a guide for choosing colors in CLI applications to ensure readability across different terminal themes. The author tests a sample color scheme against several popular terminal themes—Sorcerer, macOS Terminal.app's Basic, Tango, and Solarized—to demonstrate how colors that look good in one theme can become unreadable in another.\n\nKey findings include:\n*   **Bright colors are problematic:** Colors like `bryellow` and `brblue` often have poor contrast, especially in light themes.\n*   **Grayscales are unreliable:** `white`/`brwhite` are unreadable on light backgrounds, and `black`/`brblack` are unreadable on dark backgrounds.\n*   **Solarized is a special case:** Its unique 16-color palette repurposes several bright colors for its own interface, causing CLI tools that use them to display incorrectly for its many users.\n*   **Bold text complicates things:** Due to historical quirks, bold text can unintentionally render as bright colors, further reducing the pool of safe options.\n\nThe article concludes that, to maximize compatibility, developers should restrict their palette to just **11 out of 32 possible color and bold combinations**. The core recommendation is to avoid bright colors and grayscale extremes, sticking to a limited set of standard, non-bright colors to ensure the tool remains usable for the widest audience.",
    "chinese_title": "如何为你的CLI应用程序选择颜色（2023版）",
    "chinese_summary": "本文为CLI应用程序中的颜色选择提供了一份指南，以确保在不同终端主题下的可读性。作者通过测试一套示例配色方案在多个流行终端主题（Sorcerer、macOS Terminal.app的Basic、Tango和Solarized）下的表现，展示了在一种主题中看起来不错的颜色在另一种主题中可能变得难以辨认。\n\n主要发现包括：\n*   **亮色问题突出：** 如`bryellow`和`brblue`这类颜色对比度往往较差，尤其在浅色主题中。\n*   **灰度不可靠：** `white`/`brwhite`在浅色背景上难以辨认，而`black`/`brblack`在深色背景上难以辨认。\n*   **Solarized是特例：** 其独特的16色调色板将几种亮色重新用于自身界面，导致使用这些颜色的CLI工具在其众多用户中显示异常。\n*   **粗体文本使情况复杂化：** 由于历史遗留问题，粗体文本可能意外地呈现为亮色，进一步减少了安全选项的范围。\n\n文章总结认为，为了最大化兼容性，开发者应将调色板限制在**32种可能的颜色和粗体组合中的仅11种**。核心建议是避免使用亮色和极端灰度，坚持使用一组有限的、非亮色的标准颜色，以确保工具能为最广泛的用户群体保持可用性。"
  },
  {
    "id": "46811762",
    "title": "Heating homes with the largest particle accelerator",
    "url": "https://home.cern/news/news/cern/heating-homes-worlds-largest-particle-accelerator",
    "summary": "**Summary:**\n\nCERN has begun using waste heat from its Large Hadron Collider (LHC) to warm homes and businesses in the nearby French town of Ferney-Voltaire. A new heat exchange system, operational since mid-January 2026, captures hot water from cooling the LHC's cryogenic equipment at Point 8, located near the town.\n\nInstead of releasing this heat into the atmosphere via cooling towers, the system now channels it through two 5-MW heat exchangers to supply a local district heating network. This network is expected to heat the equivalent of several thousand homes, avoiding the use of traditional gas heating and preventing thousands of tonnes of CO₂ emissions annually.\n\nCERN supplies heat whenever possible without impacting its scientific operations. Currently, Ferney-Voltaire uses up to 5 MW, but capacity could double when the LHC is fully running. Even during the planned multi-year maintenance shutdown (LS3) starting in summer 2026, CERN will continue to supply between 1 and 5 MW of heat, with only brief interruptions.\n\nThis initiative is part of CERN's broader energy management and environmental strategy, which includes other heat-recovery projects. Together, these efforts are projected to save 25–30 GWh of energy per year from 2027 onward.",
    "chinese_title": "用最大的粒子加速器为家庭供暖",
    "chinese_summary": "**摘要：**\n\n欧洲核子研究中心（CERN）已开始利用其大型强子对撞机（LHC）产生的余热，为邻近的法国小镇费尔奈-伏尔泰的家庭和企业供暖。自2026年1月中旬起，一套新的热交换系统投入运行，该系统从位于小镇附近的8号点收集冷却LHC低温设备产生的热水。\n\n该系统不再通过冷却塔将余热排入大气，而是通过两台5兆瓦的热交换器将热量输送至当地区域供热网络。预计该网络可为相当于数千户家庭供暖，从而避免使用传统燃气供暖，并每年减少数千吨二氧化碳排放。\n\nCERN在确保不影响其科学运行的前提下，尽可能提供余热。目前，费尔奈-伏尔泰最多可使用5兆瓦热量，但当LHC全面运行时，供热能力可翻倍。即使从2026年夏季开始的计划性多年维护停机（LS3）期间，CERN也将持续提供1至5兆瓦的热量，仅会有短暂中断。\n\n该举措是CERN更广泛的能源管理和环境战略的一部分，其中包括其他余热回收项目。预计从2027年起，这些努力每年将节省25至30吉瓦时的能源。"
  },
  {
    "id": "46754097",
    "title": "Computing Sharding with Einsum",
    "url": "https://blog.ezyang.com/2026/01/computing-sharding-with-einsum/",
    "summary": "This article introduces using Einstein summation (einsum) notation as a fast, efficient method for reasoning about tensor sharding in distributed machine learning, particularly for operations like matrix multiplication. It argues that while diagrammatic approaches are intuitive, einsum provides a more streamlined way to calculate the resulting sharding patterns of outputs and gradients.\n\nThe core idea is to translate operations into einsum formulas (e.g., `\"bi,oi->bo\"` for a linear layer). The author then presents a concise set of sharding rules based on whether a dimension is a *batch* (free), *contraction*, or *free* dimension. For example, sharding a contraction dimension in both inputs leads to a `Partial()` output, indicating a pending all-reduce operation.\n\nThe utility of this method is demonstrated through two worked examples. First, in **Tensor Parallelism**, analyzing the backward pass for a `ColumnParallelLinear` layer reveals why an all-reduce is necessary for the gradient of the input, as it results in a `Partial()` sharding. Second, in **Sequence Parallelism** with a scaling factor, the analysis shows the gradient for the weight becomes `Partial()`, requiring an all-reduce. This einsum-based approach systematically clarifies when communication (like all-reduce) is needed during distributed training backward passes.",
    "chinese_title": "使用Einsum进行分片计算",
    "chinese_summary": "本文介绍了如何运用爱因斯坦求和（einsum）符号作为一种快速高效的方法，用于在分布式机器学习中推理张量分片，尤其适用于矩阵乘法等操作。文章指出，虽然图示方法直观易懂，但einsum提供了一种更为简洁的方式来计算输出和梯度的分片模式。\n\n其核心思想是将操作转化为einsum公式（例如，线性层可表示为`\"bi,oi->bo\"`）。作者随后基于维度是*批次*（自由）、*收缩*还是*自由*维度，提出了一套简洁的分片规则。例如，若在两个输入中同时分片收缩维度，则输出为`Partial()`，表示有待执行的全归约操作。\n\n该方法通过两个实例展示了其实用性。首先，在**张量并行**中，分析`ColumnParallelLinear`层的反向传播过程揭示了为何输入梯度需要全归约，因为它产生了`Partial()`分片。其次，在带有缩放因子的**序列并行**中，分析表明权重梯度变为`Partial()`，同样需要全归约。这种基于einsum的方法系统性地阐明了在分布式训练的反向传播过程中何时需要通信（如全归约）。"
  },
  {
    "id": "46810337",
    "title": "Playing Board Games with Deep Convolutional Neural Network on 8bit Motorola 6809",
    "url": "https://ipsj.ixsq.nii.ac.jp/records/229345",
    "summary": "This article presents a research project that successfully runs a Go-playing deep convolutional neural network (CNN) on the Motorola 6809, an 8-bit microprocessor from 1978. The work was implemented on a vintage Thomson MO5 microcomputer.\n\nThe core challenge addressed is that while training deep neural networks requires significant computational power, the inference (execution) phase can be optimized for efficiency. The authors take this to an extreme by deploying a CNN on a severely resource-constrained historical system. Key to this achievement is the use of **quantization** techniques, which reduce the precision of the neural network's numerical parameters (e.g., from 32-bit floating-point to 8-bit integers), dramatically decreasing memory and processing requirements.\n\nDespite the hardware limitations of the 6809 CPU, the resulting Go-playing program achieved a playing strength comparable to **GNU Go**, a well-known benchmark program. This demonstrates that with careful optimization and quantization, complex deep learning models can be executed on very low-power, legacy computing devices. The project serves as a notable example of pushing the boundaries of efficient neural network inference.",
    "chinese_title": "在8位摩托罗拉6809上使用深度卷积神经网络玩棋盘游戏",
    "chinese_summary": "本文介绍了一项研究项目，成功在摩托罗拉6809（一款1978年推出的8位微处理器）上运行了围棋对弈深度卷积神经网络（CNN）。该工作在一台复古的Thomson MO5微型计算机上实现。\n\n研究解决的核心挑战在于：虽然训练深度神经网络需要强大的计算能力，但其推理（执行）阶段可以针对效率进行优化。作者通过将CNN部署在资源极度受限的历史系统上，将这一思路推向了极致。实现这一成果的关键在于采用**量化**技术，该技术降低了神经网络数值参数的精度（例如从32位浮点数降至8位整数），从而大幅减少了内存和处理需求。\n\n尽管6809 CPU存在硬件限制，但最终开发的围棋对弈程序达到了与知名基准程序**GNU Go**相当的棋力。这表明通过精细的优化和量化，复杂的深度学习模型可以在功耗极低的老旧计算设备上运行。该项目作为推动高效神经网络推理边界的一个显著范例，具有重要参考价值。"
  },
  {
    "id": "46814991",
    "title": "Networks Hold the Key to a Decades-Old Problem About Waves",
    "url": "https://www.quantamagazine.org/networks-hold-the-key-to-a-decades-old-problem-about-waves-20260128/",
    "summary": "This article details a breakthrough in solving a decades-old mathematical problem about the Fourier transform, known as Chowla's cosine problem. The question, posed in 1965, asks how small a sum of simple cosine waves (each corresponding to an integer in a set) can become. Despite its apparent simplicity, progress had been minimal for 20 years.\n\nIn 2025, four mathematicians—Zhihan Jin, Aleksa Milojević, István Tomon, and Shengtong Zhang—made the first significant advance. Their breakthrough originated not from Fourier analysis but from unrelated work on a graph theory problem called MaxCut. They developed new techniques to analyze the eigenvalues of graphs, which measure structural properties.\n\nA number theorist, Ilya Shkredov, recognized that their graph theory results could be applied to Chowla's problem by connecting it to a special type of graph (a Cayley graph). The team then proved that for any set of N integers, the corresponding cosine sum must dip below -N^(1/10). This was the first bound to match the form of Chowla's original conjecture (which predicted a minimum around -√N). Just days later, Benjamin Bedert used traditional Fourier methods to improve the bound slightly to -N^(1/7).\n\nThe result is significant not only for inching closer to Chowla's conjecture but also for demonstrating a powerful, unexpected bridge between the seemingly separate fields of graph theory and Fourier analysis, opening new avenues for future research.",
    "chinese_title": "网络掌握着解决一个关于波的数十年难题的关键。",
    "chinese_summary": "本文详细阐述了在解决一个关于傅里叶变换的、存在数十年的数学难题——乔拉余弦问题——方面取得的突破。该问题于1965年提出，探讨了一组简单余弦波（每个波对应一个整数集合中的整数）的和可以变得多小。尽管问题看似简单，但在20年间进展甚微。\n\n2025年，四位数学家——金志涵、阿莱克萨·米洛耶维奇、伊斯特万·托蒙和张盛桐——取得了首次重大进展。他们的突破并非源于傅里叶分析，而是来自对一个名为最大割的图论问题的无关研究。他们开发了新技术来分析图的特征值，这些特征值衡量了图的结构特性。\n\n数论学家伊利亚·什克雷多夫认识到，通过将乔拉问题与一种特殊类型的图（凯莱图）联系起来，他们的图论结果可以应用于乔拉问题。该团队随后证明，对于任意包含N个整数的集合，对应的余弦和必须低于-N^(1/10)。这是首次得到与乔拉原始猜想形式相符的界限（该猜想预测最小值约为-√N）。几天后，本杰明·贝德特使用传统傅里叶方法将界限略微改进至-N^(1/7)。\n\n这一成果不仅意义重大，因为它向乔拉猜想迈进了一步，还展示了图论与傅里叶分析这两个看似独立的领域之间强大而意外的桥梁，为未来研究开辟了新途径。"
  },
  {
    "id": "46810401",
    "title": "Waymo robotaxi hits a child near an elementary school in Santa Monica",
    "url": "https://techcrunch.com/2026/01/29/waymo-robotaxi-hits-a-child-near-an-elementary-school-in-santa-monica/",
    "summary": "On January 23, a Waymo robotaxi struck a child near an elementary school in Santa Monica, causing minor injuries. According to Waymo, the incident occurred during school drop-off hours when the child suddenly entered the roadway from behind a tall, stopped SUV. The autonomous vehicle, traveling at about 17 mph, braked hard but still made contact at 6 mph.\n\nBoth the National Highway Traffic Safety Administration (NHTSA) and the National Transportation Safety Board (NTSB) have opened investigations into the crash. The NHTSA is specifically examining whether the vehicle exercised appropriate caution given the school zone context, the presence of children, a crossing guard, and double-parked vehicles.\n\nWaymo stated that its vehicle detected the pedestrian immediately and that, according to its internal model, a fully attentive human driver would have hit the child at a higher speed of about 14 mph. The company is cooperating with investigators.\n\nThis incident occurs as Waymo faces separate federal probes into its vehicles illegally passing school buses in Atlanta and Austin.",
    "chinese_title": "Waymo自动驾驶出租车在圣莫尼卡一所小学附近撞伤一名儿童",
    "chinese_summary": "1月23日，一辆Waymo自动驾驶出租车在圣莫尼卡一所小学附近撞伤一名儿童，造成轻微伤害。Waymo表示，事故发生在学校送学时段，该儿童突然从一辆停靠的高大SUV后方闯入车道。当时自动驾驶车辆以约17英里/小时的速度行驶，虽紧急刹车，仍以6英里/小时的速度发生碰撞。\n\n美国国家公路交通安全管理局（NHTSA）和国家运输安全委员会（NTSB）均已对此事故展开调查。NHTSA正重点核查该车辆在学校区域、儿童与交通协管员在场、以及道路存在双排停车的情况下是否采取了充分谨慎措施。\n\nWaymo称其系统已立即识别到行人，并指出根据其内部模型测算，即便是全神贯注的人类驾驶员也可能会以约14英里/小时的更高速度撞上该儿童。公司正配合调查工作。\n\n此次事件发生之际，Waymo正因旗下车辆在亚特兰大和奥斯汀违规超越校巴而面临多项联邦调查。"
  },
  {
    "id": "46810536",
    "title": "Break Me If You Can: Exploiting PKO and Relay Attacks in 3DES/AES NFC",
    "url": "https://www.breakmeifyoucan.com/",
    "summary": "This research exposes critical vulnerabilities in widely used NFC technologies like MIFARE Ultralight C/AES and NTAG 223/224 DNA, enabling attackers to recover cryptographic keys and forge credentials.\n\nThe core issue is not the cryptography itself (3DES/AES), but protocol and deployment flaws. After a successful relay attack bypasses distance limits, attackers can perform a **partial key overwrite** attack. This technique exploits that keys are stored across multiple memory pages that can be written independently. By overwriting parts of the key on multiple cards sharing a static key, attackers reduce the brute-force effort from 2^112 to a feasible 2^28, allowing full key recovery.\n\nThe impact is severe: **non-NXP compatible cards** (found in ~34% of sampled hospitality cards) have broken random number generators, allowing key recovery from a *single* card in under a minute. **NTAG DNA** tags are vulnerable due to a lack of integrity checks. Real-world deployments are highly vulnerable, with 100% of surveyed systems having misconfigurations like unlocked memory or static keys.\n\nMitigations include: locking key memory pages, implementing key diversification, enabling integrity checks (CMAC), and verifying genuine NXP chips. For high-security needs, migration to MIFARE DESFire EV3 is recommended. The vulnerabilities were responsibly disclosed to NXP, and proof-of-concept tools are publicly available.",
    "chinese_title": "《你能破解我吗：利用3DES/AES NFC中的PKO与中继攻击》",
    "chinese_summary": "这项研究揭示了广泛应用的NFC技术（如MIFARE Ultralight C/AES和NTAG 223/224 DNA）中的关键漏洞，使攻击者能够恢复加密密钥并伪造凭证。\n\n核心问题并非密码算法本身（3DES/AES），而在于协议与部署缺陷。在通过中继攻击成功突破距离限制后，攻击者可实施**部分密钥覆写**攻击。该技术利用密钥分散存储在多个可独立写入的内存页的特性，通过对多张共享静态密钥的卡片进行部分密钥覆写，攻击者将暴力破解难度从2^112降至可行的2^28，从而实现完整密钥恢复。\n\n影响极为严重：**非NXP兼容卡片**（约占抽样酒店门卡的34%）因随机数生成器存在缺陷，可在*单张*卡片上于一分钟内恢复密钥；**NTAG DNA**标签因缺乏完整性校验而存在风险。实际部署系统脆弱性极高，调查显示100%的系统存在内存未锁定或使用静态密钥等配置缺陷。\n\n缓解措施包括：锁定密钥存储页、实施密钥多样化、启用完整性校验（CMAC）以及验证正品NXP芯片。对于高安全需求场景，建议迁移至MIFARE DESFire EV3。相关漏洞已负责任地披露给NXP公司，概念验证工具已公开。"
  },
  {
    "id": "46805665",
    "title": "We can’t send mail farther than 500 miles (2002)",
    "url": "https://web.mit.edu/jemorris/humor/500-miles",
    "summary": "A statistics department reported the bizarre problem that they could not send email farther than approximately 520 miles. The issue began after a consultant patched and rebooted their server.\n\nUpon investigation, the system administrator discovered the root cause: the server upgrade had inadvertently downgraded the sendmail software from version 8 to version 5, while leaving the newer configuration file in place. The older sendmail could not parse the new configuration's verbose options, causing critical settings like the connection timeout to default to zero.\n\nWith a zero timeout, the system would abort connection attempts after about 3 milliseconds. On their fast, switched network, the limiting factor for connecting to a distant server became the speed of light. A quick calculation showed that 3 milliseconds was the time light takes to travel roughly 560 miles round-trip, explaining the observed 500-mile limit. The problem was resolved by reinstalling the correct sendmail version.",
    "chinese_title": "邮件无法送达超过500英里之外（2002年）",
    "chinese_summary": "某统计部门报告了一个离奇问题：他们的电子邮件无法发送到大约520英里以外的地方。该问题始于一名顾问修补并重启了他们的服务器。\n\n经调查，系统管理员发现了根本原因：服务器升级时意外将sendmail软件从版本8降级至版本5，却保留了新版配置文件。旧版sendmail无法解析新配置中的详细选项，导致连接超时等关键设置默认归零。\n\n由于超时时间为零，系统会在约3毫秒后中止连接尝试。在他们高速交换网络中，连接远程服务器的限制因素变成了光速。简单计算显示，3毫秒正是光往返约560英里所需的时间，这解释了观测到的500英里限制。通过重新安装正确的sendmail版本，问题得以解决。"
  },
  {
    "id": "46809420",
    "title": "The Sovereign Tech Fund Invests in Scala",
    "url": "https://www.scala-lang.org/blog/2026/01/27/sta-invests-in-scala.html",
    "summary": "The Sovereign Tech Fund, a German public initiative, has invested €377,300 in the Scala programming language over two years to strengthen its long-term security, maintenance, and developer experience. The Scala Center will coordinate the work.\n\nThis investment recognizes Scala as critical digital infrastructure, widely used in essential systems across finance, public services, and data pipelines where reliability is paramount.\n\nThe funding will support five key areas:\n1.  A security audit of Scala's core components by OSTIF.\n2.  Improvements to the **scoverage** code coverage tool.\n3.  Maintenance of the standard library and core APIs for stability.\n4.  Modernization of core library documentation and websites.\n5.  A major update to the **sbt** build tool (version 2.0), which will adopt Scala 3 for build definitions.\n\nThe Scala Center emphasized that this public investment reinforces the ecosystem's resilience and sustainability. Updates on the projects will be shared via the Scala blog and the contributors' forum.",
    "chinese_title": "主权科技基金投资Scala语言",
    "chinese_summary": "德国公共倡议项目“主权科技基金”已向Scala编程语言投资377,300欧元，为期两年，旨在加强其长期安全性、维护性和开发者体验。Scala中心将负责协调相关工作。\n\n此项投资将Scala认定为关键数字基础设施，该语言广泛应用于金融、公共服务和数据管道等可靠性至关重要的核心系统。\n\n资金将支持五个关键领域：\n1. 由OSTIF对Scala核心组件进行安全审计\n2. 改进**scoverage**代码覆盖率工具\n3. 维护标准库与核心API以保障稳定性\n4. 实现核心库文档与网站的现代化升级\n5. 对**sbt**构建工具进行重大更新（2.0版本），其构建定义将采用Scala 3\n\nScala中心强调，这项公共投资将增强生态系统的韧性与可持续性。项目进展将通过Scala博客和贡献者论坛同步发布。"
  },
  {
    "id": "46814828",
    "title": "Gourmand Syndrome",
    "url": "https://en.wikipedia.org/wiki/Gourmand_syndrome",
    "summary": "**Summary of Gourmand Syndrome**\n\nGourmand syndrome is a rare, benign eating disorder triggered by an injury to specific brain regions, most commonly the right frontal or temporal lobe, basal ganglia, or limbic structures. The injury typically results from events like a stroke or trauma.\n\nThe core symptom is the development of a new, intense preoccupation with gourmet, high-quality food, often emerging six to twelve months after the brain injury. This goes beyond simple enjoyment and involves two key aspects: a refined change in eating habits and taste preferences, and an obsessive, craving-driven component. Notably, individuals often have no prior history of food obsession or eating disorders.\n\nFirst identified in 1997, the syndrome is believed to occur when frontotemporal brain circuits involved in normal eating behavior are damaged. While rare (only about 36 documented cases by 2001), it can lead to significant lifestyle changes, such as career shifts to food-related fields, extensive travel for dining, and substantial weight gain. It shares biological features with obsessive and addictive disorders.",
    "chinese_title": "美食家综合征",
    "chinese_summary": "**美食家综合征概述**\n\n美食家综合征是一种罕见的良性进食障碍，由特定脑区损伤引发，最常见于右额叶或颞叶、基底神经节或边缘结构。此类损伤通常由中风或外伤等事件导致。\n\n其核心症状是在脑损伤后六至十二个月内，患者对精致、高品质食物产生全新且强烈的沉迷。这超越了单纯的享受，包含两个关键方面：饮食习惯与口味偏好的精微改变，以及强迫性、渴求驱动的成分。值得注意的是，患者通常并无食物沉迷或进食障碍的既往史。\n\n该综合征于1997年首次被确认，被认为与调控正常进食行为的前额叶-颞叶神经回路受损有关。虽然罕见（截至2001年仅约36例记录），但它可能导致显著的生活方式改变，例如转行至食品相关领域、为美食频繁旅行以及体重大幅增加。它在生物学特征上与强迫症和成瘾性疾病有相似之处。"
  },
  {
    "id": "46814828",
    "title": "Gourmand Syndrome",
    "url": "https://en.wikipedia.org/wiki/Gourmand_syndrome",
    "summary": "**Summary of Gourmand Syndrome**\n\nGourmand syndrome is a rare and benign eating disorder triggered by a brain injury, typically occurring 6–12 months after damage to the right frontal or temporal lobe, often affecting cortical areas, basal ganglia, or limbic structures. First identified in 1997, it is characterized by a new, obsessive passion for gourmet and refined foods following the injury, even in individuals with no prior interest in food.\n\nThe syndrome has two core components: a change in taste preferences toward fine dining and an obsessive, craving-driven element that shares biological features with addictive disorders. It is believed to result from disruption to frontotemporal brain circuits involved in normal eating behavior.\n\nAs of 2001, only about 36 cases had been documented. Notable cases include a political journalist who became a food critic after a stroke and a marathon runner who transformed into a gastronomic critic, traveling extensively for gourmet meals and gaining significant weight. Only one pediatric case has been reported, involving a child with a right temporal lobe abnormality.\n\nIn essence, gourmand syndrome is a neurological condition where brain damage leads to a profound and specific obsession with high-quality food, altering a person's lifestyle and dietary focus.",
    "chinese_title": "美食家综合征",
    "chinese_summary": "**美食家综合征概述**\n\n美食家综合征是一种罕见且良性的进食障碍，由脑损伤引发，通常在右额叶或颞叶受损后6至12个月内出现，常累及皮层区域、基底神经节或边缘结构。该综合征于1997年首次被识别，其特征是患者在受伤后对美食和精致食物产生一种全新的、强迫性的热衷，即使此前对食物毫无兴趣。\n\n该综合征包含两个核心要素：一是口味偏好转向高级餐饮的改变；二是具有强迫性、渴求驱动的特征，与成瘾障碍有相似的生物学基础。据信，这是由于涉及正常进食行为的前额叶-颞叶脑回路遭到破坏所致。\n\n截至2001年，仅记录了约36例病例。著名案例包括一名中风后转为美食评论家的政治记者，以及一名马拉松运动员转变为美食评论家，为品尝佳肴频繁旅行并体重显著增加。仅有一例儿科病例被报道，涉及一名右颞叶异常的儿童。\n\n本质上，美食家综合征是一种神经系统疾病，脑损伤导致患者对高品质食物产生深刻而特定的痴迷，从而改变其生活方式和饮食关注点。"
  }
]