[
  {
    "id": "47103931",
    "title": "Parse, Don't Validate and Type-Driven Design in Rust",
    "url": "https://www.harudagondi.space/blog/parse-dont-validate-and-type-driven-design-in-rust/",
    "summary": "This article introduces the \"Parse, Don't Validate\" principle and Type-Driven Design in Rust, advocating for encoding program invariants into the type system rather than performing runtime validation.\n\nThe core idea is to strengthen function parameters by using newtypes (like `NonZeroF32` or `NonEmptyVec<T>`) that guarantee certain properties (e.g., non-zero, non-empty) by construction. This shifts validation to a single, upfront \"parsing\" step (e.g., `NonZeroF32::new()`), after which the type itself carries the guarantee. This contrasts with \"validating\" approaches that return `Option`/`Result` and require repeated checks, leading to redundant code and potential runtime errors.\n\nKey benefits highlighted include:\n*   **Making illegal states unrepresentable:** Types like `String` (a validated `Vec<u8>`) ensure invalid data cannot exist in the system.\n*   **Improving API clarity and safety:** Function signatures explicitly state their requirements (e.g., `divide(a: f32, b: NonZeroF32)`).\n*   **Enabling compiler-assisted correctness:** Errors are caught at compile-time rather than runtime.\n*   **Reducing boilerplate:** Eliminates repetitive validation checks after the initial parsing.\n\nThe article concludes with maxims of Type-Driven Design: make illegal states unrepresentable and prove invariants as early as possible, moving away from error-prone \"shotgun parsing\" where validation is scattered throughout the code.",
    "chinese_title": "解析而非验证与Rust中的类型驱动设计",
    "chinese_summary": "本文介绍了Rust中的“解析而非验证”原则与类型驱动设计，倡导将程序不变量编码进类型系统而非依赖运行时验证。\n\n核心思想是通过使用新类型（如`NonZeroF32`或`NonEmptyVec<T>`）强化函数参数，这些类型在构造时即保证特定属性（如非零、非空）。这将验证过程转移到单一的前置“解析”步骤（例如`NonZeroF32::new()`），此后类型自身携带保证。这与“验证式”方法形成对比——后者返回`Option`/`Result`并要求重复检查，导致冗余代码和潜在运行时错误。\n\n强调的主要优势包括：\n*   **使非法状态无法表示**：像`String`（已验证的`Vec<u8>`）这类类型确保系统中不存在无效数据。\n*   **提升API清晰度与安全性**：函数签名明确声明其要求（例如`divide(a: f32, b: NonZeroF32)`）。\n*   **实现编译器辅助的正确性**：错误在编译时而非运行时被捕获。\n*   **减少样板代码**：消除初始解析后重复的验证检查。\n\n文章最后总结了类型驱动设计的准则：使非法状态无法表示，并尽早证明不变量，从而摆脱验证逻辑散落代码各处、容易出错的“霰弹式解析”。"
  },
  {
    "id": "47098245",
    "title": "I verified my LinkedIn identity. Here's what I handed over",
    "url": "https://thelocalstack.eu/posts/linkedin-identity-verification-privacy/",
    "summary": "In pursuit of LinkedIn's verification badge, the author discovered the process is handled by a third-party US company, Persona. This service collects extensive personal data, including a full passport scan, a live selfie, extracted facial geometry, and behavioral biometrics. Persona then cross-references this information against various databases, effectively performing a background check.\n\nCritically, the author found that Persona uses these documents to train its AI systems and shares data with 17 subprocessors, all based in North America. Despite data potentially being stored in Germany, Persona's US incorporation subjects all information to the US CLOUD Act, meaning American authorities can demand it regardless of physical storage location.\n\nThe article warns that the legal protections for EU data under frameworks like the EU-US Data Privacy Framework are precarious. Furthermore, Persona's terms cap liability at $50 and mandate individual arbitration in case of a breach.\n\nThe core conclusion is that users trade highly sensitive, immutable biometric and identity data for a cosmetic badge, often without understanding the scale of the exchange or the limited recourse if the data is compromised. The author advises those who have verified to request data deletion and urges others to consider if the badge is worth the significant privacy trade-off.",
    "chinese_title": "我验证了我的领英身份。以下是我提交的信息",
    "chinese_summary": "为了获得LinkedIn的认证徽章，作者发现这一流程由美国第三方公司Persona处理。该服务收集大量个人数据，包括完整的护照扫描件、实时自拍照、提取的面部几何数据以及行为生物特征。Persona随后将这些信息与多个数据库进行交叉比对，实质上完成了一次背景调查。\n\n关键的是，作者发现Persona会利用这些文件训练其人工智能系统，并将数据分享给17家位于北美的分包处理商。尽管数据可能存储在德国，但Persona在美国注册的性质使得所有信息都受美国《云法案》约束，这意味着无论物理存储位置如何，美国当局都有权要求获取这些数据。\n\n文章警告称，欧盟数据在《欧美数据隐私框架》等机制下的法律保护并不稳固。此外，Persona的条款将责任上限设为50美元，并规定若发生数据泄露需通过个人仲裁解决。\n\n核心结论是：用户用高度敏感、不可更改的生物识别和身份数据换取了一个装饰性的徽章，却往往不了解这种交换的规模，也不清楚数据泄露后追索权的局限性。作者建议已认证用户申请删除数据，并敦促其他人慎重考虑这枚徽章是否值得以重大隐私代价换取。"
  },
  {
    "id": "47103506",
    "title": "Canvas_ity: A tiny, single-header <canvas>-like 2D rasterizer for C++",
    "url": "https://github.com/a-e-k/canvas_ity",
    "summary": "**Summary**\n\nCanvas_ity is a compact, single-header C++ library for rendering 2D vector graphics, designed to closely mimic the W3C HTML5 Canvas API. It prioritizes high-quality rendering, ease of use, and small code size over raw speed. The library supports nearly all core canvas features, including paths, strokes, fills, gradients, patterns, images, fonts, shadows, and compositing, but adapts the API for C++ (e.g., avoiding string-based style specifications).\n\nKey features include:\n*   **High-Quality Output**: Uses trapezoidal area antialiasing, gamma-correct blending, and bicubic resampling for smooth, perceptually accurate results.\n*   **Ease of Use**: Has no dependencies, is thread-safe, uses no global state, and manages memory predictably within embedded vectors.\n*   **Compactness**: The entire implementation is around 2300 lines of C++03 code, producing small binaries (~36 KiB).\n\nNotable limitations are its basic text rendering (no hinting, kerning, etc.), non-secure TrueType font parsing, and lack of GPU acceleration. It is distributed under the permissive ISC license.",
    "chinese_title": "Canvas_ity：一个用于C++的轻量级、单头文件、类似<canvas>的2D光栅化器",
    "chinese_summary": "**概述**\n\nCanvas_ity 是一个紧凑的单头文件 C++ 库，用于渲染二维矢量图形，其设计旨在紧密模仿 W3C HTML5 Canvas API。它优先考虑高质量的渲染效果、易用性和较小的代码体积，而非追求原始速度。该库支持几乎所有核心画布功能，包括路径、描边、填充、渐变、图案、图像、字体、阴影和合成，但针对 C++ 对 API 进行了适配（例如，避免使用基于字符串的样式规范）。\n\n主要特点包括：\n*   **高质量输出**：使用梯形区域抗锯齿、伽马校正混合和双三次重采样，以实现平滑且感知准确的结果。\n*   **易于使用**：无外部依赖、线程安全、不使用全局状态，并在嵌入式向量内进行可预测的内存管理。\n*   **紧凑性**：整个实现大约为 2300 行 C++03 代码，生成的二进制文件体积小（约 36 KiB）。\n\n值得注意的局限性包括其基本的文本渲染（无提示、字距调整等）、非安全的 TrueType 字体解析以及缺乏 GPU 加速。该库在宽松的 ISC 许可证下分发。"
  },
  {
    "id": "47102576",
    "title": "What not to write on your security clearance form (1988)",
    "url": "https://milk.com/wall-o-shame/security_clearance.html",
    "summary": "In this 1988 article, Les Earnest recounts a childhood incident that later impacted a security clearance application. In 1943, at age twelve, he and a friend created a simple code based on a book about cryptography. Earnest lost his glasses case, which contained the folded code key. A citizen found it, suspected espionage, and turned it over to the FBI, who launched a costly investigation before tracing it back to him.\n\nYears later, while applying for a summer job requiring a clearance, Earnest truthfully answered \"Yes\" to having been investigated by the FBI and explained, \"I was suspected of being a Japanese spy.\" The security officer, upon hearing the story, became agitated, tore up the form, and instructed him to fill out a new one without mentioning the incident, warning that disclosure would prevent him from ever getting a clearance. Earnest complied and received the clearance, learning that full honesty on such forms could be counterproductive. The anecdote humorously highlights the bureaucratic absurdities of security clearance processes.",
    "chinese_title": "你的安全审查表格上不该写什么（1988年）",
    "chinese_summary": "在这篇1988年的文章中，莱斯·厄内斯特回忆了一起童年事件，此事后来影响了他的安全许可申请。1943年，十二岁的他和朋友根据一本密码学书籍设计了一套简易密码。厄内斯特丢失了眼镜盒，里面装着折叠的密码密钥。一位市民拾获后怀疑涉及间谍活动，将其交给了联邦调查局；该局耗费巨资展开调查，最终追溯到厄内斯特本人。\n\n多年后，厄内斯特申请一份需要安全许可的暑期工作时，如实回答了“是”关于是否曾被联邦调查局调查的问题，并解释道：“我曾被怀疑是日本间谍。”安全官员听完原委后情绪激动，撕毁了表格，指示他重新填写一份且不得提及此事，并警告说披露此事将使他永远无法获得许可。厄内斯特照做后获得了许可，由此领悟到在此类表格上完全诚实可能适得其反。这则轶事以幽默的方式揭示了安全审查程序中的官僚主义荒诞。"
  },
  {
    "id": "47102975",
    "title": "Personal Statement of a CIA Analyst",
    "url": "https://antipolygraph.org/statements/statement-038.shtml",
    "summary": "**Summary of \"Personal Statement of a CIA Analyst\"**\n\nThe article is a first-person account from a former CIA analyst detailing their negative experience with a polygraph examination during a routine security reinvestigation. The core argument is that the polygraph process is a flawed, pseudoscientific \"ritual of intimidation\" rather than a reliable tool for detecting deception.\n\nThe analyst describes the exam as highly stressful and accusatory, with the examiner employing aggressive and unprofessional techniques, including badgering, making unfounded insinuations about sexual behavior, and threatening to derail the analyst's career over minor, previously disclosed personal contacts. Despite a long and successful career with a Top Secret clearance, the analyst felt presumed guilty and subjected to psychological pressure designed to elicit confessions.\n\nThe statement concludes that the polygraph is counterproductive to national security. It drives away honest, qualified personnel—the author left the CIA shortly after this experience—while potentially missing actual security threats who may train to beat the test. The author advocates for abolishing the polygraph within the intelligence community, arguing it creates a false sense of security and damages morale and trust.",
    "chinese_title": "一位中央情报局分析师的个人陈述",
    "chinese_summary": "**《一名中情局分析员个人陈述》摘要**\n\n本文是一位前中情局分析员以第一人称叙述的亲身经历，详细描述了其在一次例行安全复审中接受测谎检查的负面体验。核心论点是：测谎过程存在缺陷，是一种伪科学的“恐吓仪式”，而非可靠的谎言检测工具。\n\n该分析员描述称，测谎过程压力极大且充满指控意味。考官采用了攻击性且不专业的手段，包括反复逼问、对性行为进行毫无根据的影射，并威胁要因其过往已申报的次要个人往来而断送其职业生涯。尽管该分析员拥有长期成功的工作记录和最高机密安全许可，却仍被预设为有罪，并遭受旨在逼供的心理压力。\n\n陈述总结认为，测谎对国家安全适得其反。它驱走了诚实、合格的人员——作者在此经历后不久便离开了中情局——同时可能漏掉那些经过训练以通过测试的真正安全威胁。作者主张在情报界废除测谎，认为它制造了虚假的安全感，并损害了士气和信任。"
  },
  {
    "id": "47061614",
    "title": "How far back in time can you understand English?",
    "url": "https://www.deadlanguagesociety.com/p/how-far-back-in-time-understand-english",
    "summary": "This article describes a linguistic experiment where a fictional blog post is written in progressively older forms of English, spanning from the year 2000 back to 1000. The author, a linguist, constructed the passages to illustrate how the language has changed over a millennium.\n\nThe post begins in modern, informal \"blogger\" English and regresses through time, with each section representing a century. The reader is invited to note where comprehension becomes difficult. The author explains that English from the last 300 years (1700–2000) is largely understandable due to standardized spelling and stable grammar, with only stylistic \"voice\" changing significantly.\n\nComprehension typically breaks down around the 1500s and 1600s due to major shifts in spelling, grammar, and vocabulary. By the 1300s and earlier, the text becomes almost a foreign language to modern readers, requiring translation to be understood.\n\nThe core takeaway is that while modern English speakers can read texts from the 1700s with relative ease, the language changes dramatically the further back one goes. The experiment visually demonstrates the evolution of English, highlighting that our modern tongue is the product of a thousand years of continuous transformation.",
    "chinese_title": "你能理解多久以前的英语？",
    "chinese_summary": "本文描述了一项语言实验：作者虚构了一篇博客文章，用逐渐古老的英语形式写成，时间跨度从2000年回溯至1000年。身为语言学家的作者通过构建这些段落，展示了英语在千年间的演变过程。\n\n文章以现代非正式的“博主式”英语开篇，并随时间倒推，每个部分代表一个世纪。读者被邀请留意理解开始变得困难的节点。作者解释道，近三百年（1700–2000年）的英语因拼写标准化和语法稳定而基本可读，显著变化的仅是文体“风格”。\n\n理解障碍通常出现在1500至1600年代，这是由于拼写、语法和词汇发生了重大转变。到了1300年及更早时期，文本对现代读者而言几乎如同外语，需要翻译才能理解。\n\n核心结论是：虽然现代英语使用者能相对轻松地阅读1700年代的文本，但年代越久远，语言变化就越剧烈。这项实验直观展现了英语的演化历程，强调了我们现代语言是千年持续变革的产物。"
  },
  {
    "id": "47103945",
    "title": "Inputlag.science – Repository of knowledge about input lag in gaming",
    "url": "https://inputlag.science",
    "summary": "**Summary of \"Inputlag.science – Repository of knowledge about input lag in gaming\"**\n\nThis website serves as a central knowledge base for understanding input lag in gaming systems. It defines input lag as the latency between a user's action and its visible effect on screen, a problem that has grown over the years as systems have become more complex.\n\nThe article explains that this increased latency often goes unnoticed but can now cause significant issues in modern games. It attributes the rise to system complexity and a frequent lack of developer awareness about all the factors that contribute to lag.\n\nTo address this, the site identifies the three major components in the \"lag chain\":\n1.  **The Controller**\n2.  **The Game Engine**\n3.  **The Display**\n\nThe website's purpose is to help both developers and consumers understand these latency issues, the subtleties surrounding each component, and the methods for precisely measuring input lag. It focuses particularly on the controller and game engine aspects.",
    "chinese_title": "Inputlag.science – 游戏输入延迟知识库",
    "chinese_summary": "**《Inputlag.science——游戏输入延迟知识库》摘要**\n\n本网站是理解游戏系统输入延迟的核心知识库。它将输入延迟定义为用户操作与屏幕上可见效果之间的延迟，这是一个随着系统日益复杂而逐渐加剧的问题。\n\n文章指出，这种增加的延迟往往不易察觉，但在现代游戏中可能引发显著问题。其根源在于系统复杂性，以及开发者常常未能充分认识导致延迟的所有因素。\n\n为此，网站明确了“延迟链”中的三个主要组成部分：\n1.  **控制器**\n2.  **游戏引擎**\n3.  **显示器**\n\n该网站旨在帮助开发者和消费者理解这些延迟问题、各环节的细微差别以及精确测量输入延迟的方法，尤其侧重于控制器与游戏引擎方面的探讨。"
  },
  {
    "id": "47103649",
    "title": "Cloudflare outage on February 20, 2026",
    "url": "https://blog.cloudflare.com/cloudflare-outage-february-20-2026/",
    "summary": "On February 20, 2026, Cloudflare experienced a 6-hour outage affecting customers using its Bring Your Own IP (BYOIP) service. The incident was caused by an internal software bug during an automated change intended to improve processes. A faulty API query misinterpreted a parameter, causing a cleanup task to systematically delete approximately 1,100 BYOIP prefixes (25% of the total) instead of targeting only those scheduled for removal.\n\nThis resulted in withdrawn BGP routes, making affected services unreachable. While some customers could self-remediate via the dashboard, about 300 required manual restoration by engineers due to a secondary bug that removed service bindings from edge servers. The outage impacted various services, including CDN, Spectrum, and Magic Transit, causing connection timeouts.\n\nCloudflare attributed the failure to insufficient testing in staging environments and incomplete test coverage for the automated task scenario. The change was part of the company's \"Code Orange: Fail Small\" initiative to improve reliability. In response, Cloudflare outlined remediation steps: standardizing API schemas to prevent misinterpretation, and redesigning systems to separate operational and configured states. This will enable faster, health-mediated rollbacks to known-good configurations during future issues.",
    "chinese_title": "2026年2月20日Cloudflare服务中断事件",
    "chinese_summary": "2026年2月20日，Cloudflare发生持续6小时的服务中断，影响了使用其自带IP（BYOIP）服务的客户。此次事件源于一次旨在优化流程的自动化变更中出现的内部软件故障。一个有缺陷的API查询错误解读了参数，导致清理任务系统性地删除了约1,100个BYOIP前缀（占总数的25%），而非仅针对计划移除的部分。\n\n这导致BGP路由被撤销，使得受影响的服务无法访问。尽管部分客户可通过控制面板自行修复，但由于另一个次级故障清除了边缘服务器上的服务绑定，仍有约300个客户需要工程师手动恢复。此次中断影响了包括CDN、Spectrum和Magic Transit在内的多项服务，导致连接超时。\n\nCloudflare将故障归因于测试环境中的测试不足，以及针对自动化任务场景的测试覆盖不完整。此次变更是公司“橙色代码：小范围故障”计划的一部分，旨在提升系统可靠性。作为回应，Cloudflare提出了改进措施：标准化API模式以防止参数误读，并重新设计系统以分离运行状态与配置状态。这将使未来出现问题时，能通过健康检查机制更快回滚至已知良好的配置。"
  },
  {
    "id": "47094429",
    "title": "Loon: A functional lang with invisible types, safe ownership, and alg. effects",
    "url": "https://loonlang.com",
    "summary": "**Summary:**\n\nLoon is a new programming language designed to run in a web browser using JavaScript. It is a LISP dialect, which means it uses a distinctive, parenthesis-heavy syntax. The language emphasizes several advanced and modern programming concepts.\n\nIts key advertised features are **invisible types** (likely a form of powerful type inference that minimizes explicit type annotations), **safe ownership** (a system for managing memory and resources to prevent errors, similar to Rust), and **algebraic effects** (a mechanism for handling side-effects and control flow in a functional, composable way).\n\nThe core premise is that Loon combines the simplicity and expressiveness of a LISP with these sophisticated compile-time guarantees and effect management systems. This aims to offer developers a language that is both elegant to write and robust, preventing common classes of bugs related to types, memory, and program effects—all while being immediately executable in a browser environment without plugins or special setup.",
    "chinese_title": "Loon：一门具备隐形类型、安全所有权和代数效应的函数式语言",
    "chinese_summary": "**摘要：**\n\nLoon 是一种新的编程语言，专为在 Web 浏览器中使用 JavaScript 运行而设计。它是一种 LISP 方言，这意味着它采用独特且括号密集的语法。该语言强调多种先进和现代的编程概念。\n\n其宣传的主要特性包括**隐形类型**（可能是一种强大的类型推断形式，能最大限度地减少显式类型注解）、**安全所有权**（一种用于管理内存和资源的系统，旨在防止错误，类似于 Rust）以及**代数效应**（一种以函数式、可组合的方式处理副作用和控制流的机制）。\n\n其核心理念在于，Loon 将 LISP 的简洁性和表达力与这些复杂的编译时保证及效应管理系统相结合。这旨在为开发者提供一种既编写优雅又具备鲁棒性的语言，能够防止与类型、内存和程序效应相关的常见错误类别——同时无需插件或特殊设置即可直接在浏览器环境中执行。"
  },
  {
    "id": "47098172",
    "title": "How an inference provider can prove they're not serving a quantized model",
    "url": "https://tinfoil.sh/blog/2026-02-03-proving-model-identity",
    "summary": "Tinfoil's Modelwrap is a system that cryptographically proves an inference provider is serving a specific, unaltered model, addressing the industry problem of providers secretly using quantized or degraded versions to cut costs.\n\nIt works by creating a public, verifiable commitment to the exact model weights. The core innovation combines a Merkle tree (to produce a small root hash representing the entire model) with **dm-verity**, a Linux kernel subsystem. dm-verity enforces integrity at runtime by transparently verifying every disk read of the model weights against the attested root hash. If any bit doesn't match, the read fails.\n\nThis guarantee is bound to a secure hardware enclave via attestation. While standard attestation only proves the initial boot state, Modelwrap's configuration ensures the enclave's kernel will *enforce* the weight commitment during operation. This provides a runtime guarantee without requiring changes to inference software like vLLM.\n\nThe approach works for both public models (anyone can verify the hash) and private, proprietary models (owners can verify consistency without revealing weights). Performance overhead is minimal, affecting only the initial model load time, not inference speed. Modelwrap is open-source, allowing independent verification and use.",
    "chinese_title": "一个推理服务提供商如何证明他们没有提供量化模型",
    "chinese_summary": "Tinfoil的Modelwrap是一个通过密码学方式证明推理服务商正在运行特定、未经篡改模型的系统，旨在解决行业中存在服务商为降低成本秘密使用量化或降级版本的问题。\n\n其工作原理是创建对精确模型权重的公开可验证承诺。该核心创新将默克尔树（用于生成代表整个模型的微型根哈希）与**dm-verity**（Linux内核子系统）相结合。dm-verity通过在运行时透明验证每次模型权重磁盘读取与认证根哈希的一致性来强制保障完整性。任何比特位不匹配都会导致读取失败。\n\n该保障通过认证机制与安全硬件飞地绑定。虽然标准认证仅证明初始启动状态，但Modelwrap的配置确保飞地内核将在运行期间*强制执行*权重承诺。这提供了运行时保障，且无需修改vLLM等推理软件。\n\n该方法既适用于公开模型（任何人都可验证哈希值），也适用于私有专有模型（所有者可在不泄露权重的情况下验证一致性）。性能开销极小，仅影响初始模型加载时间，不影响推理速度。Modelwrap已开源，支持独立验证和使用。"
  },
  {
    "id": "47103136",
    "title": "Toyota Mirai hydrogen car depreciation: 65% value loss in a year",
    "url": "https://carbuzz.com/toyota-mirai-massive-depreciation-one-year/",
    "summary": "The Toyota Mirai, a hydrogen fuel cell vehicle, is experiencing catastrophic depreciation, losing up to 65% of its value within a year. While still in production, recent used models are selling for a fraction of their original $50,000+ price tag, often under $10,000.\n\nThis steep decline is attributed to several key factors. Primarily, hydrogen fueling infrastructure in the U.S. is severely limited, with only 54 stations—all in California—and minimal government investment compared to electric vehicle (EV) charging networks. This makes the Mirai impractical for most buyers. Furthermore, the rise of battery-electric vehicles as the dominant green alternative has overshadowed hydrogen. Consumer wariness about the complexity and cost of maintaining a used hydrogen vehicle also contributes to its low resale value.\n\nThe article notes that while Toyota and BMW continue limited hydrogen development, the market has largely moved on. U.S. Mirai sales were only 210 units in 2025. The piece concludes that hydrogen cars face a dim future in passenger vehicles, especially with emerging alternatives like synthetic fuels, leaving the Mirai as a symbol of a technology struggling to find mainstream adoption.",
    "chinese_title": "丰田Mirai氢能源车贬值：一年内价值缩水65%",
    "chinese_summary": "丰田Mirai作为一款氢燃料电池汽车，正经历灾难性的贬值，一年内价值缩水高达65%。尽管该车型仍在生产，但近期二手车的售价仅为原价5万美元以上的零头，往往不足1万美元。\n\n这种急剧贬值主要源于几个关键因素。首先，美国的加氢基础设施严重不足，全国仅有54座加氢站（全部位于加利福尼亚州），且政府对其的投资远少于电动汽车充电网络，这使得Mirai对大多数买家而言并不实用。其次，作为主流绿色替代方案的纯电动汽车的兴起，使氢能源技术相形见绌。此外，消费者对二手氢能源车辆维护复杂性和成本的担忧，也进一步拉低了其转售价值。\n\n文章指出，尽管丰田和宝马仍在进行有限的氢能源技术开发，但市场主流已转向其他方向。2025年，Mirai在美国仅售出210辆。文章总结认为，氢能源乘用车前景黯淡，尤其是在合成燃料等新兴替代方案出现的背景下，Mirai已成为一项难以融入主流市场的技术象征。"
  },
  {
    "id": "47102763",
    "title": "DialUp95 – A 90s inspired nostalgia hit",
    "url": "https://dialup95.com/",
    "summary": "This article describes **DialUp95**, a web-based simulation that recreates the experience of using a dial-up internet connection from the 1990s. The core purpose is to provide a **nostalgia hit**, immersing users in the sights and sounds of that era, complete with a detailed interface modeled after Windows 95.\n\nThe summary outlines the key interactive elements of the simulation:\n*   An **\"Experience Switcher\"** to choose connection settings.\n*   A detailed login window where users input a username, password, and phone number for the fictional **\"DialUp95 ISP.\"**\n*   The iconic **connection process**, showing status messages like \"Dialing...\" and the final connection speed (e.g., 31200 bps).\n*   A **connection status window** displaying duration, protocol information (PPP, TCP/IP), and a disconnect button.\n\nThe article also notes the project is a creation by **Robert Putt** and includes a call to support the developer by buying them a coffee. In essence, DialUp95 is a functional and aesthetic tribute designed to evoke the specific feel of early consumer internet access.",
    "chinese_title": "DialUp95 – 一款唤起90年代怀旧情怀的热门之作",
    "chinese_summary": "本文介绍了**DialUp95**，这是一个基于网络的模拟程序，重现了20世纪90年代使用拨号上网的体验。其核心目的是提供一种**怀旧冲击**，让用户沉浸在那个时代的视觉与声音氛围中，并配有一个仿照Windows 95设计的详细界面。\n\n概述部分列出了该模拟程序的主要交互元素：\n*   **“体验切换器”**，用于选择连接设置。\n*   一个详细的登录窗口，用户需输入虚构的**“DialUp95 ISP”**的用户名、密码和电话号码。\n*   标志性的**连接过程**，显示“正在拨号...”等状态信息以及最终连接速度（例如31200 bps）。\n*   一个**连接状态窗口**，显示连接时长、协议信息（PPP、TCP/IP）以及一个断开连接按钮。\n\n文章还提到该项目由**Robert Putt**创建，并呼吁通过“请开发者喝杯咖啡”的方式支持开发者。本质上，DialUp95是一个兼具功能与美感的致敬之作，旨在唤起早期消费者互联网接入的独特感受。"
  },
  {
    "id": "47096253",
    "title": "Claws are now a new layer on top of LLM agents",
    "url": "https://twitter.com/karpathy/status/2024987174077432126",
    "summary": "This article announces the introduction of \"Claws\" as a new layer built on top of existing LLM (Large Language Model) agents. The core concept is that Claws enhance or extend the capabilities of these underlying AI agents, though the specific technical details or functionalities of Claws are not described in the provided text.\n\nThe bulk of the content is not about the announcement itself, but a standard browser error message. It states that JavaScript is disabled and is required to use the platform (x.com, formerly Twitter). It prompts the user to enable JavaScript or switch to a supported browser, with links to a Help Center for more information. The page footer contains standard legal and corporate links.\n\n**Summary:** The main point is the announcement of \"Claws\" as a new layer for LLM agents. However, the key information about what Claws actually *are* or *do* is absent from the snippet. The visible content is dominated by a technical notice informing users they must enable JavaScript to view the full site, followed by standard footer links.",
    "chinese_title": "Claws现已成为LLM智能体之上的新一层。",
    "chinese_summary": "本文宣布在现有LLM（大型语言模型）智能体之上引入名为“Claws”的新层级。其核心概念是Claws能增强或扩展这些底层AI智能体的能力，但文中未具体说明Claws的技术细节或功能。\n\n主要内容并非关于该公告本身，而是一条标准的浏览器错误提示。信息显示JavaScript已被禁用，而使用该平台（x.com，原Twitter）必须启用JavaScript。页面提示用户启用JavaScript或切换至支持的浏览器，并附有帮助中心链接以供参考。页脚包含常规的法律声明与企业链接。\n\n**概要：** 核心内容是宣布“Claws”作为LLM智能体的新层级。但片段中并未说明Claws的具体定义或功能。可见内容主要为技术提示，告知用户必须启用JavaScript才能访问完整网站，随后是标准页脚链接。"
  },
  {
    "id": "47046858",
    "title": "Permacomputing",
    "url": "https://wiki.xxiivv.com/site/permacomputing.html",
    "summary": "The Canon Cat, a late-1980s workstation computer, is an early example of permacomputing principles. Its core software was written in Forth, a minimalist and efficient concatenative programming language. This design choice made Forth's interactive programming environment directly available to the user as a built-in subsystem for scripting and automation.\n\nThis architecture allowed operators to inspect, modify, and extend the machine's own system software in real time, blurring the line between user and programmer. It embodies key permaculturing ideals: **transparency** (the system's workings were accessible), **resilience** (Forth's simplicity aids long-term maintainability), **and user agency** (deep control over the tool itself).\n\nThe Cat demonstrates how foundational software choices can create a durable, repairable, and adaptable computing environment, contrasting with today's common opaque and closed systems.",
    "chinese_title": "永久计算",
    "chinese_summary": "佳能Cat是1980年代末的一款工作站计算机，是永续计算原则的早期范例。其核心软件采用Forth编写——这是一种极简高效的串接式编程语言。这一设计使得Forth的交互式编程环境作为内置子系统直接向用户开放，可用于脚本编写与自动化操作。\n\n该架构允许操作员实时检查、修改和扩展机器自身的系统软件，模糊了用户与程序员之间的界限。它体现了永续计算的核心理念：**透明度**（系统运行机制可被探查）、**韧性**（Forth的简洁性有助于长期维护）**以及用户自主权**（对工具本身的深度掌控）。\n\nCat展示了基础软件选择如何能创造出持久、可修复且适应性强的计算环境，这与当今普遍存在的不透明封闭系统形成了鲜明对比。"
  },
  {
    "id": "47098296",
    "title": "Acme Weather",
    "url": "https://acmeweather.com/blog/introducing-acme-weather",
    "summary": "Acme Weather is a new subscription-based weather app from the creators of Dark Sky. Its core philosophy is to embrace the inherent uncertainty of weather forecasting, moving beyond a single prediction to provide users with more practical information.\n\nThe app's key features include:\n*   **Alternate Possible Futures:** It displays a spread of forecast lines to show a range of plausible outcomes, helping users gauge reliability and plan for different scenarios.\n*   **Community Reporting:** Users can submit real-time condition reports, which appear on a map to supplement radar and official data.\n*   **Useful Maps:** It offers a comprehensive suite of maps (radar, precipitation totals, wind, etc.) integrated directly into forecasts for context.\n*   **Comprehensive Notifications:** Users can receive alerts for rain, lightning, severe weather, and even custom conditions, or opt into fun \"Acme Labs\" alerts for rainbows and beautiful sunsets.\n*   **Privacy-Focused Model:** The company emphasizes a strict privacy policy, collecting only necessary data, avoiding third-party trackers, and funding the service solely through user subscriptions.\n\nPositioned as the culmination of 15 years of experience, Acme Weather is available on iOS with an Android version planned, operating on a $25/year subscription model with a free trial.",
    "chinese_title": "Acme天气",
    "chinese_summary": "Acme Weather是Dark Sky开发者推出的新款订阅制天气应用。其核心理念是正视天气预报固有的不确定性，超越单一预测，为用户提供更具实用性的信息。\n\n该应用的主要功能包括：\n*   **多重可能未来：** 显示一组预测线以展示合理的结果范围，帮助用户评估可靠性并为不同情况制定计划。\n*   **社区实况报告：** 用户可提交实时天气状况报告，这些报告会在地图上显示，以补充雷达和官方数据。\n*   **实用地图工具：** 提供一套完整的地图（雷达、降水总量、风况等），直接整合到预报中以便理解天气背景。\n*   **全面通知系统：** 用户可接收降雨、闪电、恶劣天气甚至自定义条件的警报，也可选择接收有趣的\"Acme实验室\"警报，如彩虹和美丽日落。\n*   **隐私优先模式：** 公司强调严格的隐私政策，仅收集必要数据，避免第三方追踪器，并完全通过用户订阅来维持服务运营。\n\n作为15年经验积累的成果，Acme Weather目前已在iOS平台上线，Android版本正在开发中。该应用采用25美元/年的订阅模式，并提供免费试用期。"
  },
  {
    "id": "47100232",
    "title": "zclaw: personal AI assistant in under 888 KB, running on an ESP32",
    "url": "https://github.com/tnm/zclaw",
    "summary": "**zclaw** is a compact, open-source AI personal assistant designed to run on ESP32 microcontrollers, with a strict firmware size limit of 888 KB. Written in C, it enables natural language interaction for tasks like scheduling, GPIO control, and managing persistent memory.\n\nKey features include chat via Telegram or a hosted web interface, timezone-aware task scheduling, and support for AI providers like Anthropic and OpenAI. It is tested on ESP32-C3, S3, and C6 boards, with the Seeed XIAO ESP32-C3 recommended for starters.\n\nSetup is streamlined with one-line bootstrap scripts. The project includes useful utilities for building, flashing (with optional encryption), provisioning credentials, benchmarking latency, and running tests. It is licensed under MIT, emphasizing a hackable and fun user experience.",
    "chinese_title": "zclaw：个人AI助手，不到888KB，运行于ESP32平台",
    "chinese_summary": "**zclaw**是一款紧凑型开源AI个人助手，专为ESP32微控制器设计，其固件大小严格限制在888KB以内。采用C语言编写，支持通过自然语言交互实现日程管理、GPIO控制及持久化内存管理等任务。\n\n核心功能包括通过Telegram或托管网页界面进行聊天、支持时区感知的任务调度，以及兼容Anthropic和OpenAI等AI服务提供商。已在ESP32-C3、S3和C6开发板上完成测试，推荐初学者使用Seeed XIAO ESP32-C3开发板。\n\n项目提供一键式引导脚本简化配置流程，并包含构建、烧录（支持可选加密）、凭证配置、延迟基准测试及运行测试等实用工具。采用MIT开源协议，注重提供可自由定制且富有乐趣的用户体验。"
  },
  {
    "id": "47101890",
    "title": "Show HN: Iron-Wolf – Wolfenstein 3D source port in Rust",
    "url": "https://github.com/Ragnaroek/iron-wolf",
    "summary": "**Iron-Wolf** is a source port of the classic game *Wolfenstein 3D*, written in Rust. Its primary goal is to create a pixel-perfect and mod-friendly recreation of the original game.\n\n**Key Features & Information:**\n*   **Demo:** A playable demo of the first level (E1M1) is available.\n*   **How to Play:**\n    *   Clone the repository and run a command (`just run-sdl-shareware`) to play the included shareware version.\n    *   A web version is playable directly in a browser at the provided URL.\n*   **Full Game Support:** The web version allows users to upload their own full game files to play the complete experience.\n*   **Configuration:** An optional configuration file (`iw_config.toml`) can be customized, with options explained in a provided default file.\n\nIn short, Iron-Wolf is a modern, Rust-based reimplementation of *Wolfenstein 3D* that supports both a quick demo and the full game via local or web play.",
    "chinese_title": "展示 HN：Iron-Wolf – 用 Rust 编写的《德军总部 3D》源代码移植版",
    "chinese_summary": "**Iron-Wolf** 是一款基于 Rust 语言开发的经典游戏《Wolfenstein 3D》源码移植版。其主要目标是实现一个像素级还原、易于修改的原始游戏复刻。\n\n**核心特性与信息：**\n*   **试玩版：** 提供可游玩的第一关（E1M1）演示。\n*   **如何游玩：**\n    *   克隆代码仓库并运行命令（`just run-sdl-shareware`）即可游玩内含的共享版本。\n    *   网页版可通过提供的 URL 在浏览器中直接运行。\n*   **完整游戏支持：** 网页版允许用户上传自己的完整游戏文件以体验全部内容。\n*   **配置：** 可通过可选的配置文件（`iw_config.toml`）进行自定义，相关选项在提供的默认文件中有详细说明。\n\n简而言之，Iron-Wolf 是一款基于 Rust 的现代版《Wolfenstein 3D》重制项目，支持通过本地或网页方式快速试玩及运行完整游戏。"
  },
  {
    "id": "47092578",
    "title": "I found a Vulnerability. They found a Lawyer",
    "url": "https://dixken.de/blog/i-found-a-vulnerability-they-found-a-lawyer",
    "summary": "A diving instructor and security engineer discovered a critical vulnerability in a major diving insurer's member portal, where sequential numeric user IDs and a static default password exposed sensitive personal data, including that of minors. Following responsible disclosure protocols, he reported the issue to the organization and Malta's national CSIRT on April 28, 2025, with a 30-day embargo.\n\nInstead of a constructive response, the organization's legal team threatened him with criminal prosecution under Maltese law for his actions and demanded he sign a confidentiality agreement. The researcher refused the NDA, offering only to confirm data deletion, and argued that involving authorities was standard practice. The organization eventually fixed the vulnerability but blamed users for not changing default passwords and did not confirm notifying affected individuals as likely required by GDPR.\n\nThe article criticizes the organization for prioritizing reputation over security and user protection, a common pattern that discourages responsible disclosure. It concludes with advice for organizations to adopt transparent vulnerability disclosure policies and for researchers to document thoroughly and involve national CSIRTs for protection.",
    "chinese_title": "我发现了一个漏洞。他们找来了律师。",
    "chinese_summary": "一名潜水教练兼安全工程师在一家大型潜水保险公司会员门户中发现了一个关键漏洞，由于采用连续数字用户ID和静态默认密码，导致包括未成年人在内的敏感个人信息暴露。他遵循负责任披露原则，于2025年4月28日向该机构及马耳他国家计算机安全事件响应小组报告了此问题，并设置了30天保密期。\n\n然而，该机构法律团队并未作出建设性回应，反而依据马耳他法律以刑事起诉相威胁，并要求他签署保密协议。研究人员拒绝签署保密协议，仅同意确认数据删除，并指出联系权威机构是标准做法。该机构最终修复了漏洞，但将责任归咎于用户未修改默认密码，且未确认是否按《通用数据保护条例》要求通知受影响人员。\n\n文章批评该机构将声誉置于安全和用户保护之上，这种常见做法阻碍了负责任的安全披露。文末建议机构应建立透明的漏洞披露政策，研究人员则应详细记录漏洞并联系国家计算机安全事件响应小组以获取保护。"
  },
  {
    "id": "47099982",
    "title": "Padlet (YC W13) Is Hiring in San Francisco and Singapore",
    "url": "https://padlet.jobs",
    "summary": "This is a mission-driven hiring announcement from Padlet, a Y Combinator W13 company. The core message is a call to join their team to build tools that support the essential, often unseen, work that makes modern life possible.\n\nThe article poetically lists everyday comforts and milestones—from coffee to weddings—and attributes them all to the collective effort of a \"world at work.\" It vividly describes the grit, routine, and dedication behind this work, from office struggles to physical labor.\n\nThe founder, Nitesh, uses this reflection to frame Padlet's purpose: to create products that serve these workers. The rallying cry, \"Let's get to work,\" transitions from describing existing labor to inviting new hires to contribute. The goal is to \"show up for them\" by building tools that help people make, save, break, and move—the verbs that define progress.\n\nThe key practical information is that Padlet is hiring for roles in both San Francisco and Singapore. The announcement emphasizes culture and mission over specific job openings, seeking candidates inspired to empower the global workforce through their product.",
    "chinese_title": "Padlet（YC W13）正在旧金山和新加坡招聘。",
    "chinese_summary": "这是一份来自Y Combinator W13孵化公司Padlet的使命驱动型招聘启事。其核心信息是号召志同道合者加入团队，共同打造支持那些维系现代生活运转、至关重要却常被忽视的工作的工具。\n\n文章以诗意的笔触列举了从咖啡到婚礼等日常生活的舒适与重要时刻，并将其归功于“运转中的世界”的集体努力。它生动描绘了这些工作背后的艰辛、重复与奉献——无论是办公室里的殚精竭虑，还是体力劳动中的汗水挥洒。\n\n创始人Nitesh以此为契机，阐明了Padlet的宗旨：为这些劳动者创造服务型产品。那句“让我们开始工作吧”的号召，既是对既有劳动的诠释，也是对新生力量的邀约。目标是通过打造帮助人们创造、节省、突破和行动的工具来“为他们挺身而出”——这些动词正是推动进步的基石。\n\n关键的实际信息是：Padlet正在旧金山和新加坡两地招聘。启事着重强调企业文化与使命，而非具体职位，旨在寻找那些渴望通过产品赋能全球劳动力的有志之士。"
  },
  {
    "id": "47059147",
    "title": "I Don't Like Magic",
    "url": "https://adactio.com/journal/22399",
    "summary": "In this article, the author expresses a deep-seated distrust of \"magic\" in technology—specifically, the layers of abstraction in web development that obscure how things work. He draws a clear line in his own front-end work, preferring to stay close to raw HTML, CSS, and JavaScript to maintain control and understanding.\n\nHe distinguishes between libraries (code he calls) and frameworks (code that calls his code), stating a particular aversion to frameworks like React due to their enforced idioms and performance costs. This control-focused approach is acknowledged as atypical and commercially limiting, leading him to avoid client projects reliant on such abstractions.\n\nThe author extends this skepticism to modern tools like npm and, especially, AI coding assistants (LLMs). He compares LLMs to a \"turbo-charged npm,\" viewing generated code as unreliable \"spells\" that create maintenance nightmares. He argues that while abstractions can speed up initial development, their long-term cost is a loss of understanding and difficult maintenance—a critical concern for his own long-lived projects.\n\nUltimately, he frames hand-crafted coding as a satisfying craft, akin to knitting, rather than the fastest method, and reaffirms his core stance: \"I don’t like magic.\"",
    "chinese_title": "我不喜欢魔法",
    "chinese_summary": "在这篇文章中，作者表达了对技术中“魔法”的根深蒂固的不信任——尤其是那些掩盖了工作原理的Web开发抽象层。他在自己的前端工作中划清界限，更倾向于贴近原生的HTML、CSS和JavaScript，以保持控制力和理解。\n\n他区分了库（他调用的代码）和框架（调用他代码的代码），并特别表达了对像React这类框架的反感，因为它们强加了特定模式并带来性能开销。他承认这种以控制为中心的做法并不常见，且在商业上有所局限，这使他避免承接依赖此类抽象层的客户项目。\n\n作者将这种怀疑态度延伸至现代工具，如npm，尤其是AI编程助手（大语言模型）。他将大语言模型比作“涡轮增压的npm”，视生成的代码为不可靠的“咒语”，会带来维护噩梦。他认为，尽管抽象能加速初期开发，但其长期代价是理解力的丧失和维护的困难——这对他的长期项目而言至关重要。\n\n最终，他将手工编码视为一种令人满足的技艺，类似于编织，而非最快的方法，并重申其核心立场：“我不喜欢魔法。”"
  },
  {
    "id": "47098582",
    "title": "AI uBlock Blacklist",
    "url": "https://github.com/alvi-se/ai-ublock-blacklist",
    "summary": "This article introduces a personal **uBlock Origin blacklist** designed to block AI-generated content farms. The author created it to filter out low-quality, ad-filled websites that use generative AI to produce unreliable, often misleading articles for SEO and profit.\n\nKey features of the list include:\n*   **Manual Curation**: Websites are added individually based on the author's browsing, focusing on patterns like unnecessary introductions, vague content, referral links, lack of sources, and publication dates post-November 2022.\n*   **Safety & Quality Focus**: It aims to protect users from potentially dangerous AI \"hallucinations\" (e.g., harmful advice) and to promote human-written content with genuine experience and creativity.\n*   **Community-Driven**: Users can contribute by reporting sites via GitHub issues or submitting pull requests to add specific domains or subdirectories (e.g., `||example.com/@slopUser^$doc`).\n\nThe project distinguishes itself from broader AI-blocking tools by targeting only **garbage content farms**, not legitimate AI tools or services. The list is available for public subscription via a direct link for uBlock Origin users.",
    "chinese_title": "AI uBlock 黑名单",
    "chinese_summary": "本文介绍一份个人维护的 **uBlock Origin 黑名单**，专门用于屏蔽人工智能生成的内容农场。作者创建此列表旨在过滤那些利用生成式AI生产低质量、充斥广告、内容不可靠且常具误导性的文章以获取SEO流量和盈利的网站。\n\n该列表的主要特点包括：\n*   **人工筛选**：基于作者浏览经验逐个添加网站，重点关注如冗余导语、内容空洞、推广链接、缺乏信息来源以及发布日期在2022年11月后等特征。\n*   **安全与质量导向**：旨在保护用户免受AI“幻觉”可能带来的危害（例如错误建议），并推广蕴含真实经验与创造力的人工撰写内容。\n*   **社区驱动**：用户可通过GitHub提交问题报告网站，或通过拉取请求提交具体域名或子目录（例如`||example.com/@slopUser^$doc`）来参与完善。\n\n该项目与宽泛的AI屏蔽工具不同，仅针对**垃圾内容农场**，不影响合法的AI工具或服务。用户可通过直链订阅该列表，适用于uBlock Origin用户。"
  },
  {
    "id": "47095597",
    "title": "Be wary of Bluesky",
    "url": "https://kevinak.se/blog/be-wary-of-bluesky",
    "summary": "This article warns that Bluesky, despite being built on the open ATProto protocol, is becoming dangerously centralized and vulnerable to the same issues that plagued platforms like Twitter.\n\nThe core problem is that while users theoretically own their data and can self-host their Personal Data Server (PDS), almost everyone uses Bluesky's free, convenient servers. This centralizes all user data—from posts to photos to git issues—under Bluesky's control. Each new app that uses \"Sign in with Bluesky\" further entrenches this dependency.\n\nFurthermore, Bluesky controls critical infrastructure layers like the main data relay, the AppView that assembles timelines, and the centralized identity directory. While others *could* run these services, in practice, no one does, creating single points of failure.\n\nThe author compares this to email: an open protocol where Gmail's convenience led to centralization. With ATProto, the open protocol may actually accelerate centralization, as every app adds more data to Bluesky's servers.\n\nThe article's central warning is about incentives. If Bluesky is acquired, the new owner would control the data and infrastructure for the entire app ecosystem. They could disable exports, cut off third-party apps, or insert ads. Despite Bluesky's Public Benefit Corporation (PBC) status, the pressure from $120 million in venture capital funding will push toward monetizing and controlling the user base, not enabling easy exit. The technical possibility to leave is meaningless if the practical and economic incentives are designed to prevent it.",
    "chinese_title": "警惕Bluesky",
    "chinese_summary": "本文警告称，尽管Bluesky建立在开放的ATProto协议之上，但它正变得危险地中心化，并容易受到曾困扰Twitter等平台的相同问题影响。\n\n核心问题在于，虽然理论上用户拥有自己的数据并可以自托管个人数据服务器（PDS），但几乎所有人都在使用Bluesky免费便捷的服务器。这导致所有用户数据——从帖子、照片到代码问题——都集中在Bluesky的控制之下。每个使用“通过Bluesky登录”的新应用都进一步加深了这种依赖。\n\n此外，Bluesky控制着关键基础设施层，如主数据中继、组装时间线的应用视图以及中心化身份目录。虽然其他人*可以*运行这些服务，但实际上无人实施，从而形成了单点故障。\n\n作者将此比作电子邮件：一个因Gmail便利性导致中心化的开放协议。对于ATProto，开放协议实际上可能加速中心化，因为每个应用都会向Bluesky服务器添加更多数据。\n\n文章的核心警告关乎激励机制。如果Bluesky被收购，新所有者将控制整个应用生态系统的数据和基础设施。他们可能禁用数据导出、切断第三方应用或插入广告。尽管Bluesky是公益公司（PBC），但来自1.2亿美元风险资本的压力将推动其货币化并控制用户群，而非提供便捷的退出途径。如果实际设计的经济激励措施旨在阻止退出，那么技术上的离开可能性就毫无意义。"
  },
  {
    "id": "47094192",
    "title": "Turn Dependabot off",
    "url": "https://words.filippo.io/dependabot/",
    "summary": "This article argues that Dependabot's automated dependency updates create harmful \"noise\" and alert fatigue, especially for Go projects. The author illustrates this with a case study where Dependabot generated thousands of unnecessary pull requests for a security fix in a rarely used function, even alerting projects that didn't import the vulnerable package.\n\nInstead of Dependabot, the author recommends two scheduled GitHub Actions:\n1.  **`govulncheck` Action:** This Go vulnerability scanner uses static analysis to filter alerts based on whether your code actually calls the vulnerable symbols, dramatically reducing false positives and allowing for proper security assessment.\n2.  **Test Suite Action:** To catch breaking changes without constant updates, run your test suite daily against the latest dependency versions using `go get -u`. This provides early warning of issues without forcing immediate updates, making the process safer and more controlled.\n\nThe core message is that automated, unfiltered dependency updates are counterproductive. They waste time, cause alert fatigue, and pressure maintainers with irrelevant fixes. By using smarter tools like `govulncheck` and strategic testing, developers can maintain security and compatibility with less noise and more meaningful oversight.",
    "chinese_title": "关闭Dependabot",
    "chinese_summary": "本文认为，Dependabot的自动化依赖更新会产生有害的“噪音”和警报疲劳，尤其对Go项目而言。作者通过一个案例研究说明：Dependabot为一个很少使用的函数的安全修复生成了数千个不必要的拉取请求，甚至向未导入该漏洞包的项目发出了警报。\n\n作者建议用两个定时GitHub Actions替代Dependabot：\n1.  **`govulncheck` Action：** 这款Go漏洞扫描器通过静态分析，根据代码是否实际调用了漏洞符号来过滤警报，大幅减少误报，便于进行有效的安全评估。\n2.  **测试套件Action：** 为避免频繁更新而捕捉破坏性变更，可使用`go get -u`每日针对最新依赖版本运行测试套件。这能在不强制立即更新的情况下提前预警问题，使流程更安全、更可控。\n\n核心观点是：未经筛选的自动化依赖更新往往适得其反。它们浪费时间、引发警报疲劳，并用无关的修复给维护者带来压力。通过使用`govulncheck`等智能工具和策略性测试，开发者可以在减少噪音、加强有效监督的同时，保持安全性和兼容性。"
  },
  {
    "id": "47095105",
    "title": "A16Z partner says that the theory that we'll vibe code everything is ' wrong'",
    "url": "https://www.aol.com/articles/a16z-partner-says-theory-well-050150534.html",
    "summary": "In a podcast interview, Andreessen Horowitz (A16z) partner Anish Acharya argued against the idea that AI-assisted \"vibe coding\" will be used to rebuild all enterprise software. He contends that since software like ERP and CRM systems only represents 8-12% of a company's costs, using AI to rewrite these core tools would yield minimal savings (around 10%) while introducing significant risk.\n\nInstead, Acharya believes companies should focus their \"innovation bazooka\" of AI on developing their core business products or optimizing the other 90% of their operational costs. He stated that while some specific software business models may be disadvantaged, the broad market sell-off of software stocks is an overreaction.\n\nHis comments follow a sharp decline in software stocks, partly triggered by fears that new AI tools like Anthropic's could disrupt traditional software markets. Acharya aligns with investor Vinod Khosla's view that Wall Street's short-term pricing is often irrelevant to long-term tech value, emphasizing that real-world AI usage metrics are more important indicators than stock prices.",
    "chinese_title": "A16Z合伙人称“我们将凭感觉编码一切”的理论是“错误的”。",
    "chinese_summary": "在一次播客访谈中，安德森·霍洛维茨基金（A16z）合伙人阿尼什·阿查里亚反驳了AI辅助的“氛围编程”将被用于重建所有企业软件的观点。他认为，由于ERP和CRM等软件仅占企业成本的8-12%，使用AI重写这些核心工具带来的节省微乎其微（约10%），却会引入巨大风险。\n\n相反，阿查里亚认为企业应将AI这一“创新火箭炮”聚焦于开发核心业务产品或优化其余90%的运营成本。他表示，虽然某些特定软件商业模式可能受到冲击，但软件股遭遇的广泛市场抛售属于过度反应。\n\n此番言论发表之际，软件股正经历大幅下跌，部分原因是市场担忧Anthropic等新型AI工具可能颠覆传统软件市场。阿查里亚与投资者维诺德·科斯拉观点一致，认为华尔街的短期定价往往与长期技术价值无关，并强调现实世界的AI使用指标比股价更能反映真实价值。"
  },
  {
    "id": "47091419",
    "title": "Keep Android Open",
    "url": "https://f-droid.org/2026/02/20/twif.html",
    "summary": "This edition of \"This Week in F-Droid\" focuses on a critical warning about Android's future and includes updates on the F-Droid ecosystem.\n\n**Main Alert: Android's Impending Lockdown**\nThe core team warns that Google's plans to restrict sideloading and third-party app stores (announced August 2025) are still active, despite public perception that Google reversed course. They argue this will make Google the gatekeeper of all Android devices. To raise awareness, F-Droid clients now display a banner urging users to voice concerns to regulators before it's too late. Other app stores like IzzyOnDroid and Obtainium have joined this awareness campaign.\n\n**F-Droid Development Updates**\n*   **F-Droid Basic:** Version 2.0-alpha3 was released, featuring a CSV export for installed apps, an install history, a mirror chooser, and various UI improvements.\n*   **Note:** Users of version 1.23.x must manually enable \"Allow beta updates\" to receive this alpha.\n\n**Notable App Updates**\n*   **Conversations/Quicksy:** Updated with a significant change: removing a Google library in favor of direct IPC with Google Play Services, potentially paving the way for a single FLOSS version for both F-Droid and Play Store.\n*   **ProtonVPN:** Dropped OpenVPN support, now using only WireGuard and Stealth protocols, reducing app size by ~40%.\n*   **SimpleEmail:** Received its first update in two years, adding compatibility with Android 12+.\n*   Other updates include **Dolphin Emulator**, **Nextcloud** apps and server, and **Buses**.\n\n**Repository Changes**\n*   **5 apps were removed**, including Tibetan Pad and Tomdroid.\n*   **1 app was newly added**: NeoDB You, a native NeoDB client.\n*   **287 apps were updated**; a partial list is included in the article.",
    "chinese_title": "保持安卓开放",
    "chinese_summary": "本期《F-Droid周报》重点关注关于安卓未来的关键警示，并收录了F-Droid生态系统的更新动态。\n\n**核心警示：安卓系统即将全面封闭**\n核心团队警告称，尽管公众普遍认为谷歌已改变策略，但其限制侧载和第三方应用商店的计划（于2025年8月宣布）仍在推进。团队指出这将使谷歌成为所有安卓设备的唯一守门人。为提高公众意识，F-Droid客户端现已展示横幅，敦促用户在为时已晚前向监管机构表达关切。IzzyOnDroid和Obtainium等其他应用商店也已加入这项倡议。\n\n**F-Droid开发动态**\n*   **F-Droid Basic：** 发布2.0-alpha3版本，新增已安装应用CSV导出功能、安装历史记录、镜像选择器及多项界面优化。\n*   **注意：** 1.23.x版本用户需手动启用“允许测试版更新”才能接收此Alpha版本。\n\n**重点应用更新**\n*   **Conversations/Quicksy：** 重要变更：移除了谷歌库，改为直接与谷歌服务框架进行进程间通信，这可能为F-Droid和Play Store提供统一的自由开源版本铺平道路。\n*   **ProtonVPN：** 放弃OpenVPN支持，现仅使用WireGuard和Stealth协议，应用体积缩减约40%。\n*   **SimpleEmail：** 两年来首次更新，新增对Android 12+的兼容支持。\n*   其他更新包括**Dolphin模拟器**、**Nextcloud**系列应用与服务器以及**Buses**。\n\n**软件仓库变更**\n*   **5款应用被移除**，包括Tibetan Pad和Tomdroid。\n*   **新增1款应用**：NeoDB You（原生NeoDB客户端）。\n*   **287款应用获得更新**，部分列表详见正文。"
  },
  {
    "id": "47091748",
    "title": "Facebook is cooked",
    "url": "https://pilk.website/3/facebook-is-absolutely-cooked",
    "summary": "The author describes logging into Facebook for the first time in eight years and finding the main News Feed overrun with low-quality, algorithmically-recommended content. The feed was dominated not by posts from friends or followed pages, but primarily by AI-generated \"thirst traps\" of young women, along with other engagement-bait videos and memes.\n\nThis content, which the author labels \"slop\" and \"lizard-brain-rot,\" appeared to be targeted based on gender, suggesting a straight male user would see a different feed than others. The author notes the difficulty in distinguishing AI from real content and observes that comments sections were often filled with bot-like responses.\n\nThe experience leads to several conclusions: that Facebook's core product has severely degraded into an algorithmic \"conveyor belt\" of low-value content; that this decline may be most extreme for inactive or isolated users whose feeds lack genuine social updates; and that the platform now hosts disturbing material, including AI-generated images of underage-looking girls, which prompted the author to log off immediately. The piece frames this as the final, failed state of a once-dominant social network.",
    "chinese_title": "脸书完蛋了。",
    "chinese_summary": "作者描述了自己时隔八年首次登录Facebook的经历，发现首页动态已被低质量的算法推荐内容淹没。动态流中不再是好友或关注页面的帖子，而主要是AI生成的年轻女性“诱惑陷阱”视频，以及其他博取互动的视频和网络迷因。\n\n这类被作者称为“垃圾内容”和“蜥蜴脑腐蚀”的内容似乎基于性别进行定向推送，暗示男性用户看到的动态流会与他人不同。作者指出很难区分AI生成内容与真实内容，并发现评论区常充斥着类似机器人的回复。\n\n此番体验得出几点结论：Facebook的核心产品已严重退化，沦为低价值内容的算法“传送带”；这种退化对于动态流缺乏真实社交更新的非活跃或孤立用户可能最为极端；该平台如今甚至包含令人不安的内容，包括AI生成的未成年模样女孩图像，这促使作者立即退出登录。文章将这种现象描绘成这个一度主导市场的社交网络最终失败的形态。"
  },
  {
    "id": "47092006",
    "title": "Wikipedia deprecates Archive.today, starts removing archive links",
    "url": "https://arstechnica.com/tech-policy/2026/02/wikipedia-bans-archive-today-after-site-executed-ddos-and-altered-web-captures/",
    "summary": "The English-language Wikipedia has decided to blacklist and remove all links to the archiving service Archive.today. This decision followed a community discussion that concluded the site is unreliable and poses a security risk.\n\nThe primary reasons for the ban are twofold. First, Wikipedia editors discovered that Archive.today had been used to launch a DDoS attack against a blogger, Jani Patokallio, after he wrote about the site operator's identity. Second, and more critically, editors found evidence that Archive.today had tampered with archived webpage snapshots, inserting Patokallio’s name into them to further a personal grudge. This manipulation directly undermined the core requirement of verifiability for Wikipedia sources.\n\nAs a result, Wikipedia’s volunteer editors are now tasked with removing or replacing over 695,000 links to Archive.today and its various domains. The guidance recommends using alternative archives like the Internet Archive instead.\n\nThe article notes that the site's operator, using the alias \"Nora,\" had also sent threats to Patokallio. While the Wikimedia Foundation had not yet intervened, it indicated the security threat to users was serious enough that it might have done so. The decision highlights Wikipedia's reliance on the integrity of external sources and its community-driven process for enforcing its standards.",
    "chinese_title": "维基百科弃用Archive.today，开始移除存档链接",
    "chinese_summary": "英文维基百科决定将存档服务Archive.today列入黑名单并移除所有相关链接。这一决定源于社区讨论后认定该网站不可靠且存在安全风险。\n\n禁令的主要原因有两点。首先，维基百科编辑发现Archive.today曾被用于对博主贾尼·帕托卡利奥发起分布式拒绝服务攻击，起因是帕托卡利奥撰写了关于该网站运营者真实身份的文章。其次，也是更关键的一点，编辑们发现证据表明Archive.today曾篡改已存档的网页快照，在其中插入帕托卡利奥的名字以泄私愤。这种篡改行为直接违背了维基百科对资料来源可验证性的核心要求。\n\n因此，维基百科的志愿者编辑们现需移除或替换超过69.5万个指向Archive.today及其多个域名的链接。相关指引建议改用互联网档案馆等其他存档服务。\n\n文章指出，该网站运营者（化名“诺拉”）曾向帕托卡利奥发出威胁。虽然维基媒体基金会尚未介入此事，但表示用户面临的安全威胁已严重到可能需要基金会采取行动。这一决定凸显了维基百科对外部资料来源完整性的依赖，以及其通过社区驱动流程执行标准的运作模式。"
  },
  {
    "id": "47094877",
    "title": "Don't create .gitkeep files, use .gitignore instead (2023)",
    "url": "https://adamj.eu/tech/2023/09/18/git-dont-create-gitkeep/",
    "summary": "This article explains how to ensure an empty directory (like `build/`) is created when cloning a Git repository, as Git only tracks files, not directories.\n\nIt first describes the common `.gitkeep` technique: placing an empty `.gitkeep` file inside the directory and adding specific rules to the root `.gitignore` to ignore everything in that directory except the `.gitkeep` file. The author notes this method is flawed because it requires editing two files, can break if the directory is renamed, and uses a non-standard filename.\n\nThe article then advocates for a better technique using only a `.gitignore` file placed inside the target directory (e.g., `build/.gitignore`). This file contains two lines: `*` to ignore all files, and `!.gitignore` to un-ignore itself. When this directory is committed, Git tracks the `.gitignore` file, thereby creating the directory on clone. This method is simpler, uses a standard Git file, and remains valid even if the directory is renamed.",
    "chinese_title": "不要创建.gitkeep文件，改用.gitignore（2023）",
    "chinese_summary": "本文解释了如何在克隆Git仓库时确保创建空目录（如`build/`），因为Git仅跟踪文件而非目录。\n\n文章首先介绍了常见的`.gitkeep`技巧：在目录中放置空的`.gitkeep`文件，并在根目录的`.gitignore`中添加特定规则，以忽略该目录内除`.gitkeep`外的所有内容。作者指出此方法存在缺陷：需要编辑两个文件、目录重命名时可能失效，且使用了非标准文件名。\n\n随后文章提倡一种更优方案：仅在目标目录内（如`build/.gitignore`）放置一个`.gitignore`文件。该文件包含两行内容：`*`用于忽略所有文件，`!.gitignore`用于取消忽略自身。当提交此目录时，Git会跟踪`.gitignore`文件，从而在克隆时创建目录。这种方法更简洁、使用标准Git文件，且即使目录重命名仍保持有效。"
  },
  {
    "id": "47102208",
    "title": "The Nekonomicon – Nekochan.net Archive, Updated",
    "url": "http://nekonomicon.irixnet.org/",
    "summary": "This article presents \"The Nekonomicon,\" a structured digital archive of the now-defunct Nekochan.net forums, a prominent online community dedicated to vintage NeXT and early Apple computers.\n\nThe archive is organized into three distinct volumes, each serving a specific purpose:\n*   **Volume 1 - Book of Endings:** Contains the final, preserved state of the Nekochan.net forums.\n*   **Volume 2 - Book of Notes:** Archives the complete textual discussions and technical knowledge shared by the community.\n*   **Volume 3 - Book of Illustrations:** Preserves the forum's photo gallery, documenting hardware and projects.\n\nThe summary establishes that the Nekonomicon is not a single document but a comprehensive, multi-volume preservation effort aimed at safeguarding the technical discussions, community knowledge, and visual history of this niche computing community for future reference.",
    "chinese_title": "《猫之魔典》——Nekochan.net 存档，已更新",
    "chinese_summary": "本文介绍了《Nekonomicon》——一个对已关闭的Nekochan.net论坛（一个专注于复古NeXT和早期苹果电脑的重要线上社区）进行结构化整理的数字档案库。\n\n该档案库分为三个独立卷册，各具特定功能：\n*   **第一卷 - 终末之书：** 收录Nekochan.net论坛最终被保存下来的状态。\n*   **第二卷 - 笔记之书：** 归档社区分享的完整文本讨论与技术知识。\n*   **第三卷 - 图鉴之书：** 保存论坛的相册，记录硬件设备与项目成果。\n\n概述阐明，《Nekonomicon》并非单一文档，而是一项全面的多卷本保存工程，旨在为未来留存这一小众计算社区的技术讨论、社群知识与视觉历史。"
  },
  {
    "id": "47101200",
    "title": "macOS's Little-Known Command-Line Sandboxing Tool (2025)",
    "url": "https://igorstechnoclub.com/sandbox-exec/",
    "summary": "**Summary**\n\n`sandbox-exec` is a built-in macOS command-line tool that allows users to run applications in a restricted, isolated environment. This sandboxing technique enhances security by limiting an application's access to system resources—such as files, networks, or hardware—to only what is explicitly permitted.\n\nTo use the tool, you create a sandbox profile (a configuration file with a Scheme-like syntax) that defines the rules. The basic command is `sandbox-exec -f profile.sb command_to_run`. There are two main approaches to writing profiles: a secure \"deny by default\" model that blocks everything except specified allowances, and a more permissive \"allow by default\" model that blocks only listed operations.\n\nThe article provides practical examples, such as creating a terminal session without network access, and highlights debugging methods using the Console app or `log stream` to monitor sandbox denials. It also notes that macOS includes pre-built profiles in `/System/Library/Sandbox/Profiles/`.\n\nWhile powerful for security testing, limiting untrusted code, and privacy control, `sandbox-exec` has limitations. Apple discourages its direct use in favor of the App Sandbox framework for developers, creating effective profiles requires trial and error, and it lacks a graphical interface. Despite this, it remains a highly flexible tool for advanced users seeking granular control over application permissions.",
    "chinese_title": "macOS鲜为人知的命令行沙盒工具（2025）",
    "chinese_summary": "**摘要**\n\n`sandbox-exec` 是 macOS 内置的命令行工具，允许用户在受限制的隔离环境中运行应用程序。这种沙盒技术通过限制应用程序对系统资源（如文件、网络或硬件）的访问，仅允许明确授权的操作，从而增强了安全性。\n\n使用该工具时，需创建一个沙盒配置文件（采用类似 Scheme 语法的配置文件）来定义规则。基本命令格式为 `sandbox-exec -f profile.sb command_to_run`。编写配置文件主要有两种方式：一种是安全的“默认拒绝”模式，即除明确允许的操作外阻止一切访问；另一种是更宽松的“默认允许”模式，仅阻止列出的操作。\n\n本文提供了实用示例，例如创建无网络访问的终端会话，并重点介绍了使用控制台应用或 `log stream` 监控沙盒拒绝事件的调试方法。文中还指出，macOS 在 `/System/Library/Sandbox/Profiles/` 目录中提供了预置的配置文件。\n\n尽管 `sandbox-exec` 在安全测试、限制不受信任代码和隐私控制方面功能强大，但它也存在局限性。苹果公司不鼓励直接使用该工具，而建议开发者采用应用沙盒框架；创建有效的配置文件需要反复调试，且缺乏图形界面。尽管如此，对于寻求对应用程序权限进行精细控制的高级用户而言，它仍是一个高度灵活的工具。"
  }
]