[
  {
    "id": "46633488",
    "title": "Apple is fighting for TSMC capacity as Nvidia takes center stage",
    "url": "https://www.culpium.com/p/exclusiveapple-is-fighting-for-tsmc",
    "summary": "This article details a significant shift in the semiconductor industry, where Apple is now competing for production capacity at TSMC as Nvidia rises to become a top client. The core dynamic is the surging demand for AI chips, driven by Nvidia and others, which is straining TSMC's advanced manufacturing lines and giving these clients greater pricing power and influence.\n\nKey points include:\n*   **Changing Leadership:** Nvidia likely surpassed Apple as TSMC's largest customer in some quarters of 2025, a shift driven by Nvidia's explosive revenue growth (estimated +62%) compared to Apple's slower hardware sales growth (+3.6%).\n*   **Capacity Competition:** Apple's smartphone processors must now compete for wafer space against larger, more complex AI GPUs from Nvidia and AMD, meaning its orders are no longer automatically prioritized.\n*   **TSMC's Strategic Position:** TSMC is investing heavily (capex up ~32% to a record $52-56B) to build new fabs for next-generation nodes like A16, which is optimized for high-performance computing (HPC) chips. This near-term roadmap favors AI clients.\n*   **Long-Term Balance:** While Nvidia dominates current demand, Apple provides TSMC with stability due to its broad, varied product lineup across many fabs. Future node development (like A14) is designed for both mobile and HPC, which may rebalance the relationship.\n*   **Financial Realities:** The article defends TSMC's cautious expansion, noting its high capital intensity and depreciation costs compared to fabless clients like Nvidia and Alphabet, which bear no manufacturing risk.\n\nIn essence, the AI boom has reshaped the pecking order at TSMC, with Nvidia's Jensen Huang gaining influence over Tim Cook in the fight for advanced chipmaking capacity.",
    "chinese_title": "苹果正争夺台积电产能，而英伟达成为焦点。",
    "chinese_summary": "本文详述了半导体行业的一次重大转变：随着英伟达崛起成为顶级客户，苹果正与英伟达在台积电争夺产能。核心动因是英伟达等公司对AI芯片的激增需求，这给台积电的先进制程生产线带来压力，并赋予这些客户更强的议价能力和影响力。\n\n要点包括：\n*   **领导地位更迭**：受英伟达营收爆发式增长（预计+62%）与苹果硬件销售增速放缓（+3.6%）影响，英伟达可能在2025年某些季度超越苹果，成为台积电最大客户。\n*   **产能竞争**：苹果的智能手机处理器如今必须与英伟达和AMD更大、更复杂的AI GPU争夺晶圆产能，其订单不再自动享有优先权。\n*   **台积电的战略定位**：台积电正大幅增加资本支出（约增长32%至创纪录的520-560亿美元），为A16等新一代制程建设新晶圆厂。该制程专为高性能计算芯片优化，短期路线图更有利于AI客户。\n*   **长期平衡**：虽然英伟达主导当前需求，但苹果凭借其广泛且跨多厂区的产品组合为台积电提供了稳定性。未来制程（如A14）将兼顾移动设备与高性能计算需求，可能重塑双方关系。\n*   **财务现实**：文章为台积电的谨慎扩张辩护，指出其资本密集度和折旧成本远高于英伟达、Alphabet等无晶圆厂客户，后者无需承担制造风险。\n\n本质上，AI热潮已重塑台积电的客户层级，在先进芯片产能的争夺中，英伟达的黄仁勋正获得比苹果的蒂姆·库克更大的影响力。"
  },
  {
    "id": "46636387",
    "title": "CVEs affecting the Svelte ecosystem",
    "url": "https://svelte.dev/blog/cves-affecting-the-svelte-ecosystem",
    "summary": "The Svelte team has released security patches for five vulnerabilities affecting core packages in the ecosystem. Users must upgrade to the following versions immediately: **devalue to 5.6.2**, **svelte to 5.46.4**, **@sveltejs/kit to 2.49.5**, and **@sveltejs/adapter-node to 5.5.1**.\n\nThe vulnerabilities include:\n*   **Two DoS flaws (CVE-2026-22775 & CVE-2026-22774)** in `devalue.parse` for versions 5.1.0-5.6.1, where malicious user input can cause excessive memory/CPU usage and crash the process. SvelteKit is only vulnerable if the experimental `remoteFunctions` feature is enabled.\n*   **A memory amplification DoS (CVE-2026-22803)** in SvelteKit's Remote Functions binary deserializer for versions 2.49.0-2.49.4, causing applications to hang and allocate large amounts of memory.\n*   **A DoS and potential SSRF vulnerability (CVE-2025-67647)** affecting SvelteKit (versions 2.19.0-2.49.4) and adapter-node, related to prerendering. It can crash the server or, under specific configurations (missing `ORIGIN` variable), allow access to internal resources.\n*   **An XSS vulnerability (CVE-2025-15265)** in Svelte 5.46.0-5.46.3 when using `hydratable` with unsanitized, user-controlled keys.\n\nThe team thanked security researchers and Vercel for their responsible disclosure and assistance, and committed to improving processes to prevent similar issues. Users are urged to report vulnerabilities privately via GitHub's Security tab.",
    "chinese_title": "影响Svelte生态系统的CVEs",
    "chinese_summary": "Svelte团队已针对影响生态系统核心包的五个漏洞发布安全补丁。用户必须立即升级至以下版本：**devalue 至 5.6.2**、**svelte 至 5.46.4**、**@sveltejs/kit 至 2.49.5** 以及 **@sveltejs/adapter-node 至 5.5.1**。\n\n漏洞详情包括：\n*   **两个DoS漏洞（CVE-2026-22775 和 CVE-2026-22774）** 存在于 `devalue.parse` 的 5.1.0-5.6.1 版本中，恶意用户输入可导致内存/CPU过度消耗并使进程崩溃。仅当启用实验性 `remoteFunctions` 功能时，SvelteKit 才会受影响。\n*   **一个内存放大DoS漏洞（CVE-2026-22803）** 存在于 SvelteKit 的 Remote Functions 二进制反序列化器中（2.49.0-2.49.4 版本），可导致应用程序挂起并分配大量内存。\n*   **一个DoS及潜在SSRF漏洞（CVE-2025-67647）** 影响 SvelteKit（2.19.0-2.49.4 版本）和 adapter-node，涉及预渲染功能。该漏洞可能使服务器崩溃，或在特定配置（缺少 `ORIGIN` 变量）下允许访问内部资源。\n*   **一个XSS漏洞（CVE-2025-15265）** 存在于 Svelte 5.46.0-5.46.3 版本中，当 `hydratable` 与未净化的用户控制键值一起使用时可能被触发。\n\n团队感谢安全研究人员和 Vercel 负责任地披露漏洞并提供协助，并承诺改进流程以防止类似问题。敦促用户通过 GitHub 的安全标签私下报告漏洞。"
  },
  {
    "id": "46637165",
    "title": "JuiceFS is a distributed POSIX file system built on top of Redis and S3",
    "url": "https://github.com/juicedata/juicefs",
    "summary": "JuiceFS is an open-source, high-performance distributed POSIX file system designed for cloud-native environments. It stores file data in object storage services (like Amazon S3) and metadata in databases (like Redis or MySQL), allowing massive cloud storage to be used as efficiently as local storage without code changes.\n\nKey features include full POSIX and Hadoop compatibility, an S3-compatible gateway, a Kubernetes CSI driver, strong consistency, and support for data encryption and compression. Its architecture consists of a client, a metadata engine, and object storage for data. Files are broken into chunks, slices, and blocks for optimized performance.\n\nJuiceFS is production-ready, supports a wide range of object storage services, and is used by various organizations. The project is under active development with a roadmap including gateway optimization and snapshots. It is licensed under Apache 2.0, and anonymous usage tracking can be disabled.",
    "chinese_title": "JuiceFS是一个基于Redis和S3构建的分布式POSIX文件系统。",
    "chinese_summary": "JuiceFS是一款专为云原生环境设计的开源高性能分布式POSIX文件系统。它将文件数据存储在对象存储服务（如Amazon S3）中，元数据存储在数据库（如Redis或MySQL）中，使海量云存储能像本地存储一样高效使用，且无需修改代码。\n\n主要特性包括完全兼容POSIX和Hadoop、提供S3兼容网关、Kubernetes CSI驱动、强一致性，并支持数据加密与压缩。其架构由客户端、元数据引擎和对象存储数据层组成。文件被分割为块、切片和子块以优化性能。\n\nJuiceFS已具备生产就绪能力，支持多种对象存储服务，并被众多机构采用。该项目正在积极开发中，路线图包括网关优化和快照功能。它采用Apache 2.0许可证，并可禁用匿名使用统计。"
  },
  {
    "id": "46613324",
    "title": "Inside The Internet Archive's Infrastructure",
    "url": "https://hackernoon.com/the-long-now-of-the-web-inside-the-internet-archives-fight-against-forgetting",
    "summary": "This article, published in March 2020, details the personal and pragmatic preparations of a California engineer for the emerging COVID-19 pandemic. The individual, Bruce Li, approaches the situation not from a place of panic, but through a \"rational\" and systematic engineering mindset.\n\nThe main focus is on his methodical stockpiling of essential supplies to enable a prolonged period of self-isolation. His preparations are comprehensive, covering key categories: a three-month supply of shelf-stable food and water, a robust first-aid kit, necessary prescription medications, and basic sanitation and hygiene products.\n\nBeyond physical supplies, Li emphasizes the importance of financial and digital readiness. This includes ensuring access to cash, securing important documents, and having backup power sources for communication devices. His strategy is designed to minimize the need to leave home, thereby reducing exposure risk.\n\nThe article presents his actions as a logical response to potential supply chain disruptions and healthcare system overload, framing preparedness as a responsible way to protect oneself and alleviate pressure on public resources. It captures the early-pandemic shift from general awareness to concrete, individual action, exemplified by a technical, problem-solving approach to the crisis.",
    "chinese_title": "互联网档案馆基础设施内部探秘",
    "chinese_summary": "这篇发表于2020年3月的文章，详细记录了加州工程师布鲁斯·李为应对新兴新冠疫情所做的个人务实准备。面对疫情，他并未陷入恐慌，而是以“理性”且系统化的工程思维应对。\n\n文章重点描述了他为长期自我隔离所做的有条不紊的物资储备。其准备工作全面覆盖关键领域：储存了三个月保质期稳定的食物和水、一个完备的急救包、必要的处方药以及基本的清洁卫生用品。\n\n除了实体物资，李还强调了财务与数字准备的重要性，包括确保现金获取、保管重要文件，以及为通讯设备配备备用电源。他的策略旨在最大限度减少外出需求，从而降低感染风险。\n\n文章将其行为解读为对潜在供应链中断和医疗系统过载的逻辑性回应，将事前准备视为保护自我、缓解公共资源压力的负责任方式。文章捕捉了疫情初期社会从普遍认知转向具体个人行动的转变，并以这种技术性、解决问题式的危机应对方法作为例证。"
  },
  {
    "id": "46618042",
    "title": "Claude is good at assembling blocks, but still falls apart at creating them",
    "url": "https://www.approachwithalacrity.com/claude-ne/",
    "summary": "The article argues that while Claude Opus 4.5 is impressive at executing well-defined tasks using existing tools, it fails at the higher-level design work of a senior engineer.\n\nThe author highlights two successful examples: Claude autonomously debugging a Sentry integration and migrating infrastructure from Modal to AWS ECS. In both cases, Claude excelled at assembling pre-existing, well-designed \"blocks\" like Playwright, Terraform, and AWS CLI commands.\n\nHowever, the author contrasts this with a React refactoring task, where Claude proposed a hacky, inefficient solution because the underlying code was poorly abstracted. Unlike a senior engineer who would identify and fix the root architectural problem, Claude could only work within the flawed structure it was given.\n\nThe core conclusion is that Claude lacks the \"soul\" or intrinsic drive to create elegant abstractions and improve system design. Its capability is bounded by the quality of the existing components it's provided. Therefore, while it is a powerful tool for automating tedious work, it amplifies rather than replaces the need for skilled engineers who can design the foundational \"blocks\" it relies on.",
    "chinese_title": "克劳德擅长组装积木，但在创造积木方面仍有欠缺。",
    "chinese_summary": "文章指出，尽管Claude Opus 4.5在执行使用现有工具的明确定义任务方面令人印象深刻，但在高级工程师所需的高层设计工作上却力不从心。\n\n作者列举了两个成功案例：Claude自主调试Sentry集成，以及将基础设施从Modal迁移到AWS ECS。在这两个案例中，Claude都擅长组合现有的、设计良好的“模块”，如Playwright、Terraform和AWS CLI命令。\n\n然而，作者将此与一项React重构任务进行了对比。在该任务中，由于底层代码抽象程度低，Claude提出了一个粗糙低效的解决方案。与能够识别并修复根本架构问题的高级工程师不同，Claude只能在给定的有缺陷的结构内工作。\n\n核心结论是，Claude缺乏创造优雅抽象和改善系统设计的“灵魂”或内在驱动力。其能力受限于所提供的现有组件的质量。因此，尽管它是一个自动化繁琐工作的强大工具，但它不仅没有取代，反而更加凸显了对能够设计其所依赖的基础“模块”的熟练工程师的需求。"
  },
  {
    "id": "46632023",
    "title": "25 Years of Wikipedia",
    "url": "https://wikipedia25.org",
    "summary": "**Summary of \"25 Years of Wikipedia\"**\n\nWikipedia, the free online encyclopedia, marks its 25th anniversary as one of the internet's most enduring and influential projects. Launched on January 15, 2001, by Jimmy Wales and Larry Sanger, its revolutionary model allowed anyone to edit articles, aiming to compile the sum of all human knowledge.\n\nThe article highlights Wikipedia's core principles: a neutral point of view, free content, and a collaborative, volunteer-driven community. Despite early skepticism, it grew exponentially to become a top-10 website, with over 62 million articles in more than 300 languages. It is consistently one of the first results for factual searches and a vital educational resource.\n\nKey challenges over the years have included combating vandalism, addressing systemic biases (such as underrepresentation of topics related to women and the Global South), and managing internal community conflicts. The nonprofit Wikimedia Foundation, established in 2003, supports the infrastructure and mission.\n\nLooking forward, Wikipedia faces the dual challenges of sustaining its volunteer base and adapting to new technologies like artificial intelligence. While AI tools could aid editing, they also pose risks of mass-generated low-quality content. The anniversary underscores Wikipedia's unprecedented success as a public good, demonstrating the power of open collaboration, while also emphasizing its ongoing struggle to ensure reliability, equity, and relevance for the next 25 years.",
    "chinese_title": "维基百科25周年",
    "chinese_summary": "**《维基百科25周年综述》**\n\n维基百科作为互联网领域最具持久影响力项目之一，迎来了其创立25周年纪念日。这项免费在线百科全书由吉米·威尔士与拉里·桑格于2001年1月15日创立，其革命性模式允许任何人编辑条目，旨在汇集全人类的知识总和。\n\n文章着重阐述了维基百科的核心原则：中立观点、免费内容以及由志愿者驱动的协作社区。尽管早期备受质疑，它仍呈指数级成长为全球访问量前十的网站，拥有超过6200万篇涵盖300多种语言的条目。它始终是事实检索的首选结果之一，也是至关重要的教育资源。\n\n多年来面临的主要挑战包括：应对恶意篡改、解决系统性偏见（如涉及女性及全球南方议题的呈现不足），以及协调内部社群矛盾。成立于2003年的非营利组织维基媒体基金会持续为该项目提供基础设施支持与使命护航。\n\n展望未来，维基百科面临维持志愿者基数与适应人工智能等新技术的双重挑战。虽然AI工具可能辅助编辑工作，但也存在批量生成低质内容的风险。此次周年纪念既彰显了维基百科作为公共产品的空前成功——证明了开放协作的力量，也凸显出其未来25年仍需持续攻坚，以确保内容的可靠性、公平性与时代相关性。"
  },
  {
    "id": "46612919",
    "title": "First impressions of Claude Cowork",
    "url": "https://simonw.substack.com/p/first-impressions-of-claude-cowork",
    "summary": "This article covers two major announcements in the AI and developer tool space.\n\nFirst, it reviews **Claude Cowork**, Anthropic's new \"general agent\" tool for non-developers. Built on the powerful Claude Code engine, Cowork provides a user-friendly interface for automating computer tasks via code execution. It operates within a secure, containerized sandbox by default, accessing only user-granted files. The author tested it successfully on a personal task but highlights significant **security concerns**, particularly around prompt injection attacks. Despite Anthropic's warnings and mitigations, the risk of data theft or system damage remains a serious, often underestimated threat.\n\nSecond, the article discusses **Fly.io's Sprites.dev**, a product addressing two key problems: safe sandboxes for coding agents and secure APIs for running untrusted code. Sprites provides persistent, stateful development environments with fast storage, automatic tool installation, and a unique checkpoint/restore feature. It also cleverly uses Claude Skills to teach the AI how to use the Sprite environment itself. The author sees this as a crucial step toward solving the sandboxing problem for both personal use and future web services.\n\nBoth releases signal a move toward more powerful, accessible, and (hopefully) secure AI-powered automation tools.",
    "chinese_title": "对Claude Cowork的初步印象",
    "chinese_summary": "本文涵盖AI和开发者工具领域的两项重大发布。\n\n首先，回顾了Anthropic面向非开发者推出的新型\"通用智能体\"工具**Claude Cowork**。该工具基于强大的Claude Code引擎构建，通过代码执行为自动化计算机任务提供用户友好界面。其默认在安全的容器化沙箱中运行，仅访问用户授权的文件。作者在个人任务中成功测试了该工具，但着重指出了其存在的重大**安全隐患**，特别是提示词注入攻击的风险。尽管Anthropic已发布警告并采取缓解措施，数据窃取或系统损坏的威胁依然严峻，且常被低估。\n\n其次，文章探讨了**Fly.io的Sprites.dev**。该产品致力于解决两大核心问题：为编码智能体提供安全沙箱环境，以及为运行非受信代码构建安全API。Sprites提供具备快速存储、自动工具安装和独特检查点/恢复功能的持久化有状态开发环境，并巧妙运用Claude Skills功能教导AI如何使用Sprite环境本身。作者认为这是解决个人使用及未来网络服务沙箱隔离难题的关键一步。\n\n两项发布共同标志着AI驱动自动化工具正朝着更强大、更易用且（有望）更安全的方向迈进。"
  },
  {
    "id": "46612494",
    "title": "Show HN: OpenWork – an open-source alternative to Claude Cowork",
    "url": "https://github.com/different-ai/openwork",
    "summary": "**OpenWork** is an open-source, extensible desktop application designed as a user-friendly alternative to Claude Cowork. It aims to make \"agentic work\" accessible to knowledge workers by providing a guided, product-like interface instead of requiring command-line expertise.\n\nBuilt on the OpenCode engine, OpenWork operates in two modes: **Host mode** (spawning a local OpenCode server in a selected project folder) and **Client mode** (connecting to an existing remote server). Its core features include creating and managing sessions, streaming live updates, visualizing execution plans as timelines, and handling permission requests for privileged actions.\n\nKey capabilities in its v0.1 release include:\n*   **Templates:** Save and re-run common workflows.\n*   **Skills Manager:** Install, list, and manage OpenCode skill modules and plugins from OpenPackage or local folders.\n*   **Auditability:** Clear visibility into what actions were taken and why.\n\nThe application is built with a Tauri (Rust) backend and a web-based UI, requiring Node.js, pnpm, and the OpenCode CLI. It prioritizes security by binding locally to 127.0.0.1 by default and hiding sensitive tool metadata. OpenWork is released under the MIT license.",
    "chinese_title": "Show HN：OpenWork —— 一个开源的Claude Cowork替代品",
    "chinese_summary": "**OpenWork** 是一款开源、可扩展的桌面应用程序，旨在作为 Claude Cowork 的用户友好替代方案。它通过提供引导式、产品化的界面，而非要求用户具备命令行专业知识，致力于让知识工作者能够轻松进行“智能体驱动的工作”。\n\n基于 OpenCode 引擎构建，OpenWork 提供两种运行模式：**主机模式**（在选定项目文件夹中启动本地 OpenCode 服务器）和**客户端模式**（连接至现有远程服务器）。其核心功能包括创建和管理会话、实时流式更新、将执行计划可视化为时间线，以及处理特权操作的权限请求。\n\n其 v0.1 版本的关键能力包括：\n*   **模板：** 保存并重新运行常用工作流。\n*   **技能管理器：** 从 OpenPackage 或本地文件夹安装、列出和管理 OpenCode 技能模块与插件。\n*   **可审计性：** 清晰展示已执行的操作及其原因。\n\n该应用程序采用 Tauri（Rust）后端和基于 Web 的 UI，需要 Node.js、pnpm 和 OpenCode CLI。它默认将服务绑定到本地 127.0.0.1 并隐藏敏感工具元数据，以此优先保障安全性。OpenWork 基于 MIT 许可证发布。"
  },
  {
    "id": "46633574",
    "title": "Found: Medieval Cargo Ship – Largest Vessel of Its Kind Ever",
    "url": "https://www.smithsonianmag.com/smart-news/archaeologists-say-theyve-unearthed-a-massive-medieval-cargo-ship-thats-the-largest-vessel-of-its-kind-ever-found-180987984/",
    "summary": "Danish and Swedish maritime archaeologists have discovered the largest medieval cargo ship, or cog, ever found. Named Svaelget 2, the 600-year-old wreck was located in the Øresund Strait and measures approximately 92 feet long, with an estimated 300-ton cargo capacity.\n\nThe ship is exceptionally well-preserved, with its starboard side protected by sand. This has allowed researchers to uncover unique structures never before found on a cog, including extensive remains of a stern \"castle\" (a sheltered deck for the crew) and a brick galley with cooking utensils and food remains.\n\nBuilt around 1410 from oak and Dutch timber, the cog's immense size highlights the scale of northern European trade in the late Middle Ages. These ships revolutionized commerce by safely transporting bulky goods like timber and salt with small crews.\n\nWhile the find confirms existing historical knowledge about robust medieval trade networks, it provides the first physical proof that cogs could reach such large dimensions, offering new insights into their construction and life on board.",
    "chinese_title": "发现：中世纪货船——史上同类船只中最大的一艘",
    "chinese_summary": "丹麦和瑞典的海事考古学家发现了迄今最大的中世纪货船，或称柯克船。这艘名为\"斯瓦勒格特2号\"的沉船已有600年历史，在厄勒海峡被发现，船身长约92英尺，估计载重量达300吨。\n\n该船保存异常完好，右舷侧因沙层保护未受侵蚀。这使得研究人员首次在柯克船上发现了独特的结构，包括大面积的船尾\"城堡\"（供船员栖身的遮蔽甲板）遗迹，以及配有炊具和食物残骸的砖砌厨房。\n\n这艘约建于1410年的柯克船采用橡木和荷兰木材建造，其庞大体量彰显了中世纪晚期北欧贸易的规模。此类船只曾以少量船员安全运输木材和盐等大宗货物，彻底改变了商业运输模式。\n\n此次发现不仅印证了现有关于中世纪坚固贸易网络的历史认知，更首次以实物证据表明柯克船能达到如此巨大的尺寸，为研究其建造技术和船上生活提供了全新视角。"
  },
  {
    "id": "46634450",
    "title": "Design and Implementation of Sprites",
    "url": "https://fly.io/blog/design-and-implementation/",
    "summary": "Fly.io has launched Sprites, a new type of disposable, persistent Linux virtual machine designed for instant, on-demand computing. Unlike their flagship Fly Machines, which are based on OCI containers, Sprites start in seconds, have 100GB of durable root storage, and automatically sleep when inactive to minimize cost.\n\nThe design relies on three key decisions. First, Sprites eliminate user-specific container images, using a single standard container to enable instant creation from pre-allocated pools. Second, they use S3-compatible object storage as the root filesystem, making data durable and workloads easily migratable, with local NVMe as a cache. Third, orchestration is \"inside-out,\" with most management services running inside the VM's root namespace, simplifying development and allowing features like service restarts without a full VM reboot.\n\nSprites integrate with Fly.io's existing infrastructure, like its service discovery system for instant public URLs, but are optimized for interactive and prototyping use cases rather than production-scale applications. The goal is to provide a seamless, low-friction computing environment where users can spin up and discard VMs as easily as grabbing a pen from a drawer.",
    "chinese_title": "精灵的设计与实现",
    "chinese_summary": "Fly.io推出了Sprites，这是一种新型的即用即弃、持久化的Linux虚拟机，专为即时按需计算而设计。与基于OCI容器的旗舰产品Fly Machines不同，Sprites可在数秒内启动，拥有100GB的持久根存储，并在闲置时自动休眠以降低成本。\n\n其设计依赖于三个关键决策。首先，Sprites取消了用户特定的容器镜像，采用单一标准容器，从而能够从预分配池中即时创建。其次，它们使用S3兼容的对象存储作为根文件系统，使数据持久化且工作负载易于迁移，同时以本地NVMe作为缓存。第三，编排采用“由内向外”的方式，大多数管理服务运行在虚拟机的根命名空间内，简化了开发流程，并实现了无需完全重启虚拟机即可重启服务等功能。\n\nSprites与Fly.io的现有基础设施（如其服务发现系统，可提供即时公共URL）无缝集成，但主要针对交互式和原型设计用例进行了优化，而非生产级应用。其目标是提供一个无缝、低摩擦的计算环境，让用户可以像从抽屉里取笔一样轻松地创建和丢弃虚拟机。"
  },
  {
    "id": "46637399",
    "title": "UK offshore wind prices come in 40% cheaper than gas in record auction",
    "url": "https://electrek.co/2026/01/14/uk-offshore-wind-record-auction/",
    "summary": "The UK's latest offshore wind auction (AR7) has set a European record by awarding 8.4 GW of new capacity. The key outcome is that the winning projects secured an average price of approximately £90 per megawatt-hour (MWh), which is about 40% cheaper than the estimated cost of power from new gas plants (£147/MWh) and significantly cheaper than new nuclear.\n\nThis auction was highly competitive, with 19 eligible projects driving prices down. The awarded capacity, enough to power nearly 10 million homes, is expected to save consumers £1.7 billion annually compared to gas and unlock around £22 billion in private investment. German energy company RWE was the biggest winner, securing contracts for nearly 7 GW.\n\nThe UK government hailed the results as a major step toward energy sovereignty and the goal of clean power by 2030, emphasizing the dual benefits of lower consumer costs and reduced reliance on fossil fuels. The auction also included a small but strategic allocation for floating offshore wind technology.",
    "chinese_title": "英国海上风电价格创纪录拍卖中比天然气便宜40%",
    "chinese_summary": "英国最新一轮海上风电拍卖（AR7）创下欧洲纪录，共授予8.4吉瓦新增装机容量。关键成果在于中标项目平均价格约为每兆瓦时90英镑，比新建燃气发电的预估成本（147英镑/兆瓦时）低约40%，且远低于新建核电成本。\n\n本次拍卖竞争激烈，19个合格项目推动价格走低。中标容量可满足近1000万户家庭用电，预计每年较燃气发电为消费者节省17亿英镑，并带动约220亿英镑私人投资。德国能源公司莱茵集团成为最大赢家，获得了近7吉瓦的合同。\n\n英国政府称赞此次成果是实现能源主权和2030年清洁电力目标的重要一步，强调其兼具降低消费者成本与减少化石燃料依赖的双重效益。本轮拍卖还包含针对漂浮式海上风电技术的少量战略性配额。"
  },
  {
    "id": "46636093",
    "title": "Supply Chain Vuln Compromised Core AWS GitHub Repos & Threatened the AWS Console",
    "url": "https://www.wiz.io/blog/wiz-research-codebreach-vulnerability-aws-codebuild",
    "summary": "Researchers discovered \"CodeBreach,\" a critical vulnerability in AWS CodeBuild that could have allowed attackers to take over key AWS GitHub repositories, including the core AWS JavaScript SDK used by the AWS Console. The flaw was an unanchored regex filter in the CI pipeline, which let attackers bypass security by registering a new GitHub account with an ID containing a trusted maintainer's ID. This allowed them to trigger a build via a malicious pull request and steal privileged GitHub credentials from the build environment.\n\nWith these credentials, attackers could gain admin access to repositories, push malicious code, and compromise the software supply chain. The AWS JavaScript SDK is used by the AWS Console and is present in 66% of cloud environments, making the potential impact enormous. AWS has since fixed the issue, implemented global hardening in CodeBuild, and introduced a new \"Pull Request Comment Approval\" build gate. The incident underscores the urgent need for organizations to secure their CI/CD pipelines against such subtle but high-impact misconfigurations.",
    "chinese_title": "供应链漏洞危及核心AWS GitHub仓库并威胁AWS控制台安全",
    "chinese_summary": "研究人员发现AWS CodeBuild存在一个名为“CodeBreach”的关键漏洞，该漏洞可能允许攻击者接管关键的AWS GitHub仓库，包括AWS控制台使用的核心AWS JavaScript SDK。该漏洞源于CI管道中一个未锚定的正则表达式过滤器，攻击者可通过注册一个包含受信任维护者ID的新GitHub账户来绕过安全限制。这使得他们能够通过恶意拉取请求触发构建，并从构建环境中窃取特权GitHub凭证。\n\n利用这些凭证，攻击者可获得仓库的管理员权限，推送恶意代码，进而破坏软件供应链。AWS JavaScript SDK被AWS控制台使用，并存在于66%的云环境中，因此潜在影响巨大。AWS已修复该问题，在CodeBuild中实施了全局加固，并引入了新的“拉取请求评论批准”构建门控机制。此事件凸显了企业亟需保护其CI/CD管道，防范此类隐蔽但影响严重的配置错误。"
  },
  {
    "id": "46632768",
    "title": "Show HN: TinyCity – A tiny city SIM for MicroPython (Thumby micro console)",
    "url": "https://github.com/chrisdiana/TinyCity",
    "summary": "**Summary of \"TinyCity – A Tiny City SIM for MicroPython\"**\n\nTinyCity is a miniature city-building simulation game, inspired by SimCity, designed to run on the Thumby micro console (powered by a Raspberry Pi RP2040) using MicroPython. Players build and manage a growing city, balancing residential, commercial, and industrial zones while handling resources like power, budget, and population needs.\n\nKey features include three selectable or randomly generated terrains, a dynamic economy with tax collection, and systems tracking population density, crime, pollution, and traffic. The game includes random disasters and allows players to construct special buildings like police stations, fire departments, and parks to improve city health and growth. It also supports save/load functionality and includes milestones with hidden bonuses.\n\nThe game is a port inspired by the Arduboy title \"MicroCity.\" It can be played by adding the source files to Thumby's Online Editor, with a web-based version planned for the future.",
    "chinese_title": "Show HN：TinyCity——为MicroPython（Thumby微型游戏机）打造的迷你城市模拟游戏",
    "chinese_summary": "**《TinyCity——基于MicroPython的微型城市模拟游戏》概述**\n\nTinyCity是一款受《模拟城市》启发的微型城市建设模拟游戏，专为搭载树莓派RP2040芯片的Thumby微型游戏机设计，采用MicroPython运行。玩家需建设并管理一座不断发展的城市，平衡住宅、商业和工业区域，同时处理电力、预算和人口需求等资源。\n\n主要特色包括三种可选或随机生成的地形、具备税收机制的动态经济系统，以及追踪人口密度、犯罪率、污染和交通状况的模拟体系。游戏内含随机灾难事件，玩家可建造警察局、消防局和公园等特殊建筑以提升城市健康度与发展水平。游戏支持存档/读档功能，并设有包含隐藏奖励的成就里程碑。\n\n本游戏移植自Arduboy平台作品《MicroCity》。玩家可通过将源代码文件添加至Thumby在线编辑器进行游玩，未来计划推出网页版本。"
  },
  {
    "id": "46627652",
    "title": "The URL shortener that makes your links look as suspicious as possible",
    "url": "https://creepylink.com/",
    "summary": "This article introduces **CreepyLink**, a satirical URL shortener designed to make links appear intentionally suspicious and untrustworthy. The service humorously inverts the typical purpose of URL shorteners—which aim to create clean, memorable links—by generating shortened URLs that look alarming or dubious.\n\nThe key points are:\n*   **Purpose:** It's a tongue-in-cheek tool that plays on internet security concerns, suggesting users can make their \"normal\" and \"trustworthy\" links look \"creepy.\"\n*   **Function:** Users can input a URL to receive a shortened version crafted to appear suspicious.\n*   **Features:** The interface includes a button to copy the generated link and a system to report issues, complete with a support email for urgent problems.\n\nOverall, the article presents CreepyLink as a humorous commentary on online security and the perception of shortened links, rather than a legitimate utility.",
    "chinese_title": "让你的链接看起来尽可能可疑的网址缩短器",
    "chinese_summary": "本文介绍了**CreepyLink**——一个讽刺性的网址缩短服务，其设计初衷是让链接看起来刻意显得可疑且不可信。该服务以幽默的方式颠覆了网址缩短器通常旨在创建简洁、易记链接的目的，转而生成看似令人警觉或可疑的短网址。\n\n主要特点包括：\n*   **目的：** 这是一款带有戏谑意味的工具，利用人们对网络安全的担忧，让用户可以将“正常”且“可信”的链接变得“诡异”。\n*   **功能：** 用户可以输入一个网址，获得一个被精心设计成可疑样子的缩短版本。\n*   **特性：** 界面包含复制生成链接的按钮和问题报告系统，并为紧急问题提供了支持邮箱。\n\n总的来说，文章将CreepyLink呈现为对网络安全和短链接认知的一种幽默评论，而非一个实用的工具。"
  },
  {
    "id": "46613304",
    "title": "Claude Cowork runs Linux VM via Apple virtualization framework",
    "url": "https://gist.github.com/simonw/35732f187edbe4fbd0bf976d013f22c8",
    "summary": "This report details the secure, sandboxed Linux environment powering Claude's \"Cowork mode.\" It is a lightweight Ubuntu 22.04 virtual machine running on ARM64 hardware.\n\nThe core security is provided by multi-layer isolation: the **Bubblewrap** tool creates separate network and process namespaces, while strict **seccomp filtering** and dropped user privileges prevent system access or escalation. All network traffic is forced through monitored HTTP and SOCKS5 proxies on the host.\n\nThe environment has a dedicated 10GB session disk, with user-accessible areas for uploads and outputs. It includes key development tools like Python, Node.js, and GCC, but notably lacks Docker, Go, and Rust.\n\nDesigned for ephemeral tasks, the session terminates when the parent process exits, and the filesystem resets between uses. The architecture balances providing a functional toolset for the Claude Code agent—enabling file operations, Bash, and web access—with strong boundaries to protect both the user's system and the host infrastructure.",
    "chinese_title": "Claude Cowork通过苹果虚拟化框架运行Linux虚拟机。",
    "chinese_summary": "本报告详细介绍了为Claude的“协作模式”提供动力的安全、沙盒化的Linux环境。这是一个运行在ARM64硬件上的轻量级Ubuntu 22.04虚拟机。\n\n其核心安全机制通过多层隔离实现：**Bubblewrap**工具创建独立的网络和进程命名空间，同时严格的**seccomp过滤**和降级的用户权限防止系统访问或权限提升。所有网络流量都被强制通过主机上受监控的HTTP和SOCKS5代理。\n\n该环境配备专用的10GB会话磁盘，设有供用户上传和输出的可访问区域。它包含Python、Node.js和GCC等关键开发工具，但明确不包含Docker、Go和Rust。\n\n该环境专为临时任务设计，当父进程退出时会话即终止，且文件系统在每次使用间重置。其架构在平衡性上：既为Claude代码代理提供功能性工具集——支持文件操作、Bash和网络访问——又通过严格的边界保护用户系统和主机基础设施。"
  },
  {
    "id": "46637127",
    "title": "‘ELITE’: The Palantir app ICE uses to find neighborhoods to raid",
    "url": "https://werd.io/elite-the-palantir-app-ice-uses-to-find-neighborhoods-to-raid/",
    "summary": "This article reports on an internal Palantir application called \"ELITE,\" which is used by U.S. Immigration and Customs Enforcement (ICE) to identify and locate potential deportation targets. The tool functions like a map interface, highlighting neighborhoods based on the density of immigrants and assigning a \"confidence score\" to individuals' addresses.\n\nOnce a location or person is selected, ELITE displays a detailed dossier containing the individual's name, photo, government-issued Alien Number, date of birth, and full address. The author characterizes the system as enabling \"racial profiling on a grand scale\" and draws a stark comparison to historical surveillance capabilities.\n\nThe article heavily criticizes the ethical implications for the Palantir employees developing this technology. It questions how engineers reconcile their daily work—building a more efficient system for deportations—with the personal benefits of their employment, such as salary, stock options, and a comfortable office environment. The piece frames their labor as directly powering an agency responsible for arrests, deportations, and documented incidents of violence against civilians.",
    "chinese_title": "‘精英’：Palantir为ICE开发的用于定位突击搜查区域的应用程序",
    "chinese_summary": "本文报道了Palantir公司内部一款名为“ELITE”的应用程序，该程序被美国移民与海关执法局（ICE）用于识别和定位潜在的驱逐目标。该工具以地图界面形式运作，根据移民密度高亮显示社区，并为个人地址分配“置信度评分”。\n\n一旦选定某个地点或个人，ELITE便会显示包含姓名、照片、政府签发的外国人编号、出生日期和完整地址的详细档案。作者将这一系统描述为能够“实现大规模种族定性”，并与历史上的监控能力形成鲜明对比。\n\n文章严厉批评了开发此项技术的Palantir员工所面临的道德困境，质疑工程师们如何将日常工作——构建更高效的驱逐系统——与薪资、股票期权、舒适办公环境等个人利益相协调。文章指出，他们的劳动直接驱动着这个实施逮捕、驱逐及有暴力对待平民记录的执法机构。"
  },
  {
    "id": "46636738",
    "title": "Zuck#: A programming language for connecting the world. And harvesting it",
    "url": "https://jayzalowitz.github.io/zucksharp/",
    "summary": "Zuck# is a satirical, PHP-inspired programming language that humorously critiques modern social media practices, particularly those associated with Meta (Facebook). Its core design replaces standard programming keywords with terms that parody corporate tech culture, such as `STEAL_DATA` for variable assignment, `SENATOR_WE_RUN_ADS` for output, and `PIVOT_TO_VIDEO` for conditional statements.\n\nThe language's features mock common tech industry tropes: moving fast and breaking things (`MOVE_FAST` and `BREAK_THINGS`), constant rebranding, invasive data harvesting, and evasive corporate responses to errors (`CONGRESSIONAL_HEARING`, `BLAME_RUSSIA`). It includes playful examples like a \"Humanity Verification Protocol\" that involves manual blinking and a \"Smoking Meats Protocol\" referencing a well-known Mark Zuckerberg meme.\n\nWhile presented as a functional language with installation instructions (via Git, Docker) and a complete keyword reference, its primary purpose is comedic and critical commentary. It satirizes the erosion of privacy, the pivot-driven development cycle, and the often-absurd rhetoric of tech congressional hearings, all through the lens of programming syntax.",
    "chinese_title": "扎克#：一种连接世界并从中获取价值的编程语言。",
    "chinese_summary": "Zuck#是一种讽刺性、受PHP启发的编程语言，以幽默方式批判现代社交媒体行为，尤其针对Meta（Facebook）的相关做法。其核心设计将标准编程关键词替换为嘲讽企业科技文化的术语，例如用`STEAL_DATA`表示变量赋值，`SENATOR_WE_RUN_ADS`表示输出，`PIVOT_TO_VIDEO`表示条件语句。\n\n该语言特性戏仿了科技行业的常见套路：快速行动打破常规（`MOVE_FAST`与`BREAK_THINGS`）、频繁品牌重塑、侵入式数据收集，以及企业对错误的回避式回应（`CONGRESSIONAL_HEARING`、`BLAME_RUSSIA`）。它包含诸如需要手动眨眼的“人性验证协议”和引用马克·扎克伯格知名梗图的“熏肉协议”等趣味示例。\n\n尽管该语言提供了安装指南（通过Git、Docker）和完整关键词参考，看似具备功能性，但其主要目的在于喜剧表达与批判性评论。它通过编程语法讽刺隐私侵蚀、跟风转向的开发周期，以及科技公司国会听证会中常出现的荒谬说辞。"
  },
  {
    "id": "46573926",
    "title": "Goscript: Transpile Go to human-readable TypeScript",
    "url": "https://github.com/aperturerobotics/goscript",
    "summary": "**GoScript** is an experimental compiler that translates Go code into human-readable TypeScript at the AST level. Its primary goal is to enable code reuse, allowing developers to share algorithms, business logic, and data structures between Go backends and TypeScript frontends without maintaining separate codebases.\n\nKey features include support for Go constructs like structs, interfaces, methods, channels, goroutines (translated to async/await), slices, maps, and control flow. It aims for a simple and readable translation, though it has current limitations such as using JavaScript's number type (instead of Go's precise integers) and lacking support for pointer arithmetic, unsafe operations, and complex numbers.\n\nThe tool can be installed via `go install` and used via CLI or programmatic API. After compilation, the generated TypeScript requires a `tsconfig.json` with specific settings (ES2022+ target, `esnext.disposable` lib) and can be integrated into frontend frameworks like React or Vue. Examples demonstrate translating user management logic and async channel patterns for use in web applications.\n\nGoScript is positioned as a pragmatic solution for sharing self-contained logic, contrasting with more ambitious projects like GopherJS that aim to run entire Go programs in browsers. It is open-source (MIT licensed) and welcomes community feedback and contributions.",
    "chinese_title": "Goscript：将Go代码转译为人类可读的TypeScript",
    "chinese_summary": "**GoScript** 是一款实验性编译器，可在抽象语法树（AST）层面将 Go 代码转换为人类可读的 TypeScript。其主要目标是实现代码复用，使开发者能够在 Go 后端与 TypeScript 前端之间共享算法、业务逻辑和数据结构，无需维护独立的代码库。\n\n核心特性包括支持 Go 的多种结构，如结构体、接口、方法、通道、协程（转换为 async/await）、切片、映射和控制流。它致力于提供简洁可读的转换结果，但目前仍存在一些限制，例如使用 JavaScript 的 number 类型（而非 Go 的精确整数），且不支持指针运算、不安全操作和复数类型。\n\n该工具可通过 `go install` 安装，并通过命令行或编程接口使用。编译后生成的 TypeScript 需要配置特定的 `tsconfig.json`（ES2022+ 目标，`esnext.disposable` 库），并可集成到 React 或 Vue 等前端框架中。示例展示了如何转换用户管理逻辑和异步通道模式以用于 Web 应用程序。\n\nGoScript 定位为一种实用的逻辑共享方案，与 GopherJS 等旨在在浏览器中运行完整 Go 程序的宏大项目形成对比。它是开源项目（采用 MIT 许可证），欢迎社区反馈与贡献。"
  },
  {
    "id": "46576170",
    "title": "Live 2025 – Spine [video]",
    "url": "https://www.youtube.com/watch?v=80C-wcqs4mI",
    "summary": "This text is not a traditional article but appears to be the standard legal and informational footer from a YouTube video page, likely for a video titled \"Live 2025 – Spine.\"\n\nThe main content is a list of administrative links and corporate disclosures. It directs users to YouTube's policies on areas like copyright, privacy, terms of service, and advertising. It also provides Google LLC's corporate address and contact information for support in Korea.\n\nKey points include:\n*   The video is hosted on YouTube, a service operated by Google LLC.\n*   YouTube outlines its legal framework, including terms for creators, advertisers, and developers.\n*   It clarifies that products featured in videos are sold by third-party merchants, not YouTube, and YouTube bears no responsibility for them.\n*   The footer contains specific contact details, including a phone number and email for Korean support.\n*   The copyright notice is dated 2026, which is future-dated relative to the video's implied 2025 title.\n\nIn essence, this \"content\" is boilerplate legal text establishing YouTube's role as a platform, disclaiming liability for third-party products, and providing necessary corporate and policy information.",
    "chinese_title": "Live 2025 – 脊柱 [视频]",
    "chinese_summary": "此文本并非传统文章，而是YouTube视频页面（可能为标题“Live 2025 – Spine”的视频）的标准法律与信息页脚。\n\n主要内容为一系列管理链接和公司披露信息。它引导用户查阅YouTube在版权、隐私、服务条款和广告等方面的政策，并提供了Google LLC的公司地址及韩国支持的联系方式。\n\n要点包括：\n*   该视频由Google LLC运营的YouTube服务托管。\n*   YouTube阐明了其法律框架，包括针对创作者、广告主和开发者的条款。\n*   明确视频中展示的产品由第三方商家销售，YouTube不对此负责。\n*   页脚包含具体联系方式，包括韩国支持的电话号码和电子邮箱。\n*   版权声明日期为2026年，相对于视频标题暗示的2025年属于未来日期。\n\n本质上，此“内容”是样板法律文本，旨在确立YouTube作为平台的角色，声明对第三方产品不承担责任，并提供必要的公司及政策信息。"
  },
  {
    "id": "46630798",
    "title": "The 3D Software Rendering Technology of 1998's Thief: The Dark Project (2019)",
    "url": "https://nothings.org/gamedev/thief_rendering.html",
    "summary": "This article details the unique 3D software rendering technology developed for the 1998 game *Thief: The Dark Project*. Written by Sean Barrett, the primary author of the renderer, it explains how the engine differed from contemporaries like *Quake*.\n\nThe core innovation was a real-time portal-and-cell visibility system, inspired by academic research. The game world was divided into convex cells connected by portals. At runtime, the engine performed a traversal from the player's viewpoint, projecting portal boundaries to determine exactly which cells and objects were visible. This created tighter visibility culling than *Quake*'s precomputed method, reducing overdraw. Visible polygons were then clipped to 2D \"bounding octagons\" for further efficiency.\n\nUnlike *Quake*, which used a front-to-back span buffer, *Thief* rendered back-to-front (the painter's algorithm). To correctly sort objects and world geometry without a z-buffer, it employed a highly complex sorting system. This system used a BSP tree to order cells and intricate logic to decide when to draw objects that spanned multiple cells, ensuring they were occluded correctly by intervening walls.\n\nThe engine's efficient culling allowed for denser object placement in levels (like cluttered rooms) because objects invisible to the player could be fully rejected. The same core technology, later modified for hardware acceleration, was also used in *System Shock 2* and *Thief 2*.",
    "chinese_title": "1998年《神偷：暗黑计划》的3D软件渲染技术（2019年）",
    "chinese_summary": "本文详细介绍了为1998年游戏《神偷：暗黑计划》开发的独特3D软件渲染技术。文章由渲染器主要作者肖恩·巴雷特撰写，阐释了该引擎如何区别于《雷神之锤》等同代产品。\n\n其核心创新是受学术研究启发的实时门户单元可见性系统。游戏世界被划分为由门户连接的凸面单元，运行时引擎从玩家视角进行遍历，通过投影门户边界精确判定可见单元与物体。相比《雷神之锤》的预计算方案，这种动态剔除大幅减少了过度绘制。可见多边形随后被裁剪为二维“边界八边形”以提升效率。\n\n与采用前至后跨度缓冲的《雷神之锤》不同，《神偷》采用后至前渲染（画家算法）。为在无深度缓冲情况下正确排序物体与世界几何，引擎运用了高度复杂的排序系统：通过BSP树排列单元顺序，并采用精密逻辑处理跨单元物体的绘制时机，确保其能被中间墙体正确遮挡。\n\n高效的剔除机制使关卡（如堆满物件的房间）能布置更密集的物体——玩家不可见的物体会被完全剔除。该核心技术经硬件加速改造后，亦应用于《网络奇兵2》与《神偷2》。"
  },
  {
    "id": "46631276",
    "title": "Jiga (YC W21) Is Hiring Full Stack Engineers",
    "url": "https://jiga.io/about-us",
    "summary": "Jiga (YC W21) is hiring Full Stack Engineers to build a platform that simplifies manufacturing procurement for companies like NASA and Tesla. The company aims to replace the slow, manual process of sourcing parts with a streamlined system connecting engineers directly with vetted manufacturers, using AI to handle administrative tasks.\n\nThe role is fully remote (US or Europe) within an async-first culture that emphasizes trust and transparency. Key aspects of their work philosophy include sharing company metrics, avoiding micromanagement, maintaining a light meeting schedule, and prioritizing fast decision-making and rapid iteration. The company is cashflow positive and growing.\n\nInterested candidates should apply by sending a brief personal introduction, their LinkedIn profile, a note on what excites them about Jiga, and their favorite ice cream flavor.",
    "chinese_title": "Jiga (YC W21) 正在招聘全栈工程师",
    "chinese_summary": "Jiga（YC W21）正在招聘全栈工程师，以构建一个简化NASA和特斯拉等公司制造采购流程的平台。该公司旨在通过一个连接工程师与认证制造商的精简系统，取代缓慢、手动寻找零部件的流程，并利用人工智能处理行政任务。\n\n该职位完全远程（美国或欧洲），采用异步优先的文化，强调信任与透明度。其工作理念的核心包括分享公司数据、避免微观管理、保持轻松的会议安排，并优先考虑快速决策与迅速迭代。公司目前现金流为正且处于增长阶段。\n\n感兴趣的候选人可通过发送简短的个人介绍、领英个人主页、对Jiga感兴趣的原因说明以及最喜欢的冰淇淋口味来申请。"
  },
  {
    "id": "46633429",
    "title": "OBS Studio 32.1.0 Beta 1 available",
    "url": "https://github.com/obsproject/obs-studio/releases/tag/32.1.0-beta1",
    "summary": "OBS Studio 32.1.0 Beta 1 has been released, introducing several significant new features and improvements. Key additions include a redesigned Audio Mixer and a new Add Source dialog for an enhanced user interface. The update also brings WebRTC Simulcast support for better streaming performance and adds missing undo/redo actions for scene item properties like scale filtering and blending modes.\n\nNotable changes involve removing \"Source\" from source names, updating the Edit Transform dialog, and disabling dock animations for a smoother experience. The default video bitrate has been increased to 6000 kbps.\n\nThe release addresses various bugs, including fixes for projector resolution decimals, sync issues with preview/program sizing, and problems with NVIDIA Blur effects displaying banding. It also resolves specific issues on macOS and with PipeWire capture.\n\nChecksums for the source code and installers across Windows (x64 and arm64), macOS (Apple and Intel), and Ubuntu 24.04 are provided for verification.",
    "chinese_title": "OBS Studio 32.1.0 Beta 1 现已发布",
    "chinese_summary": "OBS Studio 32.1.0 Beta 1 版本已发布，引入了多项重要的新功能和改进。主要新增内容包括重新设计的音频混音器和全新的添加源对话框，以提升用户界面体验。此次更新还增加了 WebRTC 联播支持，以优化流媒体性能，并为场景项目属性（如缩放滤镜和混合模式）补充了缺失的撤销/重做操作。\n\n显著变化包括从源名称中移除“源”字、更新编辑变换对话框，并停靠停靠动画以获得更流畅的体验。默认视频比特率已提升至 6000 kbps。\n\n该版本修复了多个错误，包括修正投影仪分辨率小数、预览/节目尺寸同步问题，以及 NVIDIA 模糊效果显示带状条纹的问题。同时解决了 macOS 和 PipeWire 捕获中的特定问题。\n\n提供了适用于 Windows（x64 和 arm64）、macOS（Apple 和 Intel）以及 Ubuntu 24.04 的源代码和安装程序的校验和以供验证。"
  },
  {
    "id": "46569640",
    "title": "Sinclair C5",
    "url": "https://en.wikipedia.org/wiki/Sinclair_C5",
    "summary": "The Sinclair C5 was a single-person electric tricycle launched in 1985 by inventor Sir Clive Sinclair. Marketed as an affordable, eco-friendly vehicle, it was technically classified as an \"electrically assisted pedal cycle\" to avoid licensing requirements.\n\nWeighing 45kg, it had a 250W motor, a top speed of 15mph, and a claimed 20-mile range from its lead-acid battery. Its open, recumbent design left the driver exposed to weather and traffic. Priced at £399, it was met with immediate criticism over safety concerns, impracticality, and performance limitations like a short range and inability to handle steep hills.\n\nDespite Sinclair's hopes of revolutionizing transport, the C5 was a commercial disaster. Only 5,000 of the 14,000 produced were sold before the company went into receivership within months. It is remembered as one of Britain's most notorious product failures. However, it later gained a cult following among collectors and enthusiasts who modify the vehicles.",
    "chinese_title": "辛克莱C5",
    "chinese_summary": "辛克莱C5是由发明家克莱夫·辛克莱爵士于1985年推出的单人电动三轮车。它被宣传为经济实惠的环保车辆，技术上被归类为“电力辅助脚踏车”以规避牌照要求。\n\n该车重45公斤，配备250瓦电机，最高时速15英里，宣称铅酸电池可支持20英里续航。其开放式、躺椅式的设计使驾驶者暴露于天气和交通中。售价399英镑的C5一经推出便因安全隐患、不实用性以及续航短、无法应对陡坡等性能缺陷而遭受批评。\n\n尽管辛克莱希望它能革新交通方式，C5却成为一场商业灾难。生产的1.4万辆中仅售出5000辆，公司便在数月内破产接管。它被视为英国最著名的产品失败案例之一。然而，后来该车在收藏家和爱好者中获得了小众追捧，他们常对车辆进行改装。"
  },
  {
    "id": "46635550",
    "title": "GitHub Incident",
    "url": "https://www.githubstatus.com/incidents/q987xpbqjbpl",
    "summary": "**Summary of GitHub Incident Report**\n\nOn January 15, 2026, GitHub experienced a widespread service degradation incident. The initial investigation, which began at 16:56 UTC, identified problems with **API Requests, Actions, Issues, and Pull Requests**.\n\nThe incident evolved over approximately two hours. While **Actions** recovered relatively quickly (by 17:14 UTC), the core issues with **API Requests, Issues, and Pull Requests** persisted. The situation showed initial signs of recovery around 17:44 UTC, particularly for authenticated users, but unauthenticated users continued to experience issues.\n\nBy 18:36 UTC, GitHub observed recovery across all affected services. The incident was officially marked as **Resolved** at 18:54 UTC, with normal operation restored for both Issues and Pull Requests.\n\nThroughout the event, GitHub provided regular updates on their status page, noting the specific services impacted and the progression from \"degraded availability\" to \"degraded performance\" and finally to normal operation. The company concluded by stating that a detailed root cause analysis would be shared at a later date.",
    "chinese_title": "GitHub事件",
    "chinese_summary": "**GitHub 事件报告摘要**\n\n2026年1月15日，GitHub 发生了一次广泛的服务降级事件。初步调查于 UTC 时间 16:56 开始，确认了 **API 请求、Actions、Issues 和 Pull Requests** 存在问题。\n\n事件持续演变约两小时。虽然 **Actions** 恢复相对较快（UTC 时间 17:14 前），但 **API 请求、Issues 和 Pull Requests** 的核心问题仍然存在。情况在 UTC 时间 17:44 左右出现初步恢复迹象，特别是对于已认证用户，但未认证用户仍持续遇到问题。\n\n截至 UTC 时间 18:36，GitHub 观察到所有受影响的服务均已恢复。事件于 UTC 时间 18:54 正式标记为 **已解决**，Issues 和 Pull Requests 恢复正常运行。\n\n在整个事件期间，GitHub 在其状态页面提供了定期更新，说明了受影响的具体服务以及从“可用性降低”到“性能降低”最终恢复正常运行的过程。公司最后表示，详细的根本原因分析将在后续分享。"
  },
  {
    "id": "46632039",
    "title": "Programming, Evolved: Lessons and Observations",
    "url": "https://github.com/kulesh/dotfiles/blob/main/dev/dev/docs/programming-evolved.md",
    "summary": "This article, titled \"Programming, Evolved: Lessons and Observations,\" is a personal reflection on the evolution of a developer's programming philosophy and workflow. The author, Kulesh, uses his public **dotfiles repository** (a collection of configuration files for customizing a development environment) as a central case study.\n\nThe core argument is that effective programming extends beyond writing code to mastering the surrounding ecosystem. Key lessons include the importance of **automation, environment customization, and tool mastery** to reduce friction and cognitive load. The dotfiles symbolize this philosophy, representing a curated, version-controlled setup that evolves with the developer's needs.\n\nObservations highlight a shift from seeking \"perfect\" tools to building a **personalized, iterative workflow**. The article emphasizes pragmatism—using tools that work for the individual task and context—and the value of learning through continuous refinement of one's environment. Ultimately, it frames programming as a craft where productivity and satisfaction are deeply tied to the developer's tailored toolkit and habits.",
    "chinese_title": "编程的演进：经验与观察",
    "chinese_summary": "本文题为《编程的演进：经验与观察》，是一位开发者对自身编程理念与工作流演变的个人反思。作者Kulesh以其公开的**dotfiles代码库**（一套用于定制开发环境的配置文件集合）作为核心案例展开论述。\n\n文章核心观点在于：高效的编程不仅关乎代码编写，更在于对周边生态系统的掌握。关键经验包括**自动化、环境定制和工具精通**的重要性，以减少阻力与认知负荷。dotfiles正是这一理念的象征——它代表着一个持续优化、版本可控的开发环境配置，并随着开发者的需求同步演进。\n\n文中观察指出一种从追求“完美”工具到构建**个性化、可迭代工作流**的转变。作者强调实用主义——根据具体任务和场景选用合适工具，并阐述了通过持续优化个人环境来学习的价值。最终，文章将编程定义为一种技艺，其生产力与满足感深深植根于开发者量身打造的工具组合与工作习惯之中。"
  },
  {
    "id": "46584523",
    "title": "Z80 Mem­ber­ship Card",
    "url": "https://sunrise-ev.com/z80.htm",
    "summary": "The Z80 Membership Card is a retro-style microcomputer kit that fits inside an Altoids tin. Inspired by 1980s hobbyist computers like the Altair 8800, it is designed to be built and programmed by enthusiasts to learn how computers work from the ground up.\n\nThe core system is a standalone single-board computer featuring a Z80 CPU, 32K RAM, 32K EPROM, and basic I/O. It is complemented by two main expansion cards. The **Front Panel Card** adds a hex keypad, LED display, serial port, and a sophisticated monitor program for debugging. The **Z80-SIO Serial/RAM/SD-card** adds bank-switchable RAM up to 512K, a UART, and a micro SD-card interface, enabling it to run the CP/M-80 operating system.\n\nThe kits emphasize accessibility, using through-hole components and detailed documentation. The system is self-contained, requiring no PC to program or operate. A protoboard is also available for custom expansions.\n\nPricing starts at $80 for the main kit, with additional costs for expansion cards. All necessary manuals, schematics, and software files are provided for download.",
    "chinese_title": "Z80会员卡",
    "chinese_summary": "Z80会员卡是一款可放入Altoids薄荷糖盒的复古风格微型计算机套件。其设计灵感源自20世纪80年代的业余计算机（如Altair 8800），旨在让爱好者通过亲手组装和编程，从零开始理解计算机的工作原理。\n\n核心系统是一台独立的单板计算机，搭载Z80处理器、32K RAM、32K EPROM及基础I/O接口。系统配备两块主要扩展卡：**前面板扩展卡**提供十六进制键盘、LED显示屏、串行端口及用于调试的高级监控程序；**Z80-SIO串行/内存/SD卡扩展卡**支持最高512K的分区切换内存、UART接口和微型SD卡接口，使其能够运行CP/M-80操作系统。\n\n套件采用通孔元件并配备详细文档，注重易用性。该系统自成一体，无需连接电脑即可编程和运行。另提供原型板供用户实现自定义扩展。\n\n基础套件起售价80美元，扩展卡需额外购买。所有必备手册、电路图和软件文件均可下载获取。"
  },
  {
    "id": "46614015",
    "title": "Show HN: ContextFort – Visibility and controls for browser agents",
    "url": "https://contextfort.ai/",
    "summary": "**ContextFort** is a browser extension designed to give security teams visibility and control over automated browser agents (like Comet, Atlas, and Claude). It addresses security risks by monitoring and managing what these AI-powered agents do during their sessions.\n\nThe tool provides **visibility** by showing when an agent takes control, which pages it visits, and its specific actions (such as clicks and text inputs). More importantly, it offers **controls** to enforce security policies. These include blocking specific actions on certain pages (e.g., preventing a \"Submit\" click in an email client) and blocking risky cross-site navigation within a session (e.g., stopping an agent from going to an internal tool like Atlassian after visiting an external site like StackOverflow).\n\nContextFort is backed by Y Combinator and is available as a Chrome extension. For enterprise deployments requiring cloud or self-hosted management, the company offers custom solutions upon contact.",
    "chinese_title": "Show HN：ContextFort – 浏览器代理的可见性与控制工具",
    "chinese_summary": "**ContextFort**是一款浏览器扩展，旨在为安全团队提供对自动化浏览器代理（如Comet、Atlas和Claude）的可见性和控制能力。它通过监控和管理这些AI驱动代理在会话期间的行为来应对安全风险。\n\n该工具通过展示代理何时接管控制、访问哪些页面及其具体操作（如点击和文本输入）来提供**可见性**。更重要的是，它提供了**控制功能**以执行安全策略，包括阻止特定页面上的某些操作（例如在邮件客户端中阻止“提交”点击），以及阻止会话内高风险的跨站点跳转（例如防止代理在访问StackOverflow等外部网站后跳转至Atlassian等内部工具）。\n\nContextFort由Y Combinator支持，可作为Chrome扩展使用。对于需要云端或自托管管理的企业部署，该公司可根据联系提供定制解决方案。"
  },
  {
    "id": "46636044",
    "title": "A 0-click exploit chain for the Pixel 9 Part 1: Decoding Dolby",
    "url": "https://projectzero.google/2026/01/pixel-0-click-part-1.html",
    "summary": "This article introduces a 0-click exploit chain for the Google Pixel 9, focusing on a vulnerability (CVE-2025-54957) in the Dolby Unified Decoder (UDC). The bug is an integer overflow in the decoder's handling of EMDF payloads within DD+ audio files, allowing an attacker to write controlled data beyond an allocated heap buffer. This flaw is particularly dangerous because it resides in the 0-click attack surface of Android's automatic audio transcription feature in Google Messages.\n\nThe exploit leverages two capabilities of the vulnerability: a buffer overrun to corrupt memory and a controlled leak to read uninitialized data. By carefully crafting a series of audio syncframes, an attacker can partially overwrite a pointer (the \"skip pointer\") within the decoder's memory layout. This manipulation enables writing more data than normally allowed into a specific buffer (the \"dynamic buffer\"), building a primitive referred to as \"WRITE DYNAMIC.\"\n\nThis initial step achieves arbitrary code execution within the `mediacodec` sandbox. The research aims to demonstrate the exploitability of such media decoder vulnerabilities and will be detailed in a three-part series, with subsequent posts covering privilege escalation to the kernel and lessons for defense. The vulnerabilities were fixed in January 2026.",
    "chinese_title": "Pixel 9零点击漏洞利用链第一部分：解码杜比",
    "chinese_summary": "本文介绍了针对Google Pixel 9的零点击漏洞利用链，重点关注杜比统一解码器（UDC）中的一个漏洞（CVE-2025-54957）。该漏洞是解码器在处理DD+音频文件内EMDF载荷时的整数溢出问题，允许攻击者在分配的堆缓冲区之外写入受控数据。此漏洞尤其危险，因为它位于Android系统Google Messages自动音频转录功能的零点击攻击面上。\n\n该漏洞利用链发挥了该漏洞的两项能力：通过缓冲区溢出破坏内存，以及通过受控泄漏读取未初始化数据。攻击者通过精心构造一系列音频同步帧，可以部分覆盖解码器内存布局中的一个指针（即“跳过指针”）。这种操纵使得攻击者能够向特定缓冲区（“动态缓冲区”）写入超出正常限制的数据，从而构建被称为“写入动态”的原始利用能力。\n\n这一初始步骤可在`mediacodec`沙箱内实现任意代码执行。本研究旨在展示此类媒体解码器漏洞的可利用性，并将通过三篇系列文章详细阐述，后续文章将涵盖内核权限提升及防御经验教训。相关漏洞已于2026年1月修复。"
  },
  {
    "id": "46619614",
    "title": "Show HN: Sparrow-1 – Audio-native model for human-level turn-taking without ASR",
    "url": "https://www.tavus.io/post/sparrow-1-human-level-conversational-timing-in-real-time-voice",
    "summary": "**Summary of \"Show HN: Sparrow-1 – Audio-native model for human-level turn-taking without ASR\"**\n\nTavus has introduced Sparrow-1, a real-time voice AI model designed to achieve natural, human-like conversational timing. Its key innovation is that it is **audio-native**, meaning it processes raw audio waveforms directly without relying on an intermediate Automatic Speech Recognition (ASR) step to convert speech to text.\n\nThe article highlights several main advantages of this approach:\n*   **Eliminates Turn-Taking Lag:** By bypassing ASR, the model removes the inherent latency of transcription and text processing. This allows Sparrow-1 to detect subtle acoustic cues (like pauses, intonation, and breath sounds) and respond in real-time, achieving an average response latency of **320 milliseconds**.\n*   **Preserves Paraverbal Cues:** The model can interpret and utilize the rich emotional and intentional data present in tone, pitch, and rhythm of voice, which is lost in pure text-based systems.\n*   **Improved Flow and Interactivity:** The result is a more fluid, interruptible, and natural-feeling conversation, mimicking human overlapping speech and back-channeling (e.g., \"mm-hmm\").\n\nSparrow-1 is positioned as a foundational model for creating lifelike AI avatars, digital personas, and interactive voice agents. The company has released a research paper and demos, showcasing its ability to handle realistic dialogue with minimal awkward pauses. This development represents a shift towards building voice AI that prioritizes the natural flow of conversation as much as the linguistic content.",
    "chinese_title": "Show HN: Sparrow-1 – 无需语音识别的音频原生模型，实现人类级别的对话轮转",
    "chinese_summary": "**《展示 HN：Sparrow-1——无需ASR、实现人类级别对话轮换的音频原生模型》摘要**\n\nTavus 推出了 Sparrow-1，这是一个旨在实现自然、类人对话节奏的实时语音 AI 模型。其关键创新在于它是**音频原生**的，这意味着它直接处理原始音频波形，而无需依赖中间自动语音识别（ASR）步骤将语音转换为文本。\n\n文章强调了这种方法的几个主要优势：\n*   **消除对话轮换延迟：** 通过绕过 ASR，该模型消除了转录和文本处理固有的延迟。这使得 Sparrow-1 能够检测细微的声学线索（如停顿、语调和呼吸声）并实时响应，实现了平均**320毫秒**的响应延迟。\n*   **保留副语言线索：** 该模型能够解读并利用存在于语音语调、音高和节奏中的丰富情感与意图数据，而这些数据在纯文本系统中会丢失。\n*   **提升流畅度与交互性：** 其结果是对话更加流畅、可打断且感觉自然，模仿了人类的重叠讲话和反馈应声（例如\"嗯哼\"）。\n\nSparrow-1 被定位为创建逼真 AI 化身、数字形象和交互式语音代理的基础模型。该公司已发布研究论文和演示，展示了其处理逼真对话、且仅有极少尴尬停顿的能力。这一发展代表了语音 AI 构建方向的一个转变，即优先考虑对话的自然流畅性，其重视程度不亚于对语言内容本身的关注。"
  },
  {
    "id": "46628397",
    "title": "Handy – Free open source speech-to-text app",
    "url": "https://github.com/cjpais/Handy",
    "summary": "Handy is a free, open-source, and privacy-focused desktop speech-to-text application that works entirely offline. Built with Tauri (Rust and React/TypeScript), it allows users to transcribe their speech locally and paste the text into any application using a configurable keyboard shortcut.\n\nKey features include cross-platform support (Windows, macOS, Linux), offline processing using either Whisper models (with GPU acceleration) or the CPU-optimized Parakeet V3 model, and voice activity detection for efficient recording. The project emphasizes transparency, listing known issues like potential crashes with Whisper on some systems and limited Wayland support on Linux, which requires additional tools for text input.\n\nThe application is designed to be extensible and community-driven. It provides detailed instructions for manual model installation for users with network restrictions and includes a debug mode for troubleshooting. Development is active, with ongoing work on features like improved macOS shortcuts, opt-in analytics, and settings refactoring. Handy is released under the MIT license and welcomes community contributions.",
    "chinese_title": "Handy – 免费开源语音转文字应用",
    "chinese_summary": "Handy是一款免费、开源且注重隐私的桌面端语音转文字应用，完全离线运行。它基于Tauri（Rust与React/TypeScript）构建，允许用户本地转录语音，并通过可配置的键盘快捷键将文本粘贴到任何应用程序中。\n\n主要功能包括跨平台支持（Windows、macOS、Linux）、使用Whisper模型（支持GPU加速）或CPU优化的Parakeet V3模型进行离线处理，以及用于高效录音的语音活动检测。该项目强调透明度，列出了已知问题，例如在某些系统上使用Whisper可能崩溃，以及Linux对Wayland的支持有限（需额外工具辅助文本输入）。\n\n该应用设计为可扩展且由社区驱动。它为网络受限的用户提供了详细的手动模型安装指南，并包含调试模式以协助故障排除。开发活跃，正在持续改进功能，如优化macOS快捷键、可选分析功能和设置重构。Handy采用MIT许可证发布，并欢迎社区贡献。"
  }
]