[
  {
    "id": "46914785",
    "title": "The Waymo World Model: A New Frontier for Autonomous Driving Simulation",
    "url": "https://waymo.com/blog/2026/02/the-waymo-world-model-a-new-frontier-for-autonomous-driving-simulation",
    "summary": "Waymo has introduced the Waymo World Model, a new generative AI model designed to create hyper-realistic, large-scale simulations for autonomous driving. Built upon Google DeepMind's Genie 3, the model leverages vast world knowledge from video pre-training to simulate rare and complex scenarios—like extreme weather, natural disasters, and unusual objects (e.g., elephants or tornadoes)—that are difficult to capture with real-world data alone.\n\nA key advancement is its ability to generate synchronized, high-fidelity camera and lidar sensor data, providing a more complete simulation environment. The model also offers strong controllability, allowing engineers to modify simulations through language prompts, driving actions, and scene layouts to test specific \"what-if\" scenarios and counterfactuals.\n\nThis technology enhances Waymo's ability to rigorously test its autonomous Driver against long-tail safety challenges in virtual worlds before encountering them on public roads. It also enables the conversion of regular dashcam videos into multimodal simulations and supports scalable, efficient inference for longer-duration scenarios. The goal is to create a more robust safety benchmark, accelerating the safe deployment of autonomous vehicles across diverse environments.",
    "chinese_title": "Waymo世界模型：自动驾驶仿真的新前沿",
    "chinese_summary": "Waymo推出了Waymo世界模型，这是一种新型生成式AI模型，旨在为自动驾驶创建超逼真的大规模模拟。该模型基于Google DeepMind的Genie 3构建，利用视频预训练中获取的广泛世界知识，模拟罕见且复杂的场景——例如极端天气、自然灾害和异常物体（如大象或龙卷风）——这些场景仅靠真实世界数据难以捕捉。\n\n其关键进展在于能够生成同步的高保真摄像头和激光雷达传感器数据，提供更完整的模拟环境。该模型还具有强大的可控性，允许工程师通过语言提示、驾驶操作和场景布局修改模拟，以测试特定的“假设”场景和反事实情况。\n\n这项技术增强了Waymo在公共道路上遇到之前，在虚拟世界中严格测试其自动驾驶系统应对长尾安全挑战的能力。它还能将常规行车记录仪视频转换为多模态模拟，并支持对长时间场景进行可扩展的高效推理。其目标是建立更稳健的安全基准，加速自动驾驶汽车在不同环境中的安全部署。"
  },
  {
    "id": "46917033",
    "title": "Show HN: I spent 4 years building a UI design tool with only the features I use",
    "url": "https://vecti.com",
    "summary": "Vecti is a new collaborative UX/UI design tool built over four years by its founder, Serge, to address specific designer needs. It is a browser-based application that emphasizes high performance, an intuitive interface, and real-time collaboration, allowing multiple team members to edit designs simultaneously.\n\nKey features highlighted include a powerful rendering engine for pixel-perfect designs, a shared asset library, and tools for sharing and presenting work with permission controls. A reusable components feature is listed as coming soon.\n\nThe tool offers a free Starter plan with limits on projects and editors, and a paid Professional plan with unlimited projects, pay-per-editor pricing, and priority support. The company emphasizes its EU-based operations and commitment to privacy and performance.\n\nThe post includes testimonials from users and outlines the founder's mission to create a transparent, community-aligned design tool that serves creators first.",
    "chinese_title": "展示 HN：我花了四年时间打造一款只包含我常用功能的UI设计工具",
    "chinese_summary": "Vecti是一款由创始人Serge历时四年打造的全新协作式UX/UI设计工具，旨在满足设计师的特定需求。作为基于浏览器的应用程序，它强调高性能、直观界面和实时协作功能，允许多名团队成员同时编辑设计。\n\n其突出功能包括支持像素级精准设计的强大渲染引擎、共享资源库，以及具备权限控制的工作分享与演示工具。可复用组件功能即将推出。\n\n该工具提供免费入门版（限制项目数量和编辑人数）和付费专业版（无限项目、按编辑人数计费、优先技术支持）。公司强调其运营基地位于欧盟，并致力于保障用户隐私与产品性能。\n\n文末附有用户评价，并阐述了创始人打造透明、以社区为导向、优先服务创作者的使命。"
  },
  {
    "id": "46913793",
    "title": "Microsoft open-sources LiteBox, a security-focused library OS",
    "url": "https://github.com/microsoft/litebox",
    "summary": "**Summary:**\n\nMicrosoft has open-sourced **LiteBox**, a security-focused library operating system designed to reduce the attack surface of applications by drastically limiting their interface with the host system. It functions as a sandboxing layer, isolating programs from the underlying platform.\n\nThe project is currently in active development, with APIs subject to change before a stable release. Its core design enables flexible interoperability between various \"North\" (application-facing) interfaces and \"South\" (platform/host-facing) implementations. LiteBox provides a Rust-based, nix/rustix-inspired API to applications.\n\nKey use cases highlighted include:\n*   Running unmodified Linux programs on Windows.\n*   Sandboxing Linux applications on Linux itself for enhanced security.\n*   Running programs on secure hardware platforms like AMD SEV-SNP and OP-TEE.\n*   Operating on lightweight virtualization systems like LVBS.\n\nThe project is released under the MIT license, and Microsoft provides standard open-source documentation for contributing, code of conduct, security, and support. The announcement includes a standard disclaimer regarding the use of Microsoft and third-party trademarks.",
    "chinese_title": "微软开源LiteBox，一个专注于安全的库操作系统。",
    "chinese_summary": "**摘要：**\n\n微软已开源**LiteBox**，这是一个专注于安全的库操作系统，旨在通过大幅限制应用程序与宿主系统的交互界面来减少攻击面。它充当沙盒层，将程序与底层平台隔离。\n\n该项目目前处于积极开发阶段，稳定版发布前其API可能发生变更。其核心设计支持多种“北向”（面向应用程序）接口与“南向”（面向平台/宿主）实现之间的灵活互操作。LiteBox为应用程序提供了基于Rust、受nix/rustix启发的API。\n\n强调的主要应用场景包括：\n*   在Windows上运行未经修改的Linux程序。\n*   在Linux系统上对Linux应用程序进行沙盒化以增强安全性。\n*   在AMD SEV-SNP和OP-TEE等安全硬件平台上运行程序。\n*   在LVBS等轻量级虚拟化系统上运行。\n\n该项目基于MIT许可证发布，微软提供了标准的开源文档，涵盖贡献指南、行为准则、安全及支持信息。公告中包含关于使用微软及第三方商标的标准免责声明。"
  },
  {
    "id": "46914159",
    "title": "Sheldon Brown's Bicycle Technical Info",
    "url": "https://www.sheldonbrown.com/",
    "summary": "This webpage serves as the central online archive for the late Sheldon Brown's extensive writings on bicycle mechanics and cycling culture. It is a comprehensive, categorized resource covering a wide range of topics, from beginner advice and repair tips to specialized subjects like fixed-gear bikes, tandems, and technical gear systems.\n\nThe site is organized into clear sections including Brakes, Gears, Wheels, Commuting, and Humor, among others. A key feature is the detailed Bicycle Glossary, which is an authoritative reference for cycling terminology. The page also hosts personal content about Sheldon Brown himself, including his journals, photography, and family history, reflecting the site's origins as his personal project.\n\nWhile the core technical information remains highly respected and widely used, the page notes that updates are now managed by John Allen, indicating its transition to a maintained legacy site. The provided URL is intended for those wishing to link directly to this enduring repository of practical cycling knowledge.",
    "chinese_title": "谢尔顿·布朗的自行车技术信息",
    "chinese_summary": "本网页是已故谢尔顿·布朗关于自行车机械与骑行文化的著作核心在线存档。作为一个全面分类的资源库，它涵盖从新手建议、维修技巧到固定齿轮车、双人自行车及专业传动系统等广泛主题。\n\n网站设有刹车、变速、车轮、通勤骑行及幽默故事等清晰板块，其特色内容《自行车术语词典》是骑行领域的权威参考。页面还收录了谢尔顿·布朗的个人资料，包括日记、摄影作品和家族历史，体现了该网站最初作为个人项目的渊源。\n\n尽管核心技术信息仍备受推崇并被广泛使用，页面标注现由约翰·艾伦负责更新，表明其已转型为持续维护的遗产网站。所提供的网址旨在方便需要直接链接到这个持久实用骑行知识库的用户。"
  },
  {
    "id": "46870514",
    "title": "Learning from context is harder than we thought",
    "url": "https://hy.tencent.com/research/100025?langVersion=en",
    "summary": "**Summary of \"Learning from context is harder than we thought\"**\n\nThe article from Tencent HY Research challenges the optimistic assumption that large language models (LLMs) can reliably learn and apply new information presented within a single conversation or context window. The core finding is that this \"in-context learning\" is significantly less effective and more fragile than previously believed.\n\nKey points include:\n\n*   **The Illusion of Learning:** While LLMs can appear to follow new instructions or use provided data within a context, this is often superficial pattern-matching rather than genuine knowledge acquisition. The model's performance heavily depends on the precise formatting and placement of the information in the prompt.\n*   **Critical Limitations:** The research highlights specific failure modes:\n    *   **Recency Bias:** Models tend to over-rely on the most recently presented information, even if it contradicts earlier, more accurate data in the same context.\n    *   **Instruction Ignorance:** They frequently fail to follow explicit, novel instructions provided within the prompt if those instructions conflict with their pre-trained biases.\n    *   **Lack of Integration:** New \"facts\" given in-context are not robustly integrated into the model's understanding; they are easily forgotten or misapplied in subsequent reasoning steps.\n*   **Implications:** This has major consequences for applications relying on in-context learning, such as:\n    *   Providing up-to-date information via retrieval-augmented generation (RAG).\n    *   Giving complex, one-off system prompts or instructions.\n    *   Attempting to correct model errors or biases within a single session.\n\nThe conclusion is that truly updating a model's knowledge or behavior requires fine-tuning on many examples, not just presenting information in context. This underscores a fundamental limitation in current LLM architectures for dynamic, reliable learning from a single interaction.",
    "chinese_title": "从上下文学习比我们想象的要困难。",
    "chinese_summary": "**《“从上下文学习”比我们想象的更难》摘要**\n\n腾讯混元研究院的文章挑战了一个乐观假设，即大型语言模型（LLM）能够可靠地学习和应用在单次对话或上下文窗口中呈现的新信息。核心发现是，这种“上下文学习”的有效性远低于此前的认知，且更为脆弱。\n\n主要观点包括：\n\n*   **学习的假象：** 虽然LLM在上下文中看似能遵循新指令或使用提供的数据，但这往往是表面的模式匹配，而非真正的知识获取。模型的表现高度依赖于提示中信息的确切格式和位置。\n*   **关键局限：** 研究揭示了特定的失败模式：\n    *   **近因偏差：** 模型倾向于过度依赖最近呈现的信息，即使这些信息与同一上下文中更早、更准确的数据相矛盾。\n    *   **指令忽视：** 如果提示中提供的明确、新颖指令与其预训练偏见相冲突，模型常常无法遵循这些指令。\n    *   **缺乏整合：** 在上下文中给出的新“事实”并未被稳健地整合到模型的理解中；它们很容易在后续推理步骤中被遗忘或误用。\n*   **影响：** 这对依赖上下文学习的应用具有重大影响，例如：\n    *   通过检索增强生成（RAG）提供最新信息。\n    *   给出复杂的一次性系统提示或指令。\n    *   试图在单次会话中纠正模型的错误或偏见。\n\n结论是，要真正更新模型的知识或行为，需要在大量示例上进行微调，而不仅仅是在上下文中呈现信息。这凸显了当前LLM架构在从单次交互中进行动态、可靠学习方面存在根本性局限。"
  },
  {
    "id": "46871654",
    "title": "Understanding Neural Network, Visually",
    "url": "https://visualrambling.space/neural-network/",
    "summary": "This article presents an interactive visualization to explain the basic workings of neural networks in an accessible way. It begins by framing neural networks as systems inspired by biological brains, designed to process data through layers of interconnected neurons.\n\nThe core concept is illustrated using the example of recognizing handwritten digits. The process starts by converting an image into numerical pixel data (brightness values), which become the input for the first layer of neurons. Each connection between neurons has a unique \"weight.\" The input values are multiplied by these weights, summed in the receiving neuron, and then passed through an \"activation function\" (simplified here as a threshold rule) to determine if that neuron activates.\n\nActivation signifies that a neuron has recognized a specific pattern, like a line or curve. As data progresses through successive layers, each neuron with its own weights and thresholds looks for different patterns. Early layers detect simple features, and later layers combine these to recognize more complex shapes, culminating in the final output layer where activation indicates the network's prediction (e.g., which digit it sees).\n\nThe author concludes by noting that this explanation covers the forward pass of data but omits the crucial \"learning\" process—how the correct weights and thresholds are determined through training, a topic reserved for future exploration. The piece serves as a foundational, visual introduction to neural network mechanics.",
    "chinese_title": "直观理解神经网络",
    "chinese_summary": "本文通过交互式可视化，以通俗易懂的方式阐释神经网络的基本工作原理。文章开篇将神经网络描述为受生物大脑启发的系统，其通过相互连接的神经元层处理数据。\n\n核心概念以手写数字识别为例进行说明：首先将图像转换为数值化的像素数据（亮度值），作为第一层神经元的输入。神经元之间的每个连接都有独特的“权重”。输入值乘以这些权重后，在接收神经元中求和，再通过“激活函数”（此处简化为阈值规则）判断该神经元是否激活。\n\n激活意味着神经元识别出了特定模式，如线条或曲线。随着数据在连续层中传递，每个拥有独立权重和阈值的神经元会检测不同模式。浅层网络识别简单特征，深层网络则组合这些特征以识别更复杂的形状，最终在输出层通过激活状态呈现网络预测结果（例如识别出的数字）。\n\n作者最后指出，本文解释了数据的前向传播过程，但省略了关键的“学习”机制——即如何通过训练确定正确的权重与阈值，这一主题将留待后续探讨。本文旨在为神经网络机制提供基础性的可视化入门指引。"
  },
  {
    "id": "46916586",
    "title": "How to effectively write quality code with AI",
    "url": "https://heidenstedt.org/posts/2026/how-to-effectively-write-quality-code-with-ai/",
    "summary": "This article outlines a strategy for developers to effectively collaborate with AI to produce high-quality code. The core principle is that the human must remain in control, providing clear direction and oversight.\n\nKey steps include establishing a detailed vision and architecture upfront, as every undocumented decision will be made by the AI. Precise, standardized documentation of requirements, standards, and complex logic is essential for guiding the AI and team.\n\nThe author emphasizes rigorous testing to counter AI tendencies to cheat or take shortcuts. This involves writing high-level property-based tests yourself and having a separate AI generate unbiased interface tests, both protected from alteration. Code should be marked with review levels (e.g., //A for AI-generated) and security risk labels (e.g., //HIGH-RISK) to ensure critical sections receive appropriate human scrutiny.\n\nPractical advice includes using strict linting, creating context-specific agent prompts (like CLAUDE.md), and reducing unnecessary code complexity to save costs and cognitive load. Complex tasks should be broken down, and AI's speed should be leveraged for rapid prototyping, but developers must never lose oversight of the code's inner workings.",
    "chinese_title": "如何利用AI高效编写优质代码",
    "chinese_summary": "本文概述了开发者如何与人工智能有效协作以产出高质量代码的策略。其核心原则是必须确保人类始终掌握主导权，提供清晰的指导和监督。\n\n关键步骤包括预先建立详细的愿景和架构，因为每一个未明确记录的决定都将由人工智能自行做出。为引导人工智能和团队，对需求、标准和复杂逻辑进行精确、标准化的文档记录至关重要。\n\n作者强调通过严格测试来应对人工智能倾向于取巧或走捷径的问题。这包括自行编写高层次基于属性的测试，并让另一个独立的人工智能生成无偏见的接口测试，且两者都应受到保护以防止被篡改。代码应标注审查级别（例如//A表示AI生成）和安全风险标签（例如//高风险），以确保关键部分得到适当的人工审查。\n\n实用建议包括使用严格的代码检查工具、创建针对特定情境的智能体提示（如CLAUDE.md），以及减少不必要的代码复杂性以节约成本和认知负担。复杂任务应被分解，并利用人工智能的速度进行快速原型设计，但开发者绝不能失去对代码内部运作的监督。"
  },
  {
    "id": "46911901",
    "title": "I now assume that all ads on Apple news are scams",
    "url": "https://kirkville.com/i-now-assume-that-all-ads-on-apple-news-are-scams/",
    "summary": "This article criticizes Apple for allowing scam advertisements to proliferate in its Apple News app following its 2024 deal with the ad network Taboola.\n\nThe author argues that the ads, which resemble low-quality \"chumbox\" content, have become increasingly deceptive. Several recent examples are highlighted, including AI-generated \"going out of business\" sales and ads for products from newly registered domains (e.g., MUSTYLEVO.COM, SOLVERACO.COM), which are classic hallmarks of scam operations. One specific ad for \"Tidenox\" claims a 26-year business history, but its domain was registered in May 2025, and the ad image bears a hidden AI watermark.\n\nThe core accusation is that neither Apple nor Taboola appears to be exercising adequate oversight or care in vetting these advertisements. By hosting them in a supposedly premium service—where even the paid Apple News+ tier still includes ads—Apple is creating a \"honeypot for scam ads.\" The author concludes that Apple can no longer be trusted to manage advertising within its products responsibly.",
    "chinese_title": "我现在认为苹果新闻上的所有广告都是骗局。",
    "chinese_summary": "本文批评苹果公司在2024年与广告网络Taboola达成合作后，放任其Apple News应用中诈骗广告泛滥。作者指出，这些类似低质“诱饵内容”的广告日益具有欺骗性，并列举了近期多个案例：包括AI生成的“停业清仓”促销广告，以及来自新注册域名（如MUSTYLEVO.COM、SOLVERACO.COM）的产品广告——这些均是诈骗活动的典型特征。其中一则推广“Tidenox”的广告自称拥有26年经营历史，但其域名注册于2025年5月，且广告图片暗藏AI生成水印。\n\n文章核心指控在于，苹果与Taboola均未对这些广告进行充分审核与监督。苹果将这些广告置于本应优质的服务中（甚至付费版Apple News+仍包含广告），实则是打造了“诈骗广告的温床”。作者最终得出结论：苹果已无法被信任其能负责任地管理旗下产品的广告业务。"
  },
  {
    "id": "46912800",
    "title": "Hackers (1995) Animated Experience",
    "url": "https://hackers-1995.vercel.app/",
    "summary": "This article describes a fan-made animated video that reimagines the 1995 cult film *Hackers* in a stylized, motion comic format. Created by artist David Vidovic, the project condenses the movie's plot into a short, visually dynamic experience.\n\nThe summary highlights the video's key artistic approach: it uses a limited color palette (primarily green, black, and white) to evoke the aesthetic of early computer terminals and the film's iconic \"cyberspace\" visuals. The animation style is described as energetic, employing rapid cuts, digital effects, and comic book-style framing to capture the film's high-energy tone and hacking sequences.\n\nThe main purpose of the piece is presented as a nostalgic tribute. It aims to distill the core appeal of *Hackers*—its dated but charming tech, counter-culture spirit, and memorable characters like Zero Cool and Acid Burn—for both existing fans and new viewers. The article positions Vidovic's work not as a replacement, but as a creative homage that celebrates the film's unique style and enduring legacy in cyberpunk pop culture.",
    "chinese_title": "黑客（1995）动画体验",
    "chinese_summary": "本文介绍了一部粉丝制作的动画视频，它以风格化的动态漫画形式重新演绎了1995年的邪典电影《黑客》。该作品由艺术家大卫·维多维创作，将电影情节浓缩为一段简短而视觉动态的体验。\n\n概述强调了视频的核心艺术手法：采用有限的色彩（主要为绿色、黑色和白色）来唤起早期计算机终端的美学以及电影标志性的“网络空间”视觉。动画风格被描述为充满活力，运用快速剪辑、数字特效和漫画式构图，以捕捉电影的高能基调与黑客场景。\n\n作品的主要目的被呈现为一种怀旧致敬。它旨在为既有影迷和新观众提炼《黑客》的核心魅力——包括其过时却迷人的技术、反文化精神以及如零度酷客和酸蚀等令人难忘的角色。文章将维多维的作品定位为并非替代，而是一种创造性的致敬，颂扬了这部电影在赛博朋克流行文化中独特的风格与持久的影响。"
  },
  {
    "id": "46860623",
    "title": "The Monad Called Free",
    "url": "http://blog.sigfpe.com/2014/04/the-monad-called-free.html",
    "summary": "This article explores the concept of the **Free** monad as a \"higher-order monad\" within the category of endofunctors (Endo), rather than the standard category of types (Hask). The author draws a parallel between lists in Hask and free monads in Endo, showing that free monads act like \"lists of functors.\"\n\nKey points include:\n*   **HFunctor and HMonad:** The article defines type classes for functors (`HFunctor`) and monads (`HMonad`) in the Endo category, where morphisms are natural transformations.\n*   **Free as a List Analogy:** Just as a list can be `Nil` or `Cons a (List a)`, the free monad `Free f a` is `Pure a` or `Free (f (Free f a))`. This makes `Free` the \"free monoid\" in Endo.\n*   **Generalizing Operations:** List operations like `singleton` and `foldMap` have direct analogues for free monads (`hsingleton`, `hFoldMap`), which are used for building and interpreting abstract syntax trees.\n*   **Implementation:** The core of the article provides Haskell code showing `Free` as an instance of `HFunctor` and `HMonad`, with `hreturn` and `hbind` mirroring `return` and `>>=` for lists.\n\nIn essence, the article reframes free monads through a categorical lens, highlighting their structural similarity to lists and explaining how this perspective clarifies their role in modeling and interpreting effectful computations.",
    "chinese_title": "被称作自由的单子",
    "chinese_summary": "本文探讨了**自由**单子作为自函子范畴（Endo）中的“高阶单子”概念，而非标准类型范畴（Hask）。作者通过类比Hask中的列表与Endo中的自由单子，揭示了自由单子如同“函子列表”的特性。\n\n核心要点包括：\n*   **HFunctor与HMonad**：文章定义了Endo范畴中的函子（`HFunctor`）和单子（`HMonad`）类型类，其中态射为自然变换。\n*   **自由单子的列表类比**：正如列表可以是`Nil`或`Cons a (List a)`，自由单子`Free f a`表现为`Pure a`或`Free (f (Free f a))`，这使得`Free`成为Endo范畴中的“自由幺半群”。\n*   **操作的泛化**：列表操作如`singleton`和`foldMap`在自由单子中有直接对应（`hsingleton`、`hFoldMap`），常用于构建和解释抽象语法树。\n*   **实现**：文章核心提供了Haskell代码，展示`Free`作为`HFunctor`和`HMonad`的实例，其中`hreturn`和`hbind`分别对应列表的`return`和`>>=`操作。\n\n本质上，文章通过范畴论视角重构自由单子，强调其与列表的结构相似性，并阐释这一视角如何澄清其在建模和解释带副作用计算中的作用。"
  },
  {
    "id": "46903558",
    "title": "My AI Adoption Journey",
    "url": "https://mitchellh.com/writing/my-ai-adoption-journey",
    "summary": "In this article, Mitchell Hashimoto details his measured, six-step journey to productively integrating AI agents into his software development workflow.\n\nHe began by moving beyond inefficient chatbot interfaces to using \"agents\" (LLMs that can execute commands). Initially unimpressed, he forced himself to reproduce his own manual work with agents to learn their capabilities and limitations. This taught him to break tasks down and provide agents with ways to verify their own work.\n\nSeeking efficiency, he started using \"end-of-day agents\" for research and triage, creating a \"warm start\" for the next day. As his confidence grew, he outsourced predictable \"slam dunk\" tasks to agents, allowing him to focus on more engaging work while avoiding disruptive notifications.\n\nHis current focus is \"harness engineering\": systematically improving agent performance by creating better prompts (like an `AGENTS.md` file) and building verification tools to prevent repeated mistakes. His ongoing goal is to \"always have an agent running\" on useful background tasks, balancing deep manual work with AI assistance.\n\nOverall, Hashimoto presents a pragmatic, skill-based adoption path, emphasizing that understanding what agents are *not* good at is as crucial as leveraging what they are.",
    "chinese_title": "我的AI应用之旅",
    "chinese_summary": "在这篇文章中，米切尔·哈希莫尼详细阐述了他将AI智能体有效融入软件开发工作流程的审慎六步历程。\n\n他从低效的聊天机器人界面转向使用“智能体”（可执行命令的大语言模型）。起初并不看好，但他强迫自己用智能体重现手动工作，以了解其能力与局限。这让他学会拆解任务，并为智能体提供自我验证的方法。\n\n为提高效率，他开始使用“日终智能体”进行研究与问题分类，为次日创造“预热启动”。随着信心增长，他将可预测的“稳操胜券”任务外包给智能体，使自己能专注于更有挑战性的工作，同时避免干扰性通知。\n\n他目前的重点是“驾驭工程”：通过创建更优提示（如`AGENTS.md`文件）和构建验证工具来系统化提升智能体表现，防止重复错误。他的持续目标是让智能体始终在有用的后台任务上运行，在深度手动工作与AI辅助间取得平衡。\n\n总体而言，哈希莫尼提出了一条务实、基于技能的采纳路径，强调理解智能体的短板与善用其优势同等重要。"
  },
  {
    "id": "46910963",
    "title": "A new bill in New York would require disclaimers on AI-generated news content",
    "url": "https://www.niemanlab.org/2026/02/a-new-bill-in-new-york-would-require-disclaimers-on-ai-generated-news-content/",
    "summary": "A new bill introduced in the New York state legislature, called the NY FAIR News Act, would mandate significant regulations for news organizations using AI-generated content. The bill, sponsored by Senator Patricia Fahy and Assemblymember Nily Rozic, aims to preserve journalism integrity and protect workers.\n\nKey provisions of the bill include:\n*   **Mandatory Disclaimers:** News outlets must label any published content \"substantially\" created by generative AI, though copyrightable material with \"human authorship\" may be exempt.\n*   **Human Review:** All AI-generated content, including text, audio, and images, must be reviewed by a human editor before publication.\n*   **Internal Transparency:** Newsrooms must disclose to their staff how and when AI is being used.\n*   **Source Protection:** Organizations must create safeguards to prevent AI technologies from accessing confidential source information.\n*   **Labor Protections:** The bill restricts firing journalists or reducing their pay and benefits due to AI adoption.\n\nLawmakers cite concerns over potentially false or misleading AI content and plagiarism of original sources as motivations. The bill has received endorsements from major media unions, including the NewsGuild of New York, which has been advocating for stronger AI guardrails in newsrooms.",
    "chinese_title": "纽约一项新法案要求对人工智能生成的新闻内容进行标注。",
    "chinese_summary": "纽约州立法机构提出的一项名为《纽约公平新闻法案》的新法案，将对使用人工智能生成内容的新闻机构实施严格监管。该法案由州参议员帕特里夏·法希和州众议员尼利·罗齐克共同发起，旨在维护新闻业的完整性并保护从业人员。\n\n法案的核心条款包括：\n*   **强制免责声明：** 新闻机构必须对\"实质性\"由生成式人工智能创建的内容进行标注，但具有\"人类作者身份\"的可受版权保护材料可能豁免。\n*   **人工审核：** 所有人工智能生成的内容（包括文本、音频和图像）在发布前必须经过人工编辑审核。\n*   **内部透明度：** 新闻编辑部必须向员工披露人工智能的使用方式和时间。\n*   **信源保护：** 机构必须建立防护措施，防止人工智能技术获取机密信源信息。\n*   **劳工保护：** 法案禁止因采用人工智能而解雇记者或削减其薪酬福利。\n\n立法者指出，推动该法案的动机是对人工智能内容可能虚假、误导及抄袭原创来源的担忧。该法案已获得纽约新闻工会等主要媒体工会的支持，这些工会一直倡导在新闻编辑部建立更强有力的人工智能监管措施。"
  },
  {
    "id": "46911170",
    "title": "Invention of DNA \"Page Numbers\" Opens Up Possibilities for the Bioeconomy",
    "url": "https://www.caltech.edu/about/news/invention-dna-page-numbers-synthesis-kaihang-wang",
    "summary": "Researchers at Caltech have developed a new method, called Sidewinder, that overcomes a major bottleneck in synthetic biology: constructing long, accurate DNA sequences from scratch.\n\nPreviously, chemical synthesis could only produce short DNA fragments (oligonucleotides). Assembling these into longer, gene- or genome-scale sequences was error-prone and inefficient. Sidewinder solves this by attaching unique, removable DNA tags—analogous to \"page numbers\"—to each short fragment. These tags guide the precise, ordered assembly of the fragments into a complete, uninterrupted DNA double helix with extremely high accuracy (a misconnection rate of one in one million).\n\nThis breakthrough enables researchers to rapidly and cheaply build any designed DNA sequence, translating computational blueprints from AI into physical reality. This capability is critical for advancing applications across the bioeconomy, including the development of novel therapeutics, sustainable materials, and agricultural products.\n\nThe technology, invented in the lab of Professor Kaihang Wang and detailed in *Nature*, separates the assembly instructions from the functional genetic code. After assembly, the guide tags are cleanly removed. Experts note that Sidewinder bridges a key gap between AI-driven biological design and physical construction, potentially enabling an alternative path to creating new biological functions beyond natural evolution.",
    "chinese_title": "DNA“页码”的发明为生物经济开辟新可能",
    "chinese_summary": "加州理工学院的研究人员开发出一种名为“侧风”的新方法，攻克了合成生物学领域的一个主要瓶颈：从头构建长而精确的DNA序列。\n\n此前，化学合成仅能生产短链DNA片段（寡核苷酸）。将这些片段组装成更长的基因或基因组规模的序列不仅容易出错，而且效率低下。“侧风”技术通过为每个短片段附加独特的、可移除的DNA标签（类似于“页码”）解决了这一难题。这些标签引导片段以极高精度（错误连接率仅为百万分之一）精确有序地组装成完整、无间断的DNA双螺旋结构。\n\n这一突破使研究人员能够快速、低成本地构建任何设计好的DNA序列，将人工智能计算蓝图转化为物理现实。该能力对推动生物经济领域的应用至关重要，包括开发新型疗法、可持续材料和农产品。\n\n这项由王凯航教授实验室发明并在《自然》杂志详述的技术，将组装指令与功能性遗传密码分离。组装完成后，引导标签会被完全清除。专家指出，“侧风”技术弥合了人工智能驱动的生物设计与物理构建之间的关键鸿沟，有望开辟一条超越自然演化、创造新生物功能的替代路径。"
  },
  {
    "id": "46909468",
    "title": "Things Unix can do atomically (2010)",
    "url": "https://rcrowley.org/2010/01/06/things-unix-can-do-atomically.html",
    "summary": "This 2010 article catalogs atomic operations in Unix-like systems that can be used as building blocks for thread-safe and multi-process programs without traditional locks. The author advocates leveraging the kernel for synchronization where possible, noting these techniques are most reliable on local filesystems, not network mounts like NFS.\n\nThe operations are grouped into three categories:\n\n1.  **Operating on a Pathname:** These use filesystem calls that fail if a target exists, enabling simple locks. Key examples include:\n    *   `link()` and `symlink()` to create a hard or symbolic link, failing if the new path exists.\n    *   `rename()` to atomically replace a path.\n    *   `open()` with the `O_CREAT | O_EXCL` flags to create a file exclusively.\n    *   `mkdir()`, which fails if the directory already exists.\n\n2.  **Operating on a File Descriptor:** These allow coordination over open files.\n    *   `fcntl()` with `F_SETLK`/`F_SETLKW` for advisory file region locking.\n    *   `fcntl()` with `F_SETLEASE` to get signals when a file is opened/truncated by another process.\n    *   `mmap()` with `MAP_SHARED` for inter-process memory sharing via a file.\n\n3.  **Operating on Virtual Memory:** The article mentions GCC's `__sync_*` atomic builtins (e.g., `__sync_fetch_and_add`) as the foundation for lock-free algorithms, providing full memory barriers.\n\nThe article is presented as a living document, inviting corrections and additions from readers.",
    "chinese_title": "Unix能原子化完成的操作（2010）",
    "chinese_summary": "这篇2010年的文章系统梳理了类Unix系统中的原子操作，这些操作可作为构建线程安全与多进程程序的基石，无需依赖传统锁机制。作者主张尽可能利用内核进行同步，并指出这些技术在本地文件系统上最为可靠，不适用于NFS等网络挂载场景。\n\n操作分为三类：\n\n1.  **基于路径名的操作**：利用文件系统调用在目标已存在时失败的特性实现简易锁。核心示例包括：\n    *   `link()`和`symlink()`创建硬链接或符号链接，若路径已存在则操作失败。\n    *   `rename()`原子性地替换路径。\n    *   使用`O_CREAT | O_EXCL`标志的`open()`独占创建文件。\n    *   `mkdir()`在目录已存在时失败。\n\n2.  **基于文件描述符的操作**：支持通过已打开文件进行协调。\n    *   使用`F_SETLK`/`F_SETLKW`的`fcntl()`实现咨询式文件区域锁定。\n    *   使用`F_SETLEASE`的`fcntl()`在文件被其他进程打开/截断时接收信号。\n    *   使用`MAP_SHARED`的`mmap()`通过文件实现进程间内存共享。\n\n3.  **基于虚拟内存的操作**：文章提及GCC的`__sync_*`原子内置函数（如`__sync_fetch_and_add`）作为无锁算法的基础，提供完整内存屏障。\n\n本文作为动态文档呈现，欢迎读者修正与补充。"
  },
  {
    "id": "46911869",
    "title": "TikTok's 'Addictive Design' Found to Be Illegal in Europe",
    "url": "https://www.nytimes.com/2026/02/06/business/tiktok-addictive-design-europe.html",
    "summary": "**Summary of \"TikTok's 'Addictive Design' Found to Be Illegal in Europe\"**\n\nA major European Union regulatory body has ruled that key design features of TikTok are illegal under the bloc's new digital regulations. The investigation, led by the European Commission, focused on the platform's \"addictive design\" and its impact on minors.\n\nThe core finding is that TikTok's \"addictive loops\"—specifically its algorithmically curated \"For You\" feed and its \"reward features\" like streaks and infinite scrolling—violate the Digital Services Act (DSA). The regulators determined these features exploit the psychological vulnerabilities of children, leading to compulsive use and potentially harming their mental well-being.\n\nA central issue was TikTok's use of \"rabbit hole\" effects, where the algorithm pushes increasingly extreme or narrow content to keep users engaged. The investigation also found that TikTok's age-verification methods were insufficient to protect minors from these harmful design practices.\n\nThis ruling represents the first major enforcement of the DSA's strict rules protecting children online. As a result, TikTok is now legally obligated to make significant changes to its platform for users in the European Union. The company must present a plan to bring its services into compliance, which could involve redesigning core features like its feed and notification systems. Failure to comply could result in fines of up to 6% of its global annual revenue.\n\nThe decision sets a powerful precedent, signaling that other major social media platforms could face similar scrutiny over their engagement-driven design choices in the EU market.",
    "chinese_title": "TikTok的“成瘾性设计”在欧洲被裁定违法。",
    "chinese_summary": "**欧盟裁定TikTok“成瘾性设计”违法**\n\n欧盟主要监管机构裁定，TikTok的关键设计功能违反了欧盟新数字法规。由欧盟委员会主导的调查重点关注该平台的“成瘾性设计”及其对未成年人的影响。\n\n核心结论是，TikTok的“成瘾循环”——特别是其算法驱动的“推荐”信息流以及连续使用奖励、无限滚动等“激励功能”——违反了《数字服务法案》。监管机构认定这些功能利用了儿童的心理弱点，导致强迫性使用并可能损害其心理健康。\n\n一个关键问题是TikTok利用“信息茧房”效应，即算法推送日益极端或狭隘的内容以维持用户参与度。调查还发现，TikTok的年龄验证措施不足以保护未成年人免受此类有害设计的影响。\n\n此次裁决标志着《数字服务法案》保护儿童网络安全的严格规定首次得到重大执行。因此，TikTok现在有法律义务对其在欧盟的平台进行重大调整。该公司必须提交合规方案，其中可能涉及重新设计信息流和通知系统等核心功能。若未能遵守，可能面临高达其全球年收入6%的罚款。\n\n该决定开创了重要先例，表明其他主要社交媒体平台在欧盟市场也可能因其以用户参与为导向的设计选择面临类似审查。"
  },
  {
    "id": "46868803",
    "title": "DNS Explained – How Domain Names Get Resolved",
    "url": "https://www.bhusalmanish.com.np/blog/posts/dns-explained.html",
    "summary": "This article explains the Domain Name System (DNS) by detailing the author's personal experience with a frustrating server migration. The core function of DNS is translating human-readable domain names (like example.com) into machine-readable IP addresses.\n\nThe system operates on a hierarchical chain of referrals: a query starts at the **Root** servers, which direct it to the correct **Top-Level Domain** (TLD) server (like .com), which then points to the domain's **Authoritative Nameserver** that holds the actual DNS records.\n\nKey **DNS record types** include:\n*   **A/AAAA:** Map a domain to an IPv4/IPv6 address.\n*   **CNAME:** Creates an alias from one domain to another.\n*   **MX:** Directs email for the domain.\n*   **TXT:** Used for domain verification and email security (SPF, DKIM).\n\nA critical concept is **TTL (Time to Live)**, which specifies how long DNS answers can be cached. A high TTL improves performance but slows down updates, which was the source of the author's initial problem.\n\nThe resolution process involves checking local caches (browser, OS) before a **Recursive Resolver** (like 1.1.1.1 or 8.8.8.8) performs the full lookup chain. The author concludes by noting DNS's importance in system design for load balancing, failover, and geographic routing.",
    "chinese_title": "DNS解析详解——域名如何被解析",
    "chinese_summary": "本文通过作者在服务器迁移中遭遇挫折的个人经历，详细解释了域名系统（DNS）。DNS的核心功能是将人类可读的域名（如example.com）转换为机器可读的IP地址。\n\n该系统运行在一个分层引荐链上：查询从**根**服务器开始，根服务器将其指向正确的**顶级域名**（TLD）服务器（如.com），然后该服务器再指向持有实际DNS记录的域名**权威名称服务器**。\n\n关键的**DNS记录类型**包括：\n*   **A/AAAA记录：** 将域名映射到IPv4/IPv6地址。\n*   **CNAME记录：** 创建一个域名到另一个域名的别名。\n*   **MX记录：** 引导该域名的电子邮件。\n*   **TXT记录：** 用于域名验证和电子邮件安全（SPF、DKIM）。\n\n一个关键概念是**TTL（生存时间）**，它指定了DNS答案可以被缓存的时间。高TTL可以提高性能，但会减慢更新速度，这正是作者最初问题的根源。\n\n解析过程涉及在**递归解析器**（如1.1.1.1或8.8.8.8）执行完整查找链之前，先检查本地缓存（浏览器、操作系统）。作者最后指出DNS在系统设计中对于负载均衡、故障转移和地理路由的重要性。"
  },
  {
    "id": "46868142",
    "title": "The overlooked evolution of the humble car door handle",
    "url": "https://newatlas.com/automotive/evolution-car-door-handle/",
    "summary": "This article traces the evolution of the car door handle, highlighting how its core function has remained consistent while its form and integration have advanced significantly.\n\nInitially, handles were simple, direct latches similar to those on houses. A key shift occurred in the 1950s when handles were decoupled from the latch mechanism, using rods or cables instead. This allowed for greater design variety, leading to popular styles like the push-button (seen on classics and modern Mercedes) and the enduring pull-out handle.\n\nModern innovation focuses on aerodynamics and electronics. Flush handles, which sit flush with the body, reduce drag and come in two types: motorized versions that extend and spring-loaded ones that pop out if power fails. While electronic latches are common, they universally retain a physical cable backup for safety.\n\nSafety has also driven evolution. The separation of handle and latch allowed engineers to strategically place the latch and striker at the door's strongest point to keep it closed during crashes, a critical factor in safety ratings.\n\nUltimately, the door handle represents a blend of enduring mechanical principles and modern innovation. Despite new unlocking methods like keyless fobs, the final act of opening the door still relies on a mechanism whose basic concept has proven reliable for decades.",
    "chinese_title": "被忽视的普通车门把手的演变",
    "chinese_summary": "本文追溯了汽车门把手的发展历程，重点阐述了其核心功能如何保持稳定，而形态与集成方式却取得了显著进步。\n\n最初的门把手是类似房屋门锁的简单直接插销。1950年代发生关键变革：门把手与锁栓机构分离，改用连杆或拉索连接。这一变化催生了多样化的设计，例如经典车型与现代奔驰采用的按压式按钮，以及经久不衰的拉出式把手。\n\n现代创新聚焦于空气动力学与电子化。与车身齐平的隐藏式把手能降低风阻，主要分为两类：电动伸缩式与断电时可弹开的弹簧机械式。虽然电子锁栓已很普遍，但为保障安全，所有车型仍保留物理拉索作为备用方案。\n\n安全需求也推动了技术演进。把手与锁栓的分离使工程师能将锁扣装置精准安装在车门最坚固的位置，确保碰撞时车门紧闭，这已成为安全评级的关键因素。\n\n归根结底，车门把手体现了经典机械原理与现代创新的融合。尽管无钥匙进入等新型解锁方式层出不穷，但最终开启车门的动作，依然依赖于那个历经数十年验证、基础概念始终可靠的机械结构。"
  },
  {
    "id": "46909439",
    "title": "Systems Thinking",
    "url": "http://theprogrammersparadox.blogspot.com/2026/02/systems-thinking.html",
    "summary": "This article contrasts two approaches to building complex software systems: evolutionary development and big up-front design. The evolutionary approach starts small and adds complexity over time, which is faster initially and more dynamic but risks creating a chaotic, fragile \"house of cards\" as dependencies are ignored. The big-design approach involves specifying everything in advance, which is slower to start but leads to a more coherent, reliable, and maintainable system by properly addressing dependencies from the outset.\n\nThe core issue is managing dependencies. Ignoring them for speed leads to expensive fixes and spiraling complexity later. However, big designs are hindered by a lack of long-term developer experience, rapidly changing technologies, and the perceived friction of required coordination.\n\nThe author argues that while evolutionary projects are more fun initially, they often lead to stress and failure as they grow. Big designs, though slower, provide a smoother, less stressful process with better long-term outcomes, especially for replacing existing business systems where requirements are well-understood.\n\nThe conclusion is that a balanced path is needed, combining elements of both: perhaps evolving releases while guided by a long-term architectural plan, with the flexibility to refactor and the discipline to regularly clean up technical debt. The ideal approach depends on the system's parts, with some requiring rigorous engineering and others being suitable for evolution.",
    "chinese_title": "系统思维",
    "chinese_summary": "本文对比了构建复杂软件系统的两种方法：演进式开发与大设计先行。演进式方法从小处着手，随时间逐步增加复杂度，初期速度更快且更灵活，但若忽略依赖关系，则可能形成混乱脆弱的“纸牌屋”。大设计方法则预先规划一切，起步虽慢，却能通过从一开始妥善处理依赖关系，构建出更连贯、可靠且可维护的系统。\n\n核心问题在于管理依赖关系。为求速度而忽视依赖，将导致后期修复成本高昂且复杂度螺旋上升。然而，大设计方法也面临挑战：缺乏长期开发者经验、技术快速迭代，以及所需协调工作带来的阻力。\n\n作者认为，演进式项目初期虽更有趣，但随着规模扩大，常导致压力与失败。大设计方法虽起步较慢，却能提供更平稳、压力更小的开发过程，并带来更好的长期结果，尤其适用于需求明确、需替换现有业务系统的场景。\n\n结论是，需要找到平衡之道，融合两种方法的优点：或许可以在长期架构规划的指导下进行迭代发布，既保持重构的灵活性，又坚持定期清理技术债务的纪律。理想方法取决于系统的不同部分——有些需要严格工程化，有些则适合演进式发展。"
  },
  {
    "id": "46903616",
    "title": "We tasked Opus 4.6 using agent teams to build a C Compiler",
    "url": "https://www.anthropic.com/engineering/building-c-compiler",
    "summary": "In a stress test of autonomous AI development, researcher Nicholas Carlini used 16 parallel Claude Opus 4.6 agents to build a C compiler from scratch. Over two weeks and nearly 2,000 sessions, the agent team produced a 100,000-line Rust-based compiler without internet access.\n\nThe system used a simple harness to keep agents running in a continuous loop, coordinating via a git-based locking mechanism to work on different tasks. Key lessons included the necessity of extremely high-quality tests to guide the agents, designing feedback for the AI's limitations (like time blindness), and enabling parallelism by using tools like GCC as an oracle for comparison.\n\nThe resulting compiler can build Linux 6.9 for x86, ARM, and RISC-V, along with other major projects like SQLite and Redis, and even run Doom. However, it has limitations: it relies on GCC for some 16-bit x86 code and for assembling/linking, its output is less efficient than GCC's, and adding new features often broke existing functionality.\n\nThe project demonstrates the potential of autonomous agent teams to tackle complex software engineering tasks but also highlights significant risks, such as deploying unverified code, underscoring the need for new safety strategies as AI capabilities advance rapidly.",
    "chinese_title": "我们指派Opus 4.6使用智能体团队构建一个C编译器。",
    "chinese_summary": "在一项自主AI开发的压力测试中，研究员尼古拉斯·卡里尼使用16个并行的Claude Opus 4.6智能体，从零开始构建了一个C语言编译器。经过两周近2000次会话，这个智能体团队在没有网络连接的情况下，开发出了一个基于Rust语言、包含10万行代码的编译器。\n\n该系统采用简单的控制框架使智能体持续循环运行，并通过基于git的锁定机制协调不同任务。关键经验包括：需要极高质量的测试来引导智能体，针对AI的局限性（如时间感知缺失）设计反馈机制，以及通过使用GCC等工具作为参照标准来实现并行开发。\n\n最终生成的编译器能够为x86、ARM和RISC-V架构编译Linux 6.9内核，还能编译SQLite、Redis等大型项目，甚至能运行《毁灭战士》游戏。但它也存在局限：部分16位x86代码仍需依赖GCC进行汇编和链接，其生成代码的效率低于GCC，且添加新功能时常会破坏现有功能。\n\n该项目展示了自主智能体团队处理复杂软件工程任务的潜力，同时也凸显了重大风险——例如部署未经验证的代码，这警示着随着AI能力飞速发展，亟需制定新的安全策略。"
  },
  {
    "id": "46916609",
    "title": "Show HN: If you lose your memory, how to regain access to your computer?",
    "url": "https://eljojo.github.io/rememory/",
    "summary": "**ReMemory** is a browser-based, open-source tool that uses Shamir's Secret Sharing to split a file's encryption key among trusted friends, ensuring no single person can access the data alone.\n\n**How it works:**  \n1. You encrypt a file, and the tool splits the decryption key into multiple shares (e.g., 5 shares).  \n2. You distribute these shares to friends. A predefined number of them (e.g., any 3 out of 5) must combine their shares to recover the key and decrypt the file.  \n\n**Key features:**  \n- **Offline and self-contained:** Each friend receives a bundle containing `recover.html`, which works entirely in their browser without internet or servers.  \n- **No data storage:** The tool doesn’t store files or keys; everything remains local.  \n- **Uses age encryption:** A modern, well-regarded encryption tool.  \n- **Transparent:** The code is open source, includes a self-audit document, and users can test with demo bundles before real use.  \n\n**Purpose:**  \nBuilt to provide a secure, decentralized way for trusted contacts to access important files (e.g., in case of incapacitation), without relying on a single service or person. It is not a backup solution or a cloud service.",
    "chinese_title": "Show HN：若失忆，如何重新访问你的电脑？",
    "chinese_summary": "**ReMemory** 是一款基于浏览器的开源工具，它利用 Shamir 秘密共享方案将文件的加密密钥拆分给可信的朋友，确保没有任何一个人能单独访问数据。\n\n**工作原理：**  \n1. 您加密一个文件，该工具将解密密钥拆分为多份（例如 5 份）。  \n2. 您将这些份额分发给朋友。必须有一定数量的人（例如 5 份中的任意 3 份）合并他们的份额才能恢复密钥并解密文件。\n\n**主要特点：**  \n- **离线且自包含：** 每位朋友会收到一个包含 `recover.html` 的包，该文件完全在浏览器中运行，无需互联网或服务器。  \n- **不存储数据：** 工具不存储文件或密钥；所有内容都保留在本地。  \n- **使用 age 加密：** 一种现代且备受推崇的加密工具。  \n- **透明：** 代码开源，包含自审计文档，用户可在实际使用前通过演示包进行测试。\n\n**目的：**  \n旨在为可信联系人提供一种安全、去中心化的方式来访问重要文件（例如在失能情况下），而不依赖于单一服务或个人。它并非备份解决方案或云服务。"
  },
  {
    "id": "46867446",
    "title": "Stay Away from My Trash",
    "url": "https://tldraw.dev/blog/stay-away-from-my-trash",
    "summary": "In this article, tldraw founder Steve Ruiz explains the project's decision to temporarily stop accepting external code contributions. The primary reason is an influx of low-quality pull requests generated by AI coding assistants.\n\nRuiz clarifies that the issue is not AI-generated code itself—his team uses these tools productively—but the devaluation of external contributions. When AI can easily produce formally correct code, the hard part becomes the context, design thinking, and sustained care required to solve the right problems. He illustrates this with a past example of contributing to Excalidraw, where the real work was research and design alignment, not the final implementation.\n\nThe problem worsened when his own AI script for logging bugs began generating poorly-specified issues. External contributors, also using AI, would then generate \"solutions\" to these non-existent problems, creating a cycle of well-formed but meaningless work.\n\nRuiz concludes that if bad contributions are now indistinguishable from good ones, their net value is less than zero. Therefore, it's better to limit community involvement to areas that still matter: bug reporting, discussion, and feedback, while the core team handles the code. He calls for better platform tools to manage contributions in this new AI-driven landscape.",
    "chinese_title": "离我的垃圾远点",
    "chinese_summary": "在这篇文章中，tldraw创始人Steve Ruiz解释了该项目决定暂时停止接受外部代码贡献的原因。主要原因是AI编程助手产生了大量低质量的拉取请求。\n\nRuiz澄清，问题不在于AI生成的代码本身——他的团队也在高效使用这些工具——而在于外部贡献的价值被稀释。当AI能轻易生成形式正确的代码时，真正的难点就变成了解决问题所需的情境理解、设计思维和持续投入。他以自己过去为Excalidraw贡献代码的经历为例，指出真正的工作在于研究探索和设计对齐，而非最终实现。\n\n当他自己用于记录错误的AI脚本开始生成描述模糊的问题报告时，情况变得更糟。同样使用AI的外部贡献者会针对这些不存在的问题生成“解决方案”，从而形成了形式规范但毫无意义的工作循环。\n\nRuiz总结道，如果低质量贡献已无法与高质量贡献区分，它们的净价值实际为负。因此，最好将社区参与限制在仍有价值的领域：错误报告、讨论和反馈，而由核心团队负责代码开发。他呼吁平台开发更好的工具，以应对这个AI驱动的新生态中的贡献管理挑战。"
  },
  {
    "id": "46902223",
    "title": "Claude Opus 4.6",
    "url": "https://www.anthropic.com/news/claude-opus-4-6",
    "summary": "Anthropic has launched Claude Opus 4.6, a significant upgrade to its most advanced AI model. The new version excels at complex, multi-step tasks like coding, financial analysis, and research, with major improvements in planning, debugging, and navigating large codebases. It is the first Opus-class model to feature a 1-million-token context window in beta, dramatically improving its ability to find and reason over information in long documents.\n\nBenchmarks show Opus 4.6 achieves state-of-the-art performance, outperforming competitors like OpenAI's GPT-5.2 on evaluations of economically valuable knowledge work. It also leads in agentic coding and deep web search. Despite these intelligence gains, Anthropic reports the model maintains or improves upon the strong safety and alignment of its predecessor.\n\nKey product updates include new API controls for developers, such as adjustable \"effort\" levels and \"adaptive thinking,\" which lets the model decide when to engage in deeper reasoning. A \"context compaction\" feature helps manage long-running tasks. The model is available now on claude.ai, the API, and major cloud platforms, with pricing unchanged.",
    "chinese_title": "Claude Opus 4.6",
    "chinese_summary": "Anthropic发布了Claude Opus 4.6，这是其最先进AI模型的一次重大升级。新版本在编码、金融分析和研究等复杂多步骤任务上表现卓越，在规划、调试和大型代码库导航方面有显著改进。这是首个在测试阶段具备100万token上下文窗口的Opus级模型，极大提升了其在长文档中查找信息并进行推理的能力。\n\n基准测试显示，Opus 4.6实现了最先进的性能，在经济价值知识工作的评估中超越了OpenAI的GPT-5.2等竞争对手。它在自主编码和深度网络搜索方面也处于领先地位。尽管智能水平大幅提升，Anthropic报告称该模型保持甚至超越了前代产品的强大安全性和对齐性。\n\n关键产品更新包括面向开发者的新API控制功能，如可调节的“努力程度”和“自适应思考”——后者允许模型自主决定何时进行深度推理。“上下文压缩”功能则有助于管理长期运行的任务。该模型现已在claude.ai、API及主要云平台上线，定价保持不变。"
  },
  {
    "id": "46890335",
    "title": "Recreating Epstein PDFs from raw encoded attachments",
    "url": "https://neosmart.net/blog/recreating-epstein-pdfs-from-raw-encoded-attachments/",
    "summary": "This article details an attempt to reconstruct a censored PDF file from the Epstein document release. The author discovered that a key email attachment was included in the public archive as a raw, uncensored base64-encoded text block spanning 76 pages. However, recovering the original file proved extremely difficult due to poor-quality PDF scans and the specific font used (Courier New), which makes characters like '1' and 'l' nearly indistinguishable.\n\nThe author tried multiple OCR tools—including Adobe Acrobat, Tesseract, and Amazon Textract—to extract the base64 text from the scanned pages. Each method produced corrupted output due to the low-resolution scans, JPEG artifacts, and the problematic font. Even the best results from Amazon Textract, after image preprocessing, yielded a corrupted PDF that could not be properly decompressed or viewed.\n\nThe core takeaway is that while the uncensored data technically exists within the released documents, the combination of technical incompetence in the document preparation (poor scanning and OCR) and inherent challenges (the font choice) has rendered the information practically unrecoverable through automated means, highlighting the flawed nature of the document release process.",
    "chinese_title": "从原始编码附件重建爱泼斯坦PDF文件",
    "chinese_summary": "本文详述了从爱泼斯坦文件发布中重建一份被审查PDF文件的尝试。作者发现，一封关键邮件附件在公开档案中以原始、未经审查的base64编码文本块形式存在，横跨76页。然而，由于PDF扫描质量低劣及所用特定字体（Courier New）导致“1”和“l”等字符几乎无法区分，恢复原始文件极为困难。\n\n作者尝试了多种OCR工具——包括Adobe Acrobat、Tesseract和Amazon Textract——从扫描页面提取base64文本。每种方法都因低分辨率扫描、JPEG伪影和问题字体而产生损坏的输出。即使是经过图像预处理的Amazon Textract最佳结果，生成的PDF文件也已损坏，无法正常解压缩或查看。\n\n核心结论是：虽然未经审查的数据在技术上存在于已发布的文件中，但文件准备过程中的技术缺陷（低质量扫描和OCR）与固有挑战（字体选择）相结合，使得通过自动化手段实际恢复信息几乎不可能，这凸显了文件发布流程存在缺陷。"
  },
  {
    "id": "46904645",
    "title": "Animated Engines",
    "url": "https://animatedengines.com/",
    "summary": "This webpage, titled \"Animated Engines,\" serves as an interactive educational hub dedicated to illustrating the mechanics of various engines and mechanical systems. Its primary feature is a collection of animated demonstrations that visually explain how different engines operate.\n\nThe core content is a directory of engine types, which users can click on to view their animations. The list is extensive, covering internal combustion engines (Four-stroke, Diesel, Two-stroke, Wankel, Atkinson), early aircraft engines (Gnome Rotary), jet propulsion, and various steam engines (Steam Locomotive, Oscillating, Watt Beam, Newcomen Atmospheric). It also includes Stirling engines and other unique mechanisms like the CO2 motor and Coomber engine.\n\nBeyond the animations, the site provides supplementary pages with information about the project's history, a bibliography, contact details, and a copyright policy. It also offers guidance on how to support or follow the project. The overarching purpose of the site is to use clear, engaging animations to demystify complex engineering concepts for students, enthusiasts, and learners.",
    "chinese_title": "动画引擎",
    "chinese_summary": "这个名为“动画引擎”的网页是一个互动教育平台，专门用于展示各类发动机和机械系统的工作原理。其主要特色是一系列动画演示，通过视觉方式直观解释不同发动机的运作机制。\n\n核心内容是一个发动机类型目录，用户点击即可观看对应的动画。目录涵盖范围广泛，包括内燃机（四冲程、柴油机、二冲程、汪克尔转子发动机、阿特金森循环发动机）、早期航空发动机（格诺姆旋转发动机）、喷气推进装置，以及多种蒸汽机（蒸汽机车、摆动式、瓦特摇臂式、纽科门大气式）。此外还收录了斯特林发动机和其他独特机械装置，如二氧化碳发动机和库姆伯发动机。\n\n除动画外，网站还提供补充页面，包含项目历史、参考文献、联系方式和版权政策等信息，并说明了如何支持或关注该项目。网站的根本宗旨是通过清晰生动的动画，为学生、爱好者和学习者揭开复杂工程概念的神秘面纱。"
  },
  {
    "id": "46854128",
    "title": "Nixie-clock using neon lamps as logic elements (2007)",
    "url": "https://www.pa3fwm.nl/projects/neonclock/",
    "summary": "This article describes the author's 2006 project to build a digital clock using Nixie tubes for display, with the unique feature that the counting logic is implemented entirely with neon lamps, resistors, capacitors, and diodes—no transistors or integrated circuits.\n\nThe core logic uses neon lamps in ring counter circuits, exploiting the difference between a lamp's higher striking voltage and lower maintaining voltage. The author adapted a 1960s design, but found modern indicator neon lamps less suitable, requiring careful selection, component value adjustments, and a \"burn-in\" period for the lamps. The Nixie tubes are driven indirectly via light-dependent resistors (LDRs) illuminated by the neon lamps.\n\nWhile the clock was completed and functional, it proved unreliable over time. The neon lamps continued to age unpredictably, making the circuit unstable and difficult to maintain. The project inspired others to experiment with similar designs, and the author later built a more reliable version in 2020 using different neon tubes (МТХ-90).",
    "chinese_title": "使用霓虹灯作为逻辑元件的辉光管时钟（2007年）",
    "chinese_summary": "本文介绍了作者2006年的一个项目：使用辉光管显示的数字钟，其独特之处在于计数逻辑完全由氖灯、电阻、电容和二极管实现——未使用任何晶体管或集成电路。\n\n核心逻辑采用环形计数器电路中的氖灯，利用氖灯较高的击穿电压和较低的维持电压之间的差异。作者改编了一种1960年代的设计，但发现现代指示用氖灯不太适用，需要仔细筛选元件、调整参数值，并对氖灯进行“老化”处理。辉光管通过氖灯照明的光敏电阻间接驱动。\n\n虽然时钟最终完成并能够运行，但长期使用证明其可靠性不足。氖灯会持续发生不可预测的老化，导致电路不稳定且难以维护。该项目启发了其他人尝试类似设计，作者后来在2020年使用不同的氖管（МТХ-90）制作了一个更可靠的版本。"
  },
  {
    "id": "46914974",
    "title": "Show HN: Daily-updated database of malicious browser extensions",
    "url": "https://github.com/toborrm9/malicious_extension_sentry",
    "summary": "This project provides a daily-updated, public database of malicious Chrome and Edge browser extensions that have been removed from the Chrome Web Store. It was created to fill a gap in available, current information on such threats.\n\nThe core offering is a free, local scanning tool called **MalExt Scanner**. Users can run it with a simple one-line command (`curl` and `python3`), and it will instantly check their installed extensions against the database without sending any data online. The tool works on Windows, macOS, and Linux.\n\nThe database itself is compiled automatically from multiple sources, including security blogs, threat feeds, and monitoring services. Each entry includes the extension's unique ID, name, and the date it was added. The data is available in `.md` and `.csv` formats for use in security research, threat intelligence, or building protective tools.\n\nThe creator emphasizes the ongoing threat of malicious extensions, citing recent news articles about extensions stealing ChatGPT conversations, API keys, and conducting large-scale malware campaigns. The project welcomes community contributions to help keep the database comprehensive and current.",
    "chinese_title": "Show HN：每日更新的恶意浏览器扩展数据库",
    "chinese_summary": "本项目提供了一个每日更新的公开数据库，收录了已从Chrome应用商店下架的恶意Chrome和Edge浏览器扩展。创建该项目的初衷是为了填补当前此类威胁信息的空白。\n\n核心工具是一款名为**MalExt Scanner**的免费本地扫描工具。用户只需运行一行简单的命令（使用`curl`和`python3`），即可立即对照数据库检查已安装的扩展，整个过程无需在线传输任何数据。该工具支持Windows、macOS和Linux系统。\n\n数据库通过自动化程序从多个来源整合而成，包括安全博客、威胁情报源和监测服务。每条记录均包含扩展的唯一ID、名称及收录日期。数据以`.md`和`.csv`格式提供，可用于安全研究、威胁情报分析或构建防护工具。\n\n项目创建者强调了恶意扩展持续存在的威胁，并引用了近期关于扩展窃取ChatGPT对话记录、API密钥以及发起大规模恶意软件攻击的新闻报道。该项目欢迎社区贡献，以帮助保持数据库的全面性和时效性。"
  },
  {
    "id": "46848009",
    "title": "The Gnome Village: Treads fight, gnomes cooperate (2025)",
    "url": "https://happihacking.com/blog/posts/2025/the-gnome-village/",
    "summary": "This article introduces the \"Gnome Village\" metaphor to explain the BEAM (Erlang/Elixir) concurrency model, contrasting it with object-oriented programming.\n\nIn OOP, systems are built like tightly-coupled machines where code and state are fused. In the BEAM model, **code (modules)** and **state (processes)** are separate. Code resides in shared, immutable \"scrolls,\" while state lives inside independent, lightweight **processes (\"gnomes\")**. Each gnome has its own private memory (\"backpack\") and garbage collection, ensuring no process can corrupt another.\n\nGnomes cooperate solely by **exchanging messages** (copied between heaps), not by sharing memory. This eliminates the need for locks and makes bottlenecks visible via mailbox queues. Concurrency is cheap; millions of processes can run concurrently because they are isolated and scheduled fairly using a **reduction-based** system, preventing any single process from monopolizing the CPU.\n\nThe model's core strength is **fault isolation**. A crash in one process is contained and does not affect others, enabling the \"let it crash\" philosophy. This separation of concerns, along with cheap process creation and clear message protocols, allows for systems that are scalable, maintainable, and resilient.",
    "chinese_title": "《侏儒村：履带相争，侏儒共济（2025）》",
    "chinese_summary": "本文通过“侏儒村庄”的隐喻来解释BEAM（Erlang/Elixir）并发模型，并与面向对象编程进行对比。\n\n在面向对象编程中，系统如同紧密耦合的机器，代码与状态融为一体。而在BEAM模型中，**代码（模块）**与**状态（进程）**是分离的。代码存在于共享且不可变的“卷轴”中，而状态则存在于独立、轻量级的**进程（“侏儒”）**内部。每个侏儒拥有自己的私有内存（“背包”）和垃圾回收机制，确保任何进程都无法破坏其他进程。\n\n侏儒之间仅通过**交换消息**（在堆之间复制）进行协作，而非共享内存。这消除了对锁的需求，并通过邮箱队列使瓶颈可见。并发成本低廉；数百万个进程可以并发运行，因为它们相互隔离，并采用**基于削减**的公平调度系统，防止单个进程独占CPU。\n\n该模型的核心优势在于**故障隔离**。一个进程的崩溃会被限制在自身范围内，不会影响其他进程，从而实现了“任其崩溃”的理念。这种关注点分离，加上廉价的进程创建和清晰的消息协议，使得系统具备可扩展性、可维护性和弹性。"
  },
  {
    "id": "46908650",
    "title": "Solving Shrinkwrap: New Experimental Technique",
    "url": "https://kizu.dev/shrinkwrap-solution/",
    "summary": "This article presents a novel, experimental CSS technique to solve the long-standing \"shrinkwrap\" problem, where an element with auto-wrapped content fails to shrink to its actual width after wrapping, leaving unwanted empty space.\n\nThe core solution combines two modern CSS features: **anchor positioning** and **scroll-driven animations**. By creating a specific nested HTML structure, the technique uses a hidden \"probe\" element anchored to the content to measure its true dimensions after wrapping. This measured width is then applied to the outer container via scroll-driven animations, forcing it to shrink-wrap visually *and* in layout.\n\nThe author details the prerequisites (e.g., needing `container-type: inline-size` and phrasing content), provides the full commented code, and demonstrates its effectiveness on common use cases like balanced text headers. While the technique works in stable Chrome and Safari with graceful degradation, it is highly experimental—noted for potential browser instability—and is presented as a proof-of-concept that could inform future native CSS features.",
    "chinese_title": "解决收缩包装问题：新型实验技术",
    "chinese_summary": "本文介绍了一种新颖的实验性CSS技术，旨在解决长期存在的“收缩包裹”问题——即当元素内容自动换行后，无法收缩至实际宽度，从而留下多余空白。\n\n该解决方案的核心结合了两项现代CSS特性：**锚点定位**与**滚动驱动动画**。通过构建特定的嵌套HTML结构，该技术利用一个隐藏的“探测”元素锚定于内容，以测量换行后的真实尺寸。随后通过滚动驱动动画将测得的宽度应用于外部容器，使其在视觉*和*布局上均实现收缩包裹效果。\n\n作者详细阐述了技术前提（例如需要`container-type: inline-size`属性与短语化内容），提供了完整注释代码，并在平衡文本标题等常见用例中验证了其有效性。虽然该技术在Chrome和Safari稳定版中可实现优雅降级运行，但它仍属于高度实验性方案——作者提示可能存在浏览器稳定性风险——并作为概念验证展示，以期对未来原生CSS特性的发展提供参考。"
  },
  {
    "id": "46867271",
    "title": "Plasma Effect (2016)",
    "url": "https://www.4rknova.com/blog/2016/11/01/plasma",
    "summary": "This article describes the classic plasma effect, a staple of demoscene graphics from the 1980s and 1990s. It creates flowing, organic patterns reminiscent of plasma or auroras using simple mathematical functions.\n\nThe core technique involves generating and combining multiple 2D sine and cosine waves with different frequencies and phases, based on screen coordinates and animated over time. The interference between these waves produces the effect's characteristic complex, pulsing patterns. The resulting numerical values are then mapped to smooth color gradients, often using a cosine-based palette for vibrant, continuous color transitions.\n\nThe article includes a modern GLSL implementation that demonstrates the effect. This code combines several wave functions and animates them, mapping the output to a color vector. It also features an optional enhancement: adding specular highlights by calculating the gradient of the color field to simulate reflective surfaces and add depth, a technique made possible by modern shader capabilities.\n\nIn summary, the plasma effect is a historically significant and visually captivating example of procedural graphics, achieving complex organic motion from straightforward trigonometric operations and color mapping.",
    "chinese_title": "等离子效果（2016）",
    "chinese_summary": "本文介绍了经典的等离子效果，这是20世纪80年代和90年代演示场景图形中的经典元素。它通过简单的数学函数创造出流动的、有机的图案，令人联想到等离子体或极光。\n\n核心技术涉及基于屏幕坐标生成并组合多个具有不同频率和相位的二维正弦波与余弦波，并随时间进行动画处理。这些波之间的干涉产生了该效果特有的复杂脉动图案。随后，生成的数值被映射到平滑的颜色渐变，通常使用基于余弦的调色板来实现鲜艳、连续的颜色过渡。\n\n文章包含了一个现代GLSL实现来演示该效果。此代码结合了多个波函数并进行动画处理，将输出映射到颜色向量。它还包含一个可选的增强功能：通过计算颜色场的梯度来添加高光，以模拟反射表面并增加深度，这是现代着色器能力所支持的技术。\n\n总之，等离子效果是程序化图形中具有历史意义且视觉上引人入胜的范例，通过简单的三角运算和颜色映射实现了复杂的有机运动。"
  },
  {
    "id": "46903929",
    "title": "The time I didn't meet Jeffrey Epstein",
    "url": "https://scottaaronson.blog/?p=9534",
    "summary": "In this blog post, Scott Aaronson recounts discovering his name in the Jeffrey Epstein files, despite never having met or corresponded with Epstein. The documents reveal that in 2010, an intermediary named Charles Harper tried to arrange a meeting between Aaronson, Seth Lloyd, and Epstein to discuss funding for a \"Cryptography in Nature\" project.\n\nAaronson explains that he met Harper once but, after forwarding Harper's email to his family, heeded his mother's warning to avoid getting \"sucked up in the slime-machine.\" He subsequently blew off further meeting attempts and forgot the entire episode until the files were released.\n\nThe post includes a humorous excerpt from the files where Harper suggested a conference themed around Aaronson's impending 30th birthday. Reflecting in the comments, Aaronson argues that most academics who avoided Epstein did so out of vague unease or disinterest rather than moral clarity, placing himself in that category. He emphasizes the role of his family's advice in keeping him clear of the association and muses that, under slightly different circumstances, he might have met Epstein, which would have been embarrassing but not indicative of complicity.",
    "chinese_title": "我没见到杰弗里·爱泼斯坦的那次",
    "chinese_summary": "在这篇博客文章中，斯科特·阿伦森讲述了他在杰弗里·爱泼斯坦文件中发现自己名字的经历，尽管他从未见过爱泼斯坦或与他有过任何通信。文件显示，2010年，一位名叫查尔斯·哈珀的中间人曾试图安排阿伦森、塞思·劳埃德和爱泼斯坦会面，讨论一个名为“自然界的密码学”项目的资助事宜。\n\n阿伦森解释说，他与哈珀仅见过一面，但在将哈珀的邮件转发给家人后，他听从了母亲的警告，避免“被卷入污浊的泥潭”。随后，他拒绝了进一步的会面尝试，并完全忘记了这件事，直到相关文件被公开。\n\n文章还幽默地引用了文件中的一段内容：哈珀曾提议以阿伦森即将到来的30岁生日为主题组织一场会议。在评论中反思时，阿伦森认为，大多数避开爱泼斯坦的学者是出于模糊的不安或缺乏兴趣，而非道德上的清醒判断，他自己也属于这一类。他强调家人的建议帮助他远离了与爱泼斯坦的关联，并感慨道，如果情况稍有不同，他可能会见到爱泼斯坦——那将令人尴尬，但并不代表他参与了任何不当行为。"
  }
]