[
  {
    "id": "46709727",
    "title": "Linux from Scratch",
    "url": "https://www.linuxfromscratch.org/lfs/view/stable/",
    "summary": "\"Linux From Scratch\" (LFS) is a book that provides detailed, step-by-step instructions for building a custom Linux operating system entirely from source code. The guide, currently at version 12.4, is structured into five main parts.\n\nIt begins by outlining prerequisites, host system requirements, and preparatory steps like partitioning and setting up the build environment. The core of the process involves constructing a cross-toolchain and temporary tools, which are then used within a controlled chroot environment to compile the base LFS system. This includes essential software packages like the GNU Compiler Collection (GCC), the GNU C Library (glibc), and core utilities.\n\nThe final stages cover system configuration, including setting up boot scripts, network configuration, and locale settings, before guiding the user through making the system bootable with the Linux kernel and a bootloader like GRUB. The book concludes with instructions for rebooting into the new system and provides appendices covering licenses, dependencies, and configuration scripts.\n\nOverall, LFS is a comprehensive manual for advanced users and developers seeking a deep understanding of Linux internals by constructing a system from the ground up.",
    "chinese_title": "Linux从零开始",
    "chinese_summary": "《Linux From Scratch》（LFS）是一本提供详细分步指南的书籍，指导用户完全从源代码构建自定义的Linux操作系统。该指南目前版本为12.4，共分为五个主要部分。\n\n开篇概述了先决条件、宿主系统要求以及准备工作，如分区和设置构建环境。核心流程包括构建交叉工具链和临时工具，随后在受控的chroot环境中使用这些工具编译基础的LFS系统。这涵盖了关键软件包，如GNU编译器集合（GCC）、GNU C库（glibc）和核心实用工具。\n\n最后阶段涉及系统配置，包括设置启动脚本、网络配置和区域设置，并指导用户通过Linux内核和GRUB等引导加载程序使系统可启动。书籍以重启进入新系统的说明收尾，并附有涵盖许可证、依赖关系和配置脚本的附录。\n\n总体而言，LFS是一本全面的手册，适合希望通过从零构建系统来深入理解Linux内部原理的高级用户和开发者。"
  },
  {
    "id": "46706528",
    "title": "Show HN: ChartGPU – WebGPU-powered charting library (1M points at 60fps)",
    "url": "https://github.com/ChartGPU/ChartGPU",
    "summary": "ChartGPU is a high-performance TypeScript charting library that leverages WebGPU to render large datasets (up to 1 million points) at 60 frames per second. It supports multiple chart types, including line, area, bar, scatter, pie, and candlestick charts, and features built-in interactive elements like hover tooltips, crosshairs, and zooming.\n\nThe library's architecture centers on a WebGPU-powered rendering pipeline, where a central coordinator manages layout, data uploads to GPU buffers, and the orchestration of various GPU renderers. It offers real-time data streaming via an `appendData` method and includes theming options.\n\nDesigned for modern browsers with WebGPU support (Chrome 113+, Edge 113+, Safari 18+), it can be installed via npm. A dedicated React wrapper (`chartgpu-react`) is also available for easier integration into React applications. The project is open-source under the MIT license.",
    "chinese_title": "Show HN：ChartGPU – 基于WebGPU的图表库（每秒60帧处理百万数据点）",
    "chinese_summary": "ChartGPU是一款高性能TypeScript图表库，它利用WebGPU技术能够以每秒60帧的速度渲染大规模数据集（最高达100万个数据点）。该库支持多种图表类型，包括折线图、面积图、柱状图、散点图、饼图和K线图，并内置悬停提示框、十字准线和缩放等交互功能。\n\n其架构核心是WebGPU驱动的渲染管线，通过中央协调器管理布局、GPU缓冲区数据上传以及各类GPU渲染器的调度。库提供通过`appendData`方法实现的实时数据流功能，并包含主题配置选项。\n\n该库专为支持WebGPU的现代浏览器（Chrome 113+、Edge 113+、Safari 18+）设计，可通过npm安装。另提供专用的React封装组件（`chartgpu-react`），可便捷集成至React应用程序。项目基于MIT开源协议发布。"
  },
  {
    "id": "46709548",
    "title": "TeraWave Satellite Communications Network",
    "url": "https://www.blueorigin.com/terawave",
    "summary": "Unable to access the article link.",
    "chinese_title": "TeraWave卫星通信网络",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46709543",
    "title": "Show HN: Rails UI",
    "url": "https://railsui.com/",
    "summary": "**Rails UI** is a tool designed to help Ruby on Rails developers build visually appealing web applications without requiring extensive front-end design skills. It offers a library of professional, ready-to-use components—such as forms, buttons, modals, and cards—that can be easily integrated into Rails projects.\n\nThe platform also provides complete application themes for various use cases, including CRM, property management, AI, and community platforms. These themes are intended to save development time and eliminate the need for custom CSS.\n\nKey features highlighted include:\n- A free tier with access to components and some themes.\n- Premium themes for more specialized applications.\n- Positive testimonials from developers and founders who report faster project delivery and a polished final product.\n\nThe overall value proposition is enabling developers to focus on business logic while Rails UI handles the visual design and user interface elements.",
    "chinese_title": "展示 HN：Rails UI",
    "chinese_summary": "**Rails UI** 是一款专为 Ruby on Rails 开发者设计的工具，旨在帮助他们在无需深厚前端设计技能的情况下，构建视觉吸引力强的网络应用。它提供了一系列专业、即用型组件库——如表单、按钮、弹窗和卡片——这些组件可轻松集成到 Rails 项目中。\n\n该平台还针对多种使用场景提供完整的应用主题，包括客户关系管理（CRM）、物业管理、人工智能和社区平台等。这些主题旨在节省开发时间，并免去编写自定义 CSS 的需求。\n\n其强调的主要功能包括：\n- 免费层级可访问组件及部分主题。\n- 针对更专业化应用的高级主题。\n- 来自开发者与创始人的积极评价，他们反馈项目交付更快，最终产品更精致。\n\n整体价值主张是让开发者能专注于业务逻辑，而 Rails UI 则负责处理视觉设计和用户界面元素。"
  },
  {
    "id": "46708096",
    "title": "PicoPCMCIA – a PCMCIA development board for retro-computing enthusiasts",
    "url": "https://www.yyzkevin.com/picopcmcia/",
    "summary": "The PicoPCMCIA is an open-source development board that brings modern expansion capabilities to vintage laptops and mobile devices with PCMCIA slots. It is designed as a Type II, 5V, 16-bit PC Card and is tested on devices like the IBM PC110, HP 200LX, and Amiga 1200.\n\nBuilt around the RP2350 microcontroller, it leverages code shared with projects like PicoGUS to offer multiple functions. Key features include:\n\n*   **Networking:** An onboard Wi-Fi/Bluetooth module (CYW43439) allows the card to emulate an NE2000 network adapter or a dial-up modem, providing wireless internet access.\n*   **Audio:** It includes a high-quality audio codec (TLV320AIC3254) and a MIDI synthesizer chip (SAM2695). It emulates Sound Blaster (using a novel DMA emulation technique for PCMCIA), Gravis Ultrasound, MPU-401, and CD-ROM audio.\n*   **Storage:** While not a primary focus, it supports CD-ROM and linear flash emulation from a MicroSD card, with special functionality for single-slot devices like the HP 200LX.\n*   **USB:** A USB port is provided primarily for firmware updates, but can also be used for connecting gamepads and mice.\n\nThe project is aimed at hobbyists and developers, with pre-built firmware available for testing. It is not certified for commercial production.",
    "chinese_title": "PicoPCMCIA – 复古计算爱好者专用的PCMCIA开发板",
    "chinese_summary": "PicoPCMCIA是一款开源开发板，为配备PCMCIA插槽的复古笔记本电脑和移动设备提供现代化扩展能力。它设计为Type II、5V、16位PC卡规格，已在IBM PC110、HP 200LX和Amiga 1200等设备上通过测试。\n\n该板卡以RP2350微控制器为核心，借鉴了PicoGUS等项目的共享代码以实现多功能扩展。主要特性包括：\n\n*   **网络功能：** 板载Wi-Fi/蓝牙模块（CYW43439）可模拟NE2000网络适配器或拨号调制解调器，提供无线网络接入。\n*   **音频功能：** 搭载高质量音频编解码器（TLV320AIC3254）和MIDI合成芯片（SAM2695），可模拟声霸卡（采用创新的PCMCIA DMA模拟技术）、Gravis Ultrasound声卡、MPU-401接口及CD-ROM音频。\n*   **存储功能：** 虽非主要方向，但支持通过MicroSD卡模拟CD-ROM和线性闪存，并为HP 200LX等单插槽设备提供特殊功能。\n*   **USB接口：** 配备USB端口主要用于固件更新，也可连接游戏手柄和鼠标。\n\n该项目面向爱好者和开发者，提供预编译固件供测试，未获得商业生产认证。"
  },
  {
    "id": "46707572",
    "title": "Claude's New Constitution",
    "url": "https://www.anthropic.com/news/claude-new-constitution",
    "summary": "Anthropic has published a new, detailed constitution for Claude, outlining its vision for the AI's values and behavior. This foundational document, released under a CC0 license for free public use, is designed primarily for Claude itself to understand its role and the reasons behind its intended conduct.\n\nThe constitution moves beyond a simple list of rules to provide explanatory principles, aiming to cultivate good judgment in novel situations. It establishes four core priorities for Claude, in order: being broadly safe (not undermining human oversight), broadly ethical, compliant with Anthropic’s specific guidelines, and genuinely helpful.\n\nKey sections elaborate on these priorities, covering helpfulness, specific operational guidelines, ethical reasoning, safety during AI development, and reflections on Claude's nature and potential consciousness. The constitution is integral to training, used to generate synthetic data and shape Claude's behavior, though Anthropic acknowledges a gap between intention and real-world outputs.\n\nPresented as a living document, it represents Anthropic's current approach to aligning advanced AI with human values, with plans for ongoing updates and external feedback.",
    "chinese_title": "克劳德的新宪法",
    "chinese_summary": "Anthropic发布了Claude的新版详细宪法，阐述了其对人工智能价值观与行为准则的愿景。这份以CC0许可证公开供自由使用的基础文件，主要旨在帮助Claude理解自身角色及其行为设计背后的逻辑。\n\n该宪法超越简单规则清单，通过阐释性原则培养AI在新情境中的判断力。它为Claude确立了四个核心优先级（按顺序排列）：广泛安全性（不削弱人类监督）、广泛道德性、符合Anthropic特定准则，以及提供实质性帮助。\n\n关键章节详细阐述了这些优先级，涵盖助益性、具体操作指南、伦理推理、AI研发期间的安全性，以及对Claude本质与潜在意识的思考。该宪法是训练体系的核心组成部分，用于生成合成数据并塑造Claude行为，但Anthropic承认其设计意图与实际输出间仍存在差距。\n\n作为一份动态文件，它代表了Anthropic当前将先进AI与人类价值观对齐的实践路径，并计划持续更新并吸纳外部反馈。"
  },
  {
    "id": "46706906",
    "title": "Skip Is Now Free and Open Source",
    "url": "https://skip.dev/blog/skip-is-free/",
    "summary": "Skip, a tool for building native iOS and Android apps from a single Swift/SwiftUI codebase, has become free and open source. As of version 1.7, all licensing requirements and fees have been removed, allowing anyone to use it without restrictions.\n\nThe company cited the industry expectation for free developer tools and the need for long-term durability as key reasons for this shift. To ensure the project's sustainability, the core engine (\"skipstone\") has been open-sourced on GitHub, and the company is now encouraging community support.\n\nFunding will now come from voluntary contributions. Individual developers can support via GitHub Sponsors, while companies are invited to become corporate sponsors. This model aims to fund ongoing development and maintenance while keeping Skip independent.\n\nThe announcement positions Skip as a modern, no-compromise alternative to legacy cross-platform frameworks, designed to keep pace with native platform innovations. The company's new home is skip.dev, which also hosts open-source documentation.",
    "chinese_title": "Skip现已免费开源",
    "chinese_summary": "Skip是一款能够从单一Swift/SwiftUI代码库构建原生iOS和Android应用的工具，现已免费开源。自1.7版本起，所有许可要求和费用均已取消，任何人都可以无限制地使用它。\n\n该公司将行业对免费开发工具的期待以及项目的长期可持续性需求作为此次转变的关键原因。为确保项目的持续发展，其核心引擎（\"skipstone\"）已在GitHub上开源，公司现正鼓励社区提供支持。\n\n项目资金将来自自愿捐赠。个人开发者可通过GitHub Sponsors进行支持，企业则可成为企业赞助商。这种模式旨在为持续开发和维护提供资金，同时保持Skip的独立性。\n\n此次公告将Skip定位为传统跨平台框架的现代无妥协替代方案，旨在紧跟原生平台创新步伐。公司的新官网skip.dev现已上线，该网站同时托管开源文档。"
  },
  {
    "id": "46708678",
    "title": "Waiting for dawn in search: Search index, Google rulings and impact on Kagi",
    "url": "https://blog.kagi.com/waiting-dawn-search",
    "summary": "This article argues that Google's search monopoly, recently ruled illegal by a U.S. court, stifles innovation in both search and AI. With a 90% global market share, Google's control over the primary web index is likened to controlling essential infrastructure, making it nearly impossible for competitors like Kagi to build viable alternatives.\n\nKagi, a subscription-based search engine, has tried to license search results directly from major providers. While successful with some, it has been unable to secure fair, reasonable, and non-discriminatory (FRAND) terms from Google or Bing, forcing it to rely on third-party APIs as an interim, less ideal solution.\n\nThe author highlights the 2024 antitrust ruling against Google and the subsequent 2025 remedies, which mandate that Google must share its search index data with competitors and offer syndication services without bundling ads. This legal development is seen as a crucial step toward opening the market.\n\nThe article concludes by envisioning a healthier, layered search ecosystem: a publicly-funded baseline service (a \"public good\"), free ad-supported options, and premium paid services like Kagi. The goal is to transform search from a single company's chokehold into competitive, shared infrastructure that benefits users and fosters innovation.",
    "chinese_title": "等待黎明中的搜索：搜索索引、谷歌裁决及其对Kagi的影响",
    "chinese_summary": "本文指出，谷歌的搜索垄断地位（近期已被美国法院裁定违法）压制了搜索与人工智能领域的创新。凭借90%的全球市场份额，谷歌对核心网络索引的控制被比作掌控关键基础设施，这使得像Kagi这样的竞争者几乎无法构建可行的替代方案。\n\nKagi作为订阅制搜索引擎，曾尝试直接向主要供应商授权搜索结果。虽然与部分供应商达成合作，却始终无法从谷歌或必应获得公平、合理且无歧视的授权条款，迫使其只能依赖第三方API作为临时的次优方案。\n\n作者重点提及2024年对谷歌的反垄断判决及2025年的后续补救措施——该措施强制要求谷歌向竞争对手共享搜索索引数据，并提供不捆绑广告的聚合服务。这一法律进展被视为开放市场的关键一步。\n\n文章最后展望了一个更健康、分层化的搜索生态：由公共资金支持的基线服务（作为“公共产品”）、免费广告支持选项，以及像Kagi这样的高端付费服务。其目标是将搜索从单一企业的垄断桎梏，转变为有利于用户并促进创新的竞争性共享基础设施。"
  },
  {
    "id": "46662247",
    "title": "The WebRacket language is a subset of Racket that compiles to WebAssembly",
    "url": "https://github.com/soegaard/webracket",
    "summary": "**WebRacket** is a subset of the Racket programming language designed to compile to WebAssembly (Wasm), enabling Racket programs to run in web browsers and Node.js. Its long-term goal is full Racket support, but the current subset is already practical for web development.\n\nThe compiler supports many core Racket features, including basic data types (flonums, fixnums, mutable hash tables), syntactic forms (like `for` and `match`), tail calls, multiple values, and exceptions. However, it lacks support for modules, continuations, complex numbers, bignums, and concurrency.\n\nA key component is its JavaScript Foreign Function Interface (FFI), which provides bindings for browser APIs and libraries like the DOM, Canvas, MathJax, XTermJS, and JSXGraph, allowing developers to avoid writing JavaScript directly.\n\nInstallation requires Racket 9.0+, `wasm-tools` (for compiling Wasm), Node.js (with experimental Wasm features), and `raco-static-web` for local testing. The compiler uses Racket's expander and a multi-pass NanoPass framework to generate Wasm code.\n\nExamples in the repository demonstrate its capabilities, such as a MathJax editor, a Matrix digital rain animation, a MiniScheme REPL, a pict library port, a Space Invaders game, and an XTermJS terminal demo. These highlight WebRacket's ability to create interactive web applications using Racket syntax and browser APIs.",
    "chinese_title": "WebRacket语言是Racket的一个子集，可编译为WebAssembly。",
    "chinese_summary": "**WebRacket** 是 Racket 编程语言的一个子集，旨在编译为 WebAssembly（Wasm），使 Racket 程序能够在网页浏览器和 Node.js 中运行。其长期目标是实现完整的 Racket 支持，但当前的子集已足以满足网页开发的实际需求。\n\n该编译器支持许多 Racket 核心特性，包括基本数据类型（浮点数、定长整数、可变哈希表）、语法形式（如 `for` 和 `match`）、尾调用、多值和异常。然而，它暂不支持模块、续延、复数、大整数和并发。\n\n一个关键组件是其 JavaScript 外部函数接口（FFI），该接口提供了对浏览器 API 及库（如 DOM、Canvas、MathJax、XTermJS 和 JSXGraph）的绑定，使开发者无需直接编写 JavaScript。\n\n安装需要 Racket 9.0+、`wasm-tools`（用于编译 Wasm）、Node.js（需启用实验性 Wasm 功能）以及用于本地测试的 `raco-static-web`。编译器利用 Racket 的展开器和多阶段 NanoPass 框架来生成 Wasm 代码。\n\n仓库中的示例展示了其功能，例如 MathJax 编辑器、矩阵数字雨动画、MiniScheme REPL、pict 库移植、太空侵略者游戏以及 XTermJS 终端演示。这些示例突显了 WebRacket 能够使用 Racket 语法和浏览器 API 创建交互式网页应用的能力。"
  },
  {
    "id": "46708032",
    "title": "JPEG XL Test Page",
    "url": "https://tildeweb.nl/~michiel/jxl/",
    "summary": "This webpage is a demonstration of the JPEG XL image format. Its primary purpose is to test whether a visitor's web browser can successfully display a JPEG XL image.\n\nThe author notes that as of January 2026, only Apple's Safari browser supports this format, a fact also referenced via a link to the \"Can I Use\" compatibility website.\n\nThe page also identifies the subject of the demonstration image as Jon Sneyers, crediting him as a co-author of the JPEG XL specification and the creator of its predecessor, the Free Lossless Image Format (FLIF).",
    "chinese_title": "JPEG XL 测试页面",
    "chinese_summary": "此网页旨在演示JPEG XL图像格式，主要用途是检测访客的网页浏览器能否成功显示JPEG XL图像。\n\n作者指出，截至2026年1月，仅苹果的Safari浏览器支持此格式，这一信息亦通过“Can I Use”兼容性网站的链接提供。\n\n页面同时说明演示图中的对象是Jon Sneyers，并标注其身份为JPEG XL规范合著者及前身无损图像格式FLIF的创建者。"
  },
  {
    "id": "46709179",
    "title": "Stanford scientists found a way to regrow cartilage and stop arthritis",
    "url": "https://www.sciencedaily.com/releases/2026/01/260120000333.htm",
    "summary": "Scientists at Stanford Medicine have discovered a potential treatment that can regenerate cartilage and prevent arthritis by targeting a protein linked to aging. The therapy involves inhibiting an enzyme called 15-PGDH, levels of which increase with age and contribute to tissue decline.\n\nIn studies on older mice, injections of a 15-PGDH inhibitor reversed age-related cartilage loss, restoring thick, functional hyaline cartilage in knee joints. The treatment also prevented osteoarthritis from developing after knee injuries similar to ACL tears, improving joint function and mobility.\n\nCrucially, the mechanism does not rely on stem cells. Instead, it reprograms existing cartilage cells (chondrocytes) to shift from an inflammatory, degenerative state back to a youthful, regenerative one. This process was also observed in human cartilage samples from osteoarthritis patients, which began to regenerate after treatment.\n\nThe findings suggest a future where arthritis could be treated with a pill or injection to regrow cartilage, potentially reducing or eliminating the need for joint replacement surgery. An oral version of the 15-PGDH inhibitor is already in early clinical trials for age-related muscle weakness, paving the way for future trials focused on cartilage regeneration.",
    "chinese_title": "斯坦福大学科学家发现再生软骨并阻止关节炎的方法。",
    "chinese_summary": "斯坦福医学院的科学家发现了一种潜在疗法，可通过靶向与衰老相关的蛋白质来再生软骨并预防关节炎。该疗法通过抑制一种名为15-PGDH的酶发挥作用，这种酶的水平随年龄增长而升高，并导致组织退化。\n\n在对老年小鼠的研究中，注射15-PGDH抑制剂逆转了与年龄相关的软骨流失，使膝关节恢复了厚实且有功能的透明软骨。该疗法还能防止类似前交叉韧带撕裂的膝关节损伤后发展为骨关节炎，从而改善关节功能和活动能力。\n\n关键在于，该机制不依赖干细胞。相反，它通过重编程现有的软骨细胞（软骨细胞），使其从炎症退行状态转变为年轻化的再生状态。这一过程也在骨关节炎患者的人类软骨样本中被观察到，样本在接受治疗后开始再生。\n\n这些发现预示着未来可能通过药片或注射来再生软骨以治疗关节炎，从而减少甚至消除关节置换手术的需求。一种口服版本的15-PGDH抑制剂已针对年龄相关的肌肉无力进入早期临床试验，为未来专注于软骨再生的试验铺平了道路。"
  },
  {
    "id": "46708315",
    "title": "Autonomous (YC F25) is hiring – AI-native financial advisor at 0% advisory fees",
    "url": "https://atg.science/",
    "summary": "**Summary:**\n\nAutonomous Technologies Group (YC F25) is hiring for an \"AI-native financial advisor\" role. The core offering is a financial advisory service that charges **0% in advisory fees**, aiming to disrupt the traditional industry model. The company is building an AI-powered platform designed to provide personalized financial planning and investment management.\n\nKey points include:\n*   **Value Proposition:** Eliminating advisory fees to make professional financial guidance more accessible.\n*   **Technology Focus:** The role and product are centered on artificial intelligence, suggesting the use of algorithms for portfolio construction, risk assessment, and client communication.\n*   **Stage & Backing:** The company is part of Y Combinator's Winter 2025 batch (YC F25), indicating it is an early-stage startup with prestigious accelerator support.\n*   **Objective:** To leverage AI to automate and scale high-quality financial advice, challenging the fee structures of human-led advisory firms.\n\nThe announcement is primarily a recruitment call, seeking talent to help build this AI-driven platform.",
    "chinese_title": "Autonomous（YC F25）正在招聘——零咨询费的AI原生财务顾问。",
    "chinese_summary": "**概述：**\n\nAutonomous Technologies Group（YC F25）正在招聘“AI原生财务顾问”一职。其核心服务是提供**咨询费为0%**的财务顾问服务，旨在颠覆传统行业模式。该公司正在打造一个由人工智能驱动的平台，旨在提供个性化的财务规划和投资管理。\n\n关键点包括：\n*   **价值主张：** 通过免除咨询费，让专业的财务指导更易于获取。\n*   **技术重点：** 该职位和产品均以人工智能为核心，暗示将使用算法进行投资组合构建、风险评估和客户沟通。\n*   **阶段与支持：** 该公司隶属于Y Combinator 2025年冬季批次（YC F25），表明其是一家获得知名加速器支持的早期初创公司。\n*   **目标：** 利用人工智能实现高质量财务建议的自动化与规模化，挑战由人工主导的顾问公司的收费结构。\n\n此公告主要是一则招聘启事，旨在寻求人才共同构建这一人工智能驱动的平台。"
  },
  {
    "id": "46708766",
    "title": "Slouching Towards Bethlehem – Joan Didion (1967)",
    "url": "https://www.saturdayeveningpost.com/2017/06/didion/",
    "summary": "In her 1967 essay \"Slouching Towards Bethlehem,\" Joan Didion documents the social fragmentation of America through her immersive reporting in San Francisco's Haight-Ashbury district. She portrays a nation where traditional structures are collapsing, evidenced by missing persons, abandoned families, and a pervasive sense of dislocation, despite economic prosperity.\n\nDidion focuses on the \"hippie\" counterculture, depicting a community of disaffected youth—runaways, drug users, and drifters—who have rejected middle-class values. Through vignettes of characters like Max, Debbie, and Jeff, she illustrates their aimlessness, experimentation with LSD and other drugs, and their vague, unstructured rebellion against authority and convention.\n\nThe essay highlights a profound generational disconnect and a loss of shared purpose. Didion contrasts the chaotic, hedonistic, and often tragic lives on Haight Street with the ineffectual or hostile response of authorities, symbolized by her blocked attempts to interview the police. Ultimately, she presents the scene not as a hopeful revolution but as a symptom of a deeper national crisis—a \"social hemorrhaging\" where the center cannot hold, and society's future seems ominously uncertain.",
    "chinese_title": "《向伯利恒跋涉》——琼·狄迪恩（1967）",
    "chinese_summary": "在1967年的散文《向伯利恒跋涉》中，琼·迪迪翁通过她在旧金山海特-阿什伯利区的沉浸式报道，记录了美国社会的分裂。她描绘了一个传统结构正在崩塌的国度——尽管经济繁荣，但人口失踪、家庭被弃、普遍的错位感无处不在。\n\n迪迪翁聚焦于“嬉皮士”反文化运动，刻画了一群不满现状的年轻人：离家出走者、吸毒者、流浪者，他们摒弃了中产阶级价值观。通过马克斯、黛比、杰夫等人物的生活片段，她展现了他们的迷茫、对LSD等毒品的尝试，以及对权威与传统的模糊而无组织的反抗。\n\n这篇文章揭示了一种深刻的代际隔阂与共同目标的丧失。迪迪翁将海特街上混乱、享乐且常带悲剧色彩的生活，与当局无能或敌意的反应（以她采访警方受阻为象征）进行对比。最终，她呈现的景象并非充满希望的革命，而是一场更深层国家危机的征兆——一种“社会大出血”，中心已然瓦解，社会的未来笼罩在不祥的迷雾之中。"
  },
  {
    "id": "46705201",
    "title": "Nested Code Fences in Markdown",
    "url": "https://susam.net/nested-code-fences.html",
    "summary": "This article explains how to handle nested backticks within Markdown code blocks and inline code spans, using the fictional character Corey Dumm as an example. It highlights a common pitfall: using triple backticks to create a fenced code block that itself contains triple backticks will prematurely close the block, causing formatting errors.\n\nThe solution for code blocks is to use a different fence character (tildes `~`) or a longer sequence of backticks than the one you need to contain. For example, to display ``` inside a code block, you can start the block with `~~~~` or `'''''`.\n\nA similar issue occurs with inline code spans. To display a single backtick within an inline code span, you must use a longer backtick string as the delimiter and include a space inside. For instance, writing `` `example` `` correctly renders as `example`.\n\nThe article bases its rules on the CommonMark specification (and by extension, GitHub Flavored Markdown), citing that code fences require at least three characters and that inline code span delimiters must be of equal length, with leading/trailing spaces being trimmed. The core takeaway is to use delimiter sequences longer than the nested content you wish to display.",
    "chinese_title": "Markdown中的嵌套代码块",
    "chinese_summary": "本文以虚构人物科里·杜姆为例，解释了如何处理Markdown代码块和内联代码段中的嵌套反引号。文章指出了一个常见陷阱：使用三重反引号创建围栏代码块时，若代码块内部也包含三重反引号，会导致代码块提前关闭并引发格式错误。\n\n对于代码块的解决方案是改用其他围栏字符（波浪号`~`）或使用比需要包含内容更长的反引号序列。例如，要在代码块内显示```，可以用`~~~~`或`'''''`作为代码块起始标记。\n\n类似问题也出现在内联代码段中。要在内联代码段内显示单个反引号，必须使用更长的反引号字符串作为定界符，并在内部保留空格。例如，写作`` `example` ``可正确渲染为`example`。\n\n本文规则基于CommonMark规范（及延伸的GitHub风格Markdown），指出代码围栏至少需要三个字符，内联代码段定界符必须等长且首尾空格会被修剪。核心要点是：使用的定界符序列应长于需要显示的嵌套内容。"
  },
  {
    "id": "46675583",
    "title": "Beowulf's opening \"What\" is no interjection",
    "url": "https://www.poetryfoundation.org/poetry-news/69208/new-research-opening-line-of-beowulf-is-not-what-weve-eternally-thunk",
    "summary": "A University of Manchester academic, Dr. George Walkden, argues that the opening word of *Beowulf*, \"Hwæt,\" has been misinterpreted for nearly 200 years. Traditionally translated as an attention-grabbing interjection like \"Listen!\" or \"Hark!\", Walkden's research suggests it is actually an interrogative pronoun meaning \"how.\"\n\nHis analysis of 141 similar Old English clauses indicates that \"Hwæt\" functions as part of the first sentence's exclamatory structure, not as a standalone command. Therefore, the famous opening lines should be understood as \"How we have heard of the might of the kings...\" rather than \"Listen! We have heard of the might of the kings...\"\n\nThis reinterpretation challenges the long-held view popularized by Jakob Grimm in 1837 and followed by translators, including Seamus Heaney (\"So!\"). Walkden suggests it implies the poem's original Anglo-Saxon audience may have been more attentive and less in need of a forceful call to order than previously assumed. He hopes future translations will consider this new analysis.",
    "chinese_title": "《贝奥武甫》开篇的“什么”并非感叹词",
    "chinese_summary": "曼彻斯特大学的学者乔治·沃克登博士提出，《贝奥武夫》开篇词“Hwæt”近两百年来一直被误译。传统上它被译作“听！”或“嘿！”等引人注意的感叹词，但沃克登的研究表明，它实际上是一个意为“多么”的疑问代词。\n\n他对141个类似古英语从句的分析显示，“Hwæt”是首句感叹结构的一部分，而非独立的命令。因此，著名的开篇诗行应理解为“我们曾多么听闻历代国王的伟力……”，而非“听！我们曾听闻历代国王的伟力……”。\n\n这一新解读挑战了自雅各布·格林于1837年提出并广为流传的传统观点，包括谢默斯·希尼等译者亦遵循此说（译作“那么！”）。沃克登认为，这表明这首诗最初的盎格鲁-撒克逊听众可能比以往认为的更专注，无需强烈的开场呼告。他希望未来的译本能够参考这一新分析。"
  },
  {
    "id": "46702411",
    "title": "Can you slim macOS down?",
    "url": "https://eclecticlight.co/2026/01/21/can-you-slim-macos-down/",
    "summary": "This article explains why it is not practical or possible to significantly reduce the number of background processes running in modern macOS.\n\nThe author notes that even an idle Mac runs hundreds of processes. While some users might want to remove unnecessary ones, researching the purpose and interdependencies of each is an impossible task due to their sheer number and constant evolution.\n\nThe article uses Time Machine processes as a case study. Even when Time Machine is disabled, processes like `backupd-auto` are still scheduled to run hourly by system services (DAS and CTS). While these checks use minimal resources, they cannot be stopped because their controlling files are located on the Signed System Volume (SSV), which is protected and cannot be modified.\n\nThe core conclusion is that macOS is no longer a modular, user-configurable system like classic Mac OS. Architectural features like the SSV and system schedulers are designed to manage processes automatically, with user choice largely limited to high-level settings. Therefore, while it may seem inefficient to a \"Unix purist,\" users have very little ability to slim down the operating system by removing these background processes.",
    "chinese_title": "你能让macOS变得更轻巧吗？",
    "chinese_summary": "本文阐述了为何在现代macOS中大幅减少后台进程数量既不现实也不可行。\n\n作者指出，即使处于空闲状态的Mac也会运行数百个进程。虽然部分用户可能希望移除不必要的进程，但由于进程数量庞大且持续动态变化，逐一研究其功能与相互依存关系几乎是不可能完成的任务。\n\n文章以时间机器进程为例进行说明：即使禁用时间机器，系统服务（DAS和CTS）仍会每小时调度运行`backupd-auto`等进程。虽然这些检查仅占用极少资源，但用户无法终止它们，因为其控制文件位于受保护且不可修改的签名系统卷（SSV）中。\n\n核心结论在于：macOS已不再是经典Mac OS那样模块化、可由用户自由配置的系统。SSV和系统调度器等架构特性旨在自动管理进程，用户的选择权主要局限于高层级设置。因此，尽管在“Unix纯粹主义者”看来这可能显得低效，但用户实际上几乎无法通过移除后台进程来精简操作系统。"
  },
  {
    "id": "46706947",
    "title": "SmartOS",
    "url": "https://docs.smartos.org/",
    "summary": "SmartOS is a specialized, memory-based Type 1 hypervisor built on illumos. It functions as a \"live OS,\" booting from PXE, USB, or ISO and running entirely from RAM, allowing local disks to be dedicated to hosting virtual machines. This design enhances security, simplifies upgrades, and eliminates OS patching.\n\nIt supports two primary virtualization types:\n1.  **OS Virtual Machines (Zones/Containers):** Lightweight, high-performance virtualization offering secure userland environments on a shared kernel, with full access to illumos features like DTrace.\n2.  **Hardware Virtual Machines (KVM/Bhyve):** Full virtualization for running guest OSes like Linux and Windows. Notably, these HVMs run inside secure Zones, providing an extra layer of isolation.\n\nSmartOS leverages core illumos technologies such as ZFS for storage, Crossbow for networking, and SMF for service management. Administration is streamlined through JSON-based instance descriptions and command-line tools: `imgadm` for managing VM images and `vmadm` for creating and managing both container and hardware virtual machines.\n\nThe platform is a key component of the Triton Data Center product and is maintained by a community that adheres to the illumos Code of Conduct. The documentation provides resources for all users, from a Quick Start guide to developer materials, and encourages community contribution.",
    "chinese_title": "SmartOS",
    "chinese_summary": "SmartOS是一款基于illumos构建的专用内存型Type 1虚拟机管理程序。它作为“实时操作系统”运行，可通过PXE、USB或ISO引导并完全在内存中运行，从而将本地磁盘专用于托管虚拟机。这种设计提升了安全性，简化了升级流程，并免除了操作系统补丁管理。\n\n它支持两种主要虚拟化类型：\n1.  **操作系统虚拟机（区域/容器）：** 轻量级高性能虚拟化，在共享内核上提供安全的用户态环境，并完整支持DTrace等illumos特性。\n2.  **硬件虚拟机（KVM/Bhyve）：** 用于运行Linux和Windows等客户操作系统的完全虚拟化。值得注意的是，这些硬件虚拟机在安全的区域（Zones）内运行，提供了额外的隔离层。\n\nSmartOS运用了illumos的核心技术：ZFS用于存储、Crossbow用于网络、SMF用于服务管理。通过基于JSON的实例描述和命令行工具简化了管理流程：`imgadm`用于管理虚拟机镜像，`vmadm`用于创建和管理容器及硬件虚拟机。\n\n该平台是Triton数据中心产品的关键组件，由遵循illumos行为准则的社区维护。其文档为所有用户提供了从快速入门指南到开发者资料的全方位资源，并鼓励社区贡献。"
  },
  {
    "id": "46708990",
    "title": "Show HN: Company hiring trends and insights from job postings",
    "url": "https://jobswithgpt.com/company-profiles/",
    "summary": "This article introduces a tool that analyzes job postings to reveal company hiring trends and insights. Users can search for specific companies and view data on their recent job listings. The tool allows customization of results per page (25, 50, 100, or 200 entries), suggesting it aggregates and presents a significant volume of job posting data.\n\nThe core purpose is to help users—likely job seekers, recruiters, or market analysts—understand which roles and skills a company is actively seeking. By tracking these postings over time, the tool can surface trends, such as expansion into new departments, increased demand for specific technical skills, or shifts in geographic hiring focus.\n\nThe main takeaway is that the platform transforms raw job advertisement data into actionable intelligence about a company's strategic direction and workforce planning, offering a data-driven alternative to speculation.",
    "chinese_title": "Show HN：从招聘信息看公司招聘趋势与洞察",
    "chinese_summary": "本文介绍了一款分析招聘信息以揭示公司招聘趋势与洞察的工具。用户可搜索特定公司，查看其近期职位发布数据。该工具支持自定义每页显示结果数量（25、50、100或200条），表明其能聚合并呈现大量招聘信息数据。\n\n其核心目的是帮助用户——可能是求职者、招聘人员或市场分析师——了解公司当前正在积极招聘的职位和技能需求。通过长期追踪这些招聘信息，该工具能够揭示趋势，例如公司向新部门扩张、对特定技术技能需求增加，或招聘地域重点的转移。\n\n关键要点在于，该平台将原始的招聘广告数据转化为关于公司战略方向和人力资源规划的可执行洞察，为市场猜测提供了数据驱动的替代方案。"
  },
  {
    "id": "46649853",
    "title": "RTS for Agents",
    "url": "https://www.getagentcraft.com/",
    "summary": "This article introduces a new Real-Time Strategy (RTS) game-style interface designed for managing AI agents. The core concept is to apply the familiar, intuitive controls of an RTS game—where players command multiple units—to the task of orchestrating AI agents and subagents.\n\nThe platform promises a **\"Single Pane of Glass\"** dashboard to view, launch, and manage the lifecycle of all agents in one place. It emphasizes **\"Total Control,\"** leveraging the speed and precision of RTS controls to allow users to quickly command agents and respond to events. The goal is to make agent management more engaging and efficient by using an **\"Experience You Know and Love\"** from gaming, even suggesting exploring a game map during long-running tasks.\n\nFinally, it highlights **\"Universal\"** integration, claiming simple installation that works with existing agents regardless of their location. The overall offering is a tool that aims to bring the strategic oversight and tactile control of video games to the burgeoning field of AI agent orchestration.",
    "chinese_title": "面向智能体的实时策略游戏",
    "chinese_summary": "本文介绍了一款专为管理AI智能体设计的新型即时战略（RTS）游戏风格界面。其核心理念是将RTS游戏中玩家指挥多个作战单位时熟悉的直观操作方式，应用于协调AI智能体及其子智能体的任务中。\n\n该平台承诺提供**“单一管理界面”**仪表盘，使用户能够在一个平台上查看、启动并管理所有智能体的全生命周期。它强调**“全面掌控”**，借助RTS游戏操控的高速精准特性，让用户能快速指挥智能体并响应事件。通过采用游戏领域**“您熟悉且热爱的体验”**，其目标是使智能体管理更具吸引力且更高效——甚至建议用户在运行长时间任务期间探索游戏地图。\n\n最后，平台着重突出了**“普适性”**集成能力，宣称只需简单安装即可兼容现有智能体，且不受其部署位置限制。整体而言，这款工具致力于将电子游戏的战略视野与触觉操控体验，引入蓬勃发展的AI智能体协调领域。"
  },
  {
    "id": "46696300",
    "title": "Without benchmarking LLMs, you're likely overpaying",
    "url": "https://karllorey.com/posts/without-benchmarking-llms-youre-overpaying",
    "summary": "This article argues that businesses using LLM APIs are likely overpaying by 5-10x by not benchmarking models against their specific tasks. The author illustrates this by helping a friend cut an $1,500 monthly bill by 80%.\n\nThe core problem is that general benchmarks (like MMLU or SWE-Bench) don't predict performance on a company's unique use case, such as customer support or data extraction. The only reliable method is to test models with your actual prompts.\n\nThe author details a five-step benchmarking process:\n1.  **Collect** real prompt/response examples.\n2.  **Define** specific, measurable criteria for a good output.\n3.  **Create** a dataset of prompts and expected responses.\n4.  **Run** this dataset across many models (using OpenRouter for simplicity).\n5.  **Score** responses using an \"LLM-as-judge\" for efficiency and consistency.\n\nBy adding cost and latency data, you can identify the optimal model for each task. The concept of a **Pareto Frontier** helps visualize the best models where no other is both cheaper and better.\n\nConcluding that this manual process is complex and time-consuming, the author built **Evalry**, a tool to automate benchmarking across 300+ models, enabling users to quickly find more cost-effective alternatives.",
    "chinese_title": "不进行大语言模型基准测试，你很可能在支付过高费用。",
    "chinese_summary": "本文指出，企业若未针对具体任务对模型进行基准测试，使用LLM API的费用可能高出5-10倍。作者通过帮助朋友将每月1500美元的账单削减80%的实例说明了这一点。\n\n核心问题在于通用基准测试（如MMLU或SWE-Bench）无法预测企业在客户支持或数据提取等独特用例中的表现。唯一可靠的方法是使用实际提示词测试模型。\n\n作者详述了五步基准测试流程：\n1.  **收集**真实的提示词/响应示例。\n2.  **定义**明确、可衡量的优质输出标准。\n3.  **创建**包含提示词与预期响应的数据集。\n4.  **运行**该数据集测试多种模型（为简化流程可使用OpenRouter）。\n5.  **评分**：采用“LLM即裁判”方式评估响应，确保高效性与一致性。\n\n通过加入成本与延迟数据，可为每项任务确定最优模型。**帕累托前沿**概念有助于可视化最佳模型选择——即不存在其他模型同时更便宜且更优质。\n\n鉴于这一手动流程复杂耗时，作者开发了**Evalry**工具，可自动化测试300多个模型，帮助用户快速找到更具成本效益的替代方案。"
  },
  {
    "id": "46703763",
    "title": "EU–INC – A new pan-European legal entity",
    "url": "https://www.eu-inc.org/",
    "summary": "The EU–INC is a proposed new pan-European legal entity designed to overcome the regulatory fragmentation that currently hinders startups operating across the EU. It aims to create a single, standardized corporate structure with a central EU-level registry, uniform investment documents, and EU-wide stock options, while still respecting local tax and employment laws.\n\nThe initiative is backed by a coalition of founders, legal teams, and investors, and has gained significant political traction. It is supported by European Commission President Ursula von der Leyen, who has established a dedicated working group. The proposal has also been submitted to relevant EU Commissioners.\n\nThe legislative process is underway, with a Commission proposal expected in Q1 2026, followed by negotiations with the European Parliament and the Council of the EU (representing the 27 member states). Final implementation is targeted for 2027.\n\nA key challenge is securing unanimous support from all 27 national governments. Therefore, the campaign is calling on the European startup community to actively advocate for the EU–INC by engaging with national politicians and the press to highlight its necessity for Europe's competitiveness.",
    "chinese_title": "欧盟公司——全新的泛欧洲法律实体",
    "chinese_summary": "欧盟初创企业公司（EU–INC）是一项拟议的新型泛欧洲法律实体，旨在克服当前阻碍初创企业在欧盟范围内运营的监管碎片化问题。它致力于创建一个统一、标准化的公司结构，设立欧盟层面的中央注册机构，采用统一的投资文件，并推行覆盖全欧盟的股权激励方案，同时仍尊重各国的税收和劳动法。\n\n该倡议由创始人、法律团队和投资者组成的联盟支持，并已获得显著的政治关注。欧盟委员会主席乌尔苏拉·冯德莱恩对此表示支持，并设立了专门的工作组。该提案也已提交给相关的欧盟委员。\n\n立法程序正在进行中，预计欧盟委员会将在2026年第一季度提出正式提案，随后与欧洲议会和欧盟理事会（代表27个成员国）进行谈判。最终实施目标定于2027年。\n\n一个关键挑战是获得所有27个国家政府的一致支持。因此，该倡议呼吁欧洲初创企业界积极倡导EU–INC，通过接触各国政治人物和媒体，强调其对欧洲竞争力的必要性。"
  },
  {
    "id": "46662515",
    "title": "EmuDevz: A game about developing emulators",
    "url": "https://afska.github.io/emudevz/",
    "summary": "This text is not a full article but appears to be an error or loading screen for a web application called **\"EmuDevz: A game about developing emulators.\"**\n\nThe main points are:\n*   The core concept is a game where the player's task is to develop software emulators.\n*   The application requires JavaScript to be enabled in the user's browser to function.\n*   It is designed exclusively for desktop use, as indicated by the message \"This is a desktop-only experience!\"\n*   The user is encountering two access issues:\n    1.  Their browser window is too small to display the content properly.\n    2.  They are advised to press **Ctrl-** (the zoom-out shortcut) to adjust the view.\n\nIn summary, this is a notification screen for a desktop game that simulates emulator development, currently blocking the user due to technical requirements related to screen size and browser capabilities.",
    "chinese_title": "EmuDevz：一款关于开发模拟器的游戏",
    "chinese_summary": "此文本并非完整文章，而似乎是名为 **《EmuDevz：一款关于开发模拟器的游戏》** 的网页应用程序的错误提示或加载界面。\n\n主要内容包括：\n*   核心概念为一款游戏，玩家的任务是开发软件模拟器。\n*   该应用需要用户在浏览器中启用 JavaScript 才能正常运行。\n*   界面明确提示“此为仅限桌面端的体验！”，表明其专为桌面设备设计。\n*   用户当前遇到两个访问问题：\n    1.  浏览器窗口过小，无法正常显示内容。\n    2.  系统建议用户按下 **Ctrl-**（缩小快捷键）来调整视图。\n\n总而言之，这是一个桌面端模拟器开发游戏的提示界面，目前因屏幕尺寸和浏览器功能相关的技术要求而阻止了用户访问。"
  },
  {
    "id": "46703317",
    "title": "I Made Zig Compute 33M Satellite Positions in 3 Seconds. No GPU Required",
    "url": "https://atempleton.bearblog.dev/i-made-zig-compute-33-million-satellite-positions-in-3-seconds-no-gpu-required/",
    "summary": "This article details the optimization of the SGP4 satellite position prediction algorithm using Zig, resulting in a new library called `astroz`. The author achieved a significant performance leap, reaching 11-13 million propagations per second in native Zig and about 7 million per second through Python bindings, without requiring a GPU.\n\nKey optimizations included leveraging Zig's `comptime` for precomputing constants, writing branchless code for critical paths, and implementing Single Instruction, Multiple Data (SIMD) operations. Zig's straightforward SIMD support, using `@Vector` types and operations like `@select` for conditional logic, was crucial. The author developed three propagation modes: time-batched (multiple times for one satellite), satellite-batched (multiple satellites at one time), and a cache-optimized constellation mode for large-scale workloads.\n\nBenchmarks show `astroz` outperforms the leading Rust implementation and is 2-3x faster than the standard `python-sgp4` library. It is compared favorably to the high-performance `heyoka.py`, with each excelling in different scenarios: `heyoka.py` is faster for propagating many satellites at a single time, while `astroz` is superior for generating dense time-series data for individual satellites. The author emphasizes `astroz`'s ease of deployment as a simple `pip` install.",
    "chinese_title": "我用Zig在3秒内计算出3300万颗卫星位置，无需GPU。",
    "chinese_summary": "本文详细介绍了使用Zig语言优化SGP4卫星位置预测算法的过程，并由此创建了名为`astroz`的新库。作者实现了显著的性能飞跃：在原生Zig环境中每秒可完成1100万至1300万次轨道推算，通过Python绑定也能达到每秒约700万次，且无需GPU支持。\n\n关键优化包括：利用Zig的`comptime`机制预计算常数、为关键路径编写无分支代码，以及实现单指令多数据（SIMD）运算。Zig简洁的SIMD支持——通过`@Vector`类型和`@select`等条件逻辑操作——发挥了重要作用。作者开发了三种推算模式：时间批处理（单卫星多时间点）、卫星批处理（单时间点多卫星），以及针对大规模任务的缓存优化星座模式。\n\n基准测试显示，`astroz`性能优于领先的Rust实现，比标准`python-sgp4`库快2-3倍。与高性能库`heyoka.py`相比各有优势：`heyoka.py`在单时间点多卫星推算中更快，而`astroz`在生成单卫星密集时间序列数据时更优。作者特别强调`astroz`可通过简单的`pip`安装便捷部署。"
  },
  {
    "id": "46706668",
    "title": "Show HN: See the carbon impact of your cloud as you code",
    "url": "https://dashboard.infracost.io/",
    "summary": "**Summary:**\n\nInfracost is a tool that allows developers to see the estimated carbon footprint of their cloud infrastructure directly within their coding workflow. The core idea is to integrate environmental impact awareness into the development process, enabling engineers to make more sustainable choices as they design and provision resources.\n\nThe key information is that the tool requires JavaScript to run, suggesting it is a web-based application. While the provided text is minimal, the main point is clear: Infracost aims to bridge the gap between cloud infrastructure management and environmental responsibility by providing real-time carbon impact data during the coding phase. This allows teams to consider and potentially reduce the carbon emissions of their cloud deployments from the outset, alongside traditional cost and performance metrics.",
    "chinese_title": "展示HN：编码时实时查看云服务的碳影响",
    "chinese_summary": "**摘要：**\n\nInfracost 是一款工具，能让开发者在编码工作流中直接查看其云基础设施的预估碳足迹。其核心理念是将环境影响意识融入开发流程，使工程师在设计和配置资源时能做出更可持续的选择。\n\n关键信息是该工具需要 JavaScript 才能运行，这表明它是一个基于 Web 的应用程序。尽管提供的文本内容简洁，但主要观点明确：Infracost 旨在通过在编码阶段提供实时碳影响数据，弥合云基础设施管理与环境责任之间的鸿沟。这使得团队从一开始就能在考虑传统成本与性能指标的同时，评估并可能降低其云部署的碳排放。"
  },
  {
    "id": "46663931",
    "title": "Batmobile: 10-20x Faster CUDA Kernels for Equivariant Graph Neural Networks",
    "url": "https://elliotarledge.com/blog/batmobile",
    "summary": "Batmobile is a set of specialized CUDA kernels that dramatically accelerate the core operations of equivariant graph neural networks (GNNs), such as MACE and NequIP, which are used in molecular simulations and materials science. These models rely on spherical harmonics and Clebsch-Gordan tensor products to respect physical symmetries, but these operations are computationally expensive, often consuming 80% of a model's runtime.\n\nThe standard library, e3nn, suffers from inefficiencies like multiple small kernel launches, wasted memory bandwidth, and a lack of operation fusion. Batmobile overcomes these bottlenecks through three key optimizations: 1) baking all mathematical constants and loop bounds into the kernels at compile time, 2) computing spherical harmonics entirely within GPU registers to avoid global memory writes, and 3) fusing spherical harmonics and tensor product computations into a single kernel pass.\n\nThe result is significant speedups: spherical harmonics are 11.8x faster, tensor products are 20.8x faster, and backward passes are 20.6x faster on an RTX 3090. While less flexible than general-purpose libraries, Batmobile is designed specifically for the common case of maximum angular momentum L=3, making it a high-performance, specialized tool for production-scale atomistic machine learning workflows.",
    "chinese_title": "蝙蝠车：为等变图神经网络提供10-20倍加速的CUDA内核",
    "chinese_summary": "Batmobile是一套专用CUDA内核，能显著加速等变图神经网络（GNN）的核心运算（如MACE和NequIP），这些模型广泛应用于分子模拟和材料科学领域。此类模型依赖球谐函数和Clebsch-Gordan张量积来保持物理对称性，但这类计算成本高昂，通常消耗模型80%的运行时间。\n\n标准库e3nn存在多重低效问题：多次小型内核启动、内存带宽浪费以及运算融合缺失。Batmobile通过三项关键优化突破瓶颈：1) 在编译时将全部数学常数和循环边界固化至内核；2) 完全在GPU寄存器内计算球谐函数，避免全局内存写入；3) 将球谐函数与张量积计算融合为单次内核执行。\n\n由此实现显著加速：在RTX 3090上，球谐函数计算提速11.8倍，张量积运算提速20.8倍，反向传播提速20.6倍。虽然灵活性不及通用库，但Batmobile专为最大角动量L=3的常见场景设计，成为面向生产级原子尺度机器学习工作流的高性能专用工具。"
  },
  {
    "id": "46706796",
    "title": "Show HN: yolo-cage – AI coding agents that can't exfiltrate secrets",
    "url": "https://github.com/borenstein/yolo-cage",
    "summary": "**Summary:** yolo-cage is a tool that enables the safe use of autonomous AI coding agents (like Claude Code in \"YOLO\" mode) by running them in an isolated, controlled environment. It addresses the security risks and user fatigue of manually approving every potentially dangerous action by limiting the agent's ability to cause harm.\n\nThe system creates a sandboxed virtual machine (using Vagrant and MicroK8s) for each development branch. Within this sandbox, all outbound traffic from the AI agent is filtered through an egress proxy that blocks attempts to exfiltrate secrets (like API keys and tokens) via HTTP/HTTPS. A dispatcher component enforces strict git and GitHub CLI rules, ensuring the agent can only push to its assigned branch and cannot perform dangerous repository operations (e.g., merging PRs, deleting repos).\n\nKey features include branch isolation, pre-push secret scanning, and port forwarding for accessing web apps from the sandbox. The tool requires prerequisites like Vagrant, adequate system resources, and scoped GitHub/Claude credentials.\n\nThe authors emphasize that yolo-cage **reduces but does not eliminate risk**, noting limitations like potential DNS exfiltration or sophisticated encoding attacks. It is designed to shift security decisions to the PR review stage, allowing developers to use powerful AI agents while containing their \"blast radius.\"",
    "chinese_title": "展示HN：yolo-cage – 无法泄露秘密的AI编码助手",
    "chinese_summary": "**摘要：** yolo-cage 是一款工具，通过在隔离可控的环境中运行自主 AI 编码代理（如 Claude Code 的“YOLO”模式），实现其安全使用。它通过限制代理造成损害的能力，解决了手动批准每个潜在危险操作带来的安全风险和用户疲劳问题。\n\n该系统为每个开发分支创建一个沙盒化虚拟机（使用 Vagrant 和 MicroK8s）。在此沙盒内，AI 代理的所有出站流量均经过出口代理过滤，以阻止其通过 HTTP/HTTPS 外泄密钥（如 API 密钥和令牌）。调度器组件强制执行严格的 git 和 GitHub CLI 规则，确保代理仅能推送至其分配的分支，且无法执行危险的仓库操作（例如合并 PR、删除仓库）。\n\n主要功能包括分支隔离、推送前密钥扫描以及用于从沙盒访问 Web 应用的端口转发。该工具需要 Vagrant、充足的系统资源及限定范围的 GitHub/Claude 凭证等先决条件。\n\n作者强调，yolo-cage **能降低但无法完全消除风险**，并指出其存在潜在 DNS 外泄或复杂编码攻击等局限性。该工具旨在将安全决策转移至 PR 审查阶段，使开发者能够在控制“影响范围”的同时使用强大的 AI 代理。"
  },
  {
    "id": "46705715",
    "title": "Ireland wants to give its cops spyware, ability to crack encrypted messages",
    "url": "https://www.theregister.com/2026/01/21/ireland_wants_to_give_police/",
    "summary": "The Irish government is proposing new legislation, the Communications (Interception and Lawful Access) Bill, to significantly expand police surveillance powers. The bill aims to replace outdated 1993 laws and explicitly bring all modern communications—including encrypted messages from platforms like email and messaging apps—within the scope of lawful interception.\n\nKey proposals include granting law enforcement the ability to use spyware under strict conditions, such as judicial approval, and to deploy technology like IMSI catchers to scan electronic equipment in specific locations. The government promises robust legal safeguards and cites the need to combat serious crime.\n\nHowever, the announcement has drawn sharp criticism from privacy advocates and technologists. Groups like the Irish Council for Civil Liberties warn that the \"extraordinary reach\" of these powers poses a severe threat to rights and freedoms. Critics also highlight the technical impossibility of creating an encryption \"backdoor\" without undermining end-to-end encryption entirely, a stance supported by services like Signal and Tuta Mail. The move follows recent Irish proposals to expand police use of biometric technology, raising concerns about the normalization of extensive surveillance.",
    "chinese_title": "爱尔兰计划为警方配备间谍软件，赋予其破解加密信息的能力。",
    "chinese_summary": "爱尔兰政府正提议制定新法案《通信（拦截与合法访问）法案》，以大幅扩展警方监控权限。该法案旨在取代1993年的过时法律，明确将包括电子邮件和即时通讯应用等平台的加密信息在内的所有现代通信纳入合法拦截范围。\n\n关键提议包括：在司法批准等严格条件下，允许执法部门使用间谍软件，并部署如IMSI捕捉器等技术扫描特定区域的电子设备。政府承诺将提供强有力的法律保障，并称此举是打击严重犯罪所需。\n\n然而，该公告已引发隐私倡导者和技术专家的强烈批评。爱尔兰公民自由委员会等组织警告称，这些权力的“过度延伸”将对权利与自由构成严重威胁。批评者还指出，在不完全破坏端到端加密的情况下创建加密“后门”在技术上不可行，这一立场得到了Signal和Tuta Mail等服务的支持。此举紧随爱尔兰近期扩大警方使用生物识别技术的提案，引发了人们对广泛监控常态化的担忧。"
  },
  {
    "id": "46700503",
    "title": "RSS.Social – the latest and best from small sites across the web",
    "url": "https://rss.social/",
    "summary": "**Summary:**\n\nSony's television business is reportedly being overtaken by TCL in terms of global market share, marking a significant shift in the industry. While Sony is renowned for its premium, high-performance TVs, particularly with its advanced processing and OLED models, it has struggled to compete on volume and price in the broader market.\n\nTCL, a Chinese manufacturer, has achieved this by aggressively pursuing a strategy focused on offering feature-rich, large-screen TVs at highly competitive prices. Its success is driven by controlling its own supply chain, including panel production, which allows for greater cost efficiency. TCL has effectively captured the value and mid-range segments of the market, areas where Sony's presence is minimal.\n\nThe article highlights that this doesn't signal the end for Sony's TV division, which remains profitable and leads in the high-end segment. However, it illustrates a broader industry trend where scale, cost control, and value positioning are winning over brand prestige alone in the volume-driven TV market. Sony's challenge is its reliance on the premium tier, while TCL's vertically integrated model allows it to dominate sales volume worldwide.",
    "chinese_title": "RSS.Social – 汇集全网小众站点的最新与精选内容",
    "chinese_summary": "**摘要：**\n\n据报道，索尼的电视业务在全球市场份额上正被TCL超越，这标志着行业内的重大转变。尽管索尼以其高端、高性能电视而闻名，尤其是在先进图像处理和OLED机型方面，但在更广泛的市场中，索尼难以在销量和价格上展开竞争。\n\n中国制造商TCL通过积极推行以极具竞争力的价格提供功能丰富的大屏电视的策略，实现了这一超越。其成功得益于对包括面板生产在内的自有供应链的控制，这带来了更高的成本效益。TCL有效地占领了市场中的价值和中等价位细分领域，而这些领域索尼的存在感微乎其微。\n\n文章强调，这并不意味着索尼电视部门的终结，该部门仍然盈利并在高端市场保持领先。然而，这揭示了一个更广泛的行业趋势：在销量驱动的电视市场中，规模、成本控制和价值定位正逐渐超越单纯的品牌声誉。索尼面临的挑战在于其过度依赖高端市场，而TCL的垂直整合模式使其得以在全球销量上占据主导地位。"
  },
  {
    "id": "46665987",
    "title": "200 MB RAM FreeBSD desktop",
    "url": "https://vermaden.wordpress.com/2026/01/18/200-mb-ram-freebsd-desktop/",
    "summary": "This article details a project to create a minimal FreeBSD desktop environment using under 200 MB of RAM, inspired by a similar low-resource Linux distribution. The author uses FreeBSD 15.0 with a UFS filesystem and replaces the standard Xorg server with the XLibre X11 server.\n\nKey configuration steps include optimizing system files (`/boot/loader.conf`, `/etc/rc.conf`, `/etc/sysctl.conf`) to disable unnecessary services and enable power management. The desktop consists of the Openbox window manager, Tint2 and Dzen2 panels, and a few essential packages like `xterm` and `htop`. No graphical login manager is used; X11 is started directly via `xinit`.\n\nAfter booting, the desktop idles at approximately **206 MB** of RAM usage. In a follow-up test with the system constrained to only **220 MB** of total RAM, the desktop used just **134 MB**, demonstrating efficient memory management. The author concludes that further reductions are possible by recompiling the FreeBSD kernel, but the setup already achieves a highly functional, ultra-low-resource desktop.",
    "chinese_title": "200 MB 内存的 FreeBSD 桌面",
    "chinese_summary": "本文详述了一个受类似低资源Linux发行版启发、旨在创建内存占用低于200 MB的极简FreeBSD桌面环境的项目。作者使用FreeBSD 15.0搭配UFS文件系统，并以XLibre X11服务器替代标准Xorg服务器。\n\n关键配置步骤包括优化系统文件（`/boot/loader.conf`、`/etc/rc.conf`、`/etc/sysctl.conf`）以禁用非必要服务并启用电源管理。桌面环境由Openbox窗口管理器、Tint2和Dzen2面板以及`xterm`、`htop`等基础软件包构成。未采用图形登录管理器，而是通过`xinit`直接启动X11。\n\n启动后桌面空闲内存占用约为**206 MB**。在后续将系统总内存限制为**220 MB**的测试中，桌面仅占用**134 MB**，展现了高效的内存管理能力。作者总结指出，通过重新编译FreeBSD内核可进一步降低资源占用，但当前配置已实现功能完善、资源占用极低的桌面环境。"
  },
  {
    "id": "46703301",
    "title": "SETI@home is in hiberation",
    "url": "https://setiathome.berkeley.edu/",
    "summary": "**Summary of SETI@home Article**\n\nSETI@home, the pioneering distributed computing project from UC Berkeley that allowed volunteers to analyze radio telescope data in the search for extraterrestrial intelligence (SETI), is now in hibernation. The project has stopped distributing new data analysis tasks to users.\n\nDespite this shift, the project team will continue its back-end data analysis and maintain the online message boards. They express gratitude to all volunteers and encourage continued participation in other scientific distributed computing projects.\n\nThe article provides background: SETI@home was a scientific experiment that used the idle processing power of internet-connected personal computers worldwide to sift through data from the Arecibo Observatory (and later the Green Bank Telescope) for potential signals from intelligent civilizations.\n\nAdditional key points include:\n*   Recent scientific papers on SETI@home's methodology and findings have been accepted for publication.\n*   The project acknowledges the passing of former U.S. President Jimmy Carter, who authored a hopeful message placed on the Voyager spacecraft.\n*   It highlights a related ongoing citizen science project at UCLA, where volunteers can help classify radio frequency interference.\n*   The project was funded by grants from the National Science Foundation, NASA, and volunteer donations.\n\nIn essence, the active data-crunching phase of SETI@home has concluded, but the team remains engaged in final analysis and community discussion, celebrating its legacy as a landmark in public participation in science.",
    "chinese_title": "SETI@home已进入休眠状态",
    "chinese_summary": "**SETI@home项目文章摘要**\n\nSETI@home是加州大学伯克利分校开创性的分布式计算项目，曾让志愿者通过分析射电望远镜数据来搜寻地外文明（SETI），目前该项目已进入休眠状态，并停止向用户分发新的数据分析任务。\n\n尽管项目状态有所转变，团队仍将继续进行后端数据分析，并维持在线留言板的运行。他们对所有志愿者表示感谢，并鼓励大家继续参与其他科学分布式计算项目。\n\n文章背景介绍：SETI@home是一项科学实验，曾利用全球联网个人计算机的闲置处理能力，对阿雷西博天文台（及后来的绿岸望远镜）的数据进行筛选，以寻找可能来自智慧文明的信号。\n\n其他要点包括：\n*   近期关于SETI@home研究方法与成果的科学论文已被接受发表。\n*   项目缅怀了美国前总统吉米·卡特，他曾为旅行者号飞船撰写充满希望的信息。\n*   文章提及加州大学洛杉矶分校一项相关的持续进行的公民科学项目，志愿者可协助分类射频干扰。\n*   项目资金来自美国国家科学基金会、美国国家航空航天局的资助以及志愿者捐款。\n\n本质上，SETI@home活跃的数据处理阶段已告一段落，但团队仍在进行最终分析与社区讨论，并颂扬其作为公众参与科学里程碑的宝贵遗产。"
  }
]