[
  {
    "id": "46556210",
    "title": "Show HN: I made a memory game to teach you to play piano by ear",
    "url": "https://lend-me-your-ears.specr.net",
    "summary": "**Summary of \"Lend Me Your Ears\"**\n\n\"Lend Me Your Ear\" is a web-based memory game designed to teach users to play piano by ear. The core concept is to replace traditional card-matching with matching musical notes and chords by their sound.\n\nThe game presents a grid of cards, each representing a musical note or chord. Players click to \"flip\" a card and hear its sound, then try to find its matching pair based on auditory memory rather than visual symbols. This process trains the user's ear to recognize and differentiate between pitches and harmonies.\n\nThe creator built the game to address the common difficulty of playing by ear, offering a gamified, low-pressure alternative to traditional ear training exercises. It is accessible directly in a web browser with no installation required, making it an easy entry point for beginners.\n\nKey features include multiple difficulty levels (progressing from single notes to complex chords), a clean and simple interface, and immediate auditory feedback. The project is presented as a Show HN post, inviting the community to try the game and provide feedback on the concept and its execution as a learning tool.",
    "chinese_title": "Show HN：我制作了一款记忆游戏，教你用耳朵弹钢琴",
    "chinese_summary": "**《借我一耳》概要**\n\n《借我一耳》是一款基于网页的记忆游戏，旨在通过听觉训练帮助用户学习钢琴。其核心理念是用匹配音符与和弦的声音，替代传统的卡片配对玩法。\n\n游戏呈现一个卡片网格，每张卡片代表一个音符或和弦。玩家点击“翻转”卡片聆听其声音，然后依靠听觉记忆（而非视觉符号）寻找与之匹配的配对。这一过程训练用户识别和区分音高与和声的能力。\n\n创作者开发此游戏是为了解决常见的“凭听觉演奏”难题，提供了一种游戏化、低压力的传统听音训练替代方案。该游戏可直接在网页浏览器中运行，无需安装，为初学者提供了便捷的学习入口。\n\n主要功能包括多难度级别（从单音到复杂和弦逐步进阶）、简洁直观的界面设计以及即时听觉反馈。该项目以“Show HN”帖文形式发布，邀请社区体验游戏，并就其作为学习工具的理念与实现提供反馈。"
  },
  {
    "id": "46557489",
    "title": "JavaScript Demos in 140 Characters",
    "url": "https://www.dwitter.net/top",
    "summary": "This article showcases a collection of JavaScript demos from the platform Dwitter, where developers create visual animations in 140 characters of code or less. Each demo is defined by a `u(t)` function that runs 60 times per second, using provided shorthand functions (like `S` for `Math.sin`) and a canvas for rendering.\n\nKey themes among the featured demos include festive \"Dweetmas\" scenes, ASCII art, generative patterns like \"Rooms\" and \"Backrooms,\" and remixes where users build upon each other's work. The community actively engages through comments, sharing, and remixing creations.\n\nThe platform interface includes controls to show/hide FPS, record, share, view in fullscreen, and navigate through pages of demos. A current theme challenge, \"#Food,\" is noted, encouraging user participation around specific topics.",
    "chinese_title": "JavaScript 140字符演示集",
    "chinese_summary": "本文展示了来自Dwitter平台的一系列JavaScript演示，该平台让开发者用140个字符或更少的代码创作视觉动画。每个演示都通过一个每秒运行60次的`u(t)`函数定义，使用平台提供的简写函数（如用`S`代表`Math.sin`）并在画布上渲染。\n\n精选演示的主题包括节日气息的“Dweetmas”场景、ASCII艺术、生成式图案如“房间”与“后室”，以及用户相互借鉴创作的混搭作品。社区通过评论、分享和混搭创作积极参与互动。\n\n平台界面包含显示/隐藏帧率、录制、分享、全屏查看及浏览演示页面等控制功能。当前主题挑战“#食物”正在开展，鼓励用户围绕特定主题进行创作。"
  },
  {
    "id": "46557823",
    "title": "Show HN: EuConform – Offline-first EU AI Act compliance tool (open source)",
    "url": "https://github.com/Hiepler/EuConform",
    "summary": "**EuConform** is an open-source, offline-first tool designed to help developers and organizations navigate the technical requirements of the EU AI Act. It operates entirely within a user's browser or local environment, ensuring data privacy by never sending information to external servers.\n\nThe tool's core features include:\n*   **Risk Classification:** An interactive quiz to classify AI systems according to the Act's prohibited and high-risk categories (Articles 5, 6, and Annex III).\n*   **Bias Detection:** Implements the scientific CrowS-Pairs methodology to measure social biases in language models using log-probability analysis.\n*   **Compliance Reports:** Generates technical documentation in-browser that aligns with the structure required by Annex IV of the Act.\n\nThe project emphasizes that it provides **technical guidance only and is not a substitute for legal advice or official conformity assessments**. It is built with a modern tech stack (Next.js, TypeScript, Turborepo) and prioritizes accessibility (WCAG 2.2 AA) and multilingual support (English/German).\n\nFor enhanced bias detection, users can optionally connect it to a local AI model via Ollama. The tool is dual-licensed under MIT and EUPL-1.2, and the developers welcome contributions from the community.",
    "chinese_title": "展示 HN：EuConform——离线优先的欧盟人工智能法案合规工具（开源）",
    "chinese_summary": "**EuConform** 是一款开源、优先离线的工具，旨在帮助开发者和组织应对《欧盟人工智能法案》的技术要求。该工具完全在用户浏览器或本地环境中运行，通过绝不向外部服务器发送信息来确保数据隐私。\n\n其核心功能包括：\n*   **风险分类：** 通过互动式问卷，根据法案的禁止类和高风险类别（第5条、第6条及附件III）对人工智能系统进行分类。\n*   **偏见检测：** 采用科学的 CrowS-Pairs 方法，通过对数概率分析来测量语言模型中的社会偏见。\n*   **合规报告：** 在浏览器内生成符合法案附件IV要求结构的技术文档。\n\n该项目强调，其**仅提供技术指导，不能替代法律建议或官方合规性评估**。它采用现代技术栈（Next.js、TypeScript、Turborepo）构建，并优先考虑无障碍访问（WCAG 2.2 AA）和多语言支持（英语/德语）。\n\n为增强偏见检测功能，用户可选择通过 Ollama 将其连接到本地 AI 模型。该工具采用 MIT 和 EUPL-1.2 双重许可，开发者欢迎社区贡献。"
  },
  {
    "id": "46557057",
    "title": "AI Zealotry",
    "url": "https://matthewrocklin.com/ai-zealotry/",
    "summary": "This article advocates for experienced developers to embrace AI-assisted coding, arguing that it enhances productivity and enjoyment by automating tedious tasks and enabling work in new domains. The author acknowledges valid concerns—like AI generating low-quality code and reducing deep understanding—but compares this transition to moving from assembly to higher-level languages, where gains outweigh losses.\n\nKey strategies include using \"hooks\" to automate repetitive permissions and commands, thereby minimizing interruptions and climbing the abstraction ladder. The author emphasizes building confidence in AI-generated code through rigorous testing, self-review, and proactive questioning, rather than manually reviewing every line. They also recommend documenting plans and creating durable, AI-readable documentation to guide development.\n\nAdditionally, the article suggests that AI diminishes Python's usability advantages, making Rust (for performance) and TypeScript (for frontend) more appealing. The overarching advice is to \"think hard and write clearly\"—creating thorough design documents—as clarity enables effective AI collaboration. The goal is to construct feedback systems that leverage AI's diligence and lack of ego to produce high-quality work efficiently.",
    "chinese_title": "AI狂热",
    "chinese_summary": "本文主张经验丰富的开发者应接纳AI辅助编程，认为它通过自动化繁琐任务并赋能新领域工作，能提升生产力与工作乐趣。作者承认存在合理担忧——例如AI可能生成低质量代码或削弱深层理解——但将这一转型比作从汇编语言转向高级语言，认为收益远大于损失。\n\n核心策略包括运用“钩子”自动化重复性权限与命令操作，从而减少干扰并提升抽象层级。作者强调应通过严格测试、自我审查和主动提问来建立对AI生成代码的信心，而非逐行人工检查。同时建议记录开发计划并创建持久化、AI可读的文档来指导开发。\n\n此外，文章指出AI削弱了Python的易用性优势，使得Rust（追求性能）和TypeScript（前端开发）更具吸引力。贯穿始终的建议是“深入思考，清晰表述”——即创建详尽的设计文档——因为清晰的思路能促成高效的AI协作。最终目标是构建反馈系统，利用AI的严谨性和无主观偏见特性，高效产出高质量成果。"
  },
  {
    "id": "46547962",
    "title": "Scientists discover oldest poison, on 60k-year-old arrows",
    "url": "https://www.nytimes.com/2026/01/07/science/poison-arrows-south-africa.html",
    "summary": "**Summary of \"Scientists discover oldest poison, on 60k-year-old arrows\"**\n\nA groundbreaking archaeological discovery in South Africa has revealed the earliest known evidence of humans using poison on their hunting tools. Researchers analyzed a collection of 60,000-year-old bone arrowheads found in a cave near the country's southern coast.\n\nThe key finding was the detection of toxic chemical residue on several of these ancient artifacts. Scientific analysis identified traces of a poisonous compound derived from the castor bean plant (*Ricinus communis*). This indicates that the Late Stone Age inhabitants of the region were not only crafting sophisticated bone-tipped projectiles but were also applying plant-based toxins to increase their lethality.\n\nThis discovery pushes back the known timeline for the use of poison in hunting technology by approximately 20,000 years. It provides significant insight into the advanced cognitive abilities and practical knowledge of early humans. The use of poison represents a complex process of understanding plant properties, toxin extraction, and application to weapons—a major innovation in hunting strategy.\n\nThe findings suggest that these early humans were highly resourceful, employing a multi-component technology (bone points, wood shafts, adhesive, and poison) to gain an advantage in hunting, potentially allowing them to bring down larger prey more efficiently. This discovery underscores the technological sophistication of human societies in Africa long before the emergence of agriculture.",
    "chinese_title": "科学家在六万年前的箭头上发现最古老的毒药。",
    "chinese_summary": "**《科学家在六万年前箭头上发现最古老毒药》摘要**\n\n南非一项突破性考古发现揭示了人类在狩猎工具上使用毒药的最早已知证据。研究人员分析了在该国南部海岸附近洞穴中发现的一批六万年前的骨制箭头。\n\n关键发现在于检测到这些古老器物上残留的有毒化学物质。科学分析识别出来自蓖麻植物的有毒化合物痕迹，这表明该地区的旧石器时代晚期居民不仅制作了精密的骨尖投掷武器，还使用了植物性毒素以增强其杀伤力。\n\n这一发现将人类狩猎技术中使用毒药的时间线提前了约两万年，为了解早期人类的先进认知能力和实践知识提供了重要线索。毒药的使用涉及理解植物特性、提取毒素并应用于武器的复杂过程，是狩猎策略的一项重大创新。\n\n研究结果表明，这些早期人类极具智慧，他们运用多部件技术（骨制箭尖、木制箭杆、粘合剂和毒药）来提升狩猎优势，可能因此能更高效地捕杀大型猎物。这一发现强调了非洲人类社会在农业出现之前很久就已具备的技术复杂性。"
  },
  {
    "id": "46557879",
    "title": "Show HN: Rocket Launch and Orbit Simulator",
    "url": "https://www.donutthejedi.com/",
    "summary": "This is a web-based orbital rocket simulator that allows users to launch and maneuver a rocket in a realistic physics environment. The interface provides real-time telemetry data (altitude, velocity, acceleration, etc.) and features three primary modes of operation.\n\nUsers can perform a **Manual Control** launch, directly piloting the rocket's pitch with keyboard controls. Alternatively, a **Guided Launch** mode automates the ascent to a user-specified target altitude. For practicing orbital mechanics, an **Orbital Mode** lets users spawn directly into a stable orbit at various altitudes (200-800 km).\n\nOnce in orbit, the simulator provides controls for executing precise orbital maneuvers (prograde, retrograde, normal, anti-normal, radial, and anti-radial burns) to change the spacecraft's trajectory, along with an option to refuel.\n\nThe core experience is built around a dynamic visual simulation with zoom and camera-follow options, accompanied by a detailed data readout and a log of mission events.",
    "chinese_title": "展示 HN：火箭发射与轨道模拟器",
    "chinese_summary": "这是一款基于网络的轨道火箭模拟器，允许用户在真实的物理环境中发射并操控火箭。界面提供实时遥测数据（高度、速度、加速度等），并设有三种主要操作模式。\n\n用户可选择**手动控制**发射，通过键盘直接操控火箭俯仰角；或使用**制导发射**模式，自动将火箭上升至用户设定的目标高度。为练习轨道力学，**轨道模式**允许用户直接生成不同高度（200-800公里）的稳定轨道。\n\n进入轨道后，模拟器提供精确轨道机动控制（顺行、逆行、法向、反法向、径向与反径向点火）以改变航天器轨迹，并配有燃料补充选项。\n\n核心体验围绕动态视觉模拟构建，支持缩放与镜头跟随功能，同时配有详细数据面板和任务事件日志。"
  },
  {
    "id": "46554652",
    "title": "How to store a chess position in 26 bytes (2022)",
    "url": "https://ezzeriesa.notion.site/How-to-store-a-chess-position-in-26-bytes-using-bit-level-magic-df1fdb5364eb42fdac11eb23b25e9605",
    "summary": "This article explains a method to store a chess position in just 26 bytes, which is more efficient than the standard 70-byte FEN notation.\n\nThe key insight is to store only the essential information: piece placement, active color, castling rights, and en passant target square. It omits move counts, as they are not needed to define the board state.\n\nThe technique uses **bitboards**, where each of the 64 squares is represented by a single bit across multiple 64-bit integers. One set of bitboards identifies the type of piece (pawn, knight, etc.), while another identifies their color. By using clever bit packing and compression (like Huffman coding for the piece types), the author reduces the total data to 26 bytes.\n\nThe summary of the storage breakdown is:\n*   13 bytes for the piece placement bitboards.\n*   1 byte for the active color and castling rights.\n*   1 byte for the en passant target square (if any).\n*   11 bytes of overhead for the Huffman coding tree structure.\n\nThis compact representation is useful for applications like game databases, AI training, or network transmission where storage and bandwidth are at a premium.",
    "chinese_title": "如何用26字节存储一个棋局位置（2022）",
    "chinese_summary": "本文介绍了一种仅用26字节存储国际象棋棋局的方法，比标准的70字节FEN表示法更高效。\n\n其核心在于仅存储必要信息：棋子位置、行棋方、王车易位权及吃过路兵目标格。该方法省略了回合计数，因为这些信息并非定义棋盘状态所必需。\n\n该技术采用**位棋盘**，即通过多个64位整数中的单个比特来表示64个棋盘格。一组位棋盘标识棋子类型（兵、马等），另一组标识棋子颜色。作者通过巧妙的比特打包与压缩技术（如对棋子类型采用霍夫曼编码），将总数据量压缩至26字节。\n\n存储结构概要如下：\n*   13字节用于棋子位置位棋盘\n*   1字节用于行棋方与王车易位权\n*   1字节用于吃过路兵目标格（若存在）\n*   11字节用于霍夫曼编码树结构开销\n\n这种紧凑表示法适用于游戏数据库、AI训练或网络传输等对存储空间与带宽要求严苛的应用场景。"
  },
  {
    "id": "46492019",
    "title": "The (likely?) cheapest home-made Michelson interferometer",
    "url": "https://guille.site/posts/3d-printed-michelson/",
    "summary": "This article details the author's project to create an inexpensive, 3D-printed Michelson interferometer. The device, used to measure minute distance changes via light interference, is typically built with costly lab equipment. The author's goal was to make it accessible using a 3D printer and affordable components from Amazon.\n\nThe core challenge was designing functional kinematic mirror mounts, which allow precise mirror alignment. The author's solution uses 3D-printed parts, thumbscrews, nuts, and tension springs to create an adjustable three-point plane for the mirror.\n\nThe final bill of materials is under $3 (or under $20 if including a purchased beam splitter, though a cheaper microscope slide can substitute). Required parts include PLA filament, a diode laser, two small mirrors, a beam splitter, screws, nuts, springs, and rods. The assembly is straightforward once the parts are printed.\n\nThe author highlights this as an ideal 3D-printing project because it tests design and tolerances for robustness without being overly complex. The complete CAD files and code are shared on GitHub, enabling others to replicate this low-cost educational tool for demonstrating optical principles.",
    "chinese_title": "（可能是？）最便宜的自制迈克尔逊干涉仪",
    "chinese_summary": "本文详述了作者利用3D打印技术制作低成本迈克尔逊干涉仪的项目。该装置通常需借助昂贵的实验室设备构建，用于通过光干涉测量微小的距离变化。作者的目标是仅使用3D打印机和从亚马逊采购的廉价元件实现该装置的可及性。\n\n核心挑战在于设计功能性的运动学镜架，以实现镜片的精密校准。作者的解决方案采用3D打印部件、蝶形螺丝、螺母和张力弹簧，构建出可调节的三点镜片平面。\n\n最终材料成本低于3美元（若包含采购的分束器则低于20美元，但可用更便宜的显微镜载玻片替代）。所需部件包括PLA线材、二极管激光器、两片小镜片、分束器、螺丝、螺母、弹簧和金属杆。所有部件打印完成后，组装过程十分简便。\n\n作者强调这是一个理想的3D打印项目，既能测试设计的稳健性和公差容限，又不会过于复杂。完整的CAD文件和代码已在GitHub上开源，使他人能够复现这个用于演示光学原理的低成本教学工具。"
  },
  {
    "id": "46555963",
    "title": "The Vietnam government has banned rooted phones from using any banking app",
    "url": "https://xdaforums.com/t/discussion-the-root-and-mod-hiding-fingerprint-spoofing-keybox-stealing-cat-and-mouse-game.4425939/page-118",
    "summary": "This article is not about a government ban on rooted phones. Instead, it is a technical support forum discussion where a user is troubleshooting an issue with updating apps via the Google Play Store on a modified Android device.\n\nThe main points are:\n*   A user is experiencing an error stating \"not enough room\" when trying to update apps, even after clearing caches and rebooting.\n*   The problem is linked to **Magisk modules or spoofing tools** (specifically \"PI,\" likely referring to Play Integrity bypass modules like Play Integrity Fix).\n*   The helper suggests the user identify which specific spoofing module they are using (e.g., PI Fork, PI Fix Inject) to diagnose the conflict causing the storage error.\n*   The context implies the user has a rooted or modded device (Xiaomi phones are mentioned), and the troubleshooting is related to maintaining Google Play functionality while using such modifications.\n\n**Key Information:** The core issue is a technical conflict between system modification tools and the Google Play Store's update process, not a policy announcement.",
    "chinese_title": "越南政府已禁止已获取Root权限的手机使用任何银行应用。",
    "chinese_summary": "本文并非关于政府禁止已获取root权限的手机。相反，这是一篇技术支持论坛的讨论，用户正在排查一台经过修改的安卓设备上通过Google Play商店更新应用时遇到的问题。\n\n主要内容包括：\n*   用户在尝试更新应用时遇到“存储空间不足”的错误提示，即使已清理缓存并重启设备。\n*   该问题与**Magisk模块或伪装工具**相关（具体提到“PI”，很可能指Play Integrity Fix等绕过Play Integrity检测的模块）。\n*   帮助者建议用户确认正在使用的具体伪装模块（例如PI Fork、PI Fix Inject），以诊断导致存储空间错误的冲突来源。\n*   上下文暗示用户使用的是已获取root权限或经过修改的设备（文中提及小米手机），且此次排查旨在解决使用此类修改工具时保持Google Play功能正常的问题。\n\n**关键信息：** 核心问题是系统修改工具与Google Play商店更新过程之间的技术冲突，而非政策声明。"
  },
  {
    "id": "46549333",
    "title": "Show HN: Various shape regularization algorithms",
    "url": "https://github.com/nickponline/shreg",
    "summary": "**shreg** is a Python library for shape regularization, a technique that cleans up noisy or imprecise geometric data. It offers several algorithms to align line segments and simplify contours, producing cleaner, more regular shapes suitable for CAD, mesh generation, and computational geometry.\n\nKey features include:\n*   **Segment Regularization:** Aligns segment angles and positions using quadratic programming.\n*   **Snap Regularization:** Connects nearby endpoints to create watertight polygons.\n*   **Metric Regularization:** Enforces constraints like equal lengths, length quantization, and equal spacing.\n*   **Contour Regularization:** Simplifies closed polygons by aligning edges to principal directions.\n*   **T-Junction Detection:** Snaps endpoints onto the interior of other segments.\n\nThe library is dependency-free for core functionality and includes visualization tools. It formulates regularization as an energy minimization problem solved via quadratic programming, balancing fidelity to the original data with geometric regularity. Use cases include architectural drawing cleanup, generating clean meshes from sketches, and vector graphic simplification.",
    "chinese_title": "展示 HN：多种形状正则化算法",
    "chinese_summary": "**shreg** 是一个用于形状正则化的 Python 库，该技术旨在清理有噪声或不精确的几何数据。它提供多种算法来对齐线段并简化轮廓，从而生成更干净、更规则的形状，适用于 CAD、网格生成和计算几何。\n\n主要功能包括：\n*   **线段正则化：** 使用二次规划对齐线段的角度和位置。\n*   **端点吸附正则化：** 连接邻近的端点以形成封闭多边形。\n*   **度量正则化：** 强制执行等长、长度量化和等间距等约束。\n*   **轮廓正则化：** 通过将边对齐到主方向来简化闭合多边形。\n*   **T 型连接点检测：** 将端点吸附到其他线段的内部。\n\n该库的核心功能无外部依赖，并包含可视化工具。它将正则化问题表述为通过二次规划求解的能量最小化问题，在保持对原始数据的保真度与几何规则性之间取得平衡。应用场景包括建筑图纸清理、从草图生成干净网格以及矢量图形简化。"
  },
  {
    "id": "46556822",
    "title": "Replit (YC W18) Is Hiring",
    "url": "https://jobs.ashbyhq.com/replit",
    "summary": "**Summary:**\n\nReplit, a Y Combinator-backed company (W18), is currently hiring. The job listings are hosted on a dedicated \"Replit Jobs\" page. The primary content of the page is a web application that requires JavaScript to be enabled in the user's browser to function and display the available job opportunities. No specific details about the roles, locations, or company initiatives are provided in the given text. The core information is simply that Replit has open positions and interested candidates must visit their jobs portal, ensuring their browser supports JavaScript to view and apply for the roles.",
    "chinese_title": "Replit（YC W18）正在招聘",
    "chinese_summary": "**摘要：**\n\nReplit是一家获得Y Combinator支持的公司（W18批次），目前正在招聘。职位列表发布在专门的“Replit Jobs”页面上。该页面的主要内容是一个网络应用程序，需要用户在浏览器中启用JavaScript才能正常显示可用的职位机会。给定文本中未提供有关具体职位、工作地点或公司计划的详细信息。核心信息仅为Replit有职位空缺，感兴趣的候选人必须访问其招聘门户网站，并确保浏览器支持JavaScript以查看和申请这些职位。"
  },
  {
    "id": "46557233",
    "title": "Exercise can be nearly as effective as therapy for depression",
    "url": "https://www.sciencedaily.com/releases/2026/01/260107225516.htm",
    "summary": "A major Cochrane review of 73 clinical trials involving nearly 5,000 adults with depression found that exercise can be nearly as effective as psychological therapy in reducing symptoms. The analysis suggests exercise may also offer benefits comparable to antidepressant medication, though the evidence for this is less certain.\n\nThe review concluded that light to moderate-intensity physical activity over multiple sessions (between 13 and 36) appears most beneficial. No single exercise type was clearly superior, but programs combining different activities and resistance training seemed more effective than aerobic exercise alone. Reported side effects were minimal, typically limited to occasional muscle or joint injuries.\n\nResearchers emphasize that exercise is a safe, low-cost, and accessible option for managing depression, but caution that it is not a universal cure. The findings are consistent with earlier reviews, but the authors note that many studies were small, limiting definitive conclusions. More high-quality, long-term research is needed to determine which exercise types work best for specific individuals and whether benefits are sustained over time.",
    "chinese_title": "运动对抑郁症的疗效几乎可与心理治疗相媲美。",
    "chinese_summary": "一项大型Cochrane综述分析了涉及近5000名成年抑郁症患者的73项临床试验，发现运动在减轻症状方面几乎与心理疗法同样有效。分析表明，运动的效果可能与抗抑郁药物相当，尽管这方面的证据尚不充分。\n\n该综述指出，进行13至36次中低强度体育活动似乎最为有益。没有单一运动类型明显优于其他，但结合多种活动和抗阻训练的方案似乎比单纯有氧运动更有效。报告的不良反应极少，通常仅限于偶发的肌肉或关节损伤。\n\n研究人员强调，运动是管理抑郁症的一种安全、低成本且易于获取的选择，但提醒这并非普遍适用的疗法。这些发现与早期综述一致，但作者指出许多研究规模较小，限制了明确结论的得出。需要更多高质量、长期的研究来确定哪种运动类型最适合特定个体，以及其益处是否能长期维持。"
  },
  {
    "id": "46550453",
    "title": "Agonist-Antagonist Myoneural Interface",
    "url": "https://www.media.mit.edu/projects/agonist-antagonist-myoneural-interface-ami/overview/",
    "summary": "The Agonist-Antagonist Myoneural Interface (AMI) is a surgical and neural-interface technique designed to restore proprioception—the sense of limb position and movement—to individuals with amputations. Developed by MIT researchers, it addresses the critical limitation of conventional prosthetics, which lack sensory feedback, making control difficult and unnatural.\n\nDuring amputation, surgeons link pairs of muscles (agonist and antagonist) within the residual limb. These mechanically coupled muscles then communicate with a bionic prosthesis. When the prosthetic joint moves, the paired muscles stretch and contract in a natural reciprocal pattern, sending proprioceptive signals through the nerves back to the brain.\n\nIn the first human implementation, a below-knee amputee received two AMIs connected to a robotic ankle-foot. The patient could accurately sense the prosthetic's position and movement without visual cues, demonstrated superior control, and exhibited natural, reflexive movements like stair climbing. The system also enabled closed-loop control using natural neural feedback of joint torque.\n\nThis bi-directional communication between the nervous system and the prosthesis led to \"neurological embodiment,\" where the patient perceived the robotic limb as a true part of his body. The researchers term this design philosophy **NeuroEmbodied Design**, envisioning a future where synthetic devices are seamlessly integrated with human biology. The successful patient, Jim Ewing, returned to activities like rock climbing, showcasing the procedure's transformative potential.",
    "chinese_title": "激动剂-拮抗剂肌神经接口",
    "chinese_summary": "激动剂-拮抗剂肌神经接口（AMI）是一种外科手术与神经接口技术，旨在为截肢者恢复本体感觉——即肢体位置与运动的感知能力。该技术由麻省理工学院研究人员开发，针对传统假肢缺乏感觉反馈这一关键缺陷，解决了控制困难且不自然的问题。\n\n在截肢手术中，外科医生将残肢内的成对肌肉（激动肌与拮抗肌）进行连接。这些机械耦合的肌肉随后与仿生假肢进行通信。当假肢关节运动时，成对肌肉以自然的交互模式拉伸和收缩，通过神经向大脑传递本体感觉信号。\n\n在首次人体应用中，一名膝下截肢者接受了两个AMI连接至机器人踝足假肢。患者无需视觉提示即可准确感知假肢的位置与运动，展现出卓越的控制能力，并实现了爬楼梯等自然反射性动作。该系统还能利用关节扭矩的自然神经反馈实现闭环控制。\n\n神经系统与假肢之间的这种双向沟通促成了“神经性躯体融合”，使患者将机器人肢体视为身体的真实组成部分。研究人员将这一设计理念称为**神经融合设计**，展望合成设备与人体生物学无缝融合的未来。成功接受该手术的患者吉姆·尤因已重返攀岩等活动，展现了这项技术的变革潜力。"
  },
  {
    "id": "46511903",
    "title": "Show HN: Similarity = cosine(your_GitHub_stars, Karpathy) Client-side",
    "url": "https://puzer.github.io/github_recommender/",
    "summary": "**GitStars** is a client-side web tool that calculates the similarity between a user's GitHub stars and those of AI researcher Andrej Karpathy. The core metric is the cosine similarity, a common measure in data science for comparing vectors, where each user's starred repositories are treated as a vector.\n\nThe key features and points are:\n*   **Client-Side Privacy:** All processing happens in the user's browser. GitHub tokens are used only to fetch star data and are not sent to any external server, ensuring privacy.\n*   **Simple Interface:** Users input their GitHub username and a personal access token. The tool then fetches and compares the star data, outputting a similarity score.\n*   **Technical Implementation:** It uses the GitHub API to fetch up to 1,000 starred repositories for both the user and Karpathy. The cosine similarity is computed based on the overlap of these repositories.\n*   **Purpose:** The project is presented as a fun, lightweight demonstration of vector similarity concepts applied to a real-world dataset (GitHub stars), rather than a serious analytical tool.\n\nIn essence, GitStars is a privacy-focused, educational demo that lets users quickly see how their open-source interests align with a prominent figure in the AI/ML community using a fundamental data science technique.",
    "chinese_title": "Show HN：相似度 = 余弦(你的GitHub星标，Karpathy) 客户端版",
    "chinese_summary": "**GitStars** 是一款客户端网页工具，用于计算用户的 GitHub 收藏与 AI 研究员 Andrej Karpathy 收藏之间的相似度。其核心指标是余弦相似度——数据科学中常用于比较向量的方法，其中每位用户的收藏仓库被视为一个向量。\n\n主要特点包括：\n*   **客户端隐私保护：** 所有处理均在用户浏览器中进行。GitHub 令牌仅用于获取收藏数据，不会发送至任何外部服务器，确保隐私安全。\n*   **简洁界面：** 用户输入 GitHub 用户名和个人访问令牌后，工具即获取并比对收藏数据，输出相似度分数。\n*   **技术实现：** 通过 GitHub API 获取用户和 Karpathy 各最多 1,000 个收藏仓库，并基于仓库重叠度计算余弦相似度。\n*   **项目定位：** 该项目是一个轻量级趣味演示，旨在将向量相似度概念应用于真实数据集（GitHub 收藏），而非严肃的分析工具。\n\n简而言之，GitStars 是一个注重隐私的教育性演示项目，通过基础的数据科学技术，让用户快速了解自己的开源兴趣与 AI/ML 社区知名人物的契合度。"
  },
  {
    "id": "46555760",
    "title": "Cloudflare CEO on the Italy fines",
    "url": "https://twitter.com/eastdakota/status/2009654937303896492",
    "summary": "**Summary: Cloudflare CEO on Italy Fines**\n\nThe provided text is not an article about Cloudflare or any fines in Italy. It is an error message displayed by X.com (formerly Twitter) when a user's browser has JavaScript disabled.\n\nThe message states:\n*   JavaScript is disabled in the user's browser.\n*   To continue using X.com, the user must enable JavaScript or switch to a supported browser.\n*   It provides links to the Help Center for a list of compatible browsers and includes standard footer links for Terms of Service, Privacy Policy, etc.\n\nThere is no information, discussion, or quotes from the Cloudflare CEO regarding fines in Italy within this content. The user would need to access the actual article or post on X.com by enabling JavaScript to read the intended story.",
    "chinese_title": "Cloudflare首席执行官就意大利罚款发表看法",
    "chinese_summary": "**摘要：Cloudflare首席执行官谈意大利罚款事宜**\n\n提供的文本并非关于Cloudflare或意大利罚款的文章。这是X.com（原Twitter）在用户浏览器禁用JavaScript时显示的错误提示。\n\n该提示说明：\n*   用户浏览器中禁用了JavaScript。\n*   要继续使用X.com，用户需启用JavaScript或切换至受支持的浏览器。\n*   提示提供了帮助中心链接以查看兼容浏览器列表，并包含服务条款、隐私政策等标准页脚链接。\n\n此内容中并无Cloudflare首席执行官关于意大利罚款的任何信息、讨论或引述。用户需启用JavaScript以访问X.com上的实际文章或帖子，才能阅读相关内容。"
  },
  {
    "id": "46557029",
    "title": "Show HN: Scroll Wikipedia like TikTok",
    "url": "https://quack.sdan.io",
    "summary": "This article introduces a new web application that transforms the way users browse Wikipedia by presenting its content in a short-form, vertical video format similar to TikTok.\n\nThe core idea is to make Wikipedia's vast knowledge base more engaging and accessible, especially for younger audiences accustomed to rapid, visual content. Instead of reading long articles, users can \"scroll\" through bite-sized, narrated summaries of topics, with each \"card\" or short video dedicated to a key fact or concept.\n\nThe main points are:\n*   **Novel Format:** It repurposes Wikipedia's text and images into an endless, swipeable video feed.\n*   **Increased Engagement:** Aims to combat information overload and make learning feel more like casual, entertaining social media browsing.\n*   **Accessibility:** Presents complex information in a simplified, audiovisual format that is easier to digest quickly.\n\nThe title \"QuickQuackFollowingSlopDucksStorytime\" appears to be a placeholder or coded project name, not a literal description of the content. The key takeaway is the app's attempt to bridge the gap between in-depth encyclopedic knowledge and the popular, addictive format of short-video platforms.",
    "chinese_title": "Show HN：像刷抖音一样浏览维基百科",
    "chinese_summary": "本文介绍了一款新型网络应用程序，它通过以类似TikTok的短形式垂直视频格式呈现内容，彻底改变了用户浏览维基百科的方式。\n\n其核心理念是让维基百科庞大的知识库更具吸引力和可及性，尤其适合习惯快速浏览视觉内容的年轻受众。用户无需阅读长篇文章，而是可以“滑动”浏览主题的简短口述摘要，每张“卡片”或短视频都专注于一个关键事实或概念。\n\n主要特点包括：\n*   **新颖形式：** 将维基百科的文本和图像转化为可无限滑动的视频流。\n*   **提升参与度：** 旨在应对信息过载，让学习体验更像轻松娱乐的社交媒体浏览。\n*   **易于理解：** 以简化的视听格式呈现复杂信息，便于快速消化。\n\n标题“QuickQuackFollowingSlopDucksStorytime”似乎是一个占位符或编码项目名称，并非对内容的字面描述。关键要点在于该应用程序试图弥合深度百科全书式知识与流行且令人上瘾的短视频平台格式之间的差距。"
  },
  {
    "id": "46555615",
    "title": "SendGrid isn’t emailing about ICE or BLM – it’s a phishing attack",
    "url": "https://fredbenenson.com/blog/2026/01/09/sendgrid-isnt-emailing-you-about-ice-or-blm-its-a-phishing-attack/",
    "summary": "This article details a sophisticated phishing campaign targeting users of the email service SendGrid. Attackers compromise SendGrid customer accounts and use the platform's legitimate infrastructure to send emails that pass standard authentication checks. The campaign is notable for its use of politically and culturally charged lures—such as fake notifications about adding \"Support ICE,\" Black Lives Matter, or LGBTQ+ Pride footers to emails—designed to provoke strong emotional reactions and compel clicks.\n\nThese emails, which appear to come from SendGrid but actually originate from compromised customer domains, contain \"opt-out\" or \"manage preferences\" buttons that lead to fake login pages. These pages steal credentials and even intercept two-factor authentication codes in real time. The author suggests the political sophistication indicates attackers with a deep understanding of American cultural divisions, though the primary motive is likely financial.\n\nThe article notes this \"Phishception\" problem has persisted for years despite SendGrid's awareness. It advises users to enable two-factor authentication, use unique passwords, and for Gmail users, offers a filter to help block these impersonation emails. The core issue remains: as long as accounts are compromised, SendGrid's own system can be weaponized against its users.",
    "chinese_title": "SendGrid并非在发送关于ICE或BLM的邮件——这是一场钓鱼攻击。",
    "chinese_summary": "本文详细描述了一场针对电子邮件服务SendGrid用户的复杂钓鱼攻击活动。攻击者入侵SendGrid客户账户，利用该平台的合法基础设施发送能通过标准身份验证检查的邮件。这场攻击活动的显著特点是使用具有政治和文化煽动性的诱饵——例如关于在邮件中添加“支持ICE”、黑人的命也是命或LGBTQ+骄傲主题页脚的虚假通知——旨在激起强烈的情绪反应并诱使用户点击。\n\n这些看似来自SendGrid、实则源自被入侵客户域名的邮件包含“退订”或“管理偏好设置”按钮，点击后会跳转至伪造的登录页面。这些页面不仅窃取用户凭证，还能实时拦截双重验证码。作者指出，这种政治层面的精巧设计表明攻击者深刻理解美国的文化分歧，但其主要动机很可能仍是经济利益。\n\n文章提到，尽管SendGrid已意识到这种“钓鱼嵌套”问题，但多年来该问题持续存在。建议用户启用双重验证、使用独立密码，并为Gmail用户提供了可屏蔽这类伪装邮件的过滤方案。但核心问题依然存在：只要账户遭到入侵，SendGrid自身的系统就可能被武器化用于攻击其用户。"
  },
  {
    "id": "46550895",
    "title": "Mathematics for Computer Science (2018) [pdf]",
    "url": "https://courses.csail.mit.edu/6.042/spring18/mcs.pdf",
    "summary": "Based on the provided PDF data, this document appears to be a textbook or course material titled **\"Mathematics for Computer Science\" (2018)**. The content is not the full text but the PDF's internal structure, which reveals a detailed table of contents.\n\nThe summary of the structure indicates a comprehensive curriculum covering foundational and advanced mathematical topics essential for computer science. Key sections likely include:\n\n*   **Proofs & Logic:** Foundational concepts like proof techniques, propositional logic, and induction.\n*   **Structures:** Discrete structures such as sets, relations, graphs, and state machines.\n*   **Number Theory:** Concepts like primes, modular arithmetic, and their applications in cryptography.\n*   **Counting & Probability:** Combinatorics, sums, series, and probability theory.\n*   **Recurrences & Asymptotics:** Analyzing recursive algorithms and growth of functions (Big-O notation).\n*   **Advanced Topics:** Likely covering concepts like infinite sets, generating functions, and partial orders.\n\nThe extensive, nested outline (with 347 total entries and major sections containing 35 and 27 subsections) suggests this is a thorough, university-level resource designed to build the mathematical maturity required for theoretical computer science, algorithm analysis, and formal methods.",
    "chinese_title": "计算机科学数学（2018）[pdf]",
    "chinese_summary": "根据所提供的PDF数据，这份文档似乎是一本名为**《计算机科学数学（2018）》**的教科书或课程材料。内容并非全文，而是PDF的内部结构，揭示了一份详细的目录。\n\n结构概要表明，这是一套涵盖计算机科学所需基础及高级数学主题的全面课程。主要章节可能包括：\n\n*   **证明与逻辑：** 如证明技巧、命题逻辑和归纳法等基础概念。\n*   **结构：** 集合、关系、图以及状态机等离散结构。\n*   **数论：** 质数、模运算等概念及其在密码学中的应用。\n*   **计数与概率：** 组合数学、求和、级数以及概率论。\n*   **递归与渐近分析：** 分析递归算法和函数增长（大O表示法）。\n*   **高级主题：** 可能涵盖无限集、生成函数和偏序等概念。\n\n这份详尽且嵌套的纲要（总计347个条目，主要章节分别包含35个和27个子节）表明，这是一份为培养理论计算机科学、算法分析和形式化方法所需的数学成熟度而设计的、全面的大学水平资源。"
  },
  {
    "id": "46554462",
    "title": "London–Calcutta Bus Service",
    "url": "https://en.wikipedia.org/wiki/London%E2%80%93Calcutta_bus_service",
    "summary": "The London–Calcutta bus service, operated by Albert Travel, was a pioneering long-distance international bus route active from 1957 to 1976. Widely considered the world's longest bus route at the time, it covered approximately 10,000 miles (16,000 km) one way, taking about 50 days to travel from London to Calcutta via Belgium, West Germany, Austria, Yugoslavia, Bulgaria, Turkey, Iran, Afghanistan, Pakistan, and finally through northern India.\n\nThe service offered an all-inclusive experience, with the specially equipped double-decker bus featuring sleeping bunks, a kitchen, an observation lounge, and entertainment systems. It catered to tourists, allowing stops at major destinations like the Taj Mahal and including shopping opportunities in cities such as Vienna and Istanbul.\n\nAfter an accident, the original bus was rebuilt as a mobile home and later used for extended routes, including a London–Calcutta–Sydney trip. The service became closely associated with the overland \"Hippie Trail.\" It was discontinued in 1976 due to increasing geopolitical instability in the Middle East and rising tensions between Pakistan and India, which made the route unsafe.",
    "chinese_title": "伦敦至加尔各答巴士服务",
    "chinese_summary": "阿尔伯特旅行社运营的伦敦-加尔各答巴士服务，是1957年至1976年间运营的开创性长途国际巴士线路。这条线路被广泛认为是当时世界上最长的巴士路线，单程约10000英里（16000公里），从伦敦到加尔各答需耗时约50天，途经比利时、西德、奥地利、南斯拉夫、保加利亚、土耳其、伊朗、阿富汗、巴基斯坦，最后穿越印度北部。\n\n该服务提供全包式体验，特别装备的双层巴士配有卧铺、厨房、观光休息室和娱乐系统。它主要面向游客，允许在泰姬陵等主要目的地停留，并包含在维也纳和伊斯坦布尔等城市的购物机会。\n\n一次事故后，原巴士被改造成移动房屋，后来用于扩展路线，包括伦敦-加尔各答-悉尼行程。该服务与陆上“嬉皮之路”紧密相连。由于中东地缘政治不稳定加剧，以及巴基斯坦和印度之间紧张局势升级导致路线不安全，该服务于1976年停运。"
  },
  {
    "id": "46555485",
    "title": "Cloudspecs: Cloud Hardware Evolution Through the Looking Glass",
    "url": "http://muratbuffalo.blogspot.com/2026/01/cloudspecs-cloud-hardware-evolution.html",
    "summary": "This paper analyzes cloud hardware trends from 2015 to 2025, revealing that performance gains are now highly uneven across components.\n\nKey findings show that while network bandwidth per dollar improved by 10x, CPU and memory gains were modest. Cost-performance for CPUs improved only 2-3x over the decade, largely driven by specialized chips like AWS Graviton. DRAM capacity per dollar has stagnated, with normalized bandwidth gains of just 2x.\n\nThe most surprising result is the stagnation of NVMe storage performance in the cloud since 2016, despite on-premise SSD performance doubling twice. The best value for I/O performance per dollar remains with the 2016-era i3 instances.\n\nThe authors conclude that uniform hardware scaling is over. Future performance gains will come from specialization (e.g., Graviton, Nitro networking cards) and tighter hardware/software co-design. They also suggest that stagnating local NVMe, combined with exploding network speeds, may accelerate a shift toward disaggregated storage architectures. A key open question is why massive core counts deliver limited value, with software scalability likely being a major bottleneck.",
    "chinese_title": "Cloudspecs：透过镜子看云硬件的演变",
    "chinese_summary": "本文分析了2015年至2025年的云硬件发展趋势，指出当前各组件间的性能提升已高度不均衡。\n\n关键发现表明，虽然单位成本的网络带宽提升了10倍，但CPU和内存的提升幅度有限。过去十年间，CPU的性价比仅提高了2-3倍，这主要得益于AWS Graviton等专用芯片的推动。单位成本的DRAM容量已陷入停滞，标准化带宽增益仅为2倍。\n\n最令人意外的结果是自2016年以来，云上NVMe存储性能始终停滞不前，尽管本地SSD性能已实现两次翻倍。单位成本I/O性能的最佳选择仍是2016年推出的i3实例。\n\n作者总结道，硬件均匀扩展的时代已经结束。未来的性能提升将来自专业化（如Graviton、Nitro网卡）以及更紧密的软硬件协同设计。他们还指出，本地NVMe性能停滞与网络速度的爆发式增长，可能加速存储架构向解耦式方向演进。一个关键悬而未决的问题是：为何大规模核心数量带来的价值有限——软件可扩展性很可能成为主要瓶颈。"
  },
  {
    "id": "46478558",
    "title": "Linux Runs on Raspberry Pi RP2350's Hazard3 RISC-V Cores (2024)",
    "url": "https://www.hackster.io/news/jesse-taube-gets-linux-up-and-running-on-the-raspberry-pi-rp2350-s-hazard3-risc-v-cores-19088b87bb2c",
    "summary": "In 2024, developer Jesse Taube successfully booted a minimal Linux distribution on the Raspberry Pi RP2350 microcontroller, a first for the new chip. This achievement leverages the RP2350's open-source Hazard3 RISC-V cores, which are typically found in microcontrollers rather than application processors.\n\nThe project overcomes two key hardware limitations. First, it uses a NOMMU (No Memory Management Unit) version of Linux, as the Hazard3 cores lack an MMU. Second, it requires additional memory beyond the chip's built-in 520kB SRAM. The solution utilizes the RP2350's support for external PSRAM (pseudo-static RAM), meaning the Linux build runs on boards like the SparkFun Pro Micro RP2350 (with 8MB PSRAM) but not on a standard Raspberry Pi Pico 2, which lacks this expansion.\n\nThis work builds on earlier efforts to run Linux on microcontrollers like the RP2040 but is more efficient as it runs RISC-V code natively on the RP2350's cores, rather than through emulation. Taube has made the Buildroot-based configuration publicly available on GitHub, allowing others to replicate the build for compatible hardware.",
    "chinese_title": "Linux在树莓派RP2350的Hazard3 RISC-V核心上运行（2024）",
    "chinese_summary": "2024年，开发者杰西·陶布成功在树莓派RP2350微控制器上启动了一个极简Linux发行版，这是该新型芯片首次实现此功能。这一成果利用了RP2350的开源Hazard3 RISC-V内核——这类内核通常用于微控制器而非应用处理器。\n\n该项目克服了两项关键硬件限制：首先，由于Hazard3内核缺少内存管理单元（MMU），系统采用了无MMU版本的Linux；其次，运行需要超出芯片内置520kB SRAM的额外内存。解决方案利用了RP2350对外部PSRAM（伪静态随机存储器）的支持，这意味着该Linux构建可在SparkFun Pro Micro RP2350（搭载8MB PSRAM）等开发板上运行，但无法在缺少扩展内存的标准树莓派Pico 2上实现。\n\n此项工作基于早期在RP2040等微控制器上运行Linux的尝试，但效率更高，因为它直接在RP2350的RISC-V内核上原生运行代码，而非通过模拟器。陶布已将基于Buildroot的配置公开发布在GitHub上，供其他开发者为兼容硬件复现此构建。"
  },
  {
    "id": "46545620",
    "title": "How to code Claude Code in 200 lines of code",
    "url": "https://www.mihaileric.com/The-Emperor-Has-No-Clothes/",
    "summary": "This article explains how to build a basic AI coding assistant from scratch in about 200 lines of Python, demystifying the core architecture behind tools like Claude Code. The author argues that the \"magic\" is a straightforward loop: the user gives a request, a large language model (LLM) decides which tools to use, the program executes those tools locally, and the results are fed back to the LLM.\n\nThe agent requires just three fundamental tools: `read_file` to view code, `list_files` to navigate a project, and `edit_file` to create or modify files. The system works by providing the LLM with a detailed system prompt that describes these tools and a strict format for invoking them (e.g., `tool: edit_file({\"path\": \"hello.py\", \"old_str\": \"\", \"new_str\": \"print('Hello')\"})`).\n\nThe code implements a conversation loop where the LLM's responses are parsed for tool calls. If a tool is requested, it's executed, and the result is sent back to the LLM, allowing for multi-step interactions (like reading a file and then editing it). The loop continues until the LLM provides a final, tool-free response.\n\nWhile production systems add features like better error handling and more tools, the article concludes that this simple pattern of an LLM orchestrating local tool execution is the essential architecture of modern coding assistants.",
    "chinese_title": "如何用200行代码编写Claude Code",
    "chinese_summary": "本文阐述了如何用大约200行Python代码从零构建一个基础的AI编程助手，揭示了Claude Code等工具背后的核心架构。作者指出其“魔力”其实是一个简洁的循环：用户提出请求，大语言模型决定使用哪些工具，程序在本地执行这些工具，执行结果再反馈给大语言模型。\n\n该智能体仅需三个基础工具：用于查看代码的`read_file`、用于浏览项目的`list_files`，以及用于创建或修改文件的`edit_file`。系统通过向大语言模型提供详细的系统提示来运作，这些提示描述了工具功能及严格的调用格式（例如`tool: edit_file({\"path\": \"hello.py\", \"old_str\": \"\", \"new_str\": \"print('Hello')\"})`）。\n\n代码实现了一个对话循环：解析大语言模型的响应以识别工具调用请求。若检测到工具调用，则执行相应操作并将结果返回给大语言模型，从而实现多步骤交互（例如先读取文件再编辑文件）。该循环将持续运行，直至大语言模型给出不含工具调用的最终响应。\n\n尽管生产系统会添加更完善的错误处理和更多工具功能，但文章总结道：这种由大语言模型协调本地工具执行的简单模式，正是现代编程助手的核心架构。"
  },
  {
    "id": "46554897",
    "title": "Amiga Pointer Archive",
    "url": "https://heckmeck.de/pointers/",
    "summary": "The Amiga Pointer Archive is a web-based tool that allows users to create, edit, and browse custom mouse pointers for the classic Amiga computer system. It functions as an interactive editor where users can \"doodle\" their own pointer designs.\n\nKey features of the tool include:\n*   A pixel-art editor for designing pointers.\n*   A color palette for selection, with a note that specific GUI colors are not usable.\n*   Editing functions like setting a hotspot, undo/redo, and clearing the canvas.\n*   Options to name, export, and save pointers.\n*   A browsable archive of user-created pointers with random browsing and local edit history.\n\nThe site emphasizes that all edits and history are saved locally in the user's web browser. It is hosted on heckmeck.de, serving as a dedicated community archive for preserving and sharing this niche aspect of Amiga customization.",
    "chinese_title": "Amiga指针档案库",
    "chinese_summary": "Amiga指针档案库是一个基于网页的工具，允许用户为经典Amiga计算机系统创建、编辑和浏览自定义鼠标指针。它作为一个交互式编辑器，用户可以在其中“涂鸦”设计自己的指针。\n\n该工具的主要功能包括：\n*   用于设计指针的像素画编辑器。\n*   可供选择的调色板，并注明特定GUI颜色不可用。\n*   编辑功能，如设置热点、撤销/重做和清空画布。\n*   命名、导出和保存指针的选项。\n*   可浏览的用户创建指针档案库，支持随机浏览和本地编辑历史记录。\n\n网站强调所有编辑和历史记录都保存在用户网页浏览器的本地。它托管于heckmeck.de，作为一个专门的社区档案库，致力于保存和分享Amiga定制化中的这一小众领域。"
  },
  {
    "id": "46524519",
    "title": "CI-Hush",
    "url": "https://gitlab.com/jjg/ci-hush",
    "summary": "**Summary of \"CI-Hush\"**\n\nThe article \"CI-Hush\" introduces a new software tool designed to enhance security and privacy in Continuous Integration (CI) pipelines. The core problem it addresses is the accidental exposure of secrets—such as API keys, passwords, and tokens—within source code repositories, which can occur when developers inadvertently commit sensitive data.\n\nThe main function of CI-Hush is to automatically scan code commits in real-time within the CI/CD workflow. It detects potential secrets before they are merged into the main codebase, preventing them from becoming a permanent security risk. The tool uses advanced pattern matching and entropy analysis to identify a wide range of secret types with high accuracy, aiming to reduce false positives that can disrupt developer workflow.\n\nA key feature highlighted is its proactive prevention approach. Instead of merely alerting teams after a leak, CI-Hush blocks the risky commit from progressing, enforcing a \"shift-left\" security practice. This allows development teams to fix the issue immediately at the source.\n\nThe article positions CI-Hush as a solution to improve compliance, reduce the risk of data breaches, and seamlessly integrate security into the modern DevOps lifecycle without significantly slowing down development speed.",
    "chinese_title": "CI-Hush",
    "chinese_summary": "**《CI-Hush》概述**\n\n文章《CI-Hush》介绍了一款旨在增强持续集成（CI）管道安全性与隐私性的新型软件工具。其核心解决的是源代码仓库中意外泄露秘密信息（如API密钥、密码和令牌）的问题，这种情况常发生在开发人员无意间提交敏感数据时。\n\nCI-Hush的主要功能是在CI/CD工作流中实时自动扫描代码提交。它能在潜在秘密被合并到主代码库之前将其检测出来，防止其成为永久性的安全风险。该工具采用高级模式匹配和熵分析技术，以高准确率识别多种类型的秘密信息，旨在减少可能干扰开发工作流程的误报。\n\n文章强调的一个关键特性是其主动预防方法。CI-Hush并非仅在泄露后向团队发出警报，而是会阻止有风险的提交继续推进，从而强制执行“左移”安全实践。这使得开发团队能够直接在源头立即修复问题。\n\n文章将CI-Hush定位为一种解决方案，旨在提高合规性、降低数据泄露风险，并将安全性无缝集成到现代DevOps生命周期中，同时不会显著拖慢开发速度。"
  },
  {
    "id": "46493199",
    "title": "When Kitty Litter Caused a Nuclear Catastrophe",
    "url": "https://practical.engineering/blog/2025/4/15/when-kitty-litter-caused-a-nuclear-catastrophe",
    "summary": "On February 14, 2014, a radiation alarm was triggered at the Waste Isolation Pilot Plant (WIPP), a deep underground nuclear waste repository in New Mexico. The cause was traced to a breached waste drum that had undergone a chemical reaction and burst.\n\nThe incident originated at Los Alamos National Laboratory, where technicians were repackaging nitrate salt waste from nuclear weapons production. A procedural error led them to use an organic, wheat-based cat litter as an absorbent instead of the required inorganic, mineral-based type. The organic material reacted chemically with the nitrates, generating heat and pressure until the drum exploded underground.\n\nWhile the ventilation system's filters captured most radioactive material, some leaked out, resulting in low-level contamination of 21 workers and a minimal environmental release. The direct cleanup and three-year shutdown of WIPP cost approximately $500 million.\n\nThe event highlighted systemic failures in procedure management and oversight at Los Alamos. It underscored the profound, long-term challenges of handling nuclear waste, where a simple human error—a miscommunication about kitty litter—can lead to a significant and costly accident, emphasizing the need for extreme vigilance in managing permanent hazards.",
    "chinese_title": "猫砂引发的核灾难",
    "chinese_summary": "2014年2月14日，位于新墨西哥州的地下核废料处置库“废物隔离试验厂”触发辐射警报。事故根源是一个发生化学反应后破裂的废料桶。\n\n事件始于洛斯阿拉莫斯国家实验室。技术人员在处理核武器生产产生的硝酸盐废料时，因操作程序失误，误将有机麦基猫砂作为吸附剂，替代了规定的无机矿物基材料。有机材料与硝酸盐发生化学反应，产生热量和压力，最终导致废料桶在地下爆炸。\n\n尽管通风系统的过滤器捕获了大部分放射性物质，仍有少量泄漏，造成21名工作人员受到低水平污染，并导致微量辐射环境释放。事故的直接清理工作及废物隔离试验厂随后三年的关停，总计耗资约5亿美元。\n\n此次事件暴露了洛斯阿拉莫斯实验室在流程管理与监督方面的系统性缺陷。它凸显了核废料处理领域深刻而长期的挑战——一个关于猫砂的简单沟通失误，竟能引发重大且代价高昂的事故，这警示人们：在管理永久性危险品时必须保持极度的警惕。"
  },
  {
    "id": "46555512",
    "title": "Latest SteamOS Beta Now Includes Ntsync Kernel Driver",
    "url": "https://www.phoronix.com/news/Steam-OS-Beta-NTSYNC",
    "summary": "Valve has released the SteamOS 3.7.20 beta, which now includes the NTSYNC kernel driver by default. This driver is designed to accelerate Windows NT synchronization primitives, which are crucial for running Windows games on Linux through compatibility layers like Wine and Proton.\n\nThe NTSYNC driver's development was completed about a year ago, and user-space support was added in Wine 10.16, with full integration expected in the upcoming Wine 11.0 and Proton 11.0 releases. While Proton already uses the FSYNC driver for performance, the addition of NTSYNC provides an alternative path that may offer further improvements for Steam Play on SteamOS.\n\nThe main purpose of this SteamOS update is to prepare the system for future Proton versions that will utilize NTSYNC. The driver is now built and loaded automatically in the beta, ensuring it will be ready when needed. This move aligns Valve with other Linux distributions that are also incorporating the NTSYNC module, though methods for enabling it vary.",
    "chinese_title": "最新SteamOS测试版现已包含Ntsync内核驱动",
    "chinese_summary": "Valve发布了SteamOS 3.7.20测试版，现已默认包含NTSYNC内核驱动程序。该驱动程序旨在加速Windows NT同步原语，这对于通过Wine和Proton等兼容层在Linux上运行Windows游戏至关重要。\n\nNTSYNC驱动程序的开发约一年前完成，用户空间支持已在Wine 10.16中添加，预计将在即将发布的Wine 11.0和Proton 11.0中实现全面集成。尽管Proton已使用FSYNC驱动程序提升性能，但NTSYNC的加入提供了另一条优化路径，可能为SteamOS上的Steam Play带来进一步改进。\n\n此次SteamOS更新的主要目的是为未来将使用NTSYNC的Proton版本做好准备。该驱动程序在测试版中已实现自动构建和加载，确保在需要时可立即启用。此举使Valve与其他同样整合NTSYNC模块的Linux发行版保持同步，尽管各系统启用该模块的方法有所不同。"
  },
  {
    "id": "46489514",
    "title": "How Will the Miracle Happen Today?",
    "url": "https://kk.org/thetechnium/how-will-the-miracle-happen-today/",
    "summary": "**Summary:**\n\nThe article \"How Will the Miracle Happen Today?\" explores the concept of daily miracles, shifting the perspective from rare, biblical-scale events to the subtle, often overlooked wonders in ordinary life. The central argument is that miracles are not just supernatural interventions but are present in the natural world, human connection, and personal resilience.\n\nKey points include redefining miracles as moments of profound gratitude, unexpected kindness, or the simple beauty of existence—like a sunrise or a child's laughter. The author encourages a mindset of active anticipation, suggesting that by cultivating awareness and gratitude, individuals can recognize these \"small\" miracles more readily. The article posits that this shift in perception can lead to increased joy, reduced stress, and a deeper sense of meaning.\n\nUltimately, it concludes that the \"miracle\" is often the human capacity to find hope, love, and awe amidst the mundane. The question in the title becomes a daily practice of looking for and creating moments of wonder, thereby transforming one's experience of life itself.",
    "chinese_title": "今天的奇迹将如何发生？",
    "chinese_summary": "**摘要：**\n\n文章《今日奇迹将如何发生？》探讨了日常奇迹的概念，将视角从罕见的、圣经级别的宏大事件转向平凡生活中微妙且常被忽视的奇妙之处。其核心论点是，奇迹不仅是超自然的干预，更存在于自然世界、人际联系以及个人的韧性之中。\n\n文章要点包括将奇迹重新定义为深刻感恩的时刻、意想不到的善意或存在的简单之美——例如日出或孩子的笑声。作者鼓励一种积极期待的心态，认为通过培养觉察力和感恩之心，个人能更容易地识别这些“微小”的奇迹。文章提出，这种感知的转变可以带来更多的快乐、减轻压力，并深化生命的意义感。\n\n最终，文章总结道，“奇迹”往往就是人类在平凡中发现希望、爱与敬畏的能力。标题中的问题由此成为一种日常实践：去寻找并创造惊叹的时刻，从而改变个人对生命本身的体验。"
  },
  {
    "id": "46506143",
    "title": "Sorted string tables (SST) from first principles",
    "url": "https://www.bitsxpages.com/p/sorted-string-tables-sst-from-first",
    "summary": "Sorted String Tables (SSTs) are an immutable on-disk data structure optimized for SSDs, which perform best with large, batched writes and avoid small, random modifications. An SST stores key-value data sorted by key, grouping it into blocks (e.g., 4KB) to align with SSD page sizes. This design leverages spatial locality, ensuring related data is stored together for efficient retrieval.\n\nTo enable fast lookups without scanning entire files, SSTs use a multi-layered index. A main index in memory holds the first key and disk location of each data block, allowing binary search to locate the correct block quickly. For further optimization, filter blocks (like min/max or Bloom filters) can indicate if a key is absent, avoiding unnecessary disk reads.\n\nThe system involves trade-offs between read amplification, space amplification, and memory usage. Smaller data blocks reduce read amplification (less irrelevant data per fetch) but increase index size and memory overhead. Larger blocks save memory but may require reading more data than needed. This balance is crucial for tuning performance in data systems like LSM-trees, where SSTs are a foundational component.",
    "chinese_title": "排序字符串表（SST）从基本原理讲起",
    "chinese_summary": "排序字符串表（SST）是一种为SSD优化的不可变磁盘数据结构，其设计最适合大批量写入，避免小而随机的修改。SST按键排序存储键值数据，并将其分组为块（例如4KB），以匹配SSD页面大小。这种设计利用了空间局部性，确保相关数据集中存储以实现高效检索。\n\n为支持快速查找而无需扫描整个文件，SST采用多层索引。内存中的主索引存储每个数据块的第一个键及其磁盘位置，可通过二分搜索快速定位目标块。为进一步优化，过滤块（如最小/最大值过滤器或布隆过滤器）可指示某个键是否不存在，从而避免不必要的磁盘读取。\n\n该系统需要在读取放大、空间放大和内存使用之间进行权衡。较小的数据块可减少读取放大（每次获取的不相关数据更少），但会增加索引大小和内存开销；较大的块节省内存，但可能读取超出需要的数据。这种平衡对于调优LSM树等数据系统的性能至关重要，而SST正是其基础组件。"
  },
  {
    "id": "46553343",
    "title": "Kagi releases alpha version of Orion for Linux",
    "url": "https://help.kagi.com/orion/misc/linux-status.html",
    "summary": "Kagi has released an alpha version of its Orion web browser for Linux, marking an early and unstable release intended for testing.\n\nThe current build features a complete visual interface, including all menus, dialogs, toolbars, and window layouts. Core browsing functionality is demonstrated, supporting homepage access, basic searches, and website navigation.\n\nKey completed features include advanced tab management, with tabs operating independently and persisting across sessions so they reopen upon restart. A simple bookmarks system allows users to save pages into folders and access them via a dialog, sidebar, or bar. The release also includes a framework for future password management and local export/import capabilities, as well as advanced history handling.\n\nNotable features not yet implemented in this alpha include the Tab Switcher UI, WebKit extension support, and sync infrastructure.",
    "chinese_title": "Kagi发布Linux版Orion的alpha版本",
    "chinese_summary": "Kagi发布了其Orion网页浏览器的Linux版Alpha版本，这是一个早期且不稳定的测试版本。\n\n当前版本具备完整的视觉界面，包括所有菜单、对话框、工具栏和窗口布局。核心浏览功能已实现，支持主页访问、基本搜索和网站导航。\n\n已实现的关键功能包括高级标签页管理，标签页独立运行且跨会话持久保存，重启后可重新打开。简单的书签系统允许用户将页面保存到文件夹中，并通过对话框、侧边栏或书签栏访问。该版本还包含了未来密码管理框架、本地导出/导入功能以及高级历史记录处理。\n\n此Alpha版本中尚未实现的重要功能包括标签页切换器界面、WebKit扩展支持以及同步基础设施。"
  },
  {
    "id": "46489232",
    "title": "Hacking a Casio F-91W digital watch (2023)",
    "url": "https://medium.com/infosec-watchtower/how-i-hacked-casio-f-91w-digital-watch-892bd519bd15",
    "summary": "**Summary of \"Hacking a Casio F-91W digital watch (2023)\"**\n\nThe article details a hardware hacking project where the author successfully modified a classic Casio F-91W digital watch to add a new, hidden feature: a Geiger counter for detecting radiation.\n\nThe key steps and points of the hack are:\n1.  **Motivation:** The author chose the iconic and widely available F-91W for its simplicity, low cost, and the technical challenge of modifying such a compact device.\n2.  **Hardware Modification:** The core of the hack involved carefully opening the watch case and soldering wires from a tiny, commercially available radiation sensor (a PCB with a Geiger-Müller tube) to specific points on the watch's circuit board. This required identifying test points for power (VCC, GND) and a signal input.\n3.  **Software/Logic Modification:** The hack exploited the watch's built-in hourly chime function. The radiation sensor's output pulses (generated by detected radioactive particles) were fed into the circuit that triggers the chime. This repurposed the chime mechanism so that instead of beeping on the hour, the watch would beep in real-time whenever radiation was detected.\n4.  **Result:** The modified watch functioned normally as a timepiece. Its new, covert functionality was activated by holding a specific button combination. In this mode, it would provide audible feedback for radiation levels, transforming an everyday object into a functional, discreet radiation detector.\n\nIn essence, the project is a creative demonstration of embedded hardware hacking, reverse-engineering, and circuit bending to repurpose a mass-produced consumer device for a completely unintended and novel function.",
    "chinese_title": "破解卡西欧F-91W电子手表（2023）",
    "chinese_summary": "**《改装卡西欧 F-91W 电子手表（2023）概述》**\n\n本文详述了一项硬件改装项目，作者成功改造了经典的卡西欧 F-91W 电子手表，为其添加了一项新的隐藏功能：用于检测辐射的盖革计数器。\n\n此次改装的关键步骤与要点如下：\n1.  **动机：** 作者选择标志性且广泛流通的 F-91W，是因其结构简单、成本低廉，且改装如此紧凑的设备具有技术挑战性。\n2.  **硬件改装：** 改装的核心在于小心打开表壳，并将一个微型的市售辐射传感器（带有盖革-米勒管的 PCB 板）的导线焊接至手表电路板上的特定点位。这需要识别电源（VCC、GND）和信号输入的测试点。\n3.  **软件/逻辑改装：** 改装利用了手表内置的整点响报功能。辐射传感器的输出脉冲（由检测到的放射性粒子产生）被输入到触发响报的电路中。这重新利用了响报机制，使手表不再在整点鸣响，而是在检测到辐射时实时发出蜂鸣声。\n4.  **成果：** 改装后的手表作为计时器功能正常。其新的隐蔽功能通过按住特定按键组合激活。在此模式下，手表会根据辐射水平提供声音反馈，从而将一件日常物品变成了一个功能性的、隐蔽的辐射探测器。\n\n本质上，该项目创造性地展示了嵌入式硬件改装、逆向工程和电路改造，将一款大规模生产的消费设备重新用于一个完全出乎意料的新功能。"
  }
]