[
  {
    "id": "47025399",
    "title": "LT6502: A 6502-based homebrew laptop",
    "url": "https://github.com/TechPaula/LT6502",
    "summary": "The LT6502 is a custom-built, portable computer based on the 65C02 microprocessor running at 8MHz. Designed as a homebrew laptop, it features 46KB of RAM, BASIC in ROM, and a 65C22 VIA for I/O. Storage is handled by a Compact Flash card, and the system is powered by a built-in 10,000mAh battery with USB-C charging.\n\nKey hardware includes a built-in keyboard, a serial console port, an internal expansion slot, and a display (initially a 4.3\" 800x480 screen, with plans for a larger 9\" or 10.1\" model). The project log details successful milestones like initial power-up, peripheral integration (keyboard, CF card, beeper), and case assembly.\n\nThe firmware extends EhBASIC with extra commands for graphics (CIRCLE, LINE, PLOT), sound (BEEP), file management (LOAD, SAVE, DIR), and display control (CLS, MODE). The memory map allocates space for RAM, ROM, and peripherals like the VIA, display controller, and console.\n\nIn summary, the LT6502 is a fully functional, self-contained retro-computing laptop that combines classic 6502 architecture with modern conveniences like USB power and CF storage, enhanced with custom graphics and file management capabilities.",
    "chinese_title": "LT6502：一款基于6502处理器的自制笔记本电脑",
    "chinese_summary": "LT6502是一款基于8MHz 65C02微处理器的定制便携式计算机。作为自制笔记本电脑，它配备46KB内存、固化BASIC语言的ROM芯片以及用于输入输出的65C22 VIA接口。系统采用CF卡存储，内置10000mAh锂电池并支持USB-C充电。\n\n核心硬件包含内置键盘、串行控制台端口、内部扩展插槽及显示屏（初始采用4.3英寸800x480屏幕，计划升级为9英寸或10.1英寸型号）。项目日志记录了关键进展：首次通电成功、外围设备集成（键盘/CF卡/蜂鸣器）及外壳组装。\n\n固件在EhBASIC基础上扩展了图形指令（CIRCLE/LINE/PLOT）、声音指令（BEEP）、文件管理（LOAD/SAVE/DIR）和显示控制（CLS/MODE）。内存映射为RAM、ROM及VIA接口、显示控制器、控制台等外围设备分配了地址空间。\n\n总而言之，LT6502是一款功能完整的复古计算笔记本电脑，既保留了经典的6502架构，又融合了USB供电、CF存储等现代便利特性，并通过定制图形与文件管理功能实现了功能增强。"
  },
  {
    "id": "47022891",
    "title": "I Fixed Windows Native Development",
    "url": "https://marler8997.github.io/blog/fixed-windows/",
    "summary": "This article criticizes the traditional reliance on the full Visual Studio installer for native C/C++ development on Windows, highlighting its problems: massive downloads, complex configuration, poor reproducibility, and system pollution. It introduces **msvcup** as a solution—a lightweight CLI tool that directly downloads and installs only the essential MSVC compiler and Windows SDK components from Microsoft's servers.\n\nKey benefits of msvcup include:\n*   **Fast, isolated installations** into versioned directories, avoiding registry clutter.\n*   **Reproducible builds** via lock files and explicit versioning.\n*   **Self-contained build scripts** that can run on any modern Windows machine without pre-installed tools.\n*   **Automatic environment setup** (`autoenv`) that eliminates the need to manually run `vcvars` batch files.\n\nThe tool enables developers to specify toolchain dependencies directly in their build scripts, making Windows native development more portable and reliable, similar to package-manager-based workflows on Linux. While it doesn't replace the full Visual Studio IDE, it provides a modern, declarative way to manage the core compilation toolchain.",
    "chinese_title": "我修复了Windows原生开发",
    "chinese_summary": "本文批评了在Windows上进行原生C/C++开发时传统上依赖完整Visual Studio安装程序的做法，指出其问题：下载体积庞大、配置复杂、可复现性差以及系统污染。文章介绍了**msvcup**作为解决方案——这是一款轻量级CLI工具，可直接从微软服务器下载并仅安装必要的MSVC编译器和Windows SDK组件。\n\nmsvcup的主要优势包括：\n*   **快速、隔离的安装**至版本化目录，避免注册表混乱。\n*   通过锁定文件和显式版本控制实现**可复现的构建**。\n*   **自包含的构建脚本**可在任何现代Windows机器上运行，无需预装工具。\n*   **自动环境配置**（`autoenv`），无需手动运行`vcvars`批处理文件。\n\n该工具使开发者能直接在构建脚本中指定工具链依赖，让Windows原生开发更具可移植性和可靠性，类似于Linux上基于包管理器的工作流程。虽然它不能替代完整的Visual Studio IDE，但为管理核心编译工具链提供了一种现代化的声明式方法。"
  },
  {
    "id": "47025378",
    "title": "EU bans the destruction of unsold apparel, clothing, accessories and footwear",
    "url": "https://environment.ec.europa.eu/news/new-eu-rules-stop-destruction-unsold-clothes-and-shoes-2026-02-09_en",
    "summary": "On February 9, 2026, the European Commission adopted new rules under the Ecodesign for Sustainable Products Regulation (ESPR) to combat the wasteful destruction of unsold textiles.\n\nThe key measure is a **ban on destroying unsold apparel, clothing accessories, and footwear**. This aims to cut waste, reduce environmental damage—estimated at 5.6 million tons of CO2 annually from destroyed textiles—and support sustainable business models.\n\nTo ensure compliance, the rules include:\n*   A **disclosure requirement**: Companies must report volumes of unsold consumer goods they discard, using a standard format from February 2027.\n*   **Derogations**: Destruction will be permitted in specific cases, such as for safety or damaged goods, with oversight by national authorities.\n\nThe timeline for implementation is staged:\n*   The **destruction ban** applies to **large companies from July 2026** and to **medium-sized companies from 2030**.\n*   The **disclosure rules** already apply to large firms and will extend to medium-sized ones in 2030.\n\nCompanies are encouraged to adopt alternatives like resale, donation, remanufacturing, or improved stock management instead of disposal. The move is part of a broader EU strategy to make textiles and other products more circular and competitive.",
    "chinese_title": "欧盟禁止销毁未售出的服装、服饰配件及鞋类产品。",
    "chinese_summary": "2026年2月9日，欧盟委员会依据《可持续产品生态设计法规》（ESPR）通过了新规，以遏制未售出纺织品的浪费性销毁行为。\n\n核心措施是**禁止销毁未售出的服装、服饰配件及鞋类产品**。此举旨在减少浪费、降低环境损害（据估算，每年因销毁纺织品产生的二氧化碳排放达560万吨），并支持可持续商业模式。\n\n为确保合规，新规包含：\n*   **信息披露要求**：企业须自2027年2月起采用标准格式，上报其弃置的未售出消费品数量。\n*   **豁免条款**：在安全原因或商品损坏等特定情况下，经国家监管部门监督可允许销毁。\n\n实施时间表分阶段进行：\n*   **销毁禁令**将于**2026年7月起适用于大型企业**，**2030年起适用于中型企业**。\n*   **信息披露规则**已对大型企业生效，并将于2030年扩展至中型企业。\n\n欧盟鼓励企业采取转售、捐赠、再制造或优化库存管理等替代方案，而非直接弃置产品。此举是欧盟推动纺织品及其他产品更具循环性和竞争力的整体战略的一部分。"
  },
  {
    "id": "47026134",
    "title": "Towards Autonomous Mathematics Research",
    "url": "https://arxiv.org/abs/2602.10177",
    "summary": "This paper introduces **Aletheia**, an AI agent designed for autonomous mathematics research. It builds on recent advances in reasoning models to move beyond solving competition-level problems (like the International Mathematical Olympiad) to tackling professional research tasks, which involve navigating literature and constructing long, complex proofs.\n\nAletheia operates by iteratively generating, verifying, and revising solutions in natural language. It is powered by an advanced reasoning model (Gemini Deep Think), a novel inference-time scaling law for harder problems, and intensive use of tools to manage research complexity.\n\nThe authors demonstrate Aletheia's capabilities through three key milestones:\n1.  **Feng26**: A fully AI-generated research paper calculating structure constants (\"eigenweights\") in arithmetic geometry, with no human intervention.\n2.  **LeeSeo26**: A human-AI collaborative paper proving bounds on systems of interacting particles (independent sets).\n3.  **An extensive evaluation**: A semi-autonomous run on 700 open problems from a mathematical database, resulting in autonomous solutions to four open questions.\n\nThe paper concludes by proposing frameworks for quantifying the autonomy and novelty of AI-assisted mathematical results and suggests \"human-AI interaction cards\" for transparency. It reflects on the future of human-AI collaboration in mathematics and shares all prompts and outputs publicly.",
    "chinese_title": "迈向自主数学研究",
    "chinese_summary": "本文介绍**Aletheia**——一种专为自主数学研究设计的人工智能代理。它基于推理模型的最新进展，不仅能够解决竞赛级问题（如国际数学奥林匹克竞赛），还能处理专业研究任务，包括文献梳理与构建长篇复杂证明。\n\nAletheia通过迭代生成、验证和修订自然语言解决方案进行运作。其核心驱动力包括先进推理模型（Gemini Deep Think）、针对难题设计的新型推理时标度律，以及为管理研究复杂性而密集使用的工具集。\n\n作者通过三项关键成果展示Aletheia的能力：\n1.  **Feng26**：完全由AI生成的研究论文，在算术几何中计算结构常数（“特征权重”），全程无人为干预。\n2.  **LeeSeo26**：人机协作完成的论文，证明了相互作用粒子系统（独立集）的边界问题。\n3.  **大规模评估**：在数学数据库的700个开放问题上进行半自主运行，最终自主解决了其中四个未解问题。\n\n论文最后提出量化AI辅助数学成果自主性与创新性的框架，并建议采用“人机交互记录卡”以增强透明度。文章展望了数学领域人机协作的未来前景，并公开了所有提示词与输出结果。"
  },
  {
    "id": "47024506",
    "title": "Gwtar: A static efficient single-file HTML format",
    "url": "https://gwern.net/gwtar",
    "summary": "Gwtar is a new static HTML archival format that solves the \"HTML trilemma\" by creating a single, self-contained HTML file that still allows efficient lazy-loading of assets. It works by embedding a JavaScript header and a tarball of assets into one HTML file. The JavaScript uses `window.stop()` to prevent the browser from downloading the entire file, then intercepts requests for images or other assets and fetches only the necessary parts via HTTP range requests into the appended tarball.\n\nThis approach makes Gwtar files static (no external dependencies), single-file (easy to store and host), and efficient (users download only what they view). It is designed for long-term web archiving, offering a user-friendly and forward-compatible solution. The format includes features like optional error correction (PAR2 FEC) and supports local viewing with minimal server requirements, though it depends on browser support for range requests.",
    "chinese_title": "Gwtar：一种静态高效的单文件HTML格式",
    "chinese_summary": "Gwtar是一种新型静态HTML归档格式，它通过创建单一、自包含的HTML文件来解决“HTML三难困境”，同时仍能实现资源的高效懒加载。其原理是将JavaScript头部和资源压缩包嵌入单个HTML文件中：JavaScript利用`window.stop()`阻止浏览器下载完整文件，随后拦截图片或其他资源请求，通过HTTP范围请求仅从附加的压缩包中提取必要数据段。\n\n这种设计使Gwtar文件具备静态性（无外部依赖）、单文件化（便于存储托管）和高效性（用户仅下载浏览内容）三大特性。该格式专为长期网络归档设计，提供用户友好且向前兼容的解决方案，支持可选纠错功能（PAR2 FEC），并能在最低服务器要求下实现本地浏览，但其运行需依赖浏览器对范围请求的支持。"
  },
  {
    "id": "46993014",
    "title": "Real-time PathTracing with global illumination in WebGL",
    "url": "https://erichlof.github.io/THREE.js-PathTracing-Renderer/",
    "summary": "This article introduces the **THREE.js-PathTracing-Renderer**, a project enabling **real-time path tracing** with global illumination and progressive rendering within a web browser using the Three.js WebGL framework. It features a wide array of **interactive demos** showcasing its capabilities, including:\n\n*   **Advanced Rendering:** Real-time global illumination, reflections, refractions, soft shadows, caustics, and volumetric effects (fog, light shafts).\n*   **Diverse Geometry:** Support for both traditional triangle-based models (via BVH acceleration for complex meshes like the Stanford Dragon) and **mathematical (quadric) shapes** (spheres, cones, hyperboloids), inspired by vintage CGI techniques.\n*   **Hybrid Techniques:** Combining path tracing with ray marching for environments like oceans, terrain, and entire planets.\n*   **Performance & Features:** Achieves 30-60 FPS on various devices, supports HDRI lighting, PBR materials, model instancing (enabling billions of polygons), and offers experimental geometry like Quads (bilinear patches) as an alternative to triangles.\n\nThe project demonstrates the power of modern WebGL to deliver cinematic-quality, physically-based rendering interactively in the browser.",
    "chinese_title": "WebGL中的实时路径追踪与全局光照",
    "chinese_summary": "本文介绍了**THREE.js-PathTracing-Renderer**项目，该项目基于Three.js WebGL框架，可在网页浏览器中实现具备全局光照和渐进式渲染功能的**实时路径追踪**。该项目包含一系列**交互式演示**，全面展示其核心能力：\n\n*   **高级渲染效果：** 实时全局光照、反射、折射、柔和阴影、焦散及体积效果（雾效、光轴）。\n*   **多样化几何支持：** 既支持传统三角网格模型（通过BVH加速处理复杂模型如斯坦福龙），也支持**数学（二次曲面）几何体**（球体、圆锥体、双曲面），其设计灵感源自经典CGI技术。\n*   **混合渲染技术：** 结合路径追踪与光线步进，可渲染海洋、地形乃至完整行星等复杂场景。\n*   **性能与特性：** 在各种设备上可实现30-60 FPS的渲染性能，支持HDRI光照、PBR材质、模型实例化（可处理数十亿多边形），并实验性提供四边形（双线性面片）作为三角形网格的替代方案。\n\n该项目充分展现了现代WebGL技术在浏览器中实现电影级物理渲染交互体验的强大潜力。"
  },
  {
    "id": "47027044",
    "title": "With Apple: Fortify your app: Essential strategies to strengthen security",
    "url": "https://developer.apple.com/events/view/TUHA23T82K/dashboard",
    "summary": "This article outlines a scheduled meeting opportunity with Apple security experts, designed to help developers strengthen their app's security posture.\n\nThe core offering is a one-on-one consultation where Apple specialists will provide personalized guidance. The focus is on implementing Apple's built-in security frameworks and following best practices. Key strategies highlighted include adopting **data encryption** (both in transit and at rest), enforcing **app sandboxing** to limit damage from potential breaches, and requiring **biometric authentication** (like Face ID or Touch ID) for sensitive actions.\n\nThe session also emphasizes protecting user data by promoting transparency through clear **privacy nutrition labels** and secure data collection methods. Developers are encouraged to proactively identify and address security gaps before they can be exploited.\n\nIn essence, the meeting is a direct resource for developers to learn how to leverage Apple's ecosystem tools to build more secure, trustworthy apps that better safeguard user information.",
    "chinese_title": "与苹果同行：加固您的应用：强化安全性的关键策略",
    "chinese_summary": "本文概述了一次与苹果安全专家的预定会议机会，旨在帮助开发者加强其应用程序的安全防护能力。\n\n核心内容为一对一咨询，苹果专家将提供个性化指导。重点在于实施苹果内置的安全框架并遵循最佳实践。强调的关键策略包括采用**数据加密**（传输和静态数据）、实施**应用沙盒**以限制潜在漏洞造成的损害，以及对敏感操作要求**生物识别认证**（如面容ID或触控ID）。\n\n会议还强调通过清晰的**隐私标签**和安全的数据收集方法提升透明度，以保护用户数据。鼓励开发者在安全漏洞被利用前主动识别并解决问题。\n\n本质上，此次会议是开发者直接获取资源的途径，学习如何利用苹果生态系统工具构建更安全、更可信赖的应用程序，从而更好地保护用户信息。"
  },
  {
    "id": "47020191",
    "title": "I love the work of the ArchWiki maintainers",
    "url": "https://k7r.eu/i-love-the-work-of-the-archwiki-maintainers/",
    "summary": "This article is a heartfelt thank you to the maintainers and contributors of the ArchWiki, written for \"I Love Free Software Day.\" The author emphasizes that documentation maintainers often receive too little recognition for their crucial role in software freedom.\n\nThe author praises the ArchWiki as an indispensable resource, consulted regularly not just for Arch Linux but for understanding software on any distribution. They credit it with helping configure tools, discover features, and solve setup problems for themselves and others.\n\nThe piece highlights the wiki's role in gathering and preserving knowledge, making technology more understandable, and its maintainers' work in ensuring the resource's long-term reliability and availability. It quotes Edward Snowden to underscore the wiki's exceptional usefulness in an internet of declining search quality.\n\nThe author concludes by encouraging readers to also thank the ArchWiki team and consider donating to the Arch Linux project. A postscript thanks an individual for facilitating connections with key maintainers at FOSDEM 2026.",
    "chinese_title": "我热爱ArchWiki维护者们的工作。",
    "chinese_summary": "本文是为“我爱自由软件日”撰写的一封诚挚感谢信，致谢ArchWiki的维护者与贡献者。作者强调，文档维护者在软件自由事业中扮演着关键角色，却往往未获得足够的认可。\n\n作者称赞ArchWiki是不可或缺的资源，不仅在使用Arch Linux时经常查阅，也为理解各类发行版中的软件提供了帮助。他们指出，这份维基帮助自己与他人配置工具、发掘功能特性并解决系统设置问题。\n\n文章着重阐述了该维基在汇集与保存知识、促进技术理解方面的作用，并赞扬维护者通过持续工作确保这一资源的长期可靠性与可访问性。文中引用爱德华·斯诺登的观点，强调在互联网搜索质量普遍下降的当下，这份维基具有非凡的实用价值。\n\n作者最后鼓励读者一同向ArchWiki团队致谢，并考虑为Arch Linux项目捐款。附言特别感谢某位人士在FOSDEM 2026期间协助联系核心维护者。"
  },
  {
    "id": "47024907",
    "title": "Hideki Sato, designer of all Sega's consoles, has died",
    "url": "https://www.videogameschronicle.com/news/hideki-sato-designer-of-segas-consoles-dies-age-75/",
    "summary": "Hideki Sato, the former president and lead hardware designer for Sega, has died at the age of 77. As reported by Japanese outlet Beep21, Sato was the engineer behind virtually all of Sega's consoles, including the Master System, Genesis/Mega Drive, Saturn, and Dreamcast.\n\nJoining Sega in 1971, Sato explained that the company's home console development was directly influenced by its arcade work. He highlighted that the 16-bit Mega Drive was born from the desire to bring cutting-edge arcade technology into the home, capitalizing on the newly affordable 68000 chip.\n\nRegarding the Dreamcast, Sato revealed the console's development keyword was \"play and communication,\" leading to features like the built-in modem. He also candidly admitted that Sega marketed the Dreamcast's CPU as \"128-bit\" for competitive appeal, despite its technical basis being 64-bit.\n\nSato served as Sega's acting president from 2001 to 2003 and left the company in 2008.",
    "chinese_title": "世嘉所有游戏机的设计师佐藤秀树去世",
    "chinese_summary": "世嘉前总裁兼首席硬件设计师佐藤秀树去世，享年77岁。据日本媒体Beep21报道，佐藤是世嘉几乎所有游戏主机的幕后工程师，包括Master System、Genesis/Mega Drive、Saturn和Dreamcast。\n\n佐藤于1971年加入世嘉，他解释称公司的家用主机开发直接受到其街机业务的影响。他强调，16位的Mega Drive诞生于将尖端街机技术带入家庭的愿景，并利用了当时新近价格亲民的68000芯片。\n\n关于Dreamcast，佐藤透露其开发关键词是“游玩与通信”，这催生了内置调制解调器等特色功能。他也坦率承认，尽管Dreamcast的CPU技术基础是64位，但世嘉为提升市场竞争力将其宣传为“128位”。\n\n佐藤在2001年至2003年间担任世嘉代理总裁，并于2008年离开公司。"
  },
  {
    "id": "47025624",
    "title": "Palantir Gets Millions of Dollars from New York City's Public Hospitals",
    "url": "https://theintercept.com/2026/02/15/palantir-contract-new-york-city-health-hospitals/",
    "summary": "This article reports that New York City's public hospital system (NYC Health + Hospitals) has paid the data analytics firm Palantir nearly $4 million since 2023. The contract is for software to improve billing efficiency, specifically to capture missed Medicaid charges by scanning patient health notes.\n\nThe article highlights significant controversy due to Palantir's other government contracts. It details the company's work with U.S. Immigration and Customs Enforcement (ICE) for deportations, its role in NSA surveillance programs, and its partnership with the Israeli military.\n\nActivist groups, including the AFSC and NYCLU, strongly oppose the contract. They argue it is reckless to share patients' protected health information with a company involved in immigration enforcement, fearing data could be re-identified and used to target immigrant communities seeking care. Critics, including nurses' unions, demand the contract be terminated.\n\nNYC Health + Hospitals and Palantir did not provide substantive comments on the contract's specifics, though Palantir stated it does not use hospital data outside the agreed bounds. The article notes the contract includes common provisions for de-identifying patient data but cites concerns that such data can often be re-identified.",
    "chinese_title": "Palantir从纽约市公立医院获得数百万美元资金",
    "chinese_summary": "本文报道称，自2023年以来，纽约市公立医院系统（NYC Health + Hospitals）已向数据分析公司Palantir支付近400万美元。该合同旨在通过扫描患者健康记录、捕捉遗漏的医疗补助账单，以提升计费效率的软件。\n\n文章重点指出，由于Palantir与其他政府机构的合作，此事引发重大争议。详细内容包括该公司与美国移民及海关执法局（ICE）在驱逐出境方面的合作、在美国国家安全局监控项目中的角色，以及与以色列军方的伙伴关系。\n\n包括美国公谊服务委员会和纽约公民自由联盟在内的活动团体强烈反对该合同。他们认为，将受保护的患者健康信息共享给一家参与移民执法的公司是鲁莽之举，担心数据可能被重新识别并用于针对寻求医疗服务的移民社区。包括护士工会在内的批评者要求终止合同。\n\n纽约市公立医院系统和Palantir未就合同细节提供实质性评论，但Palantir声明其不会在约定范围外使用医院数据。文章指出，合同包含常见的患者数据去标识化条款，但也提及此类数据常能被重新识别的担忧。"
  },
  {
    "id": "47026848",
    "title": "State Attorneys General Want to Tie Online Access to ID",
    "url": "https://reclaimthenet.org/40-attorneys-general-back-ids-online-safety-act",
    "summary": "This article reports that a group of state Attorneys General are advocating for policies that would require age and identity verification for accessing online platforms. The core argument is that such measures are necessary to protect minors from online harms.\n\nThe article's author strongly opposes this push, framing it as a threat to online privacy and anonymity. They argue that mandatory identification creates a surveillance system and erodes the fundamental freedom of the open internet.\n\nTo offer a solution, the article pivots to recommending alternative communication platforms, specifically highlighting decentralized or self-hosted options like those found on the fediverse (e.g., Matrix, Mastodon). The key criterion for these alternatives is user control—they favor projects where users own their data and infrastructure, avoiding what the author describes as another \"polished cage\" controlled by a corporation.\n\nIn summary, the article presents a conflict between government officials seeking to enforce online ID checks for safety and privacy advocates who view such checks as dangerous overreach, promoting decentralized tools as a way to \"reclaim control.\"",
    "chinese_title": "州检察长欲将网络接入与身份验证挂钩",
    "chinese_summary": "本文报道称，一批州检察长正推动相关政策，要求用户访问在线平台时需进行年龄与身份验证。其核心论点是此类措施对于保护未成年人免受网络伤害至关重要。\n\n文章作者强烈反对这一动向，认为这将威胁网络隐私与匿名性。作者指出，强制身份验证会催生监控体系，侵蚀开放互联网的根本自由。\n\n作为解决方案，文章转而推荐替代性通信平台，特别强调去中心化或自托管选项，例如联邦宇宙中的平台（如Matrix、Mastodon）。这些替代方案的关键标准在于用户掌控权——作者推崇那些让用户自主管理数据与基础设施的项目，以避免陷入其所谓的由企业控制的另一个“精致牢笼”。\n\n总之，文章展现了政府官员为安全推行网络身份核查与隐私倡导者之间的冲突：前者视核查为必要安全措施，后者则认为这是危险的越权行为，并主张通过去中心化工具来“重获掌控权”。"
  },
  {
    "id": "47026768",
    "title": "Show HN: VOOG – Moog-style polyphonic synthesizer in Python with tkinter GUI",
    "url": "https://github.com/gpasquero/voog",
    "summary": "VOOG is a polyphonic virtual analog synthesizer built in Python, designed to emulate the sound and interface of a Moog Subsequent 37. It features a fully functional tkinter-based GUI with a dark theme and rotary knob controls.\n\nThe synth's core includes three oscillators (with sine, saw, square, and triangle waveforms), a 24dB/octave Moog-style ladder filter, dual ADSR envelopes, an LFO, and a noise generator. It offers 8-voice polyphony across 4 multitimbral channels and includes features like glide/portamento and 19 built-in presets.\n\nUsers can play notes via a virtual keyboard (mouse click/drag), a QWERTY keyboard mapping, or an optional MIDI controller. The project is structured into modules for digital signal processing (DSP), the audio engine, the GUI, MIDI support, and patch management.\n\nTo run VOOG, Python 3.13+ with tkinter is required, along with dependencies like NumPy and SoundDevice. It can be launched in GUI or command-line REPL mode and supports saving and loading custom patches.",
    "chinese_title": "展示 HN：VOOG – 使用 Python 和 tkinter GUI 开发的 Moog 风格复音合成器",
    "chinese_summary": "VOOG是一款基于Python构建的复音虚拟模拟合成器，旨在模拟Moog Subsequent 37的声音与界面。它采用深色主题的tkinter图形界面，配备旋钮控件，功能完整。\n\n合成器核心包含三个振荡器（支持正弦波、锯齿波、方波和三角波）、一个24dB/倍频程的Moog式梯形滤波器、双ADSR包络发生器、一个LFO以及噪声发生器。它具备8复音能力，支持4个多音色通道，并包含滑音/滑奏功能和19个内置预设。\n\n用户可通过虚拟键盘（鼠标点击/拖拽）、QWERTY键盘映射或可选MIDI控制器演奏音符。项目结构分为数字信号处理（DSP）、音频引擎、图形界面、MIDI支持和音色管理模块。\n\n运行VOOG需安装Python 3.13及以上版本（含tkinter），并依赖NumPy和SoundDevice等库。它可在图形界面或命令行交互模式下启动，支持保存和加载自定义音色。"
  },
  {
    "id": "47021980",
    "title": "Oat – Ultra-lightweight, semantic, zero-dependency HTML UI component library",
    "url": "https://oat.ink/",
    "summary": "**Summary:**\n\nOat is a minimalist HTML UI component library designed for developers who prioritize speed and simplicity. Its core selling point is its extremely small footprint: the entire library is just **6KB of CSS and 2.2KB of JavaScript** when minified and gzipped.\n\nThe library is built with a focus on **semantic HTML**, meaning it enhances standard HTML elements with styling and basic interactivity rather than replacing them with complex custom components. This approach promotes accessibility, clean code, and ease of use.\n\nA key feature is that Oat has **zero dependencies**, eliminating the need for any external frameworks or libraries. This makes it easy to integrate into any project without adding bloat or potential dependency conflicts.\n\nIn essence, Oat provides a set of pre-styled, functional UI elements (like buttons, forms, navigation) that are immediately usable, while being exceptionally lightweight and adhering to web standards. It is ideal for projects where performance, minimalism, and simplicity are critical.",
    "chinese_title": "Oat – 超轻量、语义化、零依赖的HTML UI组件库",
    "chinese_summary": "**概述：**\n\nOat 是一款极简的 HTML UI 组件库，专为注重速度和简洁性的开发者设计。其核心卖点是极小的体积：经过压缩和 gzip 处理后，整个库仅包含 **6KB 的 CSS 和 2.2KB 的 JavaScript**。\n\n该库的构建专注于 **语义化 HTML**，这意味着它通过样式和基础交互性来增强标准 HTML 元素，而非用复杂的自定义组件替代它们。这种方法提升了可访问性，保持了代码的简洁，并易于使用。\n\n一个关键特性是 Oat **零依赖**，无需任何外部框架或库。这使得它可以轻松集成到任何项目中，而不会增加冗余或潜在的依赖冲突。\n\n本质上，Oat 提供了一套预样式化、功能性的 UI 元素（如按钮、表单、导航），这些元素开箱即用，同时异常轻量且遵循 Web 标准。它非常适合那些对性能、极简主义和简洁性有严格要求的项目。"
  },
  {
    "id": "47021354",
    "title": "Flashpoint Archive – Over 200k web games and animations preserved",
    "url": "https://flashpointarchive.org",
    "summary": "**Flashpoint Archive** is a community-driven initiative dedicated to preserving web-based games and animations that are at risk of disappearing due to obsolete technologies like Adobe Flash. Since its launch in December 2017, the project has successfully archived over 200,000 items.\n\nThe project provides open-source software tools, including a launcher, a proxy server, and a sandbox system, to reliably run and experience the preserved content as if it were still on the original web.\n\nOriginally focused on saving Flash games, Flashpoint has expanded to preserve content from various web plugins, frameworks, and standards. It is a global, non-profit effort supported by hundreds of volunteers.\n\nThe summary highlights its core mission: to safeguard internet history and culture by ensuring continued access to this digital heritage.",
    "chinese_title": "闪点档案——保存超过20万款网页游戏与动画",
    "chinese_summary": "**Flashpoint档案库**是一个社区驱动的项目，致力于保存因Adobe Flash等过时技术而面临消失风险的网页游戏与动画。自2017年12月启动以来，该项目已成功存档超过20万件内容。\n\n该项目提供开源软件工具，包括启动器、代理服务器和沙盒系统，能够可靠地运行和体验已保存的内容，仿佛它们仍在原始网页上运行。\n\n最初专注于保存Flash游戏，Flashpoint现已扩展至保存来自各种网页插件、框架和标准的内容。这是一个全球性的非营利性努力，得到了数百名志愿者的支持。\n\n其核心使命在于：通过确保这些数字遗产的持续可访问性，来守护互联网的历史与文化。"
  },
  {
    "id": "47025188",
    "title": "Palantir vs. the \"Republik\": US analytics firm takes magazine to court",
    "url": "https://www.heise.de/en/news/Palantir-vs-the-Republik-US-analytics-firm-takes-magazine-to-court-11176508.html",
    "summary": "**Summary of \"Palantir vs. the 'Republik': US analytics firm takes magazine to court\"**\n\nThe article reports on a legal dispute between the US data analytics company Palantir and the Swiss investigative magazine *Republik*. Palantir is suing the magazine in a Swiss court, seeking to force it to delete internal company documents and data that *Republik* obtained and published.\n\nThe core of the conflict stems from *Republik*'s reporting on Palantir's business activities, particularly its work with government agencies. The magazine published articles based on what it describes as internal Palantir documents, including client lists, contracts, and internal communications. Palantir alleges that this data was obtained illegally and constitutes a violation of business secrets and data protection laws.\n\n*Republik* defends its actions, positioning the case as a critical issue of press freedom and the public's right to information. The magazine argues that Palantir, which works extensively with intelligence and police agencies, operates with significant opacity and that its work has substantial societal impact. Therefore, they contend that investigative journalism based on such documents is in the public interest.\n\nThe lawsuit highlights the tension between corporate secrecy and journalistic scrutiny, especially concerning a company like Palantir, which is known for its controversial work in surveillance and data analysis for governments. The outcome of the case could set a precedent for how European courts balance the protection of corporate data against the freedom of the press.",
    "chinese_title": "Palantir对决《Republik》：美国数据分析公司将杂志告上法庭",
    "chinese_summary": "**《Palantir 诉〈共和〉杂志：美国数据分析公司对瑞士媒体提起法律诉讼》摘要**\n\n文章报道了美国数据分析公司 Palantir 与瑞士调查性杂志《共和》之间的法律纠纷。Palantir 正在瑞士法院起诉该杂志，要求其删除《共和》获取并发布的公司内部文件与数据。\n\n冲突的核心源于《共和》对 Palantir 商业活动的报道，特别是其与政府机构的合作。该杂志基于其称为 Palantir 内部文件的资料发表了文章，内容包括客户名单、合同及内部通信。Palantir 声称这些数据系非法获取，侵犯了商业秘密并违反了数据保护法。\n\n《共和》为其行为辩护，将此案定位为关乎新闻自由和公众知情权的关键问题。该杂志指出，与情报和警察机构广泛合作的 Palantir 运营极不透明，其工作对社会影响重大。因此，他们认为基于此类文件的调查性新闻报道符合公共利益。\n\n此诉讼凸显了企业保密与新闻监督之间的紧张关系，尤其对于 Palantir 这样以从事有争议的政府监控和数据分析工作而闻名的公司。此案的结果可能为欧洲法院如何权衡企业数据保护与新闻自由树立先例。"
  },
  {
    "id": "46960485",
    "title": "How Is Data Stored?",
    "url": "https://www.makingsoftware.com/chapters/how-is-data-stored",
    "summary": "Based on the content from the provided URL, here is a concise summary:\n\n**Summary of \"How Is Data Stored?\"**\n\nThe article explains the fundamental hierarchy of data storage in computing, from the smallest unit to complex files. It begins with the **bit**, the basic binary unit (0 or 1), which represents an electrical charge or magnetic state.\n\nBits are grouped into **bytes** (typically 8 bits), which can represent a single character. The article details how text is encoded using standards like **ASCII** or **UTF-8**, where each letter, number, or symbol corresponds to a specific byte pattern.\n\nBytes are organized into **data structures** (like arrays) to form meaningful information. These structures are stored as **files** (e.g., documents, images), which the operating system manages. Files are kept in a **file system**, a method for organizing, naming, and storing files on a storage device (like an HDD or SSD). The file system handles directories, file metadata (name, size, location), and the mapping of files to specific physical sectors on the disk.\n\nFinally, the article touches on **databases** as a more advanced, efficient, and query-optimized system for storing and retrieving large volumes of interrelated data compared to simple file systems.\n\nIn essence, the storage chain progresses from: **Bits → Bytes → Characters/Data Structures → Files → File Systems → Databases**.",
    "chinese_title": "数据是如何存储的？",
    "chinese_summary": "根据所提供URL的内容，以下是简明摘要：\n\n**《数据如何存储？》摘要**\n\n文章阐述了计算中数据存储的基本层次结构，从最小单元到复杂文件。它从**比特**开始，这是基本的二进制单位（0或1），代表电荷或磁状态。\n\n比特组合成**字节**（通常为8比特），可表示单个字符。文章详细说明了如何使用**ASCII**或**UTF-8**等标准对文本进行编码，其中每个字母、数字或符号对应特定的字节模式。\n\n字节被组织成**数据结构**（如数组）以形成有意义的信息。这些结构以**文件**形式存储（例如文档、图像），由操作系统管理。文件保存在**文件系统**中，这是一种在存储设备（如HDD或SSD）上组织、命名和存储文件的方法。文件系统处理目录、文件元数据（名称、大小、位置）以及文件到磁盘特定物理扇区的映射。\n\n最后，文章提及**数据库**作为一种更高级、高效且查询优化的系统，用于存储和检索大量相互关联的数据，与简单文件系统相比更具优势。\n\n本质上，存储链的演进过程为：**比特 → 字节 → 字符/数据结构 → 文件 → 文件系统 → 数据库**。"
  },
  {
    "id": "47024184",
    "title": "1940s Irish sci-fi novel features early mecha and gravity assists",
    "url": "https://github.com/cavedave/Manannan",
    "summary": "This article announces the digitization of *Manannán*, a 1940 Irish-language young adult sci-fi novel by Máiréad Ní Ghráda. The project aims to make this obscure work more accessible, as it has never been reprinted or translated.\n\nThe novel is noted for its potentially pioneering concepts, including what may be the first depiction of a mecha (a piloted robotic suit) outside of Japanese fiction and an early literary mention of a gravity assist maneuver in space travel.\n\nThe digitization effort involves extracting and correcting text from a scanned PDF, starting with pages 9–18, which cover the beginning of the first chapter. The work is being done incrementally to identify and fix recurring OCR errors early in the process. The repository contains sample PDF pages and text files, along with the full table of contents.\n\nContributors, especially Irish speakers, are invited to help by spotting and correcting errors in the extracted text to improve the accuracy of the digital version.",
    "chinese_title": "1940年代爱尔兰科幻小说呈现早期机甲与重力助推技术。",
    "chinese_summary": "本文宣布对*Manannán*进行数字化处理，这是Máiréad Ní Ghráda于1940年创作的一部爱尔兰语青少年科幻小说。该项目旨在让这部鲜为人知的作品更易于获取，因为它从未再版或翻译过。\n\n该小说以其可能具有开创性的概念而著称，包括可能是日本科幻以外首次对机甲（有人驾驶的机器人套装）的描绘，以及早期文学作品中关于太空旅行重力助推操作的提及。\n\n数字化工作涉及从扫描的PDF中提取并校正文本，从第9至18页开始，这些页面涵盖了第一章的开头部分。这项工作正在逐步进行，以便在早期识别和修复重复出现的OCR错误。存储库中包含示例PDF页面和文本文件，以及完整的目录。\n\n欢迎贡献者，尤其是懂爱尔兰语的人士，通过发现和纠正提取文本中的错误来帮助提高数字版本的准确性。"
  },
  {
    "id": "47024676",
    "title": "An Enslaved Gardener Transformed the Pecan into a Cash Crop",
    "url": "https://lithub.com/how-an-enslaved-gardener-transformed-the-pecan-into-a-cash-crop/",
    "summary": "This article details how an enslaved gardener named Antoine revolutionized the pecan industry in the 19th century through successful grafting. While pecans were a long-established staple for Native Americans, earlier attempts to cultivate them commercially from seeds failed due to long maturation times and inconsistent nut quality.\n\nAntoine mastered the delicate technique of inosculation (grafting), joining a scion to a rootstock to create a tree that reliably produced high-quality, uniform nuts. His work, conducted with rudimentary tools, led to the Centennial pecan variety, establishing the foundation for a profitable commercial industry that grew to millions of pounds annually.\n\nThe author, a plant biologist, emphasizes the significance of Antoine's skill by contrasting it with the technical challenges of modern grafting. The article also critiques the historical erasure of Black and Indigenous botanical expertise, noting how figures like Antoine are often omitted from narratives that credit European explorers, and points to similar oversights in contemporary works like Jane Goodall's *Seeds of Hope*. Ultimately, Antoine's innovation transformed the pecan into a major cash crop, yet his contribution remains largely unsung.",
    "chinese_title": "一位被奴役的园丁将山核桃转变为经济作物",
    "chinese_summary": "本文详述了19世纪一位名叫安托万的被奴役园丁如何通过成功嫁接彻底改变了山核桃产业。虽然山核桃长期以来是美洲原住民的主要食物，但早期尝试用种子进行商业种植却因成熟期长、坚果品质不稳定而失败。\n\n安托万掌握了精妙的嫁接技术，将接穗与砧木结合，培育出能稳定产出优质、均匀坚果的树木。他使用简陋工具培育出的“百年纪念”山核桃品种，为后来年产量达数百万磅的盈利性商业产业奠定了基础。\n\n身为植物生物学家的作者通过对比现代嫁接的技术挑战，强调了安托万技艺的重要性。文章还批判了历史上对黑人和原住民植物学专业知识的抹除，指出像安托万这样的人物常被归功于欧洲探险家的叙事所忽略，并指出简·古道尔《希望的种子》等当代著作中类似的疏忽。最终，安托万的创新使山核桃成为重要经济作物，但他的贡献至今仍鲜为人知。"
  },
  {
    "id": "47022943",
    "title": "Reversed engineered game Starflight (1986)",
    "url": "https://github.com/s-macke/starflight-reverse",
    "summary": "This project involves reverse engineering the 1986 DOS game *Starflight*, which was written in the Forth programming language. The author explains that Forth uses indirect threading, a space-efficient but slow method where the executable primarily consists of 16-bit pointers rather than traditional x86 assembly. This structure makes standard disassembly tools ineffective.\n\nThe game's code retains much of its original Forth source structure, including encrypted word names that act like debugging symbols, allowing for significant reconstruction of the source. The project's disassembler translates this Forth \"bytecode\" into readable C-style code. The game data is stored across three files: `STARFLT.COM` (containing initialization and core routines) and `STARA.COM`/`STARB.COM` (holding game data, graphics, and code overlays).\n\nThe repository provides tools to extract and analyze these files, enabling others to explore the game's internals and appreciate its innovative design, which influenced many later sandbox games.",
    "chinese_title": "逆向工程游戏《星际飞行》（1986）",
    "chinese_summary": "本项目涉及对1986年DOS游戏《星际飞行》的反向工程，该游戏采用Forth编程语言编写。作者指出，Forth语言采用间接线程技术——这是一种节省空间但运行缓慢的方法，其可执行文件主要由16位指针构成，而非传统的x86汇编指令。这种结构使得标准反汇编工具难以生效。\n\n游戏代码保留了原始Forth源码的大量结构特征，包括作为调试符号的加密字词名，这使得大部分源代码得以重建。项目的反汇编器将这种Forth“字节码”转换为可读的C风格代码。游戏数据存储于三个文件中：`STARFLT.COM`（包含初始化程序和核心例程）以及`STARA.COM`/`STARB.COM`（存储游戏数据、图形资源和代码覆盖模块）。\n\n该代码库提供了提取和分析这些文件的工具，使其他开发者能够探索游戏内部机制，并领略其影响后世众多沙盒游戏的创新设计。"
  },
  {
    "id": "47025851",
    "title": "Modern CSS Code Snippets: Stop writing CSS like it's 2015",
    "url": "https://modern-css.com",
    "summary": "This article, \"Modern CSS Code Snippets,\" argues that many common CSS techniques from the past decade are now obsolete, replaced by cleaner, native browser features. It presents 56 side-by-side comparisons of \"Old\" hacks versus \"Modern\" solutions, organized by categories like Layout, Animation, Typography, and Workflow.\n\nThe key message is that developers can stop relying on complex JavaScript, preprocessors like Sass, and external libraries for many common tasks. Modern CSS now provides native solutions for centering (`place-items: center`), responsive design (`container queries`), scroll-linked animations (`animation-timeline: view()`), parent selection (`:has()`), and styling dialogs/popovers (`popover` attribute).\n\nIt highlights significant improvements in developer experience and performance, such as using `subgrid` for alignment, `text-wrap: balance` for headlines, `color-mix()` for blending, and `@scope` for scoped styles—all without extra dependencies. The article emphasizes that these modern features are widely supported in browsers, making older workarounds unnecessary for contemporary web development.",
    "chinese_title": "现代CSS代码片段：别再像2015年那样写CSS了",
    "chinese_summary": "本文《现代CSS代码片段》指出，过去十年中许多常见的CSS技术现已过时，被更简洁的原生浏览器功能所取代。文章按布局、动画、排版和工作流程等类别，呈现了56组“传统”解决方案与“现代”方案的对比。\n\n核心观点是，开发者无需再依赖复杂的JavaScript、Sass等预处理器或外部库来处理许多常见任务。现代CSS已为居中（`place-items: center`）、响应式设计（容器查询）、滚动驱动动画（`animation-timeline: view()`）、父元素选择（`:has()`）以及对话框/弹出层样式（`popover`属性）等场景提供了原生解决方案。\n\n文章重点强调了开发体验和性能的显著提升，例如使用`subgrid`进行对齐、`text-wrap: balance`优化标题排版、`color-mix()`实现色彩混合、`@scope`限定样式作用域——所有这些都无需额外依赖。文章强调，这些现代功能已获得浏览器广泛支持，使得传统解决方案在现代网页开发中不再必要。"
  },
  {
    "id": "46990175",
    "title": "LEDs Enter the Nanoscale, But efficiency hurdles challenge the smallest LEDs yet",
    "url": "https://spectrum.ieee.org/nanoled-research-approaches",
    "summary": "**Summary:**\n\nResearchers have successfully created LEDs at the nanoscale, pushing the technology into a new size regime. These \"nanoLEDs,\" developed by a company called Polar Light, are constructed from tiny, bottom-up fabricated hexagonal pyramids. This achievement is significant for potential applications in ultra-high-resolution displays, advanced optical communication, and on-chip photonic circuits.\n\nHowever, the article highlights a major challenge: **efficiency hurdles**. As LEDs shrink to these minute dimensions, their light-emitting efficiency drops significantly. This is primarily due to increased non-radiative recombination, where electrical energy is converted to heat instead of light, and surface effects that become more dominant at such small scales.\n\nThe core takeaway is that while the fabrication of nanoscale LEDs is now possible, making them practical and commercially viable requires overcoming these fundamental efficiency barriers. The development represents an important step in miniaturization, but further research is needed to improve performance before these smallest LEDs can be widely deployed.",
    "chinese_title": "LED进入纳米尺度，但效率难题挑战着迄今最小的LED。",
    "chinese_summary": "**摘要：**\n\n研究人员已成功在纳米尺度上制造出LED，将这项技术推入了一个新的尺寸领域。这些由一家名为\"极光\"公司开发的\"纳米LED\"，由微小的、自下而上制造的六角锥体构成。这一成就对于超高分辨率显示器、先进光通信以及片上光子电路等潜在应用具有重要意义。\n\n然而，文章强调了一个主要挑战：**效率障碍**。随着LED缩小到如此微小的尺寸，其发光效率显著下降。这主要是由于非辐射复合增加（电能转化为热量而非光），以及在小尺度下变得更为显著的表面效应。\n\n核心要点是，虽然纳米级LED的制造现已实现，但要使其变得实用且具备商业可行性，必须克服这些根本性的效率障碍。这项发展代表了微型化进程中的重要一步，但在这些最小尺寸的LED得以广泛应用之前，仍需进一步研究以提升其性能。"
  },
  {
    "id": "46993184",
    "title": "The Spy Who Found T. Rex",
    "url": "https://nautil.us/the-spy-who-found-t-rex-1267359/",
    "summary": "Barnum Brown, a pioneering paleontologist born in 1873, is best known for his 1902 discovery of *Tyrannosaurus rex* in Montana. Working for the American Museum of Natural History, he made this landmark find early in his career and later excavated a nearly complete specimen. His work took him globally, collecting fossils on expeditions to places like Myanmar and India.\n\nBeyond paleontology, Brown engaged in diverse side ventures. He worked as a petroleum prospector for oil companies and even provided geographical intelligence for the Office of Strategic Services (the CIA's predecessor) during World War II. He also consulted for Walt Disney on the film *Fantasia*.\n\nOne of his significant later discoveries was the Howe Quarry in Wyoming in 1934, where his team unearthed thousands of bones from a herd of sauropods that died in a prehistoric mud trap. Brown remained active into his 80s, continuing fossil hunts until his death in 1963. Although he did not live to see paleontology's modern transformation into a key evolutionary science, his prolific fossil discoveries, including the iconic T. rex, secured his legacy as a foundational figure in the field.",
    "chinese_title": "发现霸王龙的间谍",
    "chinese_summary": "巴纳姆·布朗，这位出生于1873年的先驱古生物学家，最为人所知的是他于1902年在蒙大拿州发现了*霸王龙*。在美国自然历史博物馆工作期间，他职业生涯早期便取得了这一里程碑式的发现，后来还发掘出了一具近乎完整的霸王龙标本。他的工作足迹遍布全球，曾前往缅甸和印度等地进行化石采集考察。\n\n除了古生物学，布朗还涉足多种副业。他曾为石油公司担任石油勘探员，甚至在二战期间为战略情报局（中央情报局的前身）提供地理情报。他还为沃尔特·迪士尼的电影《幻想曲》担任顾问。\n\n他后期的重要发现之一是1934年在怀俄明州发现的豪氏采石场，他的团队在那里从一群死于史前泥潭的蜥脚类恐龙中挖掘出了数千块骨头。布朗一直活跃到80多岁，直到1963年去世前仍在继续化石搜寻工作。尽管他未能亲眼见证古生物学现代转型为一门关键的进化科学，但他多产的化石发现，包括标志性的霸王龙，奠定了他在该领域作为奠基人的不朽遗产。"
  },
  {
    "id": "47026071",
    "title": "Editor's Note: Retraction of article containing fabricated quotations",
    "url": "https://arstechnica.com/staff/2026/02/editors-note-retraction-of-article-containing-fabricated-quotations/",
    "summary": "Ars Technica has retracted an article after discovering it contained fabricated quotations generated by an AI tool and falsely attributed to a source, Scott Shambaugh. In an editor's note, Editor-in-Chief Ken Fisher called this a \"serious failure\" of the publication's standards, which require direct quotes to reflect a source's actual words.\n\nFisher expressed particular distress because Ars Technica has a long-standing written policy against publishing AI-generated material without clear labeling for demonstration purposes. This incident directly violated that mandatory rule. An internal review found no other similar issues, suggesting this was an isolated failure.\n\nThe publication has apologized both to its readers and to Mr. Shambaugh for the error. The note reinforces Ars Technica's firm stance against the undisclosed use of AI-generated content in its journalism.",
    "chinese_title": "编者按：撤回包含捏造引文的文章",
    "chinese_summary": "Ars Technica在发现一篇报道包含由AI工具生成并虚假归因于消息源斯科特·尚博的捏造引文后，已撤回该文章。主编肯·费舍尔在编者按中称这是该媒体标准的“严重失误”，该标准要求直接引语必须反映消息源的真实表述。\n\n费舍尔对此深感痛心，因为Ars Technica长期奉行明文政策，禁止在未明确标注演示用途的情况下发布AI生成内容。本次事件直接违反了这项强制性规定。内部审查未发现其他类似问题，表明此为孤立事件。\n\n该媒体已就此次错误向读者和尚博先生致歉。编者按重申了Ars Technica坚决反对在新闻报道中未经披露使用AI生成内容的立场。"
  },
  {
    "id": "47015294",
    "title": "My smart sleep mask broadcasts users' brainwaves to an open MQTT broker",
    "url": "https://aimilios.bearblog.dev/reverse-engineering-sleep-mask/",
    "summary": "A user reverse-engineered a smart sleep mask, discovering it broadcasts sensitive data to an open server. After the mask's app proved unreliable, they used AI tools to decompile it, finding hardcoded login credentials for the manufacturer's MQTT broker.\n\nUsing these credentials, they connected to the broker and could access real-time data from all users' devices, including live EEG brainwave readings. More critically, the same open system allowed sending commands to any device, including triggering electrical muscle stimulation (EMS) around a sleeping user's eyes.\n\nThe article highlights a severe security flaw: the devices share universal credentials, exposing users to unauthorized data surveillance and potential physical manipulation. The researcher has responsibly disclosed the issue to the company and referenced broader concerns about digital hygiene in connected devices. The technical process of reverse-engineering the Bluetooth protocol and Flutter-based app was largely automated by an AI assistant.",
    "chinese_title": "我的智能睡眠面具将用户的脑电波广播至开放的MQTT代理服务器。",
    "chinese_summary": "一名用户对一款智能睡眠眼罩进行了逆向工程，发现它会向开放服务器广播敏感数据。在该眼罩的应用程序被证明不可靠后，他们利用人工智能工具对其反编译，发现了制造商MQTT代理服务器的硬编码登录凭证。\n\n通过使用这些凭证，他们连接到代理服务器，能够访问所有用户设备的实时数据，包括实时的脑电图脑波读数。更关键的是，同一开放系统允许向任何设备发送命令，包括触发睡眠用户眼部周围的电肌肉刺激（EMS）。\n\n文章揭示了一个严重的安全漏洞：这些设备共享通用凭证，使用户面临未经授权的数据监控和潜在的物理操控风险。研究人员已负责任地向公司披露了该问题，并提及了对联网设备数字卫生的更广泛担忧。逆向工程蓝牙协议和基于Flutter的应用程序的技术过程主要由人工智能助手自动完成。"
  },
  {
    "id": "46968964",
    "title": "RynnBrain",
    "url": "https://github.com/alibaba-damo-academy/RynnBrain",
    "summary": "**Summary of RynnBrain**\n\nRynnBrain is an embodied foundation model designed to understand and interact with the physical world. It is available in three core variants: two dense models (2B and 8B parameters) and one Mixture-of-Experts model (30B-A3B). The model is built upon Qwen3-VL and uses a unified encoder-decoder architecture to process visual inputs (like videos) and text instructions, outputting spatial trajectories, physical pointing, and action plans.\n\nIts key capabilities include:\n*   **Fine-grained egocentric understanding:** Excelling at tasks like video QA, object counting, and OCR within first-person perspectives.\n*   **Spatio-temporal localization:** Precisely locating objects, areas, motion paths, and affordances in images and videos.\n*   **Physical-space reasoning:** Using an \"interleaved reasoning\" approach that alternates between textual logic and spatial grounding to ensure reasoning is rooted in reality.\n*   **Physics-aware planning:** Integrating location and affordance information to enable detailed task decomposition and action planning for robots.\n\nThe project also releases specialized post-trained models for task planning (Plan), vision-language navigation (Nav), and chain-of-point reasoning (CoP). It introduces **RynnBrain-Bench**, a benchmark to evaluate embodied understanding across cognition and localization. The code, model checkpoints, and a technical report were released in February 2026, with quick-start guides and example \"cookbooks\" provided to demonstrate its various functions.",
    "chinese_title": "瑞恩布雷恩",
    "chinese_summary": "**RynnBrain 概述**\n\nRynnBrain 是一个具身基础模型，旨在理解物理世界并与之交互。它提供三个核心版本：两个稠密模型（2B 和 8B 参数）和一个混合专家模型（30B-A3B）。该模型基于 Qwen3-VL 构建，采用统一的编码器-解码器架构来处理视觉输入（如视频）和文本指令，输出空间轨迹、物理指向和行动规划。\n\n其核心能力包括：\n*   **细粒度第一人称理解：** 擅长视频问答、物体计数和第一人称视角内的光学字符识别等任务。\n*   **时空定位：** 在图像和视频中精确定位物体、区域、运动路径和可供性。\n*   **物理空间推理：** 采用“交错推理”方法，交替进行文本逻辑推理和空间基础定位，确保推理基于现实。\n*   **物理感知规划：** 整合位置和可供性信息，实现详细的任务分解和机器人行动规划。\n\n该项目还发布了针对任务规划、视觉语言导航和指向推理链的专项后训练模型。它推出了 **RynnBrain-Bench** 基准，用于评估具身理解在认知和定位方面的能力。代码、模型检查点和技术报告已于 2026 年 2 月发布，并提供了快速入门指南和示例“操作手册”以展示其各项功能。"
  },
  {
    "id": "47023238",
    "title": "Amazon, Google Unwittingly Reveal the Severity of the U.S. Surveillance State",
    "url": "https://greenwald.substack.com/p/amazons-ring-and-googles-nest-unwittingly",
    "summary": "This article argues that recent events involving Amazon's Ring and Google's Nest reveal the alarming expansion of the U.S. surveillance state, which is now more pervasive than a decade after Edward Snowden's disclosures.\n\nAmazon's Super Bowl ad for Ring's \"Search Party\" feature inadvertently highlighted how personal security cameras can be networked into a widespread surveillance dragnet, using AI to scan for people or pets, sparking significant public backlash. Shortly after, the FBI's recovery of footage from an unsubscribed Google Nest camera in a missing person case raised serious questions about Google storing video data even without user subscriptions, contradicting common understanding.\n\nThe author connects these incidents to a broader trend of eroding privacy driven by Silicon Valley, including the expansion of Palantir's government contracts, the proliferation of facial recognition technology, and the emerging threats from AI, which can compile intrusive personal dossiers. The core argument is that Americans are passively accepting this trade-off of liberty for perceived security, despite the foundational principles of the country. The article concludes that the initial public outrage following the Snowden revelations has dissipated, allowing the state-corporate surveillance apparatus to grow stronger with little resistance.",
    "chinese_title": "亚马逊、谷歌无意间暴露了美国监控国家的严重程度",
    "chinese_summary": "本文指出，亚马逊Ring与谷歌Nest近期事件揭示了美国监控体系的惊人扩张——其渗透程度已远超十年前爱德华·斯诺登披露后的状况。\n\n亚马逊为Ring\"搜索派对\"功能投放的超级碗广告，意外暴露了个人安防摄像头如何被联网成大规模监控天网：通过人工智能扫描人或宠物踪迹，引发强烈公众反弹。此后，联邦调查局在一桩失踪案中从未订阅的谷歌Nest摄像头获取录像，更暴露谷歌在用户未订阅时仍存储视频数据的事实，颠覆了公众普遍认知。\n\n作者将这些事件与硅谷推动的隐私侵蚀趋势相联系：包括Palantir政府合同的扩张、人脸识别技术的泛滥，以及人工智能编制侵入性个人档案的新威胁。核心论点是，美国人正被动接受以自由换取表面安全的交易，这违背了立国根基。文章最终指出，斯诺登事件激起的公众愤怒已逐渐消散，国家与企业结合的监控机器正以近乎零阻力的态势日益壮大。"
  },
  {
    "id": "46994456",
    "title": "The seam through the center of things",
    "url": "https://usefulfictions.substack.com/p/the-seam-through-the-center-of-things",
    "summary": "In this personal essay, Cate Hall describes her devastating, multi-year addiction to nitrous oxide, which began in 2017 after a drug-induced spiritual experience she interprets as an encounter with God. This experience filled a profound, previously unnoticed void, convincing her of a purposeful, loving universe. Driven to obtain tangible proof of this reality, she abandoned her career as a top poker player and obsessively documented her subsequent drug use in an attempt to reconnect with the divine.\n\nWhen the perceived connection ended, her rational mind became a tool for her addiction, justifying continued use through frameworks like Pascal's wager and the belief she was being tested. The addiction ultimately left her financially ruined, physically injured, and cognitively impaired. Getting sober required accepting there was no grand purpose or redemption for her suffering.\n\nShe explains that co-writing her recent book, *You Can Just Do Things*, served as an unconscious healing process, allowing her to transform her traumatic experience into something valuable for others. Finishing the manuscript released a long-held tension, manifesting as frequent tears of gratitude for ordinary beauties of life, signaling that her internal crisis had finally closed.",
    "chinese_title": "贯穿万物的缝隙",
    "chinese_summary": "在这篇个人随笔中，凯特·霍尔描述了她对一氧化二氮长达数年、摧毁一切的成瘾经历。这一切始于2017年一次药物引发的灵性体验，她将其解读为与上帝的相遇。这次体验填补了她内心深处一个长久以来未被察觉的空洞，让她相信宇宙充满意义与爱。为了获得这种现实的确凿证据，她放弃了顶级扑克选手的职业生涯，并痴迷地记录下随后的药物使用过程，试图重新与神圣连接。\n\n当这种感知到的连接消失后，她的理性思维反而成了成瘾的帮凶，通过帕斯卡的赌注等理论框架以及“自己正在经受考验”的信念，为持续用药辩护。成瘾最终使她经济破产、身体受损、认知障碍。戒除毒瘾需要她接受一个事实：她的痛苦并无宏大意义，也无法换来救赎。\n\n她解释道，合著新书《你可以直接去做》的过程，无意中成了一种疗愈方式，让她能将创伤经历转化为对他人有价值的产物。完成书稿释放了她积压已久的紧绷感，表现为对平凡生活之美频繁涌出的感恩之泪——这标志着她内心的危机终于画上了句号。"
  },
  {
    "id": "47025338",
    "title": "Show HN: Knock-Knock.net – Visualizing the bots knocking on my server's door",
    "url": "https://knock-knock.net",
    "summary": "**Summary:**\n\nKnock-Knock.net is a website that visualizes, in real-time, the constant automated bot attacks targeting an unprotected internet server. It frames this activity as the \"background radiation of the Internet\"—a persistent, global stream of unauthorized login attempts.\n\nThe core of the project is a live dashboard showing attempted intrusions as they happen, including the bot's geographic location, IP address, ISP, and the usernames and passwords used. The site also aggregates historical data, providing statistics on attack origins, common credentials tried, and the most problematic internet providers.\n\nBy publicly displaying this data, the site aims to demonstrate the scale and nature of automated malicious traffic on the open internet, while assuring visitors that the showcased server remains secure (\"...BUT THEY CAN'T COME IN\"). It presents the information in an engaging format, supplemented with trivia and related content.",
    "chinese_title": "Show HN：Knock-Knock.net —— 可视化那些敲击我服务器门的机器人",
    "chinese_summary": "**概述：**\n\nKnock-Knock.net 是一个实时可视化网站，展示针对未受保护互联网服务器的持续自动化机器人攻击。它将此活动描述为“互联网的背景辐射”——一股持续不断、全球性的未授权登录尝试流。\n\n该项目的核心是一个实时仪表板，显示正在发生的入侵尝试，包括机器人的地理位置、IP地址、互联网服务提供商（ISP）以及使用的用户名和密码。网站还汇总了历史数据，提供有关攻击来源、常用尝试凭证以及问题最突出的互联网服务提供商的统计数据。\n\n通过公开展示这些数据，该网站旨在揭示开放互联网上自动化恶意流量的规模和性质，同时向访问者保证所展示的服务器是安全的（“……但他们无法进入”）。它以引人入胜的形式呈现信息，并辅以趣闻和相关内容。"
  },
  {
    "id": "46977477",
    "title": "Build Gaussian Splat Experiences with SuperSplat Studio",
    "url": "https://blog.playcanvas.com/build-gaussian-splat-experiences-with-supersplat-studio/",
    "summary": "SuperSplat Studio is a new application for creating interactive 3D experiences using Gaussian splats. It allows creators to build guided presentations by adding up to 25 informational hotspots (annotations) to a scene, each with a title, description, and saved camera viewpoint. Viewers can click these hotspots or use a navigation bar to cycle through them for a structured tour.\n\nThe tool also offers extensive visual customization through PlayCanvas Engine-powered post-processing effects. Users can apply bloom, sharpen, vignette, color grading, and chromatic fringing in real-time. Additional controls for tonemapping (with multiple operator options) and background color are included to refine the scene's final look.\n\nTo get started, users must first publish a splat via the SuperSplat Editor, then open it from the Manage page in Studio. The announcement invites community feedback on future features via Discord or X.",
    "chinese_title": "使用SuperSplat Studio构建高斯飞溅体验",
    "chinese_summary": "SuperSplat Studio是一款用于创建基于高斯溅射的交互式3D体验的新应用。它允许创作者通过向场景中添加最多25个信息热点（标注点）来构建引导式演示，每个热点包含标题、描述和保存的相机视角。观众可点击这些热点或使用导航栏依次浏览，获得结构化导览。\n\n该工具还通过PlayCanvas引擎支持的后期处理效果提供广泛的视觉自定义功能。用户可实时应用泛光、锐化、暗角、色彩分级和色散效果。此外还包含色调映射（提供多种算子选项）和背景颜色调整控件，以优化场景的最终视觉效果。\n\n用户需先在SuperSplat编辑器中发布溅射文件，然后通过Studio管理页面打开文件即可开始创作。公告邀请社区通过Discord或X平台对未来功能提供反馈。"
  },
  {
    "id": "47022329",
    "title": "Two different tricks for fast LLM inference",
    "url": "https://www.seangoedecke.com/fast-llm-inference/",
    "summary": "This article compares the new \"fast mode\" inference features from Anthropic and OpenAI, explaining they use fundamentally different technical approaches.\n\nAnthropic's fast mode for Claude Opus 4.6 offers ~2.5x speed (up to 170 tokens/sec) at 6x the cost. The author theorizes this is achieved by using a low-batch-size inference strategy, similar to a bus leaving immediately for one passenger instead of waiting to fill up. This improves individual speed but reduces overall system throughput and is more expensive.\n\nOpenAI's fast mode for GPT-5.3-Codex-Spark offers a much larger ~15x speed increase (over 1000 tokens/sec). This is powered by specialized Cerebras chips with massive 44GB of on-chip memory, allowing an entire small model to reside in fast SRAM and eliminating slow data transfers. However, this requires a smaller, distilled model (\"Spark\"), which is notably less capable than the full GPT-5.3-Codex.\n\nThe author suggests OpenAI's Cerebras-based method is more technically impressive, while speculating Anthropic's move may be a competitive response. They conclude that while fast inference is being explored, raw speed at the cost of accuracy may not be the most valuable trade-off for AI assistants, as user time is often dominated by correcting mistakes rather than waiting for responses.",
    "chinese_title": "两种加速大语言模型推理的巧妙方法",
    "chinese_summary": "本文对比了Anthropic与OpenAI新推出的“快速模式”推理功能，指出两者采用截然不同的技术路径。\n\nAnthropic为Claude Opus 4.6提供的快速模式可实现约2.5倍加速（最高170词元/秒），但成本增加6倍。作者推测其采用低批量推理策略，类似巴士为单个乘客立即发车而非等待满载。这种方式提升单次响应速度，却降低了系统整体吞吐量且成本更高。\n\nOpenAI为GPT-5.3-Codex-Spark提供的快速模式实现约15倍大幅加速（超1000词元/秒）。这得益于专用Cerebras芯片配备的44GB超大片上内存，使整个精简模型能驻留于高速SRAM中，消除缓慢的数据传输。但该方案需使用经蒸馏的小型模型（“Spark”），其能力明显弱于完整版GPT-5.3-Codex。\n\n作者认为OpenAI基于Cerebras的方案技术含量更高，同时推测Anthropic的举措或是竞争性应对。文末指出，尽管业界正探索快速推理，但以准确性换取速度对AI助手未必是最佳权衡——用户时间往往消耗于纠错而非等待响应。"
  }
]