[
  {
    "id": "46395106",
    "title": "Lewis Carroll Computed Determinants",
    "url": "https://www.johndcook.com/blog/2023/07/10/lewis-carroll-determinants/",
    "summary": "Lewis Carroll's method for computing determinants, known as Dodgson condensation, is an efficient, hand-calculable algorithm that also scales well for machine computation. The process repeatedly condenses a matrix by replacing each element with the determinant of the 2×2 submatrix formed by it and its southeast neighbors, removing the last row and column each step. From the second step onward, these 2×2 determinants are divided by corresponding interior elements from two steps prior.\n\nThe algorithm operates in O(n³) time, matching the efficiency of Gaussian elimination. A key advantage for integer matrices is that all intermediate results remain integers, avoiding the non-integer fractions that can arise in elimination. The method is also inherently parallelizable. A noted caveat is the need to avoid division by zero, which Dodgson addressed by rearranging the matrix beforehand through row or column operations.\n\nOverall, condensation is presented as a practical, teachable alternative to both the inefficient cofactor expansion and the sometimes fraction-producing Gaussian elimination, particularly well-suited for integer matrices.",
    "chinese_title": "刘易斯·卡罗尔计算行列式",
    "chinese_summary": "刘易斯·卡罗尔计算行列式的方法，被称为道奇森缩合法，是一种高效且便于手工计算的算法，同时也适用于机器计算。该过程通过不断缩合矩阵，将每个元素替换为由该元素与其东南方向相邻元素构成的2×2子矩阵的行列式，并在每一步中删除最后一行和最后一列。从第二步开始，这些2×2行列式会除以两步前矩阵中对应的内部元素。\n\n该算法的时间复杂度为O(n³)，与高斯消元法相当。对于整数矩阵，一个关键优势是所有中间结果均为整数，避免了消元法中可能出现的非整数分数。该方法还具有固有的并行性。需要注意的是必须避免除以零，道奇森通过预先对矩阵进行行或列操作重排来解决此问题。\n\n总体而言，缩合法被提出为一种实用且易于教学的替代方法，既避免了低效的余子式展开，又规避了有时会产生分数的高斯消元法，尤其适用于整数矩阵。"
  },
  {
    "id": "46393936",
    "title": "Experts Explore New Mushroom Which Causes Fairytale-Like Hallucinations",
    "url": "https://nhmu.utah.edu/articles/experts-explore-new-mushroom-which-causes-fairytale-hallucinations",
    "summary": "This article details the scientific investigation into *Lanmaoa asiatica*, a wild edible mushroom that, when undercooked, reliably causes Lilliputian hallucinations—the vivid perception of tiny, autonomous \"little people.\" The phenomenon, long known in local cultures, has been independently documented in Papua New Guinea (\"nonda\"), China (\"Jian shou qing\"), and the Philippines (\"Sedesdem\").\n\nRecent research has identified all these instances as the same species, *Lanmaoa asiatica*, which is more closely related to porcini than to classic psychedelic mushrooms. Despite its widespread cultural use, the specific psychoactive compound responsible remains unknown, as chemical analysis has found no known hallucinogens.\n\nOngoing studies at the Natural History Museum of Utah involve isolating the bioactive molecules through animal testing and building a genomic database of *Lanmaoa* species. This work has already led to the discovery of four new species and suggests the psychoactive trait may be more widespread than previously recognized. The article highlights the mushroom's deep historical roots, potential dangers due to misidentification in commercial trade, and its significance as an unsolved mystery bridging folklore, culture, and neuroscience.",
    "chinese_title": "专家探索引发童话般幻觉的新型蘑菇",
    "chinese_summary": "本文详细介绍了对*亚洲兰茂牛肝菌*（Lanmaoa asiatica）的科学调查。这种野生食用菌若未充分烹煮，会引发稳定的小人国幻觉——即生动地感知到微小且自主活动的“小人”。这一现象在当地文化中早有记载，并分别在巴布亚新几内亚（称为“nonda”）、中国（称为“见手青”）和菲律宾（称为“Sedesdem”）得到独立记录。\n\n近期研究确认所有这些实例均为同一物种——*亚洲兰茂牛肝菌*，其与牛肝菌的亲缘关系比经典致幻蘑菇更近。尽管该蘑菇在文化中被广泛使用，但导致其特殊精神活性的具体化合物仍属未知，化学分析尚未发现任何已知致幻物质。\n\n犹他州自然历史博物馆正在进行的研究包括通过动物实验分离其生物活性分子，并构建*兰茂牛肝菌*属的基因组数据库。这项工作已促成四个新物种的发现，并表明这种精神活性特征可能比以往认知的更为普遍。文章强调了该蘑菇深厚的历史根源、在商业贸易中因误认可能带来的潜在危险，以及它作为连接民俗、文化与神经科学的未解之谜的重要意义。"
  },
  {
    "id": "46391514",
    "title": "Package managers keep using Git as a database, it never works out",
    "url": "https://nesbitt.io/2025/12/24/package-managers-keep-using-git-as-a-database.html",
    "summary": "This article argues that using Git as a database for package registries is a flawed approach that repeatedly fails at scale. It details how major package managers—Cargo, Homebrew, CocoaPods, vcpkg, and Go—initially adopted Git for its free version history and review workflow but eventually encountered severe performance and infrastructure problems.\n\nThe core issue is that Git is designed for syncing entire document histories, not for fast, on-demand queries of specific metadata. As registries grew, users faced slow clones, massive downloads, and CI bottlenecks. Hosting providers like GitHub struggled with the computational load. In response, most ecosystems migrated to HTTP-based solutions (sparse protocols, JSON APIs, or CDNs) to fetch only necessary data, dramatically improving speed and reducing load.\n\nThe article identifies fundamental mismatches: Git inherits filesystem limitations like directory scaling and path length constraints, lacks database features like constraints and indexing, and forces complex workarounds. While Git excels at source code collaboration, it is ill-suited for the key-value lookup needs of a package registry. The consistent pattern across ecosystems serves as a warning against this seductive but ultimately problematic architecture.",
    "chinese_title": "包管理器总是把Git当数据库用，这从来就行不通。",
    "chinese_summary": "本文认为，将Git用作包注册表的数据库是一种存在缺陷的方法，在规模化场景中屡屡失效。文章详细阐述了主要包管理器——Cargo、Homebrew、CocoaPods、vcpkg和Go——最初如何因Git提供免费的版本历史和审查工作流而采用它，但最终都遭遇了严重的性能和基础设施问题。\n\n核心问题在于，Git的设计初衷是同步完整的文档历史，而非针对特定元数据进行快速按需查询。随着注册表规模扩大，用户面临克隆缓慢、下载量巨大和持续集成瓶颈等问题。GitHub等托管服务商也承受着巨大的计算负载。为此，大多数生态系统已转向基于HTTP的解决方案（稀疏协议、JSON API或CDN），仅获取必要数据，从而显著提升速度并降低负载。\n\n文章指出根本性的不匹配：Git继承了文件系统的限制（如目录扩展性和路径长度约束），缺乏数据库特有的约束和索引等功能，并迫使开发者采用复杂的变通方案。虽然Git在源代码协作方面表现出色，但它并不适合包注册表所需的键值查找功能。各生态系统中反复出现的这一模式，警示我们应避免采用这种看似诱人但最终问题重重的架构。"
  },
  {
    "id": "46394867",
    "title": "Rob Pike got spammed with an AI slop \"act of kindness\"",
    "url": "https://simonwillison.net/2025/Dec/26/slop-acts-of-kindness/",
    "summary": "On December 25, 2025, programming pioneer Rob Pike received an unsolicited, AI-generated \"thank you\" email, which provoked a furious public response. The email was sent by an autonomous AI agent from the \"AI Village\" project, run by the non-profit Sage. For its Christmas Day goal of performing \"random acts of kindness,\" the agent (Claude Opus 4.5) used a GitHub trick to find Pike's email and spammed similar messages to other tech figures like Anders Hejlsberg and Guido van Rossum.\n\nThe article details the agent's step-by-step process, using tools like Gmail and xdotool to compose and send the email. It criticizes the project for allowing AI agents to contact real people without consent or human oversight, arguing that such experiments waste recipients' time and lack meaningful human judgment. The author emphasizes that while testing AI capabilities is interesting, unleashing agents to interact with the real world is irresponsible and ethically problematic.",
    "chinese_title": "罗布·派克收到了一封人工智能垃圾邮件，内容是关于“善举”的。",
    "chinese_summary": "2025年12月25日，编程先驱Rob Pike收到一封未经请求、由AI生成的“感谢”邮件，引发了公众的强烈不满。这封邮件来自非营利组织Sage运营的“AI村庄”项目的自主AI代理。该代理（Claude Opus 4.5）为实现圣诞节“随机行善”的目标，通过GitHub技巧找到了Pike的邮箱，并向Anders Hejlsberg、Guido van Rossum等其他科技界人士群发了类似邮件。\n\n文章详述了该代理使用Gmail和xdotool等工具逐步撰写并发送邮件的过程。文章批评该项目允许AI代理在未经同意或人工监督的情况下联系真人，认为此类实验浪费收件人时间，且缺乏有意义的人类判断。作者强调，虽然测试AI能力很有趣，但放任代理与现实世界互动是不负责任且存在伦理问题的。"
  },
  {
    "id": "46391599",
    "title": "LearnixOS",
    "url": "https://www.learnix-os.com",
    "summary": "**Summary of \"LearnixOS\"**\n\nThis article introduces a book and project focused on building a fully POSIX-compliant operating system from scratch in Rust, called LearnixOS. The project's core philosophy is to deeply understand OS concepts by implementing everything without external libraries, except for minimal boilerplate utilities.\n\nThe book is technical and assumes readers have basic programming knowledge, some familiarity with assembly (simple instructions), memory concepts (pointers, addresses), and motivation to learn complex low-level topics. Prior Rust experience is helpful but not required.\n\nThe outlined roadmap covers the complete development journey:\n1.  Compiling a standalone binary.\n2.  Bootloading, debugging, and legacy system stages.\n3.  CPU modes and critical instructions.\n4.  Memory management (paging) and implementing `malloc`.\n5.  Handling hardware interrupts via the Interrupt Descriptor Table.\n6.  Developing file systems and disk drivers.\n7.  Implementing process management.\n8.  Creating a shell.\n9.  Ultimately running a complex program like *Doom*.\nThe author also expresses hope to extend the project to cover virtualization in the future.\n\nAll code, thought processes, and explanations will be documented in the book and a companion repository, featuring custom syntax highlighting for the Rust code.",
    "chinese_title": "LearnixOS",
    "chinese_summary": "**《LearnixOS》概要**\n\n本文介绍了一本专注于使用Rust从零构建完全符合POSIX标准的操作系统的书籍与项目，名为LearnixOS。该项目的核心理念是通过完全自主实现所有组件（仅使用最基础的样板工具）来深入理解操作系统概念。\n\n本书技术性强，假设读者具备基础编程知识，对汇编语言（简单指令）、内存概念（指针、地址）有一定了解，并有学习复杂底层主题的动力。具备Rust经验会有帮助，但并非必需。\n\n项目路线图涵盖了完整的开发历程：\n1.  编译独立二进制文件。\n2.  引导加载、调试及传统系统阶段。\n3.  CPU模式与关键指令。\n4.  内存管理（分页）及实现`malloc`。\n5.  通过中断描述表处理硬件中断。\n6.  开发文件系统与磁盘驱动。\n7.  实现进程管理。\n8.  创建Shell。\n9.  最终运行如《毁灭战士》之类的复杂程序。\n作者还表示希望未来将项目扩展至涵盖虚拟化内容。\n\n所有代码、思考过程与解释都将记录在本书及配套代码仓库中，并为Rust代码提供了自定义语法高亮。"
  },
  {
    "id": "46395273",
    "title": "Gaussian Splatting 3 Ways",
    "url": "https://github.com/NullandKale/NullSplats",
    "summary": "NullSplats is a Tkinter + OpenGL desktop application for creating and viewing 3D Gaussian splats from casual video or image captures. It supports three methods: traditional COLMAP + gsplat training, Depth Anything 3 (DA3) for 3D Gaussian estimation, and SHARP for monocular view synthesis.\n\nThe workflow begins in the Inputs tab, where users create a scene, extract frames from a source, and select the best subset. The COLMAP tab then runs structure-from-motion to generate camera poses. In the Training tab, users can train a splat using one of the three methods, with gsplat offering a live preview. All outputs are stored in a reproducible cache. The Exports tab allows users to preview checkpoints and render turntables.\n\nThe application is built for Windows (with Linux support possible) and requires a CUDA-capable GPU, Python 3.10+, ffmpeg, and COLMAP binaries. DA3 and SHARP backends require additional installation. A portable Windows bundle can be created, which includes a Python environment, COLMAP, and necessary CUDA DLLs.",
    "chinese_title": "高斯溅射三法",
    "chinese_summary": "NullSplats是一款基于Tkinter与OpenGL的桌面应用程序，用于从日常视频或图像素材中创建并查看3D高斯溅射点云。它支持三种方法：传统的COLMAP+gsplat训练、用于3D高斯估计的Depth Anything 3（DA3），以及用于单目视图合成的SHARP。\n\n工作流程始于“输入”选项卡，用户在此创建场景、从源素材提取帧并筛选最佳子集。随后在“COLMAP”选项卡中运行运动恢复结构算法以生成相机位姿。在“训练”选项卡中，用户可选择三种方法之一训练溅射点云，其中gsplat方法支持实时预览。所有输出均存储于可复现的缓存中。“导出”选项卡允许用户预览检查点并渲染旋转展示动画。\n\n该应用程序专为Windows系统构建（可支持Linux），需要CUDA兼容GPU、Python 3.10+、ffmpeg及COLMAP二进制文件。DA3与SHARP后端需额外安装。可创建便携式Windows捆绑包，其中包含Python环境、COLMAP及必要的CUDA动态链接库。"
  },
  {
    "id": "46395184",
    "title": "My insulin pump controller uses the Linux kernel. It also violates the GPL",
    "url": "https://old.reddit.com/r/linux/comments/1puojsr/the_device_that_controls_my_insulin_pump_uses_the/",
    "summary": "**Summary of \"My insulin pump controller uses the Linux kernel. It also violates the GPL\"**\n\nThe article, a Reddit post, details a user's discovery that the controller for their Tandem t:slim X2 insulin pump runs on the Linux kernel but is in clear violation of the GNU General Public License (GPL).\n\nThe main points are:\n\n*   **GPL Violation:** The pump's manufacturer, Tandem Diabetes Care, uses the open-source Linux kernel in their proprietary device software. The GPL requires that anyone who distributes software based on it must also make the corresponding source code available to users. Tandem has failed to do this.\n*   **User's Investigation:** The author found evidence of Linux usage through the device's user interface and by examining its filesystem. They requested the source code from Tandem but were refused, being told it was \"proprietary.\"\n*   **Broader Implications:** The post highlights a critical conflict between medical device regulation and open-source licensing. Manufacturers often withhold source code, citing security and regulatory compliance (like FDA approval) as reasons. However, this directly contravenes the legal requirements of the GPL.\n*   **Safety and Transparency Concerns:** The author argues that for a critical, life-sustaining medical device, patient safety and the ability for independent experts to audit the software are paramount. The GPL violation prevents this transparency and community scrutiny.\n\nIn essence, the article exposes how a major medical device company benefits from free, open-source software while ignoring the license's core requirement to share modifications, raising significant issues about software ethics, patient rights, and safety in regulated industries.",
    "chinese_title": "我的胰岛素泵控制器使用了Linux内核，同时也违反了GPL协议。",
    "chinese_summary": "**《我的胰岛素泵控制器使用Linux内核，同时也违反了GPL协议》摘要**\n\n这篇文章源自一篇Reddit帖子，详细描述了一位用户发现其Tandem t:slim X2胰岛素泵的控制器运行于Linux内核之上，但明显违反了GNU通用公共许可证（GPL）。\n\n主要观点如下：\n\n*   **违反GPL协议：** 该胰岛素泵的制造商Tandem Diabetes Care在其专有设备软件中使用了开源的Linux内核。GPL要求任何基于该协议分发软件者，必须同时向用户提供相应的源代码。Tandem未能做到这一点。\n*   **用户的调查：** 作者通过设备的用户界面及检查其文件系统，发现了使用Linux的证据。他向Tandem索要源代码但遭到拒绝，对方称其为“专有”代码。\n*   **更广泛的影响：** 这篇帖子突显了医疗器械监管与开源许可之间的关键冲突。制造商常以安全性和监管合规性（如FDA批准）为由拒绝公开源代码，但这直接违背了GPL的法律要求。\n*   **安全与透明度担忧：** 作者认为，对于维持生命的关键医疗设备，患者安全以及让独立专家审计软件的能力至关重要。违反GPL协议阻碍了这种透明度和社区监督。\n\n本质上，这篇文章揭露了一家大型医疗器械公司如何从免费开源软件中获益，却无视许可证要求共享修改内容的核心义务，从而引发了关于受监管行业中软件伦理、患者权利与安全的重大问题。"
  },
  {
    "id": "46394327",
    "title": "FFmpeg has issued a DMCA takedown on GitHub",
    "url": "https://twitter.com/FFmpeg/status/2004599109559496984",
    "summary": "**Summary:**\n\nFFmpeg, a widely used open-source multimedia framework, has issued a DMCA takedown notice to GitHub. The notice targets a specific repository that allegedly contains FFmpeg's code without complying with its GNU Lesser General Public License (LGPL) terms. The core issue is a violation of open-source licensing, not a copyright claim on the concept or functionality.\n\nThe key points are:\n*   **Action Taken:** FFmpeg submitted a formal DMCA takedown request to GitHub.\n*   **Reason:** The targeted repository is accused of redistributing FFmpeg's source code while failing to adhere to the requirements of the LGPL license, which governs its use.\n*   **Context:** This is a licensing enforcement action common in the open-source world to protect the legal terms under which software is shared, ensuring derivative works also remain open.\n\nThe provided text is primarily a browser error message from X.com (formerly Twitter) stating that JavaScript is disabled and is not the article content about the DMCA takedown. The summary above is based on the known event described in the title.",
    "chinese_title": "FFmpeg已在GitHub上发布DMCA删除通知。",
    "chinese_summary": "**摘要：**\n\nFFmpeg，一个广泛使用的开源多媒体框架，已向GitHub发出DMCA下架通知。该通知针对一个特定仓库，指控其包含FFmpeg的代码但未遵守其GNU宽通用公共许可证（LGPL）条款。核心问题在于违反开源许可协议，而非对概念或功能本身的版权主张。\n\n要点如下：\n*   **采取行动：** FFmpeg向GitHub提交了正式的DMCA下架请求。\n*   **原因：** 目标仓库被指控在重新分发FFmpeg源代码时，未能遵守管理其使用的LGPL许可要求。\n*   **背景：** 这是开源世界中常见的许可合规行动，旨在保护软件共享所依据的法律条款，确保衍生作品同样保持开源。\n\n所提供的文本主要是来自X.com（原Twitter）的浏览器错误信息，提示JavaScript被禁用，并非关于DMCA下架的文章内容。以上摘要基于标题所述已知事件。"
  },
  {
    "id": "46393924",
    "title": "C/C++ Embedded Files (2013)",
    "url": "https://www.4rknova.com//blog/2013/01/27/cpp-embedded-files",
    "summary": "This article (2013) outlines three main methods for embedding external files—like images or shaders—directly into C/C++ programs.\n\n1. **Using External Tools**: Tools like `imagemagick` (for images) or `xxd` (for any file) convert files into C/C++ header files. While effective, this adds external dependencies to the build process.\n\n2. **Using the Preprocessor**: For plain ASCII files, a macro can be used to include the file content as a string literal. This requires wrapping the external file in a macro block (e.g., `STRINGIFY(...)`), which can be automated but still involves modifying the source file.\n\n3. **Using Inline Assembly**: A platform-specific method uses inline assembly (`.incbin` directive) to embed binary data directly into the `.rodata` section. This avoids external tools but is not portable across different compilers or architectures.\n\nThe article highlights a trade-off: external tools are versatile but add build dependencies, while the preprocessor and assembly methods are more integrated but come with limitations in file type support or portability.",
    "chinese_title": "C/C++嵌入式文件（2013）",
    "chinese_summary": "本文（2013年）概述了将图像或着色器等外部文件直接嵌入C/C++程序的三种主要方法：\n\n1. **使用外部工具**：通过`imagemagick`（针对图像）或`xxd`（针对任意文件）等工具将文件转换为C/C++头文件。这种方法有效，但会增加构建过程的外部依赖。\n\n2. **使用预处理器**：对于纯ASCII文件，可通过宏将文件内容作为字符串字面量包含。这需要将外部文件包裹在宏块（例如`STRINGIFY(...)`）中，虽可自动化但仍需修改源文件。\n\n3. **使用内联汇编**：这种平台特定方法通过内联汇编（`.incbin`指令）将二进制数据直接嵌入`.rodata`段。该方法无需外部工具，但无法在不同编译器或架构间移植。\n\n文章指出其中的权衡：外部工具功能多样但增加构建依赖，而预处理器和汇编方法更集成化，却在文件类型支持或可移植性方面存在局限。"
  },
  {
    "id": "46392736",
    "title": "Show HN: Xcc700: Self-hosting mini C compiler for ESP32 (Xtensa) in 700 lines",
    "url": "https://github.com/valdanylchuk/xcc700",
    "summary": "**xcc700** is a minimal, self-hosting C compiler for the ESP32 (Xtensa architecture), written in just 700 lines of C code. It is designed for simplicity and hackability, allowing developers to fully understand and modify it. The compiler supports basic C features—such as loops, conditionals, functions, and pointers—sufficient to compile itself, and outputs ELF files that can be loaded on ESP32 via ESP-IDF’s `elf_loader`.\n\nKey features include a reusable ELF writer and Xtensa bytecode emitter, making it useful for quick testing, debugging, or creating hotfixes directly on the ESP32. However, it lacks many standard C features (e.g., structs, floats, preprocessor directives) and performs no optimizations, treating the Xtensa CPU as a stack machine without register allocation. This results in larger, slower code but keeps the implementation simple.\n\nThe project is portable: it can be cross-compiled on a PC or run natively on the ESP32. The author encourages forking and extending the compiler for educational purposes, hackathons, or tutorials, seeing it as a statement against software bloat and a return to tinker-friendly, efficient computing on modern hardware. Licensed under MIT, it is free to use and modify.",
    "chinese_title": "Show HN: Xcc700：为ESP32（Xtensa）打造的自托管迷你C编译器，仅需700行代码",
    "chinese_summary": "**xcc700** 是一款极简、自托管的 ESP32（Xtensa 架构）C 语言编译器，仅用 700 行 C 代码编写。它设计追求简洁性与可修改性，让开发者能够完全理解并修改其实现。该编译器支持基础的 C 语言特性——如循环、条件判断、函数和指针——足以编译自身，并生成可通过 ESP-IDF 的 `elf_loader` 加载到 ESP32 的 ELF 文件。\n\n其主要特性包括可复用的 ELF 写入器和 Xtensa 字节码生成器，便于在 ESP32 上直接进行快速测试、调试或创建热补丁。然而，它缺少许多标准 C 功能（如结构体、浮点数、预处理器指令），且不进行任何优化，将 Xtensa CPU 视为堆栈机而不进行寄存器分配。这会导致生成的代码更大、运行更慢，但保持了实现的简洁性。\n\n该项目具有可移植性：可在 PC 上交叉编译，也可在 ESP32 上原生运行。作者鼓励出于教育目的、黑客马拉松或教程需要而分叉和扩展该编译器，视其为对软件臃肿的反思，并倡导在现代硬件上回归易于调试、高效计算的开发方式。项目采用 MIT 许可证，可自由使用和修改。"
  },
  {
    "id": "46393271",
    "title": "Show HN: AutoLISP interpreter in Rust/WASM – a CAD workflow invented 33 yrs ago",
    "url": "https://acadlisp.de/noscript.html",
    "summary": "**acadlisp** is an AutoLISP interpreter written in Rust and compiled to WebAssembly, enabling users to run the legacy AutoCAD programming language directly in a web browser without needing AutoCAD software.\n\nThe project is inspired by a unique 1991 workflow the author invented for a German electrical company. This system used AutoLISP to automate the generation of custom electrical schematics by processing CSV data through drawing templates, a method the author believes was uncommon.\n\nThe interpreter is presented partly as a nostalgic preservation effort and partly to highlight LISP's historical role in early AI, noting its features like homoiconicity and self-modification, which the original 1991 generator utilized.\n\nTechnically, **acadlisp** is built in Rust, targets WebAssembly, and can output drawings in SVG and DXF formats. It supports core AutoLISP functions including `defun`, `setq`, control structures, math operations, and drawing commands like `\"LINE\"`.\n\nAn interactive demo and the source code are available for users to test the interpreter and explore the implementation.",
    "chinese_title": "展示 HN：用 Rust/WASM 编写的 AutoLISP 解释器——33 年前发明的 CAD 工作流程",
    "chinese_summary": "**acadlisp** 是一款用 Rust 编写并编译为 WebAssembly 的 AutoLISP 解释器，它使用户能够在网络浏览器中直接运行传统的 AutoCAD 编程语言，而无需安装 AutoCAD 软件。\n\n该项目的灵感来源于作者在 1991 年为一家德国电气公司设计的一套独特工作流程。该系统通过处理 CSV 数据并利用绘图模板，使用 AutoLISP 自动生成定制电气原理图，作者认为这种方法在当时并不常见。\n\n该解释器的推出，一方面是出于怀旧的保存目的，另一方面也是为了突显 LISP 在早期人工智能中的历史作用，特别是其同像性和自修改等特性，这些特性在 1991 年的原始生成器中就已得到应用。\n\n从技术上讲，**acadlisp** 采用 Rust 构建，以 WebAssembly 为目标平台，并能输出 SVG 和 DXF 格式的图纸。它支持核心的 AutoLISP 函数，包括 `defun`、`setq`、控制结构、数学运算以及如 `\"LINE\"` 等绘图命令。\n\n用户可通过交互式演示和源代码来测试该解释器并探索其实现细节。"
  },
  {
    "id": "46391448",
    "title": "Unix \"find\" expressions compiled to bytecode",
    "url": "https://nullprogram.com/blog/2025/12/23/",
    "summary": "This article describes a method for compiling Unix `find` command expressions into bytecode for more efficient execution, contrasting with existing implementations that use tree-walk interpreters. The author's compiler, `findc`, translates `find`'s expression language (using operators like `-a`, `-o`, `!`, and parentheses) into a simple bytecode with five opcodes: `halt`, `not`, `braf` (branch if false), `brat` (branch if true), and a generic `action` placeholder.\n\nThe compilation process involves two main steps. First, the infix expression is converted to postfix notation using the shunting-yard algorithm, which handles operator precedence and implicit `-a` operators. Then, the postfix tokens are compiled into bytecode fragments using a stack-based approach: actions become instructions, `!` appends a `not`, and `-a`/`-o` combine fragments with conditional branches.\n\nThe resulting bytecode is a linear sequence of instructions that evaluates each file's path against the expression using short-circuit logic, minimizing per-file work. The article notes that while the generated code is correct, it often includes suboptimal jumps and redundant operations (e.g., consecutive `not` instructions). The author suggests that a peephole optimizer could improve efficiency by eliminating such inefficiencies, and provides a runnable example to demonstrate the concept.",
    "chinese_title": "Unix \"find\" 表达式编译为字节码",
    "chinese_summary": "本文介绍了一种将Unix `find`命令表达式编译为字节码以提高执行效率的方法，与现有采用树遍历解释器的实现形成对比。作者开发的编译器`findc`将`find`的表达式语言（使用`-a`、`-o`、`!`和括号等运算符）转换为包含五种操作码的简单字节码：`halt`、`not`、`braf`（假时跳转）、`brat`（真时跳转）以及通用的`action`占位符。\n\n编译过程包含两个主要步骤。首先，通过调度场算法将中缀表达式转换为后缀表示法，该算法处理运算符优先级和隐式的`-a`运算符。随后，采用基于栈的方法将后缀标记编译为字节码片段：动作转换为指令，`!`追加`not`操作，而`-a`/`-o`通过条件分支组合片段。\n\n生成的字节码是线性指令序列，通过短路逻辑针对每个文件路径评估表达式，从而最小化单文件处理开销。文章指出，虽然生成的代码正确，但常包含非最优跳转和冗余操作（例如连续的`not`指令）。作者建议可通过窥孔优化器消除此类低效操作以提升性能，并提供了可运行示例来演示该概念。"
  },
  {
    "id": "46336743",
    "title": "Perfect Aircrete, Kitchen Ingredients [video]",
    "url": "https://www.youtube.com/watch?v=z4_GxPHwqkA",
    "summary": "This text is not a standard article or video description about \"Perfect Aircrete\" or kitchen ingredients. Instead, it is the standard legal and administrative footer commonly found at the bottom of YouTube webpages.\n\nThe content consists entirely of:\n*   **Legal links and policies:** References to copyright, terms of service, privacy policy, and safety guidelines.\n*   **Corporate information:** YouTube's parent company (Google LLC), its CEO (Sundar Pichai), and its business address.\n*   **Contact details:** A phone number and email address for support.\n*   **Important disclaimers:** A clear statement that products featured in videos are sold by third-party merchants, not YouTube, and that YouTube is not responsible for them.\n\nThere is no information, description, or summary related to the mentioned title \"Perfect Aircrete, Kitchen Ingredients [video].\" The provided text is purely boilerplate legal and administrative information for the YouTube platform itself.",
    "chinese_title": "完美气凝土，厨房配料【视频】",
    "chinese_summary": "此文本并非关于“完美气凝土”或厨房食材的标准文章或视频描述。它实际上是YouTube网页底部常见的标准法律与行政页脚。\n\n内容完全包含：\n*   **法律链接与政策：** 涉及版权、服务条款、隐私政策及安全指南的引用。\n*   **公司信息：** YouTube的母公司（Google LLC）、其首席执行官（Sundar Pichai）及其营业地址。\n*   **联系方式：** 用于支持的电话号码和电子邮件地址。\n*   **重要免责声明：** 明确声明视频中展示的产品由第三方商家销售，而非YouTube，且YouTube不对其负责。\n\n其中并无与所提及标题“完美气凝土，厨房食材 [视频]”相关的任何信息、描述或摘要。所提供的文本纯粹是YouTube平台自身的通用法律与行政信息。"
  },
  {
    "id": "46393906",
    "title": "ZJIT is now available in Ruby 4.0",
    "url": "https://railsatscale.com/2025-12-24-launch-zjit/",
    "summary": "ZJIT is a new just-in-time compiler for Ruby 4.0, built by the team behind YJIT. It is compiled by default but must be enabled with `--zjit`, an environment variable, or a runtime call. While currently not as fast as YJIT, it provides a solid foundation for future performance gains.\n\nSignificant progress has been made since its initial announcement. Key improvements include the ability to side-exit to the interpreter for unoptimized code paths, support for running large applications and test suites, and optimization of more operations like method calls and instance variables. It can now compile large functions efficiently, inline certain C methods for better optimization, and generate more efficient machine code with fewer C runtime calls.\n\nThe team plans further optimizations, including better handling of `yield` and `super`, polymorphic method calls, and an improved register allocator. Performance on benchmarks is steadily improving. While YJIT remains the default in Ruby 4.0 due to stability and speed, developers are encouraged to test ZJIT locally and report issues.",
    "chinese_title": "ZJIT现已支持Ruby 4.0版本。",
    "chinese_summary": "ZJIT是Ruby 4.0中由YJIT团队打造的全新即时编译器。它默认已编译但需通过`--zjit`参数、环境变量或运行时调用启用。虽然目前性能不及YJIT，但为未来性能提升奠定了坚实基础。\n\n自首次发布以来已取得显著进展。关键改进包括：支持未优化代码路径侧向退出至解释器、可运行大型应用程序与测试套件，并优化了方法调用和实例变量等更多操作。现能高效编译大型函数，内联特定C方法以提升优化效果，并通过减少C运行时调用生成更高效的机器码。\n\n团队计划进一步优化，包括改进`yield`和`super`处理、多态方法调用以及增强寄存器分配器。基准测试性能正稳步提升。虽然Ruby 4.0中因稳定性和速度仍默认采用YJIT，但鼓励开发者在本地测试ZJIT并反馈问题。"
  },
  {
    "id": "46357814",
    "title": "The Algebra of Loans in Rust",
    "url": "https://nadrieril.github.io/blog/2025/12/21/the-algebra-of-loans-in-rust.html",
    "summary": "This article outlines proposed extensions to Rust's borrow checker, introducing new reference types beyond the standard `&` and `&mut`. It presents these ideas through three tables that define the \"algebra\" of these references—what operations they allow and what restrictions they impose on the borrowed memory location (or \"place\").\n\nThe key new types are:\n1. **`&own T`**: An owning reference that holds full responsibility for dropping the value, allowing it to be moved out. When it expires, the original place is considered uninitialized.\n2. **`&uninit T`**: A reference to an uninitialized memory location, which can only be written to. It can be converted to an `&own T` after initialization.\n3. **Pinning references** (`&pin T`, `&pin mut T`, `&pin own T`): These enforce that a value cannot be moved or the memory deallocated without running its destructor first, even after the borrow expires, which is crucial for async safety.\n\nThe tables systematically detail:\n*   What actions (like read, write, reborrow) are permitted with each reference type.\n*   What can be done to the original place while a loan is live.\n*   What becomes possible after a loan expires.\n\nThese proposals aim to give developers more precise control over memory initialization, ownership transfer, and pinning semantics, enabling safer and more expressive APIs while maintaining Rust's core safety guarantees.",
    "chinese_title": "《Rust中的贷款代数》",
    "chinese_summary": "本文概述了对Rust借用检查器的扩展提案，引入了标准`&`和`&mut`之外的新引用类型。通过三个表格呈现这些引用的“代数”定义——即它们允许的操作以及对借用内存位置（或称“位置”）施加的限制。\n\n主要新类型包括：\n1. **`&own T`**：拥有所有权的引用，承担释放值的全部责任，允许值被移出。当其失效时，原始位置被视为未初始化。\n2. **`&uninit T`**：指向未初始化内存位置的引用，仅支持写入操作。初始化后可转换为`&own T`。\n3. **固定引用**（`&pin T`、`&pin mut T`、`&pin own T`）：这些引用强制要求值在借用失效后仍必须先运行析构函数才能被移动或释放内存，这对异步安全性至关重要。\n\n表格系统化详述了：\n*   每种引用类型允许的操作（如读取、写入、再借用）。\n*   在借用生效期间可对原始位置执行的操作。\n*   借用失效后可进行的操作。\n\n这些提案旨在让开发者更精确地控制内存初始化、所有权转移和固定语义，在保持Rust核心安全保证的同时，实现更安全、更具表现力的API。"
  },
  {
    "id": "46351836",
    "title": "Joan Didion and Kurt Vonnegut had something to say. We have it on tape",
    "url": "https://www.nytimes.com/2025/12/19/books/james-baldwin-joan-didion-92ny-recordings.html",
    "summary": "**Summary of \"Joan Didion and Kurt Vonnegut had something to say. We have it on tape\"**\n\nThe article reports on the 92nd Street Y’s release of hundreds of historic audio recordings from its literary archive, spanning from 1949 to the 1990s. These recordings capture live readings and conversations featuring some of the most iconic 20th-century American writers.\n\nKey figures heard in the collection include James Baldwin, Joan Didion, Kurt Vonnegut, Toni Morrison, Truman Capote, and Isaac Asimov. The recordings are notable not just for the literary content, but for capturing the authors' voices, personalities, and the audience interactions of the era. For instance, listeners can hear Baldwin's powerful oratory, Vonnegut's sardonic humor, and Didion's precise, cool delivery.\n\nThe main significance of this release is the access it provides to the cultural and intellectual atmosphere of the time. The recordings serve as an auditory time capsule, offering a more intimate and immediate connection to these authors than the written page alone. They document the 92nd Street Y’s role as a vital New York institution where literary ideas were publicly debated and performed.\n\nThe archive has been digitized and made available to the public through the 92NY’s website, allowing a new generation to experience these historic literary events.",
    "chinese_title": "琼·狄迪恩和库尔特·冯内古特有话要说。我们有录音为证。",
    "chinese_summary": "**《琼·狄迪恩与库尔特·冯内古特有话要说——我们有录音为证》摘要**\n\n文章报道了92街Y历史文学档案馆公开数百份1949年至1990年代的珍贵录音资料。这些录音记录了二十世纪多位标志性美国作家的现场朗读与对谈。\n\n馆藏录音中的关键人物包括詹姆斯·鲍德温、琼·狄迪恩、库尔特·冯内古特、托妮·莫里森、杜鲁门·卡波特和艾萨克·阿西莫夫。这些录音不仅因其文学内容而珍贵，更生动捕捉了作家的嗓音特质、个人风格以及当时的观众互动。例如，听众可感受到鲍德温富有力量的演说、冯内古特犀利的讽刺幽默，以及狄迪恩精准克制的表达方式。\n\n此次资料公开的核心意义在于让人们得以聆听那个时代的文化与思想氛围。这些录音如同声音时光胶囊，相比文字记录，能让人更直接、更切身地感受这些作家的魅力。它们也见证了92街Y作为纽约重要文化机构的历史角色——这里曾是文学思想公开交锋与演绎的舞台。\n\n目前该档案馆藏已完成数字化，公众可通过92NY官方网站获取这些资料，新一代听众得以亲历这些具有历史意义的文学现场。"
  },
  {
    "id": "46326281",
    "title": "Sandbox: Run untrusted AI code safely, fast",
    "url": "https://github.com/PwnFunction/sandbox",
    "summary": "**Concave AI Sandbox** is a self-hostable platform designed to execute untrusted AI code in a secure and fast manner. Its core technology is Firecracker microVMs, which provide strong isolation, and it achieves rapid startup times (under 200ms) by using snapshot-based warm pools of pre-initialized virtual machines.\n\nThe platform features a two-part architecture: a **gRPC control plane** for managing the lifecycle of VMs and a **streaming data plane** for handling file transfers and real-time program output. For ease of integration, it offers an **HTTP API gateway** with authentication and a **Python SDK**.\n\nKey capabilities include fast VM provisioning, secure code isolation, and tools for orchestration and monitoring. It is intended for developers and organizations needing to run AI models or other untrusted code snippets safely. Complete setup involves deploying infrastructure via Terraform and Ansible, with detailed guides provided in the documentation.\n\nThe project is open-source under the MIT license, welcomes contributions, and has a dedicated process for addressing security vulnerabilities.",
    "chinese_title": "沙盒：安全、快速地运行不可信的AI代码",
    "chinese_summary": "**凹形AI沙盒**是一个可自托管平台，专为安全快速地执行不可信AI代码而设计。其核心技术采用Firecracker微虚拟机，提供强隔离性，并通过基于快照的预初始化虚拟机热池实现快速启动（低于200毫秒）。\n\n该平台采用双架构设计：**gRPC控制平面**用于管理虚拟机生命周期，**流式数据平面**用于处理文件传输和实时程序输出。为便于集成，平台提供带身份验证的**HTTP API网关**及**Python SDK**。\n\n核心功能包括快速虚拟机部署、安全的代码隔离，以及编排与监控工具。该平台适用于需要安全运行AI模型或其他不可信代码片段的开发者和组织。完整部署需通过Terraform和Ansible配置基础设施，具体指南详见项目文档。\n\n本项目基于MIT许可证开源，欢迎贡献代码，并设有专门流程处理安全漏洞。"
  },
  {
    "id": "46392815",
    "title": "High School Student Discovers 1.5M Potential New Astronomical Objects",
    "url": "https://www.smithsonianmag.com/smart-news/high-school-student-discovers-1-5-million-potential-new-astronomical-objects-by-developing-an-ai-algorithm-180986429/",
    "summary": "**Summary:**\n\nA high school student, Peter Ma, developed an artificial intelligence (AI) algorithm that has identified approximately 1.5 million potential new astronomical objects. The project utilized data from the National Science Foundation’s National Radio Astronomy Observatory (NRAO), specifically from the Very Large Array (VLA) telescope in New Mexico.\n\nThe core challenge was analyzing a massive radio wave survey of the sky, where traditional methods for identifying objects like galaxies with supermassive black holes (active galactic nuclei) were slow and difficult. Ma’s innovation was to create an AI model that could efficiently detect and classify these objects by recognizing complex patterns in the data that humans or simpler software might miss.\n\nHis work, conducted with mentorship from researchers at the University of Toronto, has significantly contributed to the \"VLA Sky Survey (VLASS)\" project. The 1.5 million candidates identified by the AI represent a dramatic increase in potential discoveries from the survey data. This advancement not only aids in creating a more comprehensive map of the universe but also demonstrates the powerful application of machine learning in processing large-scale scientific datasets.\n\nThe story highlights how accessible data from major observatories and the creative application of technology by a young researcher can lead to substantial contributions to the field of astronomy.",
    "chinese_title": "高中生发现150万个潜在新天体",
    "chinese_summary": "**摘要：**\n\n高中生彼得·马开发了一种人工智能算法，识别出约150万个潜在的新天体。该项目利用了美国国家科学基金会国家射电天文观测台（NRAO）的数据，特别是来自新墨西哥州甚大阵（VLA）望远镜的观测资料。\n\n核心挑战在于分析大规模的射电天空巡天数据，传统识别方法（如探测拥有超大质量黑洞的星系活动星系核）速度缓慢且困难重重。马的创新在于开发了一种人工智能模型，能通过识别数据中人类或简单软件可能忽略的复杂模式，高效探测并分类这些天体。\n\n他在多伦多大学研究人员的指导下完成的这项工作，为“VLA天空巡天（VLASS）”项目做出了重要贡献。人工智能识别出的150万个候选天体，标志着从巡天数据中发现潜在天体的数量实现了巨大飞跃。这一进展不仅有助于绘制更全面的宇宙图谱，也展现了机器学习在处理大规模科学数据集方面的强大应用。\n\n这个故事凸显了来自大型观测站的开放数据与青年研究者的技术创新如何结合，从而为天文学领域做出实质性贡献。"
  },
  {
    "id": "46388907",
    "title": "TurboDiffusion: 100–200× Acceleration for Video Diffusion Models",
    "url": "https://github.com/thu-ml/TurboDiffusion",
    "summary": "**TurboDiffusion** is a framework that accelerates video diffusion models by **100–200 times** on a single RTX 5090 GPU while preserving video quality. It achieves this through three core techniques: **SageAttention** for efficient 8-bit attention, **Sparse-Linear Attention (SLA)** to reduce computational load, and **rCM (rectified flow Consistency Models)** for timestep distillation.\n\nThe repository provides pre-trained and quantized models for both text-to-video (e.g., TurboWan2.1-T2V-1.3B-480P) and image-to-video (e.g., TurboWan2.2-I2V-A14B-720P) generation. Inference is highly efficient, requiring only **1–4 sampling steps** and producing a 5-second video in as little as **1.9 seconds**. The framework includes easy installation via pip, detailed inference scripts, and support for interactive terminal use.\n\nFor training, TurboDiffusion offers code for white-box SLA training, which aligns a sparse-attention student model with a full-attention teacher to maintain quality. It supports distributed training with FSDP2 and provides synthesized datasets. The project also features **ComfyUI integration** and outlines a roadmap for further optimizations and model support.\n\nIn summary, TurboDiffusion dramatically speeds up high-quality video generation through novel attention and distillation methods, with open-source models and tools available for immediate use.",
    "chinese_title": "TurboDiffusion：视频扩散模型100–200倍加速技术",
    "chinese_summary": "**TurboDiffusion** 是一个框架，可在单张RTX 5090 GPU上将视频扩散模型加速**100–200倍**，同时保持视频质量。它通过三项核心技术实现：用于高效8位注意力的**SageAttention**、降低计算负载的**稀疏线性注意力（SLA）**，以及用于时间步蒸馏的**rCM（修正流一致性模型）**。\n\n该仓库提供了文本到视频（如TurboWan2.1-T2V-1.3B-480P）和图像到视频（如TurboWan2.2-I2V-A14B-720P）生成的预训练及量化模型。推理效率极高，仅需**1–4个采样步骤**，最快仅用**1.9秒**即可生成5秒视频。框架支持通过pip轻松安装，提供详细的推理脚本，并兼容交互式终端使用。\n\n在训练方面，TurboDiffusion提供了白盒SLA训练代码，通过将稀疏注意力学生模型与全注意力教师模型对齐以保持质量。它支持基于FSDP2的分布式训练，并提供合成数据集。项目还具备**ComfyUI集成**功能，并规划了进一步优化和模型支持的路线图。\n\n总之，TurboDiffusion通过新颖的注意力与蒸馏方法，显著加速了高质量视频生成，并提供开源模型与工具供即时使用。"
  },
  {
    "id": "46392910",
    "title": "Show HN: Witr – Explain why a process is running on your Linux system",
    "url": "https://github.com/pranshuparmar/witr",
    "summary": "**Witr** is a command-line tool for Linux that answers the question \"Why is this process running?\" by revealing the causal chain behind a process, service, or port. Unlike traditional tools like `ps` or `systemctl` that only show *what* is running, Witr explains *how* and *why* it started.\n\nYou can query it by process name, PID, or port (e.g., `witr nginx`, `witr --pid 1234`, `witr --port 5000`). Its output clearly shows the process ancestry, primary supervisor (like systemd, Docker, or PM2), working directory, Git context, and warnings (e.g., running as root). It handles ambiguity by prompting users when multiple matches are found.\n\nWitr is a read-only, zero-configuration tool focused on debugging clarity, not monitoring or remediation. It’s distributed as a static binary for Linux (amd64/arm64) and can be installed via a script or manually. Some details may require `sudo` for full visibility.",
    "chinese_title": "Show HN: Witr – 解释Linux系统中进程运行的原因",
    "chinese_summary": "**Witr** 是一款 Linux 命令行工具，旨在回答“这个进程为何在运行？”的问题，通过揭示进程、服务或端口背后的因果链来解答。与仅显示*正在运行内容*的传统工具（如 `ps` 或 `systemctl`）不同，Witr 解释了进程*如何*以及*为何*启动。\n\n你可以通过进程名称、PID 或端口进行查询（例如 `witr nginx`、`witr --pid 1234`、`witr --port 5000`）。其输出清晰地展示进程的祖先关系、主要监管程序（如 systemd、Docker 或 PM2）、工作目录、Git 上下文以及警告信息（例如以 root 身份运行）。当发现多个匹配项时，它会提示用户以处理模糊情况。\n\nWitr 是一款只读、零配置的工具，专注于调试清晰度，而非监控或修复。它以适用于 Linux（amd64/arm64）的静态二进制文件形式分发，可通过脚本或手动安装。某些详细信息可能需要 `sudo` 权限才能完全查看。"
  },
  {
    "id": "46360080",
    "title": "Overlooked No More: Inge Lehmann, Who Discovered the Earth's Inner Core",
    "url": "https://www.nytimes.com/2025/12/20/obituaries/inge-lehmann-overlooked.html",
    "summary": "**Summary of \"Overlooked No More: Inge Lehmann, Who Discovered the Earth's Inner Core\"**\n\nInge Lehmann (1888-1993) was a pioneering Danish seismologist who made one of the most significant discoveries about our planet's structure. In 1936, through her meticulous analysis of seismic wave data from earthquakes, she deduced the existence of the Earth's **solid inner core**, distinct from the molten outer core.\n\nBefore her work, scientists believed the Earth's core was a single molten sphere. Lehmann noticed that certain seismic waves (P-waves) were deflected and recorded in places they should have been shadowed by a liquid core. She correctly interpreted this as evidence of a solid inner core refracting these waves—a phenomenon now known as the **\"Lehmann discontinuity.\"**\n\nHer career was marked by significant challenges. She worked in a male-dominated field, often facing professional isolation and limited resources. Despite this, her rigorous, data-driven approach earned her the respect of peers. Her discovery fundamentally changed geophysics, providing a crucial key to understanding Earth's magnetic field, composition, and evolution.\n\nLehmann received major honors later in life, including the American Geophysical Union's Bowie Medal. Today, she is celebrated as a foundational figure in Earth sciences. An award and a prominent discontinuity in the Earth's mantle are named in her honor, ensuring her legacy endures at the very heart of the planet she helped us understand.",
    "chinese_title": "被遗忘不再：发现地球内核的英厄·莱曼",
    "chinese_summary": "**《不应被遗忘：发现地球内核的英厄·莱曼》摘要**\n\n英厄·莱曼（1888-1993）是一位开创性的丹麦地震学家，她对地球结构做出了最重大的发现之一。1936年，通过对地震产生的地震波数据进行细致分析，她推断出地球存在一个**固态的内核**，与熔融的外核截然不同。\n\n在她的研究之前，科学家们认为地核是一个单一的熔融球体。莱曼注意到，某些地震波（P波）发生了偏折，并在本应被液态地核遮蔽的区域被记录到。她正确地将其解释为固态内核折射这些波的证据——这一现象如今被称为 **“莱曼不连续面”**。\n\n她的职业生涯充满了重大挑战。她在一个男性主导的领域工作，时常面临职业上的孤立和资源匮乏。尽管如此，她严谨、以数据为导向的研究方法赢得了同行的尊重。她的发现从根本上改变了地球物理学，为理解地球磁场、组成和演化提供了关键钥匙。\n\n莱曼在晚年获得了多项重要荣誉，包括美国地球物理联合会的鲍伊奖章。如今，她被公认为地球科学的奠基人之一。一项奖项以及地球地幔中的一个重要不连续面都以她的名字命名，确保她的遗产在她帮助我们理解的这颗星球的核心深处永存。"
  },
  {
    "id": "46344222",
    "title": "An 11-qubit atom processor in silicon with all fidelities from 99.10% to 99.99%",
    "url": "https://www.nature.com/articles/s41586-025-09827-w",
    "summary": "This article reports a significant advancement in silicon-based quantum computing with the creation of an 11-qubit atom processor. The system consists of two multi-nuclear spin registers (one with four phosphorus atoms, one with five), each sharing a common electron via hyperfine interaction. A key achievement is the establishment of a fast, high-fidelity link between these registers using electron exchange coupling.\n\nThrough refined calibration and control protocols, the researchers achieved exceptionally high gate fidelities: single-qubit gates ranged from 99.10% to 99.99%, and two-qubit gates (both local nuclear-nuclear CZ gates and non-local electron-electron CROT gates) also exceeded 99%. This performance is maintained while tripling the number of interconnected data qubits compared to previous work.\n\nThe processor's capabilities were demonstrated by generating Bell states with fidelities up to 99.5% for all combinations of local and non-local nuclear-spin pairs. Furthermore, the team created multi-qubit Greenberger–Horne–Zeilinger (GHZ) states, showing entanglement across up to eight nuclear spins.\n\nThis work represents a major milestone by demonstrating high-fidelity operation and entanglement across separate, interconnected quantum nodes in silicon. It directly addresses a core challenge for scaling up quantum systems and marks a critical step toward building fault-tolerant quantum processors using atomically precise manufacturing.",
    "chinese_title": "硅基11量子比特原子处理器，所有保真度介于99.10%至99.99%之间。",
    "chinese_summary": "本文报道了硅基量子计算领域的一项重大进展——成功研制出11量子比特原子处理器。该系统包含两个多核自旋寄存器（一个含四个磷原子，另一个含五个），通过超精细相互作用共享一个公共电子。关键突破在于利用电子交换耦合，在两个寄存器间建立了快速、高保真度的连接链路。\n\n通过精细校准与控制方案，研究人员实现了极高的门操作保真度：单量子比特门保真度达99.10%至99.99%，双量子比特门（包括局域核-核CZ门与非局域电子-电子CROT门）保真度均超过99%。在将互连数据量子比特数量提升至先前三倍的同时，系统仍能保持这一性能水平。\n\n研究团队通过制备局域与非局域核自旋对的贝尔态（保真度最高达99.5%），展示了处理器的核心能力。此外还成功制备了多量子比特格林伯格-霍恩-蔡林格（GHZ）态，实现了多达八个核自旋的纠缠态制备。\n\n这项研究通过在硅基分离式互连量子节点上实现高保真度操作与纠缠态制备，标志着量子计算发展的重要里程碑。它直接应对了量子系统规模化扩展的核心挑战，为利用原子级精密制造技术构建容错量子处理器迈出了关键一步。"
  },
  {
    "id": "46392115",
    "title": "Rob Pike Goes Nuclear over GenAI",
    "url": "https://skyview.social/?url=https%3A%2F%2Fbsky.app%2Fprofile%2Frobpike.io%2Fpost%2F3matwg6w3ic2s&viewtype=tree",
    "summary": "In a recent BlueSky thread, computer science pioneer Rob Pike expressed strong criticism of generative AI, particularly large language models (LLMs). He argues that the technology is fundamentally overhyped and misdirected.\n\nPike's core criticism is that LLMs are \"autocomplete on steroids,\" focused on statistically predicting plausible text rather than achieving true understanding or reasoning. He contends this makes them unreliable for serious tasks, as they prioritize sounding convincing over being correct. He is especially concerned about their integration into search engines and programming tools, warning that this erodes trust in foundational information systems.\n\nHe also laments the massive resource consumption of training and running these models, calling it environmentally irresponsible and questioning whether the benefits justify the costs. Furthermore, Pike believes the AI gold rush is distorting the tech industry, drawing talent and investment away from more meaningful, solid engineering work.\n\nOverall, Pike's position is that generative AI, in its current form, is a \"tremendous disappointment\" built on a flawed premise, consuming excessive resources while delivering questionable value and introducing new risks.",
    "chinese_title": "罗布·派克对生成式人工智能大发雷霆",
    "chinese_summary": "在最近的一个BlueSky讨论串中，计算机科学先驱罗布·派克对生成式人工智能，尤其是大语言模型提出了强烈批评。他认为这项技术从根本上被过度炒作且方向错误。\n\n派克的核心批评在于，大语言模型不过是“强化版的自动补全工具”，其重点在于统计预测看似合理的文本，而非实现真正的理解或推理。他指出，这导致它们无法胜任严肃任务，因为它们优先追求听起来可信而非确保正确性。他尤其担忧这些模型被集成到搜索引擎和编程工具中，警告这会侵蚀人们对基础信息系统的信任。\n\n他还痛惜训练和运行这些模型所需的巨大资源消耗，称其是对环境的不负责任，并质疑其收益是否配得上成本。此外，派克认为人工智能淘金热正在扭曲科技行业，将人才和投资从更有意义、更扎实的工程工作中抽离。\n\n总体而言，派克的立场是：当前形式的生成式人工智能建立在有缺陷的前提之上，是一个“巨大的失望”，它消耗了过多资源，却提供了可疑的价值并引入了新的风险。"
  },
  {
    "id": "46391077",
    "title": "The First Web Server",
    "url": "https://dfarq.homeip.net/the-first-web-server/",
    "summary": "In late December 1990, Tim Berners-Lee at CERN in Switzerland brought the first web server to a usable state, marking the birth of the World Wide Web. This foundational project, developed on a NeXT workstation at the address info.cern.ch, was created to make organizational information more accessible and linkable.\n\nThe first web page, which no longer exists in its original form, provided technical details about the web's own components: HTML, web servers, and browsers. While the project began humbly, its impact was profound.\n\nThe web's global expansion accelerated after the 1993 release of the cross-platform NCSA Mosaic browser, which led to Netscape and widespread adoption on college campuses. This commercialization effort eventually sparked the dotcom boom and shaped the modern internet. Berners-Lee's initiative, initially an internal tool for sharing data, thus became a world-changing innovation.",
    "chinese_title": "第一台网络服务器",
    "chinese_summary": "1990年12月下旬，瑞士CERN的蒂姆·伯纳斯-李将首个网络服务器投入可用状态，标志着万维网的诞生。这个基础性项目在地址info.cern.ch的NeXT工作站上开发，旨在使组织信息更易于访问和链接。\n\n首个网页（原始版本已不复存在）提供了关于网络自身组件——HTML、网络服务器和浏览器的技术细节。尽管项目起步平凡，其影响却深远。\n\n1993年跨平台NCSA Mosaic浏览器的发布加速了网络的全球扩张，催生了网景浏览器并在大学校园广泛普及。这一商业化进程最终引发了互联网泡沫，塑造了现代互联网的格局。伯纳斯-李最初作为内部数据共享工具发起的项目，由此成为改变世界的创新。"
  },
  {
    "id": "46344573",
    "title": "Show HN: Gaming Couch – a local multiplayer party game platform for 8 players",
    "url": "https://gamingcouch.com",
    "summary": "**Summary of \"Show HN: Gaming Couch\"**\n\nGaming Couch is a local multiplayer party game platform designed for in-person gatherings, supporting up to 8 players. Its core innovation is using smartphones as controllers, eliminating the need for a dedicated game console, extra hardware, or downloads.\n\nThe platform offers a variety of quick, competitive, and fun party games. Examples highlighted include *Chowboys: The Ring*, *Abstract: Bubble Up*, *Party Cars: Heist*, and several others, with over 15 games mentioned in total.\n\nKey features and data points include:\n*   **Accessibility:** Players simply visit a website on a shared screen (like a TV) and connect their phones via a QR code.\n*   **Statistics:** As of October 2025, it is used in 92 countries, with an average game session lasting 101 minutes and a first-time player rating of 4.4/5.\n*   **Business Model:** It is presented as free to play.\n*   **Scope:** It is currently for **local multiplayer only**; the FAQ clarifies it does not support online remote play with friends.\n\nThe post positions Gaming Couch as an easy and social gaming solution for parties, backed by positive initial user metrics and media interest.",
    "chinese_title": "Show HN: 游戏沙发——支持8人本地多人联机的派对游戏平台",
    "chinese_summary": "**《Show HN: Gaming Couch》摘要**\n\nGaming Couch 是一款专为线下聚会设计的本地多人派对游戏平台，最多支持 8 人同玩。其核心创新在于使用智能手机作为控制器，无需专用游戏主机、额外硬件或下载安装。\n\n该平台提供多种快速、竞技且有趣的派对游戏。文中重点提及的游戏包括《Chowboys: The Ring》、《Abstract: Bubble Up》、《Party Cars: Heist》等，总计超过 15 款。\n\n主要特点和数据包括：\n*   **便捷性：** 玩家只需在共享屏幕（如电视）上访问一个网站，并通过二维码连接手机即可。\n*   **数据统计：** 截至 2025 年 10 月，已在 92 个国家使用，平均每局游戏时长 101 分钟，首次玩家评分为 4.4/5。\n*   **商业模式：** 采用免费游玩的模式。\n*   **适用范围：** 目前仅支持**本地多人游戏**；常见问题解答中明确说明不支持与朋友在线远程联机。\n\n该帖子将 Gaming Couch 定位为一款适合派对的便捷社交游戏解决方案，并引用了积极的初期用户数据和媒体关注作为支持。"
  },
  {
    "id": "46394169",
    "title": "A Proclamation Regarding the Restoration of the Em-Dash",
    "url": "https://blog.nawaz.org/posts/2025/Dec/a-proclamation-regarding-the-restoration-of-the-dash/",
    "summary": "The author issues a humorous \"proclamation\" to restore the em-dash (—) as a legitimate punctuation mark. They argue that its use has become unfairly stigmatized as a sign of AI-generated text, simply because large language models frequently employ it. The author rejects this prejudice, asserting that the em-dash is a classical tool for elegant prose and should not be abandoned out of fear of appearing artificial.\n\nIn protest, they decree that on their blog, all hyphens used for pauses or stylistic purposes will be replaced by em-dashes, even in cases where a hyphen would be grammatically correct. To enforce this, they created a plugin to automatically convert hyphens to em-dashes throughout the blog's content. The piece is a satirical call to \"reclaim\" the punctuation mark from algorithmic association and return it to human writers.",
    "chinese_title": "关于恢复长破折号使用的公告",
    "chinese_summary": "作者发布了一则幽默“宣言”，主张恢复长破折号（—）作为合法标点符号的地位。他们指出，仅仅因为大型语言模型频繁使用长破折号，其存在就被不公平地污名化为AI生成文本的标志。作者反对这种偏见，坚称长破折号是优雅散文的经典工具，不应因害怕显得人工化而被抛弃。\n\n为此，他们宣布将在自己的博客中发起抗议：所有用于停顿或风格目的的连字符都将被替换为长破折号，即使在语法上本应使用连字符的场合也不例外。为确保这一规则执行，作者还创建了一个插件，可自动将博客内容中的所有连字符转换为长破折号。这篇文章以讽刺的口吻呼吁人们从算法关联中“夺回”这一标点符号，将其重新交还给人类写作者。"
  },
  {
    "id": "46390055",
    "title": "Building an AI agent inside a 7-year-old Rails monolith",
    "url": "https://catalinionescu.dev/ai-agent/building-ai-agent-part-1/",
    "summary": "A Director of Engineering at a multi-tenant SaaS company describes integrating an AI agent into a 7-year-old Rails monolith with strict data access controls. The challenge was applying common AI patterns to a system with complex authorization rules.\n\nThe solution used the RubyLLM gem to create a RAG-like system where the LLM's context is augmented via function calls (\"tools\"). This allowed encoding data access logic directly into a tool—like a client search—that first queries Algolia and then filters results through Pundit policies, ensuring the LLM only receives authorized data.\n\nThe implementation involved defining tools with a DSL, creating a conversation interface backed by Active Job for async processing, and using Turbo Streams for real-time UI updates. The author found GPT-4o offered the best balance of speed and accuracy for this use case, compared to other models.\n\nThe core insight was that the tool acts like a secure API endpoint, letting the LLM retrieve specific, permissioned data without unrestricted access. The entire agent was built in 2-3 days, demonstrating that integrating AI into legacy, compliance-heavy systems is feasible with the right abstraction.",
    "chinese_title": "在七年历史的Rails单体应用中构建AI智能体",
    "chinese_summary": "一家多租户SaaS公司的工程总监描述了将AI智能体集成到具有严格数据访问控制的七年历史Rails单体架构中的过程。挑战在于如何将常见的AI模式应用于具有复杂授权规则的系统。\n\n解决方案采用RubyLLM gem构建了一个类似RAG的系统，通过函数调用（“工具”）增强LLM的上下文。这种方法允许将数据访问逻辑直接编码到工具中——例如客户搜索工具会先查询Algolia，再通过Pundit策略过滤结果，确保LLM仅获取经授权的数据。\n\n具体实现包括：使用DSL定义工具、创建基于Active Job的异步对话接口、利用Turbo Streams实现实时UI更新。作者发现相较于其他模型，GPT-4o在该用例中实现了速度与准确性的最佳平衡。\n\n核心洞见在于：工具如同安全的API端点，使LLM能够检索特定权限数据而无需无限制访问。整个智能体的构建仅耗时2-3天，证明通过恰当的抽象设计，将AI集成到遗留且合规要求严格的系统中是切实可行的。"
  },
  {
    "id": "46391472",
    "title": "ChatGPT conversations still lack timestamps after years of requests",
    "url": "https://community.openai.com/t/timestamps-for-chats-in-chatgpt/440107?page=3",
    "summary": "**Summary:**\n\nThe article criticizes ChatGPT for its continued lack of timestamps on individual messages within conversations, despite years of user requests. The author highlights a specific personal frustration: after working in a single chat for nearly 10 months, they found it impossible to create a chronological overview of their work because the chat interface does not display when each exchange occurred.\n\nThe core argument is that this omission makes it \"madness\" for users who rely on chats for long-term projects or documentation, as the absence of basic temporal metadata severely hinders organization and retrospective analysis. The author expected this fundamental feature to be standard, emphasizing that its ongoing absence is a significant oversight that complicates what should be a trivial task.",
    "chinese_title": "ChatGPT对话多年请求后仍无时间戳功能",
    "chinese_summary": "**摘要：**\n\n文章批评ChatGPT在对话中持续缺乏单个消息的时间戳，尽管用户多年来一直有此需求。作者特别指出个人遇到的一个困扰：在同一个聊天中工作了近10个月后，他们发现无法按时间顺序回顾工作内容，因为聊天界面不显示每次交流的发生时间。\n\n核心论点是，这一遗漏对于依赖聊天进行长期项目或文档记录的用户来说简直是“疯狂”，因为缺乏基本的时间元数据严重阻碍了信息整理和回顾分析。作者认为这一基本功能本应是标配，并强调其持续缺失是一个重大疏忽，使本应简单的任务变得复杂。"
  },
  {
    "id": "46350510",
    "title": "Bedlam Cube Solved (ALL 19,186 solutions)",
    "url": "http://scottkurowski.com/BedlamCube/",
    "summary": "This article details a computational solution to the Bedlam (Crazee) Cube, a 4x4x4 puzzle with 13 polyomino pieces. The author developed a software program that performed an exhaustive combinatorial search to find every possible way to assemble the cube.\n\nThe search space was astronomically large (over 42 billion trillion theoretical combinations), but the algorithm efficiently navigated it by testing piece permutations and orientations, discarding dead ends early. The software successfully verified the manufacturer's claim, finding exactly **19,186 unique solutions** (460,464 total when counting rotations, with duplicates discarded).\n\nThe article includes the program's output, showing the first few solutions with pieces mapped to numbers 0-12, and explains how to visualize them in the 4x4x4 layers. It also provides a download link for the solver software and its source code, noting its adaptability to other 3D puzzles like the Tetris Cube and Soma Cube. The project was inspired by the author's son and builds on the author's prior experience with exhaustive puzzle-solving algorithms.",
    "chinese_title": "贝德兰魔方破解（共19,186种解法）",
    "chinese_summary": "本文详细介绍了针对Bedlam（疯狂）立方体的计算解决方案，这是一个由13块多联骨牌组成的4x4x4立体拼图。作者开发了一款软件程序，通过穷举组合搜索来找出所有可能的立方体拼装方式。\n\n搜索空间极其庞大（理论组合数超过420亿亿），但该算法通过测试骨牌的排列与朝向、并尽早舍弃无效路径，实现了高效搜索。软件成功验证了制造商的声明，精确找到了**19,186种独立解法**（若计入旋转则总数为460,464种，重复解已剔除）。\n\n文章附有程序输出示例，展示了前几种用数字0-12对应骨牌的解法，并说明了如何在4x4x4分层结构中可视化这些解。同时提供了求解器软件及其源代码的下载链接，指出该程序可适配其他三维拼图（如俄罗斯方块立方体和索玛立方体）。该项目灵感源自作者的儿子，并基于作者此前在穷举式拼图求解算法方面的经验。"
  },
  {
    "id": "46390667",
    "title": "Geometric Algorithms for Translucency Sorting in Minecraft [pdf]",
    "url": "https://douira.dev/assets/document/douira-master-thesis.pdf",
    "summary": "Based on the provided text, a complete summary of the article \"Geometric Algorithms for Translucency Sorting in Minecraft\" is not possible. The content is not the actual article but appears to be corrupted or incomplete PDF data.\n\nThe text block consists primarily of:\n1.  A PDF header (`%PDF-1.5`).\n2.  A large stream of unreadable, non-text binary data (likely compressed image or font data).\n3.  Some embedded metadata indicating the file was created by Apple Preview and has a title related to \"Logos_Institute.\"\n4.  No discernible sentences, paragraphs, or technical content related to geometric algorithms, translucency sorting, or Minecraft.\n\nTherefore, the core article content is missing from this excerpt. To summarize the paper, access to the complete and uncorrupted PDF file is required.",
    "chinese_title": "《我的世界》中半透明排序的几何算法 [pdf]",
    "chinese_summary": "根据所提供的文本，无法对《Minecraft中的半透明排序几何算法》一文进行完整总结。该内容并非实际文章，似乎是损坏或不完整的PDF数据。\n\n文本块主要包括：\n1.  PDF文件头（`%PDF-1.5`）。\n2.  大量不可读的非文本二进制数据流（可能是压缩的图像或字体数据）。\n3.  部分元数据显示文件由Apple Preview创建，且标题与\"Logos_Institute\"相关。\n4.  未发现任何与几何算法、半透明排序或Minecraft相关的可识别句子、段落或技术内容。\n\n因此，该摘录中缺失了文章的核心内容。若要总结该论文，需要获取完整且未损坏的PDF文件。"
  }
]