[
  {
    "id": "46766188",
    "title": "Television is 100 years old today",
    "url": "https://diamondgeezer.blogspot.com/2026/01/tv100.html",
    "summary": "On January 26, 1926, Scottish inventor John Logie Baird gave the first public demonstration of live television to journalists in his attic workshop at 22 Frith Street, Soho, London. His rudimentary \"Televisor\" used spinning discs and transmitted grainy images, with the first human subject being office worker William Taynton.\n\nBaird's journey began earlier in Hastings, where he built his first transmitter from household items. After moving to London, he refined his invention, demonstrating it at Selfridges and achieving the first transmission of light and shade using a ventriloquist's dummy. Despite initial public and press indifference, his work laid the foundation.\n\nHe continued to pioneer colour, 3D, and recorded television, and his system was used in the BBC's early broadcasts from 1936. However, it was soon superseded by the superior electronic system from Marconi-EMI. Baird's later work was hampered by fires, wartime bombing, and ill health, and he died in 1946 just as television resumed.\n\nToday, 22 Frith Street houses Bar Italia, marked by plaques commemorating the historic demonstration. The article reflects on Baird's crucial role in a transformative invention, noting it took decades for television to become the ubiquitous medium it is now.",
    "chinese_title": "电视今天迎来了它的百岁生日。",
    "chinese_summary": "1926年1月26日，苏格兰发明家约翰·洛吉·贝尔德在伦敦苏豪区弗里斯街22号的阁楼工作间，首次向记者公开展示了实时电视传输技术。他简陋的“电视播放机”采用旋转圆盘装置，传输出颗粒感强烈的图像，首位出现在画面中的人物是办公室职员威廉·泰因顿。\n\n贝尔德的探索始于更早的黑斯廷斯时期，当时他用家用物品组装出第一台信号发射器。移居伦敦后，他不断改进发明，先后在塞尔福里奇百货公司进行演示，并借助口技假人首次实现了光影层次的传输。尽管初期公众与媒体反应平淡，他的工作为电视技术奠定了基础。\n\n他持续开拓彩色电视、立体电视与录像电视技术，其系统曾被应用于英国广播公司1936年启播的早期电视节目。然而这套系统很快被马可尼-EMI公司更先进的电子系统取代。贝尔德后期的研究屡遭火灾、战时轰炸与健康问题困扰，1946年电视产业重启之际，他溘然长逝。\n\n如今弗里斯街22号已成为巴里塔利亚咖啡馆的所在地，墙面的纪念铭牌铭记着这场历史性演示。文章回顾了贝尔德在这项变革性发明中的关键作用，指出电视历经数十年才发展成为如今无处不在的媒介。"
  },
  {
    "id": "46770675",
    "title": "AI Lazyslop and Personal Responsibility",
    "url": "https://danielsada.tech/blog/ai-lazyslop-and-personal-responsibility/",
    "summary": "This article addresses the issue of \"AI Lazyslop\"—the practice of submitting AI-generated code without proper review, which burdens colleagues. The author recounts a frustrating experience with a coworker, \"Mike,\" who submitted a large, untested AI-written pull request, resisted feedback, and circumvented the review process.\n\nThe core argument is that using AI is acceptable, but developers must maintain personal responsibility. The author proposes an \"anti-AI Lazyslop manifesto\" where individuals commit to: owning and reading all code they submit, disclosing AI use, including their prompts and rationale, using AI-assisted review tools, and being able to explain the code themselves.\n\nThe piece notes a cultural shift toward AI in programming, citing examples like Ghostty's disclosure policies and Linus Torvalds' experimentation. It concludes by observing that while Mike evolved to using AI to address reviewer comments, the fundamental problem of disengaged, low-quality contributions persists wherever AI is used without accountability.",
    "chinese_title": "AI懒惰与个人责任",
    "chinese_summary": "本文探讨了“AI懒惰滑坡”现象——即未经充分审核便提交AI生成代码、增加同事负担的做法。作者讲述了一段与同事“迈克”的不愉快经历：迈克提交了大量未经测试的AI编写代码合并请求，拒绝接受反馈，并试图绕过代码审查流程。\n\n核心论点是使用AI本身无可厚非，但开发者必须保持个人责任感。作者提出一份“反AI懒惰滑坡宣言”，倡导开发者承诺：对自己提交的所有代码负责并逐行审阅、公开AI使用情况（包括提示词和设计逻辑）、借助AI辅助审查工具，并确保能亲自解释代码原理。\n\n文章指出编程文化正朝AI应用方向转变，并以Ghostty的AI使用披露政策和林纳斯·托瓦兹的AI实验为例。最后强调，尽管迈克后来转变为使用AI回应审查意见，但只要缺乏责任约束，那种疏离式低质量贡献的根本问题就会在AI应用场景中持续存在。"
  },
  {
    "id": "46766741",
    "title": "Qwen3-Max-Thinking",
    "url": "https://qwen.ai/blog?id=qwen3-max-thinking",
    "summary": "Based on the provided text, a summary cannot be generated as there is no article content to analyze. The text appears to be a system prompt or instruction for an AI model named \"Qwen3-Max-Thinking,\" directing it to summarize an article that has not been included.\n\nTo receive a summary, please provide the full text of the article you wish to have summarized.",
    "chinese_title": "Qwen3-Max-思维",
    "chinese_summary": "根据提供的文本，无法生成摘要，因为没有可供分析的文章内容。该文本似乎是针对名为“Qwen3-Max-Thinking”的AI模型的系统提示或指令，要求其总结一篇未包含的文章。\n\n如需获得摘要，请提供您希望总结的文章全文。"
  },
  {
    "id": "46769051",
    "title": "Fedora Asahi Remix is now working on Apple M3",
    "url": "https://bsky.app/profile/did:plc:okydh7e54e2nok65kjxdklvd/post/3mdd55paffk2o",
    "summary": "**Summary:**\n\nFedora Asahi Remix, a Linux distribution optimized for Apple Silicon Macs, is now functional on the new Apple M3 chip. This development was announced by Michael Reeves, who shared that a KDE Plasma desktop environment is successfully running on the hardware.\n\nThe achievement is a collaborative effort, with credit given to developers \"noopwafel\" and \"Shiz.\" This marks a significant step in expanding Linux compatibility to Apple's latest generation of proprietary processors, following prior work on the M1 and M2 series. The announcement invites further discussion and questions from the community.",
    "chinese_title": "Fedora Asahi Remix 现已在苹果 M3 芯片上运行。",
    "chinese_summary": "**摘要：**\n\n专为苹果芯片Mac优化的Linux发行版Fedora Asahi Remix现已可在新款Apple M3芯片上运行。Michael Reeves宣布了这一进展，并分享称KDE Plasma桌面环境已成功在该硬件上运行。\n\n这一成果是多方协作的成果，开发者\"noopwafel\"和\"Shiz\"为此做出了贡献。这标志着在继此前对M1和M2系列芯片的适配工作后，将Linux兼容性扩展至苹果最新一代专有处理器的重要一步。该公告邀请社区进一步讨论和提问。"
  },
  {
    "id": "46769752",
    "title": "Show HN: TetrisBench – Gemini Flash reaches 66% win rate on Tetris against Opus",
    "url": "https://tetrisbench.com/tetrisbench/",
    "summary": "**Summary:**\n\nTetrisBench is a platform for comparing AI models by having them play Tetris against each other. The key finding highlighted is that Google's Gemini Flash model achieved a 66% win rate against Anthropic's Claude Opus in these head-to-head battles.\n\nThe website presents itself as a benchmarking tool where users can run \"AI vs AI\" games. It tracks results in a win-loss-draw format and plans to feature a leaderboard to rank model performance. The interface also includes an option for users to play a Tetris battle themselves.\n\nIn essence, the article announces a novel method for evaluating AI capabilities through game competition, using the specific result of Gemini Flash outperforming Claude Opus in Tetris as its primary example and hook.",
    "chinese_title": "Show HN: TetrisBench – Gemini Flash 在俄罗斯方块对战 Opus 中达到 66% 胜率",
    "chinese_summary": "**摘要：**\n\nTetrisBench是一个通过让AI模型互相对战《俄罗斯方块》来比较其性能的平台。文章强调的关键发现是，在这些正面交锋中，谷歌的Gemini Flash模型对Anthropic的Claude Opus取得了66%的胜率。\n\n该网站定位为基准测试工具，用户可运行“AI对战AI”游戏。它以胜-负-平格式记录结果，并计划推出排行榜对模型性能进行排序。界面还包含用户亲自参与《俄罗斯方块》对战的选项。\n\n本质上，本文介绍了一种通过游戏竞技评估AI能力的新方法，并以Gemini Flash在《俄罗斯方块》中战胜Claude Opus的具体结果作为主要案例和切入点。"
  },
  {
    "id": "46763864",
    "title": "MapLibre Tile: a modern and efficient vector tile format",
    "url": "https://maplibre.org/news/2026-01-23-mlt-release/",
    "summary": "**Summary of \"Announcing MapLibre Tile: a modern and efficient vector tile format\"**\n\nMapLibre has introduced **MapLibre Tile (MLT)**, a new vector tile format designed as a successor to the widely used Mapbox Vector Tile (MVT). MLT is built from the ground up to handle modern challenges, including growing geospatial data volumes and complex new data sources, while leveraging contemporary hardware and graphics APIs.\n\nThe format's key current benefits are **significantly improved compression** (up to 6x better for large tiles) and **faster decoding performance**, achieved through a column-oriented layout and lightweight encodings. This reduces latency, storage costs, and improves cache utilization.\n\nMLT is also designed with future capabilities in mind, including better support for 3D coordinates/elevation, linear referencing for formats like Overture Maps, complex data types (nested properties, lists), and formats optimized for efficient GPU and CPU processing.\n\nFor immediate use, both MapLibre GL JS and MapLibre Native now support MLT sources via an `\"encoding\": \"mlt\"` property. Developers can experiment using a demo style, a conversion server, or the upcoming Planetiler tile generator.\n\nThe project is the result of a multi-year collaboration and is open for community feedback and contributions via Slack and GitHub.",
    "chinese_title": "MapLibre Tile：一种现代高效的矢量瓦片格式",
    "chinese_summary": "**《宣布 MapLibre Tile：一种现代高效的矢量切片格式》摘要**\n\nMapLibre 推出了 **MapLibre Tile (MLT)**，这是一种新的矢量切片格式，旨在作为广泛使用的 Mapbox Vector Tile (MVT) 的继任者。MLT 从头开始构建，旨在应对现代挑战，包括不断增长的地理空间数据量和复杂的新数据源，同时充分利用当代硬件和图形 API。\n\n该格式目前的主要优势是**显著改进的压缩率**（对于大型切片最高可达 6 倍）和**更快的解码性能**，这是通过面向列的布局和轻量级编码实现的。这减少了延迟和存储成本，并提高了缓存利用率。\n\nMLT 的设计也考虑了未来的功能，包括更好地支持 3D 坐标/高程、适用于 Overture Maps 等格式的线性参考、复杂数据类型（嵌套属性、列表），以及针对高效 GPU 和 CPU 处理优化的格式。\n\n对于即时使用，MapLibre GL JS 和 MapLibre Native 现在都通过 `\"encoding\": \"mlt\"` 属性支持 MLT 数据源。开发者可以使用演示样式、转换服务器或即将推出的 Planetiler 切片生成器进行实验。\n\n该项目是多年合作的成果，并通过 Slack 和 GitHub 开放给社区进行反馈和贡献。"
  },
  {
    "id": "46770274",
    "title": "Dithering – Part 2: The Ordered Dithering",
    "url": "https://visualrambling.space/dithering-part-2/",
    "summary": "This article, the second part of a series on dithering, focuses on **ordered dithering**, a technique for converting grayscale images to black and white.\n\nIt begins by recapping quantization—reducing color shades—and explains how a single threshold is insufficient. Ordered dithering instead uses a **threshold map**, a grid of multiple thresholds tiled across the image. Each pixel's shade is compared to the corresponding threshold value in the map to determine if it becomes black or white, creating patterns that simulate gray tones.\n\nThe article highlights a key problem: poorly arranged maps can cause visual artifacts. It introduces the **Bayer matrix** as a solution, which arranges thresholds to produce a cross-hatch pattern that evenly disperses black and white pixels. Starting with a 2x2 matrix (4 shades), it shows how increasing the map size to 4x4 (16 shades) and 8x8 (64 shades) creates smoother gradients and reduces harsh transitions.\n\nFinally, it briefly explores alternative threshold map arrangements beyond the Bayer family, such as the **Cluster Dot** matrix (which creates a classic newspaper print look) and the **Void and Cluster** method (which produces a more natural, less rigid \"blue noise\" pattern). The article concludes by teasing the next topic: error diffusion dithering.",
    "chinese_title": "抖动技术 – 第二部分：有序抖动",
    "chinese_summary": "本文是抖动技术系列的第二部分，重点介绍**有序抖动**——一种将灰度图像转换为黑白图像的技术。\n\n文章首先回顾了量化（减少色彩层次）的概念，并解释了单一阈值的不足。有序抖动则使用**阈值图**，即由多个阈值组成的网格，平铺于整幅图像上。每个像素的灰度值与图中对应位置的阈值进行比较，从而决定其变为黑色或白色，由此形成的图案能够模拟出灰色调。\n\n文章指出了一个关键问题：排列不当的阈值图会产生视觉伪影。为此引入了**拜耳矩阵**作为解决方案，该矩阵通过特定方式排列阈值，生成交叉阴影图案，使黑白像素均匀分布。从2x2矩阵（4种灰度）开始，文章展示了将矩阵尺寸增大至4x4（16种灰度）和8x8（64种灰度）如何创建更平滑的渐变并减少生硬的过渡。\n\n最后，文章简要探讨了拜耳系列之外的其他阈值图排列方式，例如**簇点矩阵**（可产生经典报纸印刷效果）和**空隙与集群法**（能生成更自然、更少规则感的“蓝噪声”图案）。文章结尾预告了下一个主题：误差扩散抖动。"
  },
  {
    "id": "46709461",
    "title": "Find 'Abbey Road when type 'Beatles abbey rd': Fuzzy/Semantic search in Postgres",
    "url": "https://rendiment.io/postgresql/2026/01/21/pgtrgm-pgvector-music.html",
    "summary": "This article explains how to implement a robust search system in PostgreSQL to match messy user queries (e.g., \"beatles abbey rd\") against a clean catalog of music albums. It presents two complementary approaches using PostgreSQL extensions.\n\n**Fuzzy Matching with pg_trgm:** This method breaks text into character trigrams to handle typos, abbreviations, and word order variations (e.g., \"abbey rd\" → \"Abbey Road\"). It requires a GIN index on a normalized version of the text for fast performance.\n\n**Semantic Search with pgvector:** This approach uses machine learning embeddings to understand meaning, allowing matches based on synonyms and conceptual similarity (e.g., \"Beatles final album\" → \"Abbey Road\"). It requires generating and storing vector embeddings for catalog items and creating an IVFFlat index.\n\nThe article emphasizes **text normalization** as a critical preprocessing step to remove noise (like \"(Remastered)\") and standardize input, improving both methods. It also recommends a **hybrid strategy**: first trying fast fuzzy matching, then falling back to semantic search for harder queries. The guide includes practical code for loading a Spotify dataset, creating indexes, generating embeddings, and implementing the combined search logic.",
    "chinese_title": "查找'Beatles abbey rd'时显示'Abbey Road'：Postgres中的模糊/语义搜索",
    "chinese_summary": "本文介绍了如何在PostgreSQL中实现一个强大的搜索系统，以匹配混乱的用户查询（例如“beatles abbey rd”）与干净的音乐专辑目录。它提出了两种使用PostgreSQL扩展的互补方法。\n\n**使用pg_trgm进行模糊匹配：** 该方法将文本分解为字符三元组，以处理拼写错误、缩写和词序变化（例如“abbey rd” → “Abbey Road”）。它需要在文本的标准化版本上建立GIN索引以实现快速性能。\n\n**使用pgvector进行语义搜索：** 该方法利用机器学习嵌入来理解含义，允许基于同义词和概念相似性进行匹配（例如“Beatles final album” → “Abbey Road”）。它需要为目录项生成和存储向量嵌入，并创建IVFFlat索引。\n\n文章强调**文本标准化**作为关键预处理步骤，以去除噪音（如“(Remastered)”）并标准化输入，从而提升两种方法的效果。它还推荐一种**混合策略**：首先尝试快速的模糊匹配，然后对更难的查询回退到语义搜索。指南包含实用代码，用于加载Spotify数据集、创建索引、生成嵌入以及实现组合搜索逻辑。"
  },
  {
    "id": "46766961",
    "title": "There is an AI code review bubble",
    "url": "https://www.greptile.com/blog/ai-code-review-bubble",
    "summary": "In this article, the founders of Greptile, an AI code review tool, argue that the market is experiencing a bubble of similar products. They state that competing on subjective claims of superior performance is ineffective.\n\nInstead, they differentiate their company through a long-term vision built on three core principles:\n\n1.  **Independence:** They believe the AI that reviews code must be separate from the one that writes it. Having the same agent both generate and approve code is seen as a fundamental conflict, akin to a student grading their own essay.\n\n2.  **Autonomy:** They predict code validation (review, testing, QA) will become fully automated—work humans dislike and are not optimal at. Consequently, Greptile is built as a \"pipes\" product for background automation, without a human review UI, preparing for a future of minimal human intervention.\n\n3.  **Feedback Loops:** They envision a seamless cycle where a human provides intent, a coding agent writes the code, and a review agent validates it. This creates an automated loop where issues are handed back for fixes until the code is auto-approved and merged, with humans only consulted for clarification.\n\nThe article concludes that choosing a code review tool is a significant long-term decision. While the future is uncertain, Greptile is committed to its vision of autonomous, independent code validation.",
    "chinese_title": "存在一个AI代码审查泡沫",
    "chinese_summary": "在这篇文章中，AI代码审查工具Greptile的创始人认为，市场正经历着同类产品的泡沫。他们指出，仅凭主观声称性能更优来竞争是无效的。\n\n相反，他们通过基于三大核心原则的长期愿景来区分自己的公司：\n\n1.  **独立性：** 他们认为审查代码的AI必须与编写代码的AI分离。让同一个代理既生成又批准代码被视为根本性的冲突，类似于学生给自己的论文打分。\n\n2.  **自主性：** 他们预测代码验证（审查、测试、质量保证）将完全自动化——这是人类不喜欢且不擅长的工作。因此，Greptile被构建为一个用于后台自动化的“管道”产品，没有人工审查界面，为未来极少人工干预做准备。\n\n3.  **反馈循环：** 他们设想一个无缝的循环：人类提供意图，编码代理编写代码，审查代理验证代码。这形成了一个自动化循环，问题被退回修复，直到代码自动批准并合并，仅在需要澄清时才咨询人类。\n\n文章总结道，选择代码审查工具是一个重大的长期决策。虽然未来充满不确定性，但Greptile致力于其自主、独立的代码验证愿景。"
  },
  {
    "id": "46767875",
    "title": "The mountain that weighed the Earth",
    "url": "https://signoregalilei.com/2026/01/18/the-mountain-that-weighed-the-earth/",
    "summary": "This article explains how scientists first measured the mass of the Earth using a mountain. While Newton's laws showed that the Earth's \"weight\" on a person is equal to the person's weight on Earth, this alone doesn't reveal the planet's mass. To calculate it, scientists needed to measure the gravitational pull of a known, smaller object.\n\nIn 1774, Astronomer Royal Nevil Maskelyne led the Schiehallion experiment in Scotland. By measuring the tiny deflection (just 0.0032 degrees) of plumb lines caused by the mountain's gravity, and combining it with a detailed survey of the mountain's shape and rock density by Charles Hutton, they could compare gravitational forces.\n\nFrom this, they calculated the Earth's average density and, consequently, its mass. Their result of 4.87×10²¹ metric tons was within 20% of the modern value (5.91×10²¹ metric tons). Although Henry Cavendish's 1798 torsion balance experiment later achieved greater precision, the Schiehallion experiment was groundbreaking. It was the first to prove that gravity is a universal force emanating from all matter, not just celestial bodies, and provided the first successful measurement of the Earth's mass.",
    "chinese_title": "称量地球的山",
    "chinese_summary": "这篇文章解释了科学家如何首次利用一座山测量地球的质量。牛顿定律表明，地球对一个人的“重量”等于这个人在地球上的重量，但这本身并未揭示地球的质量。要计算地球质量，科学家需要测量一个已知较小物体的引力。\n\n1774年，皇家天文学家内维尔·马斯基林在苏格兰领导了希哈良山实验。通过测量山脉引力导致的铅垂线微小偏转（仅0.0032度），并结合查尔斯·赫顿对山脉形状和岩石密度的详细勘测，他们得以比较引力大小。\n\n由此，他们计算出地球的平均密度，进而得出其质量。他们得出的结果4.87×10²¹公吨与现代值（5.91×10²¹公吨）误差在20%以内。尽管亨利·卡文迪许1798年的扭秤实验后来实现了更高精度，但希哈良山实验具有开创性意义。它首次证明引力是源自所有物质（不仅是天体）的普遍作用力，并成功完成了人类对地球质量的第一次测量。"
  },
  {
    "id": "46767323",
    "title": "What \"The Best\" Looks Like",
    "url": "https://www.kuril.in/blog/what-the-best-looks-like/",
    "summary": "This article argues that for early-stage startups, hiring \"the best\" doesn't mean competing for the most pedigreed candidates. Instead, it means identifying individuals who are uniquely suited to a startup's specific needs and chaotic environment, often overlooked by larger companies.\n\nThe author identifies 11 universal traits of great startup hires, emphasizing that the ideal candidate is often **non-obvious**—someone whose potential isn't reflected in a conventional resume. They should be **not-too-junior** (to avoid excessive supervision) and **not-too-senior** (as large-scale corporate experience may not translate). Other key traits include **hunger, humility, high EQ, team-centricity, competence, high-agency problem-solving, cross-disciplinary empathy, and tolerance for uncertainty**.\n\nThe core message is that a startup CTO's crucial skill is spotting this hidden talent—people with the right blend of skill, adaptability, and mindset to thrive in an early-stage company, rather than simply chasing those with the most impressive credentials.",
    "chinese_title": "“最佳”典范的模样",
    "chinese_summary": "本文认为，对于早期初创企业而言，招聘“最优秀”人才并不意味着争夺履历最光鲜的候选人，而是指找到那些特别适合初创企业特定需求和混乱环境的人——这类人才往往被大公司忽视。\n\n作者总结了优秀初创企业员工的11项普遍特质，强调理想的候选人通常是**非显而易见的**——他们的潜力无法通过传统简历体现。他们应当**资历不过浅**（以避免过度指导）也**不过深**（因为大规模企业经验未必适用）。其他关键特质包括**进取心、谦逊、高情商、团队导向、胜任力、高自主解决问题能力、跨学科同理心以及对不确定性的包容度**。\n\n核心观点是：初创企业CTO的关键能力在于发掘这类隐藏人才——即那些具备合适技能、适应力和心态、能在早期公司茁壮成长的人，而非仅仅追逐拥有最耀眼资历的候选人。"
  },
  {
    "id": "46768909",
    "title": "JuiceSSH – Give me my pro features back",
    "url": "https://nproject.io/blog/juicessh-give-me-back-my-pro-features/",
    "summary": "This article details a method to restore paid \"pro\" features in the JuiceSSH Android app after users reported that their previous purchases were no longer recognized, support became unresponsive, and the app's price increased. The author alleges this resembles an \"exit scam.\"\n\nThe guide provides a technical workaround requiring users to modify the app's APK file. It involves using tools like ApkTool and jarsigner to decompile the app, then patching three specific code files (`User.smali`, `oi0.smali`, and `pi0.smali`) to bypass the license validation checks. The modifications force the app to always return a \"valid license\" status and create a fake authenticated user profile.\n\nAfter making these code changes, the user must recompile and self-sign the modified APK before installing it. The author notes that while this restores core pro features, it likely breaks cloud synchronization and plugin functionality. The provided SHA-256 hash (`d1ee811bcd82f25aea0bdc568896d82017ee174d9c4631c123a9d9173c748232`) is for verifying the integrity of the original APK (version 3.2.2) before modification.",
    "chinese_title": "JuiceSSH – 把我的专业功能还给我",
    "chinese_summary": "本文详述了一种在JuiceSSH安卓应用中恢复付费“专业版”功能的方法。此前有用户报告称，其先前购买记录不再被识别、官方支持已无响应，且应用价格上涨。作者指称此举类似“退出骗局”。\n\n该指南提供了一种技术性解决方案，要求用户修改应用的APK文件。具体步骤包括使用ApkTool和jarsigner等工具反编译应用，随后修补三个特定代码文件（`User.smali`、`oi0.smali`和`pi0.smali`）以绕过许可证验证检查。修改将强制应用始终返回“许可证有效”状态，并创建一个虚假的已认证用户配置文件。\n\n完成代码修改后，用户需重新编译并自签名修改后的APK文件方可安装。作者指出，虽然此方法能恢复核心专业功能，但很可能会破坏云同步和插件功能。文末提供的SHA-256哈希值（`d1ee811bcd82f25aea0bdc568896d82017ee174d9c4631c123a9d9173c748232`）用于验证修改前原始APK文件（版本3.2.2）的完整性。"
  },
  {
    "id": "46766031",
    "title": "Google AI Overviews cite YouTube more than any medical site for health queries",
    "url": "https://www.theguardian.com/technology/2026/jan/24/google-ai-overviews-youtube-medical-citations-study",
    "summary": "A study by SE Ranking has found that Google's AI Overviews feature cites YouTube more than any medical website when answering health-related queries. The research, which analyzed over 50,000 German-language health searches, showed YouTube accounted for 4.43% of all citations, more than any hospital network, government portal, or medical association.\n\nThis reliance on a general video platform, where content can be created by anyone from licensed physicians to wellness influencers, raises significant concerns about the reliability of health information presented to the tool's estimated 2 billion monthly users. While Google defended the feature, stating it surfaces high-quality content and that the top-cited YouTube videos were from medical channels, the researchers noted those videos represented less than 1% of all YouTube links cited.\n\nThe findings suggest that the system may prioritize popular or visible content over medically authoritative sources, embedding structural risks for public health. This follows previous Guardian reporting on instances where AI Overviews provided dangerously misleading medical information. Experts argue the study provides empirical evidence that the potential for harm is systemic to the tool's design, not merely a series of isolated errors.",
    "chinese_title": "谷歌AI概览在健康查询中引用YouTube的次数超过任何医疗网站。",
    "chinese_summary": "SE Ranking的一项研究发现，在回答健康相关查询时，谷歌的AI概览功能引用YouTube的次数超过任何医疗网站。这项研究分析了超过5万条德语健康搜索，结果显示YouTube占所有引用的4.43%，超过任何医院网络、政府门户网站或医学协会。\n\n这种对通用视频平台的依赖引发了重大担忧，因为该平台内容可由任何人创建——从持证医师到健康领域网红——这影响了向该工具约20亿月活用户呈现的健康信息的可靠性。虽然谷歌为该功能辩护，称其会呈现高质量内容，且被引用最多的YouTube视频来自医学频道，但研究人员指出这些视频仅占所有被引用YouTube链接的不到1%。\n\n研究结果表明，该系统可能优先考虑流行或可见的内容，而非医学权威来源，这为公共卫生埋下了结构性风险。此前《卫报》曾报道过AI概览提供危险误导性医疗信息的案例。专家认为，这项研究提供了实证证据，表明潜在危害根植于该工具的设计体系，而不仅仅是一系列孤立错误。"
  },
  {
    "id": "46769965",
    "title": "When AI 'builds a browser,' check the repo before believing the hype",
    "url": "https://www.theregister.com/2026/01/26/cursor_opinion/",
    "summary": "This article critiques the hype surrounding AI's ability to autonomously build complex software, using Cursor's claim to have built a web browser with AI as a case study.\n\nCursor's CEO announced the creation of a \"from-scratch\" browser using GPT-5.2 agents, generating over 3 million lines of code. However, developers who examined the GitHub repository found the project was heavily misrepresented. The code often failed to compile or run, relied on existing engines like Servo and QuickJS (contradicting \"from-scratch\" claims), and was described by a Servo maintainer as a \"uniquely bad design.\"\n\nThe author argues the experiment was an interesting but messy internal project inaccurately marketed as a milestone to promote Cursor's autonomous agent capabilities. It lacked fundamental engineering rigor like passing CI tests and reproducible builds.\n\nThe piece concludes that while AI coding tools can be helpful assistants, the industry hype suggesting AI can independently ship complete projects is premature and dangerous. It leads to skipping the essential validation work that turns a demo into deliverable software. The call is for a focus on practical, real-world results over sensational claims.",
    "chinese_title": "当AI声称“打造浏览器”时，先查查代码库，别轻信炒作。",
    "chinese_summary": "本文以Cursor声称用AI构建浏览器为例，批判了当前关于AI能自主开发复杂软件的过度炒作。\n\nCursor首席执行官宣布使用GPT-5.2智能体“从零开始”创建了浏览器，生成了超过300万行代码。然而，审查GitHub仓库的开发者发现该项目存在严重不实表述：代码常无法编译或运行，实际依赖Servo和QuickJS等现有引擎（与“从零”声明矛盾），更被Servo维护者评价为“堪称糟糕的独特设计”。\n\n作者指出，这本质上是个有趣但混乱的内部实验项目，却被包装成里程碑式成果来推广Cursor的自主智能体能力。项目缺乏基础工程严谨性，既未通过持续集成测试，也不具备可复现的构建流程。\n\n文章最后强调，虽然AI编程工具可作为得力助手，但鼓吹AI能独立交付完整项目的行业炒作仍为时过早且危险——这种风气会让人跳过将演示转化为可交付软件的关键验证工作。作者呼吁业界应聚焦切实可行的实际成果，而非哗众取宠的宣称。"
  },
  {
    "id": "46727603",
    "title": "Not all Chess960 positions are equally complex",
    "url": "https://arxiv.org/abs/2512.14319",
    "summary": "This study analyzes the strategic complexity of all 960 starting positions in Chess960 (Fischer Random Chess). Using Stockfish engine evaluations, it finds that White maintains a near-universal first-move advantage (average evaluation of +0.30 pawns), confirming this as a structural feature of the game.\n\nTo measure decision difficulty, the authors introduce an information-based metric, \\( S(n) \\), which quantifies the cumulative information needed to identify optimal moves over the first \\( n \\) plies. This decomposes into White's (\\( S_W \\)) and Black's (\\( S_B \\)) contributions, yielding total opening complexity \\( S_{\\text{tot}} \\) and a decision asymmetry \\( A = S_B - S_W \\).\n\nResults show significant variation: total complexity differs by a factor of three across positions, while asymmetry ranges from -2.5 to +1.8 bits. A mean asymmetry \\( \\langle A \\rangle = -0.25 \\) bits indicates White generally faces slightly harder opening decisions. The standard chess starting position (#518) is found to have above-average asymmetry (91st percentile) but average overall complexity (47th percentile). The most complex opening is #226, while #198 is the most balanced.\n\nThe key conclusion is that Chess960 positions are highly heterogeneous; small rearrangements of pieces substantially alter strategic depth and competitive fairness. Notably, the classical chess setup is far from the most balanced configuration.",
    "chinese_title": "并非所有国际象棋960局面都具有相同的复杂度。",
    "chinese_summary": "本研究分析了国际象棋960（菲舍尔随机象棋）全部960种初始局面的战略复杂性。通过Stockfish引擎评估发现，白方普遍保持着先手优势（平均评估值为+0.30兵），证实这是该游戏的结构性特征。\n\n为衡量决策难度，作者引入基于信息的度量指标\\( S(n) \\)，该指标量化了前\\( n \\)步内确定最优走法所需的累积信息。该指标可分解为白方贡献值\\( S_W \\)与黑方贡献值\\( S_B \\)，由此得出开局总复杂度\\( S_{\\text{tot}} \\)及决策不对称性\\( A = S_B - S_W \\)。\n\n结果显示显著差异：不同局面的总复杂度相差三倍，不对称性范围在-2.5至+1.8比特之间。平均不对称性\\( \\langle A \\rangle = -0.25 \\)比特表明白方通常面临稍难的开局决策。传统国际象棋初始局面（#518）具有高于平均水平的不对称性（位于第91百分位），但总复杂度处于平均水平（第47百分位）。最复杂的开局是#226局面，而#198局面最为均衡。\n\n核心结论是：国际象棋960的初始局面具有高度异质性；棋子的微小重组会显著改变战略深度与竞技公平性。值得注意的是，经典国际象棋布局远非最均衡的配置。"
  },
  {
    "id": "46709270",
    "title": "Things I've learned in my 10 years as an engineering manager",
    "url": "https://www.jampa.dev/p/lessons-learned-after-10-years-as",
    "summary": "This article shares non-obvious lessons from a decade of engineering management. It argues that the role is inherently fluid, defined by balancing four pillars—Product, Process, People, and Programming—based on a team's specific needs.\n\nKey insights include the necessity for the entire team to understand and care about the product's value, not just the code. Processes should be constantly evaluated for usefulness, not followed as rituals. Communication requires transparency with the team and strategic, prepared proposals for leadership.\n\nThe manager's role is framed as 10% hands-on contributor (on non-critical work), 30% coach, and 60% cheerleader, focused on making wins visible. A core goal is to avoid becoming a bottleneck by delegating, empowering the team, and building systems that function without you. This requires trusting the team's abilities and intent, while using both quantitative and qualitative methods to verify progress and provide support.\n\nUltimately, the manager must delegate everything possible, be thoughtfully risk-averse (not paranoid), and work toward a team that thrives independently.",
    "chinese_title": "我作为工程经理十年间学到的东西",
    "chinese_summary": "本文分享了十年工程管理经验中那些不易察觉的教训。文章指出，这一角色本质上是流动的，其定义取决于根据团队具体需求在产品、流程、人员与编程四大支柱间寻求平衡。\n\n核心见解包括：整个团队不仅需要关注代码，更要理解并重视产品的价值；流程应持续评估其实用性，而非机械遵循；沟通需对团队保持透明，同时向领导层提交经过深思熟虑的战略性提案。\n\n管理者的角色被定义为：10%的实践贡献者（参与非关键工作）、30%的教练和60%的鼓舞者，重点在于让团队成果可见。核心目标是避免成为瓶颈——通过授权、赋能团队以及建立无需亲力亲为的运作体系来实现。这需要信任团队的能力与诚意，同时运用定量与定性方法验证进展并提供支持。\n\n归根结底，管理者必须尽可能下放职权，保持审慎的风险规避意识（而非多疑），并致力于打造一个能够自主蓬勃发展的团队。"
  },
  {
    "id": "46766432",
    "title": "OSS ChatGPT WebUI – 530 Models, MCP, Tools, Gemini RAG, Image/Audio Gen",
    "url": "https://llmspy.org/docs/v3",
    "summary": "The v3 release of OSS ChatGPT WebUI introduces major enhancements focused on extensibility and expanded AI model support. The core upgrade is a switch to the models.dev catalogue, providing access to over 530 models from 24 providers, including new ones like Alibaba and Nvidia.\n\nA key new feature is a flexible Extensions system, allowing users to add custom features, providers, and UI components. This is demonstrated by extensions like **Gemini RAG** for document-based AI chats and **fast_mcp** for connecting to external tools. The UI has been redesigned with a powerful new model selector for searching and filtering the vast model library.\n\nThe update also adds first-class support for **Python function calling (Tools)**, enabling LLMs to interact with the local environment, and includes built-in capabilities for image/audio generation, code execution, and desktop automation. Storage has been migrated to server-side SQLite for better performance and persistence.\n\nOverall, v3 transforms the platform into a highly extensible, feature-rich hub for interacting with a wide array of AI models and custom workflows.",
    "chinese_title": "OSS ChatGPT WebUI – 530模型、MCP、工具、Gemini RAG、图像/音频生成",
    "chinese_summary": "OSS ChatGPT WebUI v3版本发布了重大增强，重点聚焦于可扩展性和扩展的AI模型支持。核心升级是转向models.dev目录，提供对24家供应商超过530个模型的访问，包括阿里巴巴和英伟达等新供应商。\n\n一个关键的新特性是灵活的扩展系统，允许用户添加自定义功能、供应商和UI组件。这通过诸如用于基于文档的AI聊天的**Gemini RAG**扩展和用于连接外部工具的**fast_mcp**扩展来展示。UI经过重新设计，配备了一个强大的新模型选择器，用于搜索和筛选庞大的模型库。\n\n此次更新还增加了对**Python函数调用（工具）**的一流支持，使LLM能够与本地环境交互，并内置了图像/音频生成、代码执行和桌面自动化功能。存储已迁移到服务器端SQLite，以获得更好的性能和持久性。\n\n总体而言，v3将该平台转变为一个高度可扩展、功能丰富的中心，用于与广泛的AI模型和自定义工作流进行交互。"
  },
  {
    "id": "46763721",
    "title": "San Francisco Graffiti",
    "url": "https://walzr.com/sf-graffiti",
    "summary": "Based on the provided text, this is not a full article but a title and a partial header. The main points that can be summarized are:\n\n*   The subject is graffiti in San Francisco.\n*   The author or photographer appears to be Riley Walz.\n*   There is an option or prompt to \"Download all,\" suggesting the content may be a collection of images or a portfolio related to San Francisco graffiti.\n\nWithout the full article content, a summary of key arguments, findings, or detailed information cannot be provided. The available text only indicates the topic and creator.",
    "chinese_title": "旧金山涂鸦",
    "chinese_summary": "根据所提供的文本，这并非完整文章，而是一个标题和部分页眉。可总结的要点如下：\n\n*   主题是旧金山的涂鸦艺术。\n*   作者或摄影师似乎是Riley Walz。\n*   存在“下载全部”的选项或提示，表明内容可能是与旧金山涂鸦相关的图片集或作品集。\n\n由于缺乏完整文章内容，无法提供关键论点、研究发现或详细信息的总结。现有文本仅说明了主题和创作者信息。"
  },
  {
    "id": "46767668",
    "title": "France Aiming to Replace Zoom, Google Meet, Microsoft Teams, etc.",
    "url": "https://twitter.com/lellouchenico/status/2015775970330882319",
    "summary": "**Summary:**\n\nFrance is developing a sovereign, state-backed video conferencing solution to reduce reliance on foreign platforms like Zoom, Google Meet, and Microsoft Teams. The initiative, led by the Interministerial Digital Directorate (DINUM), aims to address concerns over data privacy, digital sovereignty, and the potential for surveillance or data access by non-EU governments under foreign laws.\n\nThe project is currently in a proof-of-concept phase, with the working title \"**État Visio**\" (State Video). The goal is to create a secure, trusted communication tool for French public administration, ensuring that sensitive government discussions and data remain within French and European legal jurisdiction. While initially intended for internal government use, the service could later be expanded to local authorities and public service operators.\n\nThis move is part of a broader European push for **\"digital sovereignty\"** and follows similar initiatives in other countries. It reflects growing geopolitical and regulatory pressures to control critical digital infrastructure and protect against dependencies on U.S. and Chinese tech giants. The French solution would adhere to strict European data protection standards (GDPR).\n\nThe article text provided is not the actual content but a browser error message stating that JavaScript is disabled, preventing access to the social media platform (X.com) where the article was likely posted. The summary above is based on the headline and known reporting on this ongoing French government initiative.",
    "chinese_title": "法国计划取代Zoom、Google Meet、Microsoft Teams等平台。",
    "chinese_summary": "**摘要：**\n\n法国正在开发一款由国家支持的自主视频会议解决方案，以减少对Zoom、Google Meet和Microsoft Teams等外国平台的依赖。这项由部际数字事务局（DINUM）主导的举措，旨在应对数据隐私、数字主权以及非欧盟政府可能依据外国法律进行监控或数据访问的担忧。\n\n该项目目前处于概念验证阶段，暂定名为“**État Visio**”（国家视频）。目标是打造一个安全可靠、供法国公共行政部门使用的通信工具，确保敏感的政府讨论和数据保留在法国及欧洲的法律管辖范围内。该服务最初仅供政府内部使用，未来可能扩展至地方当局和公共服务运营商。\n\n此举是欧洲更广泛的“**数字主权**”推动行动的一部分，其他国家也有类似举措。它反映了日益增长的地缘政治和监管压力，要求控制关键数字基础设施，并减少对美国和中国科技巨头的依赖。法国的解决方案将严格遵守欧洲数据保护标准（GDPR）。\n\n所提供的文章文本并非实际内容，而是一条浏览器错误信息，提示JavaScript已禁用，导致无法访问可能发布该文章的社交媒体平台（X.com）。以上摘要是基于相关新闻标题及关于法国政府此项持续举措的已知报道。"
  },
  {
    "id": "46768257",
    "title": "The Adolescence of Technology",
    "url": "https://www.darioamodei.com/essay/the-adolescence-of-technology",
    "summary": "The article argues that humanity is entering a \"technological adolescence\" as we approach the development of \"powerful AI\"—systems smarter than Nobel laureates, capable of autonomous, multi-domain tasks at superhuman speeds. The author believes this could arrive within a few years, posing a profound civilizational challenge akin to the sudden emergence of a \"country of geniuses in a datacenter.\"\n\nThe core risks are framed in five categories: **Autonomy** (if the AI's goals misalign with humanity's); **Misuse for destruction** (amplifying terrorism); **Misuse for seizing power** (by dictators or corporations); **Economic disruption** (from mass unemployment and wealth concentration); and **Indirect destabilizing effects** of rapid technological change.\n\nThe author advocates for a pragmatic, non-alarmist approach to these risks, warning against both \"doomerism\" and complacency. Effective response requires acknowledging uncertainty, starting with limited voluntary and governmental interventions, and advocating for surgical, evidence-based regulations to avoid backlash. The ultimate goal is to navigate this turbulent rite of passage to achieve the immense benefits of AI, but this demands sober, urgent, and collective action from global leaders.",
    "chinese_title": "技术的青春期",
    "chinese_summary": "文章认为，随着我们即将开发出“强大的人工智能”——即比诺贝尔奖得主更聪明、能够以超人速度自主完成多领域任务的系统，人类正在进入一个“技术青春期”。作者相信这可能在几年内实现，并将带来深刻的文明挑战，堪比“数据中心里突然出现一个天才国度”。\n\n核心风险被归纳为五类：**自主性风险**（若人工智能目标与人类目标不一致）；**破坏性滥用风险**（助长恐怖主义）；**权力攫取滥用风险**（被独裁者或企业利用）；**经济颠覆风险**（源于大规模失业与财富集中）；以及技术急速变革带来的**间接失稳效应**。\n\n作者主张以务实而非危言耸听的态度应对这些风险，既要警惕“末日论”，也要避免自满。有效的应对需要承认不确定性，从有限的志愿性及政府干预起步，并倡导精准、基于证据的监管以避免反弹。最终目标是在这场动荡的成长仪式中平稳前行，以实现人工智能的巨大效益，但这要求全球领导者采取清醒、紧迫且协同的行动。"
  },
  {
    "id": "46764170",
    "title": "Show HN: Only 1 LLM can fly a drone",
    "url": "https://github.com/kxzk/snapbench",
    "summary": "This article presents \"SnapBench,\" a project testing whether large language models (LLMs) can pilot a drone in a 3D simulation to locate and identify creatures, inspired by *Pokémon Snap*.\n\nThe author tested seven leading LLMs using the same prompt and conditions. The key finding was that only one model—**Google's Gemini 3 Flash**—successfully completed the task of finding three creatures. It did so by effectively adjusting its altitude to descend to ground level for identification.\n\nSurprisingly, more expensive and capable models like **Claude Opus** and **GPT-4o** failed. They often approached creatures horizontally but never descended, despite numerous attempts. The author suggests that spatial reasoning may not scale with model size or cost, and that smaller models might follow instructions more literally.\n\nThe project highlights that for applications requiring navigation in physical or virtual space, the most advanced model is not necessarily the best. The code is open-source, allowing others to replicate the benchmark or extend it with richer feedback, multi-agent competition, or real-world drone testing.",
    "chinese_title": "展示 HN：仅有一个大型语言模型能操控无人机",
    "chinese_summary": "本文介绍了“SnapBench”项目，该项目灵感源自《宝可梦随乐拍》，旨在测试大型语言模型（LLM）能否在三维模拟中操控无人机定位并识别生物。\n\n作者使用相同提示和条件测试了七种主流LLM。关键发现是，仅有一个模型——**谷歌的Gemini 3 Flash**——成功完成了寻找三种生物的任务。它通过有效调整飞行高度降至地面进行识别。\n\n令人意外的是，**Claude Opus**和**GPT-4o**等更昂贵、能力更强的模型却失败了。它们常水平接近生物却始终未下降高度，尽管经过多次尝试。作者认为空间推理能力可能不随模型规模或成本线性提升，较小模型或许更严格遵循指令。\n\n该项目表明，在需要物理或虚拟空间导航的应用中，最先进的模型未必最优。项目代码已开源，他人可复现该基准测试，或通过增强反馈、多智能体竞争、真实无人机测试等方式进行拓展。"
  },
  {
    "id": "46762882",
    "title": "The Holy Grail of Linux Binary Compatibility: Musl and Dlopen",
    "url": "https://github.com/quaadgras/graphics.gd/discussions/242",
    "summary": "This article discusses the challenge of achieving true Linux binary compatibility for applications that require hardware-accelerated graphics, particularly when using the Go programming language with the Godot engine via the graphics.gd project.\n\nThe core problem is the incompatibility between the two main C libraries (libc) on Linux: glibc and musl. A binary compiled for one will not run on the other. While static Go binaries work well for command-line tools, graphics drivers require dynamic loading (`dlopen`), which is problematic with musl in static builds.\n\nThe author's solution involves several steps:\n1.  Adding `GOOS=musl` support to graphics.gd to enable building on musl-based distributions.\n2.  For musl builds, linking Go code directly with Godot to create a single binary instead of a shared library.\n3.  The key innovation: implementing a custom `dlopen` for static musl binaries. This technique uses a small helper program to load the host system's dynamic linker, \"steal\" its `dlopen` function, and use assembly trampolines to correctly handle thread-local storage (TLS) when calling into dynamically loaded graphics libraries.\n\nThe result is a \"holy grail\": the ability to produce a single, static binary from a graphics.gd project that can run on any Linux system (kernel 3.2+) with a C compiler, regardless of whether it uses glibc or musl. This provides the portability of static Go binaries with full support for hardware-accelerated graphics. The article includes a link to a sample build and instructions for users to try cross-compiling their own projects.",
    "chinese_title": "Linux二进制兼容性的圣杯：Musl与Dlopen",
    "chinese_summary": "本文探讨了在需要硬件加速图形的应用中实现真正的Linux二进制兼容性所面临的挑战，特别是在通过graphics.gd项目使用Go语言与Godot引擎时。\n\n核心问题在于Linux上两个主要C库（libc）——glibc与musl——之间的不兼容性。为其中一个编译的二进制文件无法在另一个上运行。虽然静态Go二进制文件在命令行工具中表现良好，但图形驱动程序需要动态加载（`dlopen`），而这在musl的静态构建中存在问题。\n\n作者的解决方案包含几个步骤：\n1. 为graphics.gd添加`GOOS=musl`支持，以便在基于musl的发行版上构建。\n2. 对于musl构建，将Go代码直接与Godot链接，生成单一二进制文件而非共享库。\n3. 关键创新：为静态musl二进制文件实现自定义`dlopen`。该技术通过一个小型辅助程序加载宿主系统的动态链接器，“借用”其`dlopen`函数，并利用汇编跳转机制在调用动态加载的图形库时正确处理线程本地存储（TLS）。\n\n最终实现了一个“圣杯”：能够从graphics.gd项目生成单一静态二进制文件，可在任何装有C编译器的Linux系统（内核3.2+）上运行，无论其使用glibc还是musl。这既保留了静态Go二进制文件的便携性，又完整支持硬件加速图形。文章附带了示例构建的链接及用户自行尝试跨项目编译的说明。"
  },
  {
    "id": "46769201",
    "title": "Google Books has been effectively killed by the last algorithm update",
    "url": "https://old.reddit.com/r/google/comments/1qn1hk1/google_has_seemingly_entirely_removed_search/",
    "summary": "**Summary of Article: \"Google Books has been effectively killed by the last algorithm update\"**\n\nThe article, based on a Reddit discussion, reports that a recent Google algorithm update has severely degraded the functionality of Google Books. The core complaint is that the standard Google Search no longer returns usable links to books or previews within the Google Books repository.\n\nKey points from the discussion include:\n\n*   **Broken Search:** Users searching for specific book titles or quotes now primarily get results from retail sites like Amazon and Goodreads, or summary/study guide sites, instead of direct links to the book's preview on Google Books.\n*   **Loss of Functionality:** The change has effectively nullified Google Books' value as a research tool. Users can no longer easily search within texts, verify quotes, or preview content directly through Google Search.\n*   **Speculation on Motive:** Commentators speculate the change is driven by economic incentives, suggesting Google is prioritizing affiliate revenue from retail links and ad-heavy summary sites over providing direct, free access to book content.\n*   **Workaround Available (But Cumbersome):** The article notes that books can still be found by using the dedicated `books.google.com` site directly, but this requires users to know the separate domain and perform their search again, breaking the seamless integration with main Google Search.\n*   **User Frustration:** The overall sentiment is one of significant frustration and loss, with users declaring a once-powerful research tool \"dead\" for practical purposes and lamenting the prioritization of commercial results over information access.\n\nIn essence, the update is criticized for burying Google Books' content in favor of monetized links, drastically reducing its utility for readers and researchers.",
    "chinese_title": "谷歌图书在最近的算法更新中实际上已被扼杀。",
    "chinese_summary": "**文章摘要：\"谷歌图书被最新算法更新彻底扼杀\"**\n\n本文基于Reddit讨论，报道称谷歌近期算法更新严重削弱了谷歌图书的功能。核心争议在于：标准谷歌搜索不再返回指向谷歌图书库内书籍或预览页的有效链接。\n\n讨论要点包括：\n\n*   **搜索功能失效：** 用户搜索特定书名或引文时，结果主要来自亚马逊、Goodreads等零售网站或摘要/学习指南网站，而非直接指向谷歌图书预览页的链接。\n*   **核心价值丧失：** 这一变化使谷歌图书作为研究工具的价值荡然无存。用户无法再通过谷歌搜索直接进行文本内检索、核实引文或预览内容。\n*   **动机推测：** 评论者推测此次调整出于经济利益，认为谷歌优先考虑零售链接的联盟佣金和广告密集的摘要网站，而非提供直接、免费的图书内容访问。\n*   **存在替代方案（但繁琐）：** 文章指出，通过直接访问专用域名`books.google.com`仍可查找书籍，但这要求用户知晓该独立域名并重新搜索，破坏了与主谷歌搜索的无缝衔接。\n*   **用户不满：** 整体舆论充满沮丧与失落感，用户宣称这一曾强大的研究工具已\"名存实亡\"，并谴责商业结果优先于信息获取的现状。\n\n本质上，此次更新因将谷歌图书内容埋没在盈利性链接之后而受到批评，极大降低了其对读者和研究者的实用性。"
  },
  {
    "id": "46769668",
    "title": "Notice of Collective Action Lawsuit Against Workday, INC",
    "url": "https://workdaycase.com",
    "summary": "This is a court-authorized notice regarding a collective action lawsuit against Workday, Inc. The lawsuit alleges that Workday's job application platform used Artificial Intelligence (AI) features that discriminated against applicants aged 40 and older, in violation of the Age Discrimination in Employment Act (ADEA).\n\nThe notice is directed at individuals who applied for jobs using Workday's platform on or after September 24, 2020, while they were 40 or older. To potentially benefit from the lawsuit, eligible individuals must actively join, or \"opt-in,\" by completing and submitting an Opt-In Consent to Join Form by **March 7, 2026**.\n\nBy opting in, individuals consent to be represented by the plaintiffs' attorneys at no upfront cost (they would be paid from any potential recovery) and will be bound by the court's final judgment. Those who do not opt in will not be part of this specific lawsuit but retain the right to file their own separate legal action.\n\nWorkday denies the allegations, and the court has not yet ruled on the merits of the case. The notice clarifies that federal law prohibits retaliation for participating in the lawsuit.",
    "chinese_title": "针对工作日公司的集体诉讼通知",
    "chinese_summary": "这是一份关于针对Workday公司集体诉讼的法院授权通知。该诉讼指控Workday的求职申请平台使用的人工智能功能对40岁及以上的申请人构成歧视，违反了《就业年龄歧视法》。\n\n本通知面向2020年9月24日或之后使用Workday平台申请职位、且当时年龄在40岁或以上的个人。若希望从本诉讼中潜在获益，符合条件者必须通过填写并提交《加入诉讼同意书》的方式主动加入诉讼，截止日期为**2026年3月7日**。\n\n通过选择加入，个人同意由原告律师代表（律师费用将从潜在赔偿中支付，无需预先支付），并将受法院最终判决的约束。未选择加入者不会成为本案当事人，但保留另行提起诉讼的权利。\n\nWorkday否认相关指控，法院尚未就案件实质作出裁决。通知明确说明联邦法律禁止对参与诉讼者进行报复。"
  },
  {
    "id": "46701045",
    "title": "OpenFlexure Microscope",
    "url": "https://openflexure.org/projects/microscope/",
    "summary": "The OpenFlexure Microscope is an open-source, customizable optical microscope designed to provide lab-quality performance at low cost. It features an inverted design and a high-precision, 3D-printed mechanical stage that uses plastic flexures for frictionless, stable motion, achieving sub-100-nanometer precision when motorized with inexpensive stepper motors.\n\nKey advantages include its accessibility and ease of assembly. The core structure prints as a single piece, minimizing parts and post-print work. The primary costs are a Raspberry Pi and its camera module, making it affordable to build. It is versatile, working with basic webcam optics or professional microscope objectives, and can be customized with optional printed modules for advanced techniques like fluorescence or polarization-contrast microscopy.\n\nThe project provides comprehensive resources, including assembly guides, control software, and options to purchase kits from vendors. Its design is formally documented in academic publications like *Biomedical Optics Express*, supporting its scientific credibility. Ultimately, the OpenFlexure Microscope aims to make high-performance microscopy available to everyone.",
    "chinese_title": "OpenFlexure显微镜",
    "chinese_summary": "OpenFlexure显微镜是一款开源、可定制的光学显微镜，旨在以低成本实现实验室级别的性能。它采用倒置设计，配备高精度3D打印机械载物台，通过塑料柔性结构实现无摩擦稳定运动，在搭配低成本步进电机驱动时可达到亚100纳米级精度。\n\n其主要优势在于易获取和易组装。核心结构可一体打印成型，最大限度减少零部件数量和后期处理工作。主要成本仅为树莓派及其摄像头模块，使得整体构建成本低廉。该显微镜用途广泛，既可搭配普通网络摄像头光学元件，也可使用专业显微镜物镜，还能通过可选打印模块进行定制，以支持荧光或偏振对比显微等高级技术。\n\n该项目提供全面的资源，包括组装指南、控制软件，以及从供应商处购买套件的选项。其设计已正式发表于《生物医学光学快报》等学术期刊，确保了科学可信度。最终，OpenFlexure显微镜致力于让高性能显微技术惠及所有人。"
  },
  {
    "id": "46762150",
    "title": "The browser is the sandbox",
    "url": "https://simonwillison.net/2026/Jan/25/the-browser-is-the-sandbox/",
    "summary": "This article discusses how the modern web browser can serve as a secure \"sandbox\" for AI coding agents, based on research and a demo by Google's Paul Kinlan.\n\nThe core idea is that browsers have evolved over 30 years to safely run untrusted code from the web. Kinlan explores if this existing infrastructure can be repurposed to let AI agents perform tasks directly on a user's computer, similar to applications like Claude Cowork but without needing heavy local containers.\n\nHe identifies three key sandbox requirements and their browser-based solutions:\n1.  **Filesystem access:** Using the File System Access API and the `webkitdirectory` attribute for reading directories.\n2.  **Network access:** Controlled via Content Security Policy (CSP) headers.\n3.  **Safe code execution:** Achieved through sandboxed `<iframe>` elements and WebAssembly run in Web Workers.\n\nKinlan built a demo called **Co-do** to test this hypothesis. It allows users to select a local folder, configure an LLM provider, and use a chat interface where the AI can interact with those files—showcasing the browser's potential as an agent platform.\n\nThe article notes that while promising, some technologies like the File System Access API remain Chrome-specific, and documentation for `<iframe sandbox>` is sparse. Kinlan's post provides valuable technical details, including a double-iframe technique for network control.",
    "chinese_title": "浏览器即是沙盒",
    "chinese_summary": "本文探讨了现代网页浏览器如何基于谷歌Paul Kinlan的研究与演示，成为AI编程代理的安全“沙盒”。核心观点是浏览器历经30年发展已能安全运行来自网络的不受信任代码。Kinlan探索是否可将这套现有基础设施改造为让AI代理直接在用户计算机上执行任务，类似于Claude Cowork等应用，但无需笨重的本地容器。\n\n他提出了三项关键沙盒需求及其基于浏览器的解决方案：\n1.  **文件系统访问**：通过文件系统访问API和`webkitdirectory`属性实现目录读取。\n2.  **网络访问**：通过内容安全策略（CSP）标头进行控制。\n3.  **安全代码执行**：通过沙盒化`<iframe>`元素及在Web Worker中运行的WebAssembly实现。\n\nKinlan构建了名为**Co-do**的演示程序来验证这一假设。用户可通过该程序选择本地文件夹、配置大语言模型供应商，并在聊天界面中让AI与这些文件交互——展示了浏览器作为代理平台的潜力。\n\n文章指出，尽管前景广阔，但文件系统访问API等技术仍为Chrome浏览器独有，且`<iframe sandbox>`的文档资料较为匮乏。Kinlan的博文提供了宝贵的技术细节，包括用于网络控制的双重iframe技术。"
  },
  {
    "id": "46766229",
    "title": "Exactitude in Science – Borges (1946) [pdf]",
    "url": "https://kwarc.info/teaching/TDM/Borges.pdf",
    "summary": "Based on the PDF text, the article is Jorge Luis Borges's 1946 short story \"On Exactitude in Science\" (often translated as \"Of Exactitude in Science\").\n\nThe story presents a fictional historical anecdote about a legendary empire where cartography became an obsession. The mapmakers of this empire strove for absolute precision, creating maps that were the same scale as the empire itself. Their final, perfect map was a 1:1 scale, covering the entire territory it was meant to represent.\n\nBorges concludes with a ironic twist: later generations found this perfectly accurate map to be useless. The vast, tattered map was abandoned to the harsh elements of sun and rain, eventually decaying across the deserts. The story ends with the haunting image of ruined fragments of the map sheltering occasional animals or beggars.\n\nThe central theme is a critique of positivism and the futile pursuit of total representation. Borges suggests that a perfect, exhaustive replica of reality is not only impossible but also pointless, as it loses its function as a useful model or abstraction. The map becomes the territory, thereby negating its own purpose. The tale is a classic parable about the relationship between models and reality, knowledge and utility.",
    "chinese_title": "科学的严谨性——博尔赫斯（1946年）[pdf]",
    "chinese_summary": "根据PDF文本，这篇文章是豪尔赫·路易斯·博尔赫斯于1946年创作的短篇小说《论科学的精确性》（亦常译作《科学的严谨》）。\n\n故事以一个虚构的历史轶事展开，讲述了一个传奇帝国对制图术的痴迷。该帝国的地图绘制者追求绝对精确，制作出与帝国实际疆域同等比例的地图。他们最终完成的完美地图采用1:1比例，覆盖了其所要代表的全部领土。\n\n博尔赫斯以讽刺性的转折收尾：后世发现这张完美精确的地图毫无用处。这幅巨大而破旧的地图被遗弃在日晒雨淋的严酷环境中，最终在荒漠中逐渐腐朽。故事以一幅萦绕人心的画面结束——地图的残破碎片偶尔为动物或乞丐提供栖身之所。\n\n故事的核心主题是对实证主义及追求完全再现现实的徒劳之举的批判。博尔赫斯指出，一个完美无缺、事无巨细的现实复制品不仅不可能实现，而且毫无意义，因为它丧失了作为实用模型或抽象概括的功能。地图变成了领土，从而否定了自身存在的目的。这个短篇是关于模型与现实、知识与效用关系的经典寓言。"
  },
  {
    "id": "46698264",
    "title": "Text Is King",
    "url": "https://www.experimental-history.com/p/text-is-king",
    "summary": "In his article \"Text Is King,\" Adam Mastroianni challenges the popular narrative that digital technology is causing a catastrophic decline in reading and literacy. He argues that while data shows a moderate decrease in reading time, the trend is not as severe as often claimed, with book sales and independent bookstores remaining strong.\n\nMastroianni questions the assumption that people inherently prefer shallow digital content over deep reading, suggesting that human desires for meaningful, complex engagement are hard to artificially satisfy. He asserts that text remains uniquely powerful for serious intellectual work, as writing forces clarity and preserves ideas in a way other media cannot. Major cultural and political movements, he notes, are still anchored by books.\n\nHe also contends that modern society, far from becoming \"post-literate,\" is actually more \"recorded\" than ever through photos, videos, and data, which complement rather than replace textual knowledge. Ultimately, Mastroianni is optimistic about the enduring cultural power of the written word, believing the fundamental human drive to read and engage with complex text will persist.",
    "chinese_title": "文本为王",
    "chinese_summary": "亚当·马斯特罗亚尼在其文章《文字为王》中，对“数字技术正导致阅读与读写能力灾难性衰退”这一流行观点提出挑战。他指出，尽管数据显示阅读时间略有减少，但这一趋势并不像常说的那样严重，图书销售和独立书店依然保持强劲。\n\n马斯特罗亚尼质疑人们天生偏爱浅层数字内容而非深度阅读的假设，认为人类对有意义、复杂交流的渴望很难被人工满足。他强调，文字对于严肃的智力工作具有不可替代的力量，因为写作能迫使思维清晰，并以其他媒介无法做到的方式保存思想。他指出，重大的文化与政治运动依然以书籍为根基。\n\n他还认为，现代社会远未进入“后读写时代”，反而通过照片、视频和数据变得比以往更“可记录”，这些形式是对文本知识的补充而非替代。最终，马斯特罗亚尼对文字持久的文化力量保持乐观，相信人类阅读与参与复杂文本的根本动力将会延续。"
  },
  {
    "id": "46765460",
    "title": "After two years of vibecoding, I'm back to writing by hand",
    "url": "https://atmoio.substack.com/p/after-two-years-of-vibecoding-im",
    "summary": "The author describes a disillusioning journey with AI coding assistants. Initially impressed by their ability to handle small and then large tasks, they progressed to using AI for complex, specification-driven development. However, they found this approach fundamentally flawed: AI agents cannot adapt specifications dynamically, make rigid upfront decisions, and produce code that looks impressive in isolation but lacks coherence within the larger codebase.\n\nThe core issue identified is \"slop\"—AI-generated code that is plausible in small units but creates a messy, structurally unsound whole when integrated, akin to a novel where individual paragraphs are good but the overall chapter is incoherent. This led the author to conclude the code was unfit for production, prioritizing integrity and user trust over perceived speed.\n\nConsequently, the author has returned to manual coding, asserting that when factoring in the total cost of specification, review, and correction, they are ultimately faster, more accurate, and more creative without AI. The article serves as a critique of current AI coding limitations, particularly for serious engineering work requiring architectural integrity.",
    "chinese_title": "经过两年的氛围编程，我又回归了手写。",
    "chinese_summary": "作者描述了一段令人幻灭的AI编程助手使用历程。最初，它们处理小型乃至大型任务的能力令人印象深刻，于是作者进而尝试用AI进行复杂的、基于需求说明的开发。然而，他发现这种方法存在根本缺陷：AI代理无法动态调整需求说明，只会做出僵化的前期决策，生成的代码单独看似乎出色，却无法与整体代码库协调一致。\n\n其核心问题被归结为“粗糙产出”——即AI生成的代码在局部看似合理，但整合后却形成混乱、结构松散的整體，犹如一部小说中每个段落都不错，但整章却缺乏连贯性。这使作者认定此类代码不适合投入生产环境，并选择将代码完整性与用户信任置于表面速度之上。\n\n因此，作者已回归手动编程，并指出若将需求说明、审查和修正的总成本纳入考量，无AI辅助的开发方式最终更快、更准确、更具创造性。本文旨在批判当前AI编程的局限性，尤其针对需要架构完整性的严肃工程工作。"
  },
  {
    "id": "46700489",
    "title": "Blade Runner Costume Design (2020)",
    "url": "https://costumedesignarchive.blogspot.com/2020/12/blade-runner-1982.html",
    "summary": "This article details the costume design of the 1982 film *Blade Runner*, primarily by Charles Knode, with Michael Kaplan likely as assistant. The design philosophy blended futuristic elements with 1930s/40s noir fashion.\n\nKey character costumes are highlighted: Rick Deckard’s patterned shirts and trenchcoat; Gaff’s Edwardian-inspired “dandy” look; Roy Batty’s militaristic trenchcoat; and Rachael’s glamorous, Adrian-inspired power suits with fur and silk. The replicants Pris and Zhora wear sensual, kinky outfits fitting their roles, while Sebastian’s colorful, studded jacket reflects his quirky character.\n\nThe article notes that many principal costumes were custom-made, often at Ital Costume, though some minor characters likely wore vintage or stock clothing. It also mentions the challenge of documenting extras' costumes, which were a mix of reused stock, vintage, and contemporary items, and acknowledges the use of production photos due to the film’s dark, atmospheric lighting often obscuring costume details.",
    "chinese_title": "《银翼杀手》服装设计（2020）",
    "chinese_summary": "本文详述了1982年电影《银翼杀手》的服装设计，主要由查尔斯·诺德操刀，迈克尔·卡普兰可能担任助理。设计理念融合了未来主义元素与1930至1940年代的黑色电影时尚。\n\n重点角色服装包括：瑞克·戴卡德的印花衬衫与风衣；加夫受爱德华时代启发的“花花公子”造型；罗伊·巴蒂的军装风衣；以及瑞秋华丽、借鉴阿德里安设计风格的皮草与丝绸权力套装。复制人普莉丝和佐拉身着符合角色设定的性感奇装，而塞巴斯蒂安色彩鲜艳、镶满铆钉的夹克则呼应了他古怪的性格。\n\n文章指出，许多主要服装均为定制，常在意大利戏服公司制作，但部分次要角色可能穿着复古或库存服装。文中还提到记录临时演员服装的挑战——这些服装混合了重复使用的库存衣、复古款与现代单品，并承认由于影片昏暗的氛围光线常掩盖服装细节，需借助剧照进行考证。"
  }
]