[
  {
    "id": "46436889",
    "title": "FediMeteo: A €4 FreeBSD VPS Became a Global Weather Service",
    "url": "https://it-notes.dragas.net/2025/02/26/fedimeteo-how-a-tiny-freebsd-vps-became-a-global-weather-service-for-thousands/",
    "summary": "FediMeteo is a global, automated weather service built on a €4/month FreeBSD VPS. It publishes localized forecasts for thousands of cities worldwide directly to the Fediverse via the ActivityPub protocol.\n\nThe project began as a personal tool to receive weather updates for an Italian city. It uses FreeBSD jails to isolate instances by country for security and management. The core software is **snac**, a minimal ActivityPub server, which posts forecasts generated by a custom Python script. This script fetches data from Open-Meteo, formats it in Markdown with local languages and emojis for accessibility, and publishes via command line.\n\nStarting with Italy, the service expanded rapidly after promotion by FediFollows. It now covers **38 countries and over 2,900 cities**, with nearly 7,700 direct followers. Key technical challenges included scaling for large countries like the USA, handling different units and timezones, and implementing coordinate caching to improve reliability.\n\nDespite its scale, the system remains efficient, using only about 500MB of RAM. It is backed by regular ZFS snapshots and encrypted offsite backups. The project demonstrates how minimal, Unix-philosophy-aligned tools on a budget VPS can create a robust, widely-used service.",
    "chinese_title": "FediMeteo：一台4欧元的FreeBSD虚拟服务器如何成为全球气象服务",
    "chinese_summary": "FediMeteo是一项基于每月4欧元FreeBSD VPS构建的全球自动化气象服务。它通过ActivityPub协议直接向联邦宇宙发布全球数千个城市的本地化天气预报。\n\n该项目最初只是为获取意大利某城市天气信息而打造的个人工具。它采用FreeBSD监狱技术按国家隔离实例，以提升安全性和管理效率。核心软件是极简ActivityPub服务器**snac**，用于发布由定制Python脚本生成的天气预报。该脚本从Open-Meteo获取数据，使用本地语言和表情符号以Markdown格式排版以提升可读性，并通过命令行发布信息。\n\n服务从意大利起步，经FediFollows推广后迅速扩展。现已覆盖**38个国家和2900多座城市**，拥有近7700名直接关注者。主要技术挑战包括为美国等大国进行规模适配、处理不同单位和时区，以及通过坐标缓存机制提升系统可靠性。\n\n尽管规模庞大，该系统仍保持高效运行，仅占用约500MB内存。采用定期ZFS快照和加密异地备份提供数据保障。该项目证明了在低成本VPS上运用符合Unix哲学的精简工具，同样能创建出稳健且广泛使用的服务。"
  },
  {
    "id": "46437381",
    "title": "Everything as Code: How We Manage Our Company in One Monorepo",
    "url": "https://www.kasava.dev/blog/everything-as-code-monorepo",
    "summary": "At Kasava, the entire company operates from a single monorepo, containing not just application code but also marketing websites, documentation, investor decks, email templates, and external service code. This \"everything as code\" approach enables atomic changes across all boundaries—like updating pricing in one JSON file to instantly propagate across the backend, frontend, and marketing site—eliminating sync issues.\n\nThe structure is key to their AI-native development philosophy. By consolidating all context into one repository, AI tools can understand and validate changes across the entire system, accelerating documentation, fact-checking, and feature development. It also creates a uniform shipping culture where everything, from blog posts to new features, is deployed via the same `git push` workflow.\n\nWhile the repo contains over 5,000 TypeScript files across independent projects (like a Next.js frontend and Cloudflare Workers backend), they avoid complex monorepo tooling. Each directory is a separate npm project, and CI/CD pipelines are selectively triggered by path changes. They manage potential challenges like repository size and permission boundaries by keeping assets external and maintaining a small, transparent team. The setup is documented with `CLAUDE.md` files in each directory to guide both developers and AI assistants.",
    "chinese_title": "一切皆代码：我们如何在一个单一代码库中管理公司",
    "chinese_summary": "在Kasava，整个公司都运行在一个单一的单体代码库中，它不仅包含应用程序代码，还包括营销网站、文档、投资者演示文稿、电子邮件模板和外部服务代码。这种“一切皆代码”的方法实现了跨所有边界的原子性变更——例如，只需更新一个JSON文件中的定价信息，就能立即在后端、前端和营销网站上同步生效，从而消除了同步问题。\n\n这种结构是他们AI原生开发理念的关键。通过将所有上下文整合到一个代码库中，AI工具可以理解和验证整个系统的变更，从而加速文档编写、事实核查和功能开发。它还创建了一种统一的发布文化，从博客文章到新功能，所有内容都通过相同的`git push`工作流进行部署。\n\n尽管该代码库包含超过5,000个跨独立项目（如Next.js前端和Cloudflare Workers后端）的TypeScript文件，但他们避免了复杂的单体代码库工具。每个目录都是一个独立的npm项目，CI/CD流水线根据路径变更选择性触发。他们通过将资产保持外部化并维持一个小型、透明的团队来管理潜在的挑战，如代码库大小和权限边界。每个目录中都配有`CLAUDE.md`文件来记录设置，以指导开发人员和AI助手。"
  },
  {
    "id": "46435418",
    "title": "Toro: Deploy Applications as Unikernels",
    "url": "https://github.com/torokernel/torokernel",
    "summary": "Toro is a unikernel designed to deploy applications as lightweight microVMs. It features a minimalistic architecture that leverages virtio-fs for filesystem access and virtio-vsocket for networking. Key characteristics include support for x86-64, up to 512GB of RAM, compatibility with QEMU-KVM and Firecracker, a cooperative scheduler, fast boot times, and a tiny image size.\n\nUsers can quickly try Toro using a pre-built Docker container, which includes all necessary tools to run examples like \"HelloWorld.\" For local development, the required tools can be installed by following the provided Dockerfile instructions. Additional examples, such as a \"StaticWebServer\" and an \"Intercore Communication\" demo, illustrate networking and multi-core communication capabilities.\n\nContributions are welcome through the project's Google Group, and Toro is licensed under GPLv3. The project is backed by several conference presentations detailing its evolution and features, from boot time optimization to running MPI applications.",
    "chinese_title": "Toro：以单内核形式部署应用程序",
    "chinese_summary": "Toro是一种专为将应用程序部署为轻量级微虚拟机而设计的单内核系统。它采用极简架构，利用virtio-fs实现文件系统访问，通过virtio-vsocket处理网络通信。其主要特性包括支持x86-64架构、最高512GB内存、兼容QEMU-KVM和Firecracker、协作式调度器、快速启动时间以及极小的镜像体积。\n\n用户可通过预构建的Docker容器快速体验Toro，该容器包含运行\"HelloWorld\"示例所需的所有工具。若进行本地开发，可按照提供的Dockerfile说明安装必要工具。其他示例如\"StaticWebServer\"和\"Intercore Communication\"演示，则展示了网络功能与多核通信能力。\n\n欢迎通过项目Google组参与贡献，Toro采用GPLv3许可证。该项目已通过多场技术会议演讲详细介绍了从启动时间优化到运行MPI应用的发展历程与功能特性。"
  },
  {
    "id": "46436127",
    "title": "Electrolysis can solve one of our biggest contamination problems",
    "url": "https://ethz.ch/en/news-and-events/eth-news/news/2025/11/electrolysis-can-solve-one-of-our-biggest-contamination-problems.html",
    "summary": "Researchers at ETH Zurich have developed an electrochemical process to address the persistent contamination caused by banned insecticides like DDT and lindane. These pollutants, known as persistent organic pollutants (POPs), remain in the environment for decades.\n\nThe key innovation uses alternating current electrolysis to break the stable carbon-halogen bonds in these toxins. This method completely removes the harmful halogen atoms, converting them into harmless salts like table salt, while transforming the carbon skeletons into valuable industrial chemicals such as benzene. These products can be used in plastics, pharmaceuticals, and coatings.\n\nThe process is efficient and cost-effective, as alternating current prevents electrode wear and suppresses dangerous side reactions like chlorine gas formation. It requires minimal equipment and can treat contaminated soil or sludge directly on-site without complex pre-treatment, eliminating the need to transport hazardous materials.\n\nThis technology not only offers a solution for cleaning up legacy pollution but also contributes to a circular economy by turning environmental toxins into useful raw materials. The research team has successfully tested a prototype, and the project is a finalist for ETH Zurich's 2025 Spark Award.",
    "chinese_title": "电解可以解决我们最大的污染问题之一。",
    "chinese_summary": "苏黎世联邦理工学院的研究人员开发出一种电化学工艺，用于解决DDT和林丹等禁用杀虫剂造成的持久性污染。这些被称为持久性有机污染物（POPs）的有害物质可在环境中存留数十年。\n\n该技术的核心创新在于利用交流电解破坏毒素中稳定的碳-卤键。这种方法能完全去除有害的卤素原子，将其转化为食盐等无害盐类，同时将碳骨架转化为苯等有价值的工业化学品。这些产物可用于塑料、药品和涂料的生产。\n\n该工艺高效且经济，交流电可防止电极损耗并抑制氯气生成等危险副反应。它仅需简易设备，无需复杂预处理即可直接在现场处理受污染的土壤或污泥，避免了危险物质的运输需求。\n\n这项技术不仅为历史遗留污染提供了治理方案，还能将环境毒素转化为有用原材料，促进循环经济发展。研究团队已成功完成原型测试，该项目已入围苏黎世联邦理工学院2025年度火花奖最终评选。"
  },
  {
    "id": "46435614",
    "title": "A Vulnerability in Libsodium",
    "url": "https://00f.net/2025/12/30/libsodium-vulnerability/",
    "summary": "**Summary of the Libsodium Vulnerability**\n\nA vulnerability was discovered in the low-level function `crypto_core_ed25519_is_valid_point()` in libsodium, a widely used cryptography library. The bug, present in versions up to and including 1.0.20, allowed certain invalid elliptic curve points to be incorrectly validated as belonging to the required cryptographic subgroup.\n\n**Technical Issue:** The function checks if a point is in the prime-order \"main subgroup\" (order L) by multiplying it by L and verifying the result is the identity point. The flawed implementation only checked that the X coordinate was zero, missing the additional requirement that the Y and Z coordinates must be equal. This allowed points from mixed-order subgroups (e.g., a valid point added to a small-order point) to pass validation.\n\n**Impact:** The vulnerability only affects users who directly call this specific low-level function to validate untrusted points for custom cryptographic protocols. **The high-level, standard APIs for Ed25519 signatures (`crypto_sign_*`) are NOT affected**, as they do not use this function. Standard key generation also produces safe keys.\n\n**Fix & Recommendation:** The fix adds the missing coordinate check. The maintainer strongly recommends using the **Ristretto255** API (available since 2019) for new custom protocols, as it automatically handles cofactor issues and is faster. A workaround function is provided for those unable to update immediately.\n\nFixed packages have been available since December 30, 2025. The maintainer notes this is the library's first security issue in 13 years and highlights the ongoing effort required to maintain the project.",
    "chinese_title": "Libsodium 中的一个漏洞",
    "chinese_summary": "**Libsodium 漏洞摘要**\n\n在广泛使用的加密库 libsodium 中，其底层函数 `crypto_core_ed25519_is_valid_point()` 被发现存在一个漏洞。该漏洞存在于 1.0.20 及更早版本中，会导致某些无效的椭圆曲线点被错误地验证为属于所需的密码学子群。\n\n**技术问题：** 该函数通过将点乘以 L 并验证结果是否为恒等点，来检查点是否在素数阶“主子群”（阶为 L）中。有缺陷的实现仅检查了 X 坐标是否为零，而遗漏了 Y 和 Z 坐标必须相等的附加要求。这使得来自混合阶子群（例如，一个有效点加上一个小阶点）的点能够通过验证。\n\n**影响：** 该漏洞仅影响那些直接调用此特定底层函数来验证自定义密码学协议中不可信点的用户。**Ed25519 签名的高级标准 API（`crypto_sign_*`）不受影响**，因为它们不使用此函数。标准的密钥生成也会产生安全的密钥。\n\n**修复与建议：** 修复补丁添加了缺失的坐标检查。维护者强烈建议在新的自定义协议中使用 **Ristretto255** API（自 2019 年起可用），因为它能自动处理辅因子问题且速度更快。对于无法立即更新的用户，提供了一个临时解决方案函数。\n\n修复后的软件包自 2025 年 12 月 30 日起已可用。维护者指出，这是该库 13 年来的首次安全问题，并强调了维护该项目所需的持续努力。"
  },
  {
    "id": "46435308",
    "title": "Show HN: 22 GB of Hacker News in SQLite",
    "url": "https://hackerbook.dosaygo.com",
    "summary": "This is an announcement for \"Hacker Book,\" a project that provides a 22 GB SQLite database containing a complete archive of Hacker News data from 2006 onward. The database includes posts, comments, and related metadata, allowing for offline querying and analysis.\n\nThe project's website mimics the classic Hacker News interface, with navigation links (new, front, ask, show, jobs) and a search/query function. It presents itself as a permanent, community-focused archive (\"All the HN Belong to You! 2006 - 2025 FOREVER\").\n\nThe announcement is presented as a \"Show HN\" post, indicating it's a project shared by its creator(s) for the community to see and use. The footer credits \"DOSAYGO\" and includes a \"[GET THIS]\" link, presumably for downloading the database.",
    "chinese_title": "展示 HN：22 GB 的 Hacker News 数据存入 SQLite",
    "chinese_summary": "这是关于“Hacker Book”项目的公告，该项目提供了一个22 GB的SQLite数据库，包含自2006年起完整的Hacker News数据存档。该数据库涵盖帖子、评论及相关元数据，支持离线查询与分析。\n\n项目网站复刻了经典的Hacker News界面，设有导航链接（最新、首页、问答、展示、招聘）及搜索/查询功能。它定位为永久性、以社区为核心的存档（“所有HN数据皆属于你！2006 - 2025 永久留存”）。\n\n此公告以“Show HN”帖子形式发布，表明是创作者为社区分享的可使用项目。页脚标注“DOSAYGO”开发，并附有“[获取此资源]”链接，推测用于下载数据库。"
  },
  {
    "id": "46436409",
    "title": "A faster heart for F-Droid. Our new server is here",
    "url": "https://f-droid.org/2025/12/30/a-faster-heart-for-f-droid.html",
    "summary": "F-Droid has upgraded its core server hardware, thanks to community donations, replacing a 12-year-old system that was becoming a daily burden. The new server is already delivering significant performance improvements, enabling faster app builds and more frequent repository updates—increasing from updates every 3-4 days earlier this year to potentially twice daily.\n\nSourcing reliable parts caused delays due to global supply chain issues, but the team prioritized durable, long-term hardware. Notably, the server is hosted under a special arrangement with a trusted long-time contributor, ensuring physical security and transparency aligned with F-Droid's values.\n\nThis upgrade directly benefits the entire ecosystem: developers receive timelier builds, maintenance risks are reduced, and users get app updates more quickly. The project emphasizes that community donations are essential for maintaining its independence, reliability, and commitment to free software.",
    "chinese_title": "为F-Droid加速心跳。我们的新服务器现已上线。",
    "chinese_summary": "F-Droid已升级其核心服务器硬件，这得益于社区捐款，替换了已使用12年、日渐成为日常负担的旧系统。新服务器已带来显著的性能提升，实现了更快的应用构建和更频繁的仓库更新——从今年初期的每3-4天更新一次，提升至可能每日更新两次。\n\n由于全球供应链问题，采购可靠部件曾导致延迟，但团队优先选择了耐用、长效的硬件。值得注意的是，服务器通过与一位长期可信贡献者的特殊安排进行托管，确保了物理安全性和透明度，这与F-Droid的价值观相符。\n\n此次升级直接惠及整个生态系统：开发者能获得更及时的应用构建，维护风险得以降低，用户也能更快获取应用更新。该项目强调，社区捐款对于维护其独立性、可靠性以及对自由软件的承诺至关重要。"
  },
  {
    "id": "46437391",
    "title": "Prof. Software Developers Don't Vibe, They Control: AI Agent Coding Use in 2025",
    "url": "https://arxiv.org/abs/2512.14012",
    "summary": "This paper investigates how professional software developers use AI coding agents in 2025. Through field observations (13 developers) and surveys (99 developers), the research finds that experienced developers do not passively \"vibe\" with AI agents but actively control them.\n\nKey findings include:\n*   **Motivation & Value:** Developers value AI agents primarily as a productivity tool to speed up coding, but not as autonomous creators of entire software systems.\n*   **Control & Strategy:** Developers insist on retaining agency over software design and implementation to ensure fundamental quality attributes (e.g., correctness, maintainability). They employ specific strategies to control agent behavior, leveraging their own expertise to guide and correct the AI's output.\n*   **Task Suitability:** The study suggests there are specific types of tasks for which agents are more suitable, implying developers are selective in their use.\n*   **Overall Sentiment:** Experienced developers feel positive about incorporating agents into their workflow, largely due to their confidence in their own ability to complement the agents' limitations.\n\nThe paper concludes that software development best practices remain crucial for the effective use of AI agents. It points to future opportunities for designing better agent interfaces and creating guidelines for their use, emphasizing a collaborative, human-in-control model rather than full automation.",
    "chinese_title": "软件开发者不凭感觉，他们掌控：2025年AI代理编码应用",
    "chinese_summary": "本文研究了专业软件开发者在2025年如何使用AI编程助手。通过实地观察（13名开发者）和问卷调查（99名开发者），研究发现经验丰富的开发者并非被动地与AI助手\"随性协作\"，而是主动掌控其行为。\n\n主要发现包括：\n*   **动机与价值：** 开发者主要将AI助手视为提升编码效率的生产力工具，而非能够自主创建完整软件系统的创造者。\n*   **控制与策略：** 开发者坚持保留对软件设计和实现的主导权，以确保基础质量属性（如正确性、可维护性）。他们采用特定策略控制助手行为，运用自身专业知识引导和修正AI的输出。\n*   **任务适用性：** 研究表明存在某些特定类型的任务更适合使用AI助手，这意味着开发者对其使用具有选择性。\n*   **整体态度：** 经验丰富的开发者对将AI助手融入工作流程持积极态度，这主要源于他们对自己能够弥补助手局限性的信心。\n\n论文总结指出，有效使用AI助手仍需遵循软件开发的最佳实践。研究为设计更好的助手界面和制定使用指南指出了未来方向，强调应建立人为主导的协作模式，而非追求完全自动化。"
  },
  {
    "id": "46424173",
    "title": "Loss32: Let's Build a Win32/Linux",
    "url": "https://loss32.org/",
    "summary": "The article introduces **loss32**, a concept for a Linux distribution where the desktop environment is composed entirely of Win32 software running via WINE. The goal is to create a free, open-source OS that provides a seamless experience for running Windows (.exe) applications, targeting users who prefer the classic Windows desktop or need broad software compatibility.\n\nIt distinguishes loss32 from ReactOS by building on the stable Linux kernel and WINE, rather than reimplementing the Windows NT kernel. This approach aims for better hardware support and the ability to run Linux software when needed.\n\nThe author argues that Win32, through WINE, acts as a \"stable Linux ABI,\" granting access to decades of software, especially in creative fields and gaming, where Linux alternatives are often limited. A proof-of-concept screenshot shows the environment running on Debian.\n\nDevelopment is in early stages, with a proof-of-concept release targeted for January 2026. The project seeks contributors with expertise in Wayland compositors, WINE, ReactOS userland components, and the Linux desktop stack to help refine the experience.",
    "chinese_title": "Loss32：让我们构建一个Win32/Linux系统",
    "chinese_summary": "这篇文章介绍了**loss32**，这是一个Linux发行版的概念，其桌面环境完全由通过WINE运行的Win32软件构成。目标是创建一个自由、开源的操作系统，为运行Windows（.exe）应用程序提供无缝体验，主要面向那些偏爱经典Windows桌面或需要广泛软件兼容性的用户。\n\nloss32与ReactOS的区别在于，它基于稳定的Linux内核和WINE构建，而非重新实现Windows NT内核。这种方法旨在获得更好的硬件支持，并在需要时能够运行Linux软件。\n\n作者认为，通过WINE，Win32充当了一个“稳定的Linux ABI”，提供了对数十年来积累的软件的访问权限，尤其是在创意领域和游戏领域，这些领域的Linux替代方案往往有限。一张概念验证截图展示了该环境在Debian上的运行情况。\n\n该项目目前处于早期开发阶段，计划在2026年1月发布概念验证版本。项目正在寻求拥有Wayland合成器、WINE、ReactOS用户空间组件以及Linux桌面堆栈专业知识的贡献者，以帮助完善用户体验。"
  },
  {
    "id": "46366010",
    "title": "Reverse Engineering a Mysterious UDP Stream in My Hotel (2016)",
    "url": "https://www.gkbrk.com/hotel-music",
    "summary": "In 2016, a guest at a modern hotel used Wireshark and discovered a mysterious, high-volume UDP multicast stream on port 2046. The packets were a consistent 634 bytes, which was too small for video, prompting further investigation.\n\nBy writing a Python script to capture the data, the author noticed the string \"LAME3.91\" (an MP3 encoder) in the packets. However, saving the raw data as an MP3 file failed. To find the correct data offset, the author wrote another script to save multiple copies of a packet, each skipping an increasing number of bytes from the start. The `file` command revealed that skipping the first 8 bytes resulted in a valid \"MPEG ADTS, layer III\" file.\n\nA final script was created to continuously capture packets, strip the 8-byte header, and concatenate the remaining data into an MP3 file. When played, the audio was revealed to be nothing more than the hotel's elevator music, streamed via multicast to speakers in the corridors. The investigation, while technically successful, ended with an amusingly mundane discovery.",
    "chinese_title": "逆向工程我在酒店中遇到的神秘UDP数据流（2016）",
    "chinese_summary": "2016年，一位现代酒店的客人使用Wireshark时，在2046端口发现了一个神秘的高流量UDP多播流。数据包大小始终为634字节，对于视频来说太小，这促使他进一步调查。\n\n通过编写Python脚本捕获数据，作者在数据包中注意到字符串“LAME3.91”（一种MP3编码器）。然而，将原始数据直接保存为MP3文件失败了。为了找到正确的数据偏移量，作者编写了另一个脚本，保存数据包的多个副本，每个副本从起始位置跳过递增的字节数。使用`file`命令检查发现，跳过前8字节后得到了有效的“MPEG ADTS, layer III”文件。\n\n最终，作者创建了一个脚本持续捕获数据包，剥离8字节头部，并将剩余数据拼接成MP3文件。播放时，音频内容不过是酒店通过多播流向走廊扬声器播放的电梯音乐。尽管技术调查取得了成功，结果却是一个令人莞尔的平凡发现。"
  },
  {
    "id": "46432999",
    "title": "The British empire's resilient subsea telegraph network",
    "url": "https://subseacables.blogspot.com/2025/12/the-british-empires-resilient-subsea.html",
    "summary": "The British Empire's global subsea telegraph network, known as the Red Line, was a highly resilient communications system largely completed by 1902. It enabled rapid global messaging and was designed with redundancy as a core principle.\n\nIts resilience stemmed from two key features: a ring configuration that allowed traffic to be re-routed in the opposite direction if a cable was cut, and the use of multiple cables between major endpoints. This design led the British military to believe an enemy could not sever all links between any critical pair of locations.\n\nThe Committee of Imperial Defense quantified this resilience, calculating that isolating the British Isles would require cutting 57 cables, while severing Canada or South Africa would need 15 and 7 cuts, respectively. Furthermore, the Empire maintained self-sufficiency, manufacturing all cable components and conducting repairs with its unparalleled navy, which safeguarded the network.",
    "chinese_title": "大英帝国坚韧的海底电报网络",
    "chinese_summary": "大英帝国的全球海底电报网络，俗称“红线”，是一个高度坚韧的通信系统，于1902年基本建成。它实现了快速的全球信息传递，并以冗余设计为核心原则。\n\n其韧性源于两大关键特点：一是环形结构，允许在电缆被切断时反向重新路由通信流量；二是在主要端点之间铺设多条电缆。这种设计使英国军方相信，敌人无法切断任何关键地点之间的所有联系。\n\n帝国防务委员会量化了这种韧性，计算出孤立不列颠群岛需要切断57条电缆，而切断加拿大或南非的联系则分别需要15条和7条。此外，帝国保持了自给自足的能力，制造所有电缆组件，并凭借其无与伦比的海军进行维修，从而保障了网络的安全。"
  },
  {
    "id": "46433352",
    "title": "Igniting the GPU: From Kernel Plumbing to 3D Rendering on RISC-V",
    "url": "https://mwilczynski.dev/posts/riscv-gpu-zink/",
    "summary": "This article details the successful enablement of fully mainline, hardware-accelerated 3D graphics on the RISC-V-based T-HEAD TH1520 SoC (used in the Lichee Pi 4A). The core achievement was making the upstream `drm/imagination` PowerVR GPU driver functional, marking a first for RISC-V.\n\nThe primary challenge was not the GPU driver itself, but the complex \"plumbing\" required to power it on. The author had to implement and upstream a chain of platform drivers first: a mailbox for the safety coprocessor, a firmware protocol, a power domain controller, and specific clock/reset drivers. A key innovation was using the new kernel Power Sequencing (`pwrseq`) subsystem to orchestrate the GPU's precise, time-sensitive power-up routine, which was integrated into the GPU driver via a new abstraction layer.\n\nFor display output, collaborative work integrated a separate Verisilicon display controller driver (currently under review). The userspace graphics stack leverages a modern \"Vulkan-only\" approach, using the Mesa PowerVR Vulkan driver with Zink to provide OpenGL ES support.\n\nThe result is a complete, accelerated graphics pipeline. The article includes a reproduction guide and demonstrates a working benchmark (`glmark2`) running via Vulkan and Zink on the Lichee Pi 4A, transforming it into a capable graphics platform. The work highlights the collaborative nature of upstream kernel development across multiple subsystems.",
    "chinese_title": "点燃GPU：从内核管道到RISC-V上的3D渲染",
    "chinese_summary": "本文详细介绍了在基于RISC-V的T-HEAD TH1520 SoC（用于Lichee Pi 4A）上成功实现完全主线化、硬件加速的3D图形渲染。核心突破在于使上游`drm/imagination` PowerVR GPU驱动程序正常运行，这在RISC-V架构中尚属首次。\n\n主要挑战并非GPU驱动本身，而是启动所需的复杂“底层支撑系统”。作者首先实现并向上游提交了一系列平台驱动：安全协处理器的邮箱通信机制、固件协议、电源域控制器以及特定时钟/复位驱动。关键创新在于运用全新的内核电源时序（`pwrseq`）子系统来协调GPU精确且对时序敏感的启动流程，该功能通过新建的抽象层集成至GPU驱动中。\n\n在显示输出方面，通过协作整合了独立的Verisilicon显示控制器驱动（当前正在审核中）。用户态图形栈采用现代“纯Vulkan”方案，通过Mesa PowerVR Vulkan驱动配合Zink实现OpenGL ES支持。\n\n最终成果是构建了完整的加速图形管线。文章附有复现指南，并演示了在Lichee Pi 4A上通过Vulkan与Zink运行的实际基准测试（`glmark2`），使其转型为功能完备的图形平台。这项工作凸显了跨多个子系统的上游内核开发协作特性。"
  },
  {
    "id": "46432311",
    "title": "Non-Zero-Sum Games",
    "url": "https://nonzerosum.games/",
    "summary": "This article introduces **\"Non-Zero-Sum Games,\"** a website and podcast dedicated to exploring cooperative, win-win solutions to global challenges. Hosted by \"Non-Zero-Sum James,\" the platform uses the lens of game theory to examine how cooperation is essential for building a better future.\n\nThe core content is organized into thematic categories, including **Game Theory, Moral Philosophy, Ethical Economics, and AI**. These explore strategic interaction, ethics, economic system redesign, and navigating a future with artificial intelligence. Additional sections cover cooperation in nature, profiles of cooperative leaders (\"Non-Zero Heroes\"), interactive games, and creativity.\n\nThe site positions itself as a community hub, inviting readers to share, debate, and co-create ideas in the comments, emphasizing that progress requires collective effort.",
    "chinese_title": "非零和博弈",
    "chinese_summary": "本文介绍了**\"非零和博弈\"**网站及播客，该平台致力于探索应对全球挑战的合作共赢方案。主持人\"非零和詹姆斯\"以博弈论为视角，剖析合作如何成为构建更美好未来的关键。\n\n核心内容按主题分类，涵盖**博弈论、道德哲学、伦理经济学和人工智能**，探讨战略互动、伦理道德、经济体系重塑以及人工智能时代的未来走向。其他板块包括自然界中的合作、合作型领袖专题（\"非零和英雄\"）、互动游戏及创意实践。\n\n该平台定位为社区枢纽，邀请读者在评论区分享观点、参与辩论、共创思想，强调进步需要集体智慧。"
  },
  {
    "id": "46432916",
    "title": "Approachable Swift Concurrency",
    "url": "https://fuckingapproachableswiftconcurrency.com/en/",
    "summary": "This article explains Swift's concurrency model in an approachable way, focusing on three core concepts: **async/await**, **Tasks**, and **actor isolation**.\n\n**Async/await** allows you to write code that pauses (suspends) while waiting for slow operations (like network calls) and then resumes, making asynchronous logic appear sequential. You can run multiple operations in parallel using `async let`.\n\n**Tasks** are the units of work that execute async functions. They let you start async work from synchronous code, manage it (e.g., cancel it), and organize it using structured concurrency patterns like `TaskGroup`.\n\nThe most crucial shift is from thinking about **threads** to thinking about **isolation domains** to prevent data races. The model defines three main domains:\n1.  **`@MainActor`**: For all UI-related work, ensuring it runs on the main thread.\n2.  **Actors**: Protect their own mutable state, allowing only one piece of code to access it at a time.\n3.  **Nonisolated**: Code that opts out of an actor's protection because it doesn't access shared state.\n\nTo safely share data between these isolated domains, types must conform to the **`Sendable`** protocol, which the compiler enforces. The article promotes using \"Approachable Concurrency\" settings (enabled by default in newer Xcode), which simplifies the model by defaulting most code to `@MainActor` isolation, reducing friction and `Sendable` errors. You only need to explicitly mark CPU-intensive work with `@concurrent` to run it off the main thread.",
    "chinese_title": "易于上手的Swift并发编程",
    "chinese_summary": "本文以通俗易懂的方式阐释了Swift的并发模型，重点围绕三个核心概念：**async/await**、**Tasks**和**actor隔离**。\n\n**Async/await** 让你能编写在等待耗时操作（如网络请求）时暂停（挂起）、随后恢复执行的代码，使异步逻辑呈现为顺序执行。通过 `async let` 可实现多个操作的并行运行。\n\n**Tasks** 是执行异步函数的工作单元。它们允许你从同步代码启动异步任务、进行管理（例如取消），并通过 `TaskGroup` 等结构化并发模式来组织任务。\n\n最重要的思维转变是从关注**线程**转向关注**隔离域**以防止数据竞争。该模型定义了三个主要隔离域：\n1. **`@MainActor`**：处理所有UI相关任务，确保在主线程运行。\n2. **Actors**：保护自身可变状态，同一时间仅允许一段代码访问。\n3. **Nonisolated**：不访问共享状态的代码可脱离actor保护机制。\n\n要在这些隔离域间安全共享数据，类型必须遵循编译器强制实施的 **`Sendable`** 协议。文章推荐使用“易用并发”设置（新版Xcode默认启用），该设置默认将大部分代码隔离至 `@MainActor`，从而降低使用门槛和 `Sendable` 错误。仅需对CPU密集型任务显式标记 `@concurrent` 即可使其在非主线程运行。"
  },
  {
    "id": "46432862",
    "title": "Times New American: A Tale of Two Fonts",
    "url": "https://hsu.cy/2025/12/times-new-american/",
    "summary": "This article examines the U.S. State Department's recent reversal of a 2023 policy, switching its official typeface from 15-point Calibri back to 14-point Times New Roman. Secretary of State Marco Rubio's memo justified the change by claiming serif fonts like Times New Roman convey more professionalism and tradition, while framing the prior Calibri directive as a superficial diversity, equity, inclusion, and accessibility (DEIA) gesture aligned with the Biden administration.\n\nThe author systematically disputes Rubio's design-based arguments. They explain that Times New Roman was designed for newspaper practicality, not solemnity, and its widespread use stems from digital-era inertia, not inherent authority. Furthermore, other U.S. institutions like the Supreme Court and Congress use more traditionally authoritative serifs, such as Century Schoolbook.\n\nThe article also critiques the 2023 choice of Calibri, a \"warm and soft\" sans-serif ill-suited for formal documents, and notes its tenuous connection to genuine accessibility goals, which depend more on document structure than font choice.\n\nUltimately, the piece concludes that both decisions are flawed: the first used a poorly matched typeface for a worthy goal, while the second is a politically motivated return to a bland default. The author argues that Rubio's memo disguises this political gesture with unconvincing design rhetoric, as Times New Roman lacks the gravitas it claims to restore.",
    "chinese_title": "新美国时报：两种字体的故事",
    "chinese_summary": "本文探讨了美国国务院近期推翻2023年政策之举，将官方字体从15磅Calibri改回14磅Times New Roman。国务卿马可·卢比奥在备忘录中辩称，像Times New Roman这类衬线字体更能体现专业性与传统，并将此前采用Calibri字体的决定描述为拜登政府流于表面的多元化、公平、包容与无障碍（DEIA）姿态。\n\n作者系统驳斥了卢比奥基于字体设计的论点，指出Times New Roman最初是为报纸印刷的实用性而设计，并非为了彰显庄重感，其广泛使用源于数字时代的惯性而非内在的权威性。此外，美国最高法院、国会等其他机构实际采用更具传统权威感的衬线字体（如Century Schoolbook）。\n\n文章同时批评了2023年选用Calibri字体的决定——这种“温和柔软”的无衬线体并不适合正式公文，并指出其与真正无障碍目标的关联薄弱，因为文件可访问性更取决于文档结构而非字体选择。\n\n最终，文章认为两项决定均有缺陷：前者为实现崇高目标选用了不匹配的字体，后者则是出于政治动机回归平庸的默认选项。作者指出，卢比奥的备忘录用缺乏说服力的设计修辞掩饰了这一政治姿态，因为Times New Roman并不具备其所宣称的庄重特质。"
  },
  {
    "id": "46436128",
    "title": "Show HN: I remade my website in the Sith Lord Theme and I hope it's fun",
    "url": "https://cookie.engineer/index.html",
    "summary": "This post announces the author's personal website redesign using a \"Sith Lord Theme\" for a fun aesthetic. The core content showcases a list of their recent software projects, each with a name, date, and brief description.\n\nThe featured projects, all from late 2025, include:\n*   **RogueBerry One:** An operating system for the Hackberry Pi using KDE Plasma Mobile.\n*   **Forensics Tools:** A suite of digital forensics utilities.\n*   **Gooey Framework:** A WebAssembly and web components framework.\n*   **ZIMdex:** A self-hosted search tool for offline ZIM files and web content.\n*   **Gooey CLI:** A command-line tool to streamline project creation for the Gooey Framework.\n\nThe summary is that the author has relaunched their site with a Star Wars-inspired dark theme and is highlighting their recent technical work, primarily focused on niche operating systems, web development frameworks, and digital forensics tools.",
    "chinese_title": "展示HN：我以西斯尊主主题重制了我的网站，希望它有趣",
    "chinese_summary": "本贴宣布作者以“西斯尊主主题”重新设计了个人网站，增添趣味美学。核心内容展示了一系列近期软件项目，每个项目均包含名称、日期及简要说明。\n\n重点推介的项目均来自2025年底，包括：\n*   **RogueBerry One：** 基于KDE Plasma Mobile为Hackberry Pi开发的操作系统。\n*   **Forensics Tools：** 一套数字取证工具集。\n*   **Gooey Framework：** 基于WebAssembly与Web组件的开发框架。\n*   **ZIMdex：** 用于离线ZIM文件与网络内容的自主托管搜索工具。\n*   **Gooey CLI：** 为Gooey Framework优化项目创建流程的命令行工具。\n\n总结而言，作者以星球大战暗黑风格主题重新上线网站，重点展示了近期技术成果，主要聚焦于小众操作系统、网页开发框架及数字取证工具领域。"
  },
  {
    "id": "46379765",
    "title": "Postgres extension complements pgvector for performance and scale",
    "url": "https://github.com/timescale/pgvectorscale",
    "summary": "**Summary:** pgvectorscale is a PostgreSQL extension that enhances pgvector with significant performance and efficiency improvements for vector similarity search. It introduces three key innovations: the **StreamingDiskANN index** (inspired by Microsoft's DiskANN) for high-performance search, **Statistical Binary Quantization (SBQ)** for compressed storage, and **label-based filtered vector search** for combining metadata filtering with similarity queries.\n\nThe extension demonstrates major gains in benchmarks, offering **28x lower latency** and **16x higher throughput** compared to Pinecone at 99% recall, with **75% lower cost** when self-hosted. It supports standard pgvector query syntax and adds advanced features like parallel index building and tunable parameters for accuracy/performance trade-offs.\n\nInstallation is available via Docker, source compilation (with some platform limitations), or Timescale Cloud. Key use cases include creating efficient indexes on embedding columns and performing fast filtered searches using integer labels or arbitrary WHERE clauses, making it suitable for scalable AI applications requiring precise and efficient vector retrieval.",
    "chinese_title": "Postgres扩展增强pgvector的性能与扩展能力",
    "chinese_summary": "**摘要：** pgvectorscale 是一款 PostgreSQL 扩展，通过显著提升向量相似性搜索的性能和效率来增强 pgvector。它引入了三项关键创新：**StreamingDiskANN 索引**（受微软 DiskANN 启发）用于高性能搜索，**统计二进制量化（SBQ）** 用于压缩存储，以及**基于标签的过滤向量搜索**，用于将元数据过滤与相似性查询结合。\n\n该扩展在基准测试中展现出显著优势，与 Pinecone 相比，在 99% 召回率下实现了**延迟降低 28 倍**和**吞吐量提高 16 倍**，自托管时**成本降低 75%**。它支持标准的 pgvector 查询语法，并增加了并行索引构建和可调参数（用于精度/性能权衡）等高级功能。\n\n可通过 Docker、源代码编译（存在部分平台限制）或 Timescale Cloud 进行安装。主要用例包括在嵌入列上创建高效索引，以及使用整数标签或任意 WHERE 子句执行快速过滤搜索，使其适用于需要精确高效向量检索的可扩展 AI 应用。"
  },
  {
    "id": "46433661",
    "title": "Hive (YC S14) Is Hiring a Staff Software Engineer (Data Systems)",
    "url": "https://jobs.ashbyhq.com/hive.co/cb0dc490-0e32-4734-8d91-8b56a31ed497",
    "summary": "**Job Posting Summary: Hive (YC S14) is hiring a Staff Software Engineer for its Data Systems team.**\n\nThe role is a senior-level position focused on designing, building, and scaling the core data infrastructure that powers Hive's AI training and product platforms. The engineer will tackle challenges related to massive-scale data processing, storage, and real-time systems.\n\n**Key responsibilities include:**\n*   Architecting and developing high-performance data pipelines and storage systems.\n*   Optimizing data infrastructure for cost, latency, and reliability at petabyte scale.\n*   Leading technical projects and mentoring other engineers.\n*   Collaborating with AI research and product teams to understand data requirements.\n\n**The ideal candidate should have:**\n*   Extensive experience (8+ years) in software engineering with a focus on distributed data systems.\n*   Deep expertise in technologies like Spark, Flink, Kafka, and cloud data warehouses (e.g., Snowflake, BigQuery).\n*   Proven ability to design and operate large-scale, reliable data infrastructure.\n*   Strong leadership and communication skills.\n\nThis is a remote position within the United States. Hive, a Y Combinator-backed company, develops AI models for content understanding. The role offers the opportunity to work on foundational infrastructure critical to the company's AI products.",
    "chinese_title": "Hive（YC S14）正在招聘数据系统高级软件工程师",
    "chinese_summary": "**招聘职位摘要：Hive（YC S14）正在为其数据系统团队招聘一名高级软件工程师。**\n\n该职位为高级岗位，专注于设计、构建和扩展支撑Hive人工智能训练及产品平台的核心数据基础设施。工程师将应对海量数据处理、存储和实时系统相关的挑战。\n\n**主要职责包括：**\n*   架构和开发高性能数据管道与存储系统。\n*   在PB级规模上优化数据基础设施的成本、延迟和可靠性。\n*   领导技术项目并指导其他工程师。\n*   与人工智能研究和产品团队协作，理解数据需求。\n\n**理想候选人应具备：**\n*   在软件工程领域拥有丰富经验（8年以上），专注于分布式数据系统。\n*   对Spark、Flink、Kafka及云数据仓库（如Snowflake、BigQuery）等技术有深入专长。\n*   具备设计和运营大规模、可靠数据基础设施的已验证能力。\n*   出色的领导力和沟通技巧。\n\n该职位为美国境内的远程岗位。Hive是一家获得Y Combinator支持的初创公司，致力于开发用于内容理解的人工智能模型。此职位将提供参与构建对公司人工智能产品至关重要的基础架构的机会。"
  },
  {
    "id": "46431560",
    "title": "Netflix Open Content",
    "url": "https://opencontent.netflix.com/",
    "summary": "Netflix Open Content is a collection of high-quality test videos and assets released by Netflix under a Creative Commons license. The purpose is to provide open-source reference material for the entertainment, technology, and academic communities to experiment with and test advanced video and audio technologies—such as 4K, HDR, high frame rates, and Dolby Atmos—without using proprietary content.\n\nThe library includes several titles, each showcasing different technical challenges:\n*   **Sol Levante (2020):** The first 4K HDR Dolby Atmos anime short, created from conception for HDR.\n*   **Nocturne (2018):** A live-action piece shot at 120fps to challenge video codecs.\n*   **Sparks (2017):** A 4K high-frame-rate video mastered at 4000 nits.\n*   **Meridian (2016):** Netflix's first narrative HDR test title with Dolby Vision and Atmos.\n*   **Cosmos Laundromat (2016):** An animated short regraded in Dolby Vision HDR.\n*   **Chimera (2014) & El Fuente (2013):** Early 4K test content representing complex live-action scenes.\n\nAvailable assets include video files, image sequences, audio mixes, and project files. All content is hosted in a public S3 bucket and can be downloaded via a web browser or command-line tools like AWS CLI for larger files.",
    "chinese_title": "Netflix 开放内容",
    "chinese_summary": "Netflix开放内容是一套由Netflix在知识共享许可协议下发布的高质量测试视频与素材合集。其目的在于为娱乐、科技及学术领域提供开源参考材料，便于在不使用专有内容的前提下，对4K、HDR、高帧率、杜比全景声等先进音视频技术进行实验与测试。\n\n该资源库包含多部作品，每部均呈现不同的技术挑战：\n*   **《索尔·莱万特》（2020年）：** 首部从构思阶段即为HDR打造的4K HDR杜比全景声动画短片。\n*   **《夜曲》（2018年）：** 以120帧拍摄的实景短片，旨在挑战视频编解码器性能。\n*   **《火花》（2017年）：** 以4000尼特亮度进行母带制作的4K高帧率视频。\n*   **《子午线》（2016年）：** Netflix首个采用杜比视界与杜比全景声的叙事性HDR测试片。\n*   **《宇宙洗衣店》（2016年）：** 经杜比视界HDR重新调色的动画短片。\n*   **《奇美拉》（2014年）与《源泉》（2013年）：** 代表复杂实景场景的早期4K测试内容。\n\n可用素材包括视频文件、图像序列、音频混音及项目文件。所有内容均托管于公共S3存储桶中，可通过网页浏览器或AWS CLI等命令行工具下载（大文件推荐使用命令行工具）。"
  },
  {
    "id": "46431028",
    "title": "Go away Python",
    "url": "https://lorentz.app/blog-item.html?id=go-shebang",
    "summary": "**Summary of \"Go away Python\"**\n\nThe article argues for using Go (Golang) instead of Python for command-line tools and scripts, particularly those invoked via a shebang (`#!/usr/bin/env go run`). The author acknowledges Python's dominance in scripting but highlights several advantages of Go:\n\n*   **Single Binary Deployment:** Go compiles into a standalone executable with no external dependencies, simplifying distribution and installation. Python scripts require a compatible interpreter and often need virtual environments and dependency management (pip, requirements.txt).\n*   **Performance:** Go offers significantly faster execution speed and lower memory usage compared to Python, which is beneficial for performance-critical tools.\n*   **Robustness and Tooling:** Go's static typing and compiler catch errors early. Its built-in testing, benchmarking, and profiling tools, along with excellent IDE support, contribute to more reliable software.\n*   **Concurrency:** Go has first-class support for concurrency (goroutines, channels), making it easier to write efficient, parallel scripts.\n\nThe author concedes that Python remains superior for data science, machine learning, and rapid prototyping due to its vast ecosystem of specialized libraries. However, for building reliable, distributable, and efficient system tools and automation scripts, Go is presented as a compelling and often better alternative. The core trade-off is between Python's expressive brevity and rich libraries versus Go's performance, simplicity of deployment, and built-in robustness.",
    "chinese_title": "走开，Python",
    "chinese_summary": "**《告别Python》概要**\n\n本文主张在命令行工具和脚本（特别是通过shebang（`#!/usr/bin/env go run`）调用的场景）中使用Go（Golang）替代Python。作者承认Python在脚本领域的主导地位，但强调了Go的几大优势：\n\n*   **单一二进制部署：** Go可编译成无需外部依赖的独立可执行文件，简化了分发和安装。Python脚本则需要兼容的解释器，且通常需要虚拟环境和依赖管理（pip、requirements.txt）。\n*   **性能：** 相比Python，Go的执行速度显著更快，内存占用更低，这对性能敏感的工具非常有益。\n*   **健壮性与工具链：** Go的静态类型和编译器能及早捕获错误。其内置的测试、基准测试和性能分析工具，以及出色的IDE支持，有助于构建更可靠的软件。\n*   **并发支持：** Go对并发（goroutines、channels）提供原生支持，使得编写高效的并行脚本更为容易。\n\n作者承认，由于Python拥有庞大的专业库生态系统，在数据科学、机器学习和快速原型开发方面仍具优势。然而，对于构建可靠、可分发且高效的系统工具和自动化脚本，Go被呈现为一个引人注目且往往更优的选择。其核心权衡在于：是选择Python的表达简洁性与丰富库生态，还是选择Go的性能、部署简便性以及内置的健壮性。"
  },
  {
    "id": "46418517",
    "title": "HTTP Strict Transport Security (HSTS)",
    "url": "https://hstspreload.org/",
    "summary": "HTTP Strict Transport Security (HSTS) is a security mechanism that instructs web browsers to only connect to a website using HTTPS, not HTTP. It is implemented by a website sending a `Strict-Transport-Security` header in its HTTPS responses.\n\nThe primary benefit of HSTS is protection against on-path network attacks. It automatically upgrades all HTTP links to HTTPS, preventing attackers from seeing browsing history in URLs. It also blocks protocol downgrade attacks, where an attacker could intercept and prevent a redirect from HTTP to HTTPS, and helps prevent cookie hijacking on initial insecure requests.\n\nTo deploy HSTS safely, a site must first ensure all its subdomains (including internal ones) function correctly over HTTPS. Deployment should then be gradual, starting with a short policy duration (e.g., 5 minutes) and incrementally increasing it (to 1 week, then 1 month) while monitoring for issues. The `includeSubDomains` directive should be used to protect all subdomains. It is recommended to test stages with a beta group before a full rollout.",
    "chinese_title": "HTTP严格传输安全（HSTS）",
    "chinese_summary": "HTTP严格传输安全（HSTS）是一种安全机制，它指示网页浏览器仅通过HTTPS而非HTTP连接到网站。该机制通过在网站的HTTPS响应中发送`Strict-Transport-Security`标头来实现。\n\nHSTS的主要优势在于防范路径上的网络攻击。它会自动将所有HTTP链接升级为HTTPS，防止攻击者查看URL中的浏览历史记录。它还能阻止协议降级攻击（即攻击者可能拦截并阻止从HTTP到HTTPS的重定向），并有助于防止初始不安全请求中的Cookie劫持。\n\n要安全部署HSTS，网站必须首先确保其所有子域名（包括内部子域名）在HTTPS下正常运行。部署应循序渐进：从较短的策略持续时间（例如5分钟）开始，逐步延长（至1周、1个月），并在此过程中监控问题。应使用`includeSubDomains`指令来保护所有子域名。建议在全面推广前，先通过测试组进行分阶段验证。"
  },
  {
    "id": "46367377",
    "title": "Confessions to a Data Lake",
    "url": "https://confer.to/blog/2025/12/confessions-to-a-data-lake/",
    "summary": "In this article, the founder of Signal introduces **Confer**, a new end-to-end encrypted AI chat service designed to make conversations with AI assistants truly private.\n\nThe core argument is that the conversational interface of modern AI models (LLMs) psychologically invites intimate, unfiltered sharing—akin to a private journal or therapy session. However, this \"confessional\" medium is fundamentally mismatched with its underlying reality: user inputs are typically stored in plaintext on corporate servers, accessible to employees, partners, advertisers, hackers, and governments.\n\nThe author draws a parallel to the evolution of email, where users initially treated it as private correspondence before learning it was monitored and stored. The danger with AI is even greater because users reveal not just information, but their **thinking process**—uncertainties, knowledge gaps, and reasoning patterns. This creates a powerful profile for future targeted advertising and manipulation.\n\n**Confer** is presented as the solution, applying the Signal principle of end-to-end encryption to AI chats. Its goal is to ensure the interface (a private conversation) honestly reflects the technology's function, preventing user data from being used for training, advertising, or subpoenas. The project is in early testing, positioned as a tool for free exploration without the risk of one's own thoughts being used against them.",
    "chinese_title": "向数据湖的告白",
    "chinese_summary": "在这篇文章中，Signal创始人介绍了**Confer**——一项全新的端到端加密AI聊天服务，旨在让用户与AI助手的对话实现真正的私密性。\n\n核心论点是：现代AI模型（大语言模型）的对话界面在心理层面会引发亲密无保留的分享，如同私人日记或心理治疗。然而这种“告解式”媒介与其底层现实存在根本性错位：用户输入的内容通常以明文形式存储在企业服务器上，员工、合作伙伴、广告商、黑客及政府皆可访问。\n\n作者类比电子邮件的演变历程——用户最初将其视为私人通信，后来才意识到邮件受到监控和存储。AI的危险性更甚，因为用户暴露的不仅是信息，更是其**思维过程**：不确定的困惑、知识缺口与推理模式。这将形成强大的用户画像，为未来精准广告投放与操控提供可能。\n\n**Confer**作为解决方案应运而生，它将Signal的端到端加密原则应用于AI对话。其目标是确保界面（私密对话）真实反映技术功能，防止用户数据被用于模型训练、广告推送或司法传唤。该项目尚处早期测试阶段，定位为让用户自由探索思想而无惧其思维被反制的工具。"
  },
  {
    "id": "46434580",
    "title": "Show HN: Tidy Baby is a SET game but with words",
    "url": "https://tidy.baby",
    "summary": "**Tidy Baby** is a word-based adaptation of the card game **SET**. The core gameplay remains the same: players must find sets of three items where each of the game's \"dimensions\" is either all the same or all different across the three items.\n\nIn this version, the dimensions are:\n1. **Word Length:** 3, 4, or 5 letters.\n2. **Part of Speech:** Noun, verb, or adjective.\n3. **Text Style:** Bold, underline, or italic.\n\nThe game interface includes a board of words, a score, a timer, and a history of guessed sets. The objective is to clear the board by finding all possible sets. After completion, players can view their final score and time, share results, or play again. The game is presented as a web-based, single-player challenge.",
    "chinese_title": "展示HN：Tidy Baby是一款类似SET的游戏，但使用文字进行。",
    "chinese_summary": "**《整洁宝贝》** 是一款基于卡牌游戏 **《SET》** 改编的文字游戏。核心玩法保持不变：玩家需要找出三个词语组成的集合，其中每个游戏“维度”在三个词语间要么完全相同，要么完全不同。\n\n此版本的维度包括：\n1. **词长：** 3、4 或 5 个字母。\n2. **词性：** 名词、动词或形容词。\n3. **文本样式：** 粗体、下划线或斜体。\n\n游戏界面包含词语面板、分数、计时器和已猜集合的历史记录。目标是通过找出所有可能的集合来清空面板。完成后，玩家可查看最终得分与用时，分享结果或重新开始。游戏为网页版单人挑战模式。"
  },
  {
    "id": "46427586",
    "title": "Stranger Things creator says turn off “garbage” settings",
    "url": "https://screenrant.com/stranger-things-creator-turn-off-settings-premiere/",
    "summary": "In a social media post, *Stranger Things* co-creator Ross Duffer advised fans on how to properly set up their TVs before watching the show's final season. He urged viewers to manually turn off several common picture-enhancing settings, which he called \"garbage,\" including dynamic contrast, super resolution, and edge enhancer. He specifically identified motion-smoothing features (like truemotion) as the biggest \"offenders\" for creating an unnatural \"soap opera effect.\"\n\nDuffer recommended using advanced presets like \"Dolby Vision Movie Dark\" but stressed that fans should still manually ensure the problematic settings are disabled. He strongly warned against using \"vivid\" mode, stating it activates all the worst features and destroys the filmmakers' intended color and visual style.\n\nHis guidance highlights the ongoing conflict between TV manufacturers' default enhancements and the creative vision of filmmakers. *Stranger Things* Season 5, Volume 1 is now streaming on Netflix, with subsequent volumes scheduled for release on December 25 and 31, 2025.",
    "chinese_title": "《怪奇物语》创作者建议关闭“垃圾”设置",
    "chinese_summary": "在社交媒体上，《怪奇物语》联合制作人罗斯·杜弗就如何正确设置电视以观看最终季向粉丝提出建议。他呼吁观众手动关闭几种常见的画质增强设置，并称这些功能为\"垃圾\"，包括动态对比度、超分辨率和边缘增强器。他特别指出运动平滑功能（如truemotion）是造成不自然\"肥皂剧效果\"的最大\"元凶\"。\n\n杜弗推荐使用\"杜比视界电影暗场\"等高级预设模式，但强调粉丝仍需手动确保关闭问题设置。他强烈警告不要使用\"鲜艳\"模式，称该模式会激活所有最差的功能，破坏电影制作人设计的色彩与视觉风格。\n\n他的指导凸显了电视制造商默认增强功能与电影制作人创作理念之间的持续冲突。《怪奇物语》第五季第一部分已在Netflix上线，后续部分定于2025年12月25日和31日陆续发布。"
  },
  {
    "id": "46422757",
    "title": "Five Years of Tinygrad",
    "url": "https://geohot.github.io//blog/jekyll/update/2025/12/29/five-years-of-tinygrad.html",
    "summary": "**Summary of \"Five Years of Tinygrad\"**\n\nTinygrad, a minimal deep learning framework, began in 2020. After nearly three years of funding, the six-person team has built a codebase of ~19,000 lines. The founder argues that a fully sovereign software stack is the critical prerequisite for competing with NVIDIA in AI hardware, not the chip design itself—a point illustrated by the limited adoption of chips from AMD, Amazon, Tesla, and Groq.\n\nThe project is now removing its LLVM dependency to run on AMD GPUs with zero external dependencies (besides Python). It claims to outperform PyTorch on many workloads and aims to cap its final implementation at about 20,000 lines.\n\nThe article criticizes conventional software development, asserting that 98% of code consists of workarounds for other abstractions, leading to bloated systems. Tinygrad follows a \"deconstruction\" philosophy, eliminating unnecessary requirements and focusing solely on core goals. This results in codebases that are orders of magnitude smaller than typical alternatives (e.g., a hypothetical LLM server).\n\nThe \"tiny corp\" operates this philosophy externally: it is a largely public, deconstructed company funded by a computer sales division (~$2M revenue) and a public contract with AMD. Hiring is based on open-source contributions, work is self-directed, and the mission is to \"commoditize the petaflop\" by making high-performance AI training accessible.",
    "chinese_title": "Tinygrad 五年历程",
    "chinese_summary": "**《Tinygrad五年历程总结》**\n\nTinygrad是一个极简深度学习框架，始于2020年。经过近三年的资金支持，这个六人团队已构建了约1.9万行代码库。创始人认为，与英伟达在AI硬件领域竞争的关键前提是完全自主的软件栈，而非芯片设计本身——这一点可从AMD、亚马逊、特斯拉和Groq的芯片采用率有限中得到印证。\n\n该项目现正移除对LLVM的依赖，以实现在AMD GPU上运行且零外部依赖（除Python外）。它宣称在许多工作负载上性能优于PyTorch，并计划将最终实现代码量控制在约2万行以内。\n\n文章批判了传统软件开发模式，指出98%的代码是为其他抽象层打补丁，导致系统臃肿。Tinygrad遵循“解构”哲学，剔除非必要需求，仅聚焦核心目标。这使得其代码库规模比典型方案（如假设的LLM服务器）小几个数量级。\n\n“tiny corp”将此理念外化于运营：它是一家高度公开、结构解构的公司，资金来源于计算机销售部门（约200万美元营收）以及与AMD的公开合约。招聘基于开源贡献，工作自主导向，使命是通过普及高性能AI训练来“实现千万亿次计算的商品化”。"
  },
  {
    "id": "46384975",
    "title": "Show HN: One clean, developer-focused page for every Unicode symbol",
    "url": "https://fontgenerator.design/symbols",
    "summary": "This article introduces a web tool that provides a clean, developer-focused reference page for every Unicode symbol. The tool organizes over 2,931 symbols into curated sets for easy navigation, including categories like Math, Arrows, Box Drawing, Tech/UI, and Currency.\n\nIts key feature is utility: users can tap any symbol to copy it instantly for pasting into code or documents. The page offers quick links to emoji and fonts, but its core value is the structured, searchable database of technical and special characters often needed in programming and documentation.\n\nThe summary lists the available categories (e.g., Operators, Geometry, Control Pictures, Legacy Computing) with their symbol counts, giving a clear overview of the resource's scope. The design emphasizes speed and efficiency, positioning the tool as a practical alternative to cluttered or less specialized character maps.",
    "chinese_title": "Show HN：为每个Unicode符号提供简洁、面向开发者的专属页面",
    "chinese_summary": "本文介绍了一款网络工具，它为每个Unicode符号提供了一个简洁、面向开发者的参考页面。该工具将超过2,931个符号整理成精选集合，便于导航，涵盖数学、箭头、制表符、技术/用户界面和货币等类别。\n\n其核心功能是实用性：用户点击任意符号即可立即复制，以便粘贴到代码或文档中。页面提供表情符号和字体的快速链接，但其核心价值在于为编程和文档中常用的技术及特殊字符提供了结构化、可搜索的数据库。\n\n摘要列出了可用类别（如运算符、几何图形、控制图像、传统计算符号）及其符号数量，清晰展示了该资源的覆盖范围。设计强调速度和效率，使该工具成为杂乱或非专用字符映射工具的实用替代方案。"
  },
  {
    "id": "46433915",
    "title": "What Happened to Abit Motherboards",
    "url": "https://dfarq.homeip.net/what-happened-to-abit-motherboards/",
    "summary": "Abit, a once-legendary motherboard manufacturer popular with PC enthusiasts in the 1990s and early 2000s, ceased operations in 2008. Its demise resulted from several key factors.\n\nThe company initially gained fame for innovative, overclocker-friendly boards like the jumperless IT5H and the dual-CPU BP6, which allowed affordable high-performance builds. However, Abit's reputation declined due to its use of lower-quality capacitors, making its boards less durable and vulnerable to the widespread \"capacitor plague.\" This issue was compounded by outsourcing production to a cost-cutting manufacturer.\n\nFurther blows included the 2003 departure of Oscar Wu, a key engineer behind Abit's signature designs, and a major accounting scandal in 2004 that led to its stock being delisted. After being sold in 2006, the company rebranded as Universal Abit but failed to recover, closing permanently at the end of 2008.\n\nToday, Abit motherboards are valued by collectors, though they often require capacitor replacements to function reliably. The company is remembered for its groundbreaking designs that empowered PC enthusiasts, despite its eventual downfall due to quality control and financial mismanagement.",
    "chinese_title": "Abit主板怎么了",
    "chinese_summary": "升技，这家在1990年代和21世纪初深受PC爱好者喜爱的传奇主板制造商，于2008年停止运营。其衰落源于几个关键因素。\n\n公司最初因创新的、适合超频的主板而闻名，例如无需跳线的IT5H和双CPU的BP6，这些产品让用户能够以实惠的价格打造高性能电脑。然而，升技因使用低质量电容器导致声誉下滑，使其主板耐用性降低，易受普遍的“电容灾难”影响。这一问题因将生产外包给一家削减成本的制造商而进一步加剧。\n\n更多打击包括2003年升技标志性设计的关键工程师吴启华（Oscar Wu）离职，以及2004年一起重大会计丑闻导致其股票退市。2006年被出售后，公司更名为环隆升技，但未能恢复元气，最终于2008年底永久关闭。\n\n如今，升技主板受到收藏家的珍视，尽管它们通常需要更换电容器才能可靠运行。尽管公司最终因质量控制和财务管理不善而衰落，但它仍因其突破性设计而被铭记，这些设计曾极大地推动了PC爱好者的热情。"
  },
  {
    "id": "46423290",
    "title": "Tesla’s 4680 battery supply chain collapses as partner writes down deal by 99%",
    "url": "https://electrek.co/2025/12/29/tesla-4680-battery-supply-chain-collapses-partner-writes-down-dea/",
    "summary": "South Korean battery material supplier L&F Co. has written down the value of its $2.9 billion supply contract with Tesla by over 99% to just $7,386, signaling a severe collapse in demand for Tesla's 4680 battery cells.\n\nThe article states this is strong evidence that Tesla's 4680 battery program is in serious trouble. These cells, once touted as key to halving battery costs, are currently used only in the Cybertruck, which is reportedly struggling with low demand and high inventory. With Cybertruck sales far below production capacity, Tesla's need for 4680 cells has plummeted.\n\nThe author argues this effectively cancels the supply contract and suggests Tesla may be winding down 4680 production rather than ramping it up. The piece contrasts the current situation with the ambitious goals announced at Tesla's 2020 Battery Day—such as a $25,000 car and a major cost reduction—none of which have materialized. It concludes by casting doubt on the future of Tesla's planned 'Cybercab', which is also intended to use the 4680 cells.",
    "chinese_title": "特斯拉4680电池供应链崩溃，合作伙伴将交易价值减记99%",
    "chinese_summary": "韩国电池材料供应商L&F公司将其与特斯拉签订的29亿美元供货合同价值减记超99%，仅剩7386美元，这标志着特斯拉4680电池芯需求出现严重萎缩。\n\n文章指出，这是特斯拉4680电池项目陷入严重困境的有力证据。这些曾被吹捧为实现电池成本减半关键的电池芯，目前仅用于赛博卡车，而据报道该车型正面临需求低迷和高库存的困境。由于赛博卡车销量远低于产能，特斯拉对4680电池芯的需求已急剧下降。\n\n作者认为这实质上宣告了供货合同的失效，并暗示特斯拉可能正在逐步缩减而非扩大4680电池的生产。文章将当前状况与特斯拉在2020年电池日宣布的宏伟目标——如推出2.5万美元车型及实现大幅降本——进行对比，指出这些目标均未实现。最后，文章对同样计划采用4680电池的特斯拉\"赛博出租车\"的未来前景提出了质疑。"
  },
  {
    "id": "46436949",
    "title": "Foreign tech workers are avoiding travel to the US",
    "url": "https://www.computerworld.com/article/4110681/foreign-tech-workers-are-avoiding-travel-to-the-us.html",
    "summary": "This article details how foreign technology professionals are increasingly avoiding travel to the United States due to restrictive immigration policies and a hostile political climate under the Trump administration. Key reasons include fears of being denied entry at the border despite having proper visas, high visa denial rates for events like CES, and the deterrent effect of new policies like a proposed $100,000 fee per H-1B application.\n\nThe consequences are significant: U.S.-based tech and scientific conferences are seeing declining international attendance, leading some organizers to move events abroad. Furthermore, foreign workers are reconsidering long-term opportunities in the U.S., with many STEM professionals already in the country open to relocating. This talent drain is causing project delays and disrupting companies.\n\nWhile the U.S. raises barriers, competing tech hubs in Canada, Europe, and Asia are actively recruiting this global talent with fast-track visas and welcoming policies. The article concludes that by shutting out international experts, the U.S. risks declining as a tech leader despite other policy changes, harming both the American tech industry and global innovation.",
    "chinese_title": "外国科技工作者正避免前往美国。",
    "chinese_summary": "本文详述了在特朗普政府限制性移民政策和敌意政治氛围下，外国技术人才日益避免前往美国的情况。主要原因包括：尽管持有合法签证仍担心在边境被拒绝入境、CES等大型活动的签证拒签率居高不下，以及H-1B签证申请拟征收10万美元费用等新政策的威慑作用。\n\n其影响十分显著：美国本土科技与学术会议的国际参会人数持续下降，导致部分主办方将活动迁至海外。此外，外国工作者正在重新评估在美国的长期发展机会，许多已在美国的STEM领域专业人才正考虑迁居他国。这种人才流失已导致项目延误并扰乱企业运营。\n\n当美国筑起壁垒之际，加拿大、欧洲和亚洲的竞争性科技中心正通过快速签证通道和友好政策积极吸纳全球人才。文章指出，若继续将国际专家拒之门外，即便有其他政策调整，美国仍可能面临科技领导地位衰退的风险，这不仅损害美国科技产业，也将影响全球创新进程。"
  },
  {
    "id": "46402132",
    "title": "Concurrent Hash Table Designs",
    "url": "https://bluuewhale.github.io/posts/concurrent-hashmap-designs/",
    "summary": "This article explores two primary strategies for designing thread-safe hash maps, focusing on the trade-offs between simplicity and concurrency.\n\nThe first approach is a **global lock**, where a single mutex wraps all operations, ensuring correctness through mutual exclusion and memory visibility. While simple and robust, this method serializes all access, eliminating parallelism and causing contention even for read-only operations. Under heavy load, Java's `synchronized` can escalate from a cheap \"thin lock\" (using CAS on the object header) to an expensive \"inflated lock\" involving OS-level blocking and context switches, severely impacting throughput and latency.\n\nThe second strategy is **lock striping/sharding**, which distributes contention across multiple locks. In lock striping, a fixed number of locks are used, with keys mapped to specific stripes via a hash. Sharding (exemplified by Rust's DashMap) goes further by partitioning the data into independent sub-maps, each with its own lock. This allows concurrent operations on different stripes/shard, significantly improving scalability. However, unrelated keys may still collide on the same stripe, limiting parallelism, and the design adds complexity in managing multiple locks and ensuring consistent resizing.\n\nThe core trade-off is between the simplicity and safety of a global lock versus the improved concurrency—but increased complexity—of fine-grained locking schemes.",
    "chinese_title": "并发哈希表设计",
    "chinese_summary": "本文探讨了设计线程安全哈希映射的两种主要策略，重点关注简单性与并发性之间的权衡。\n\n第一种方法是**全局锁**，即使用单个互斥锁包装所有操作，通过互斥和内存可见性确保正确性。这种方法虽然简单可靠，但会序列化所有访问，消除并行性，甚至对只读操作也会引发争用。在高负载下，Java的`synchronized`可能从廉价的“瘦锁”（在对象头使用CAS）升级为昂贵的“膨胀锁”，涉及操作系统级别的阻塞和上下文切换，严重影响吞吐量和延迟。\n\n第二种策略是**锁分段/分片**，它将争用分散到多个锁上。锁分段使用固定数量的锁，通过哈希将键映射到特定分段。分片（以Rust的DashMap为例）更进一步，将数据划分为独立的子映射，每个子映射拥有自己的锁。这允许在不同分段/分片上并发操作，显著提升可扩展性。然而，不相关的键仍可能在同一分段上冲突，限制并行性，且设计增加了管理多个锁和确保一致调整大小的复杂性。\n\n核心权衡在于全局锁的简单安全性与细粒度锁方案提升的并发性（但增加了复杂性）之间。"
  }
]