[
  {
    "id": "46657122",
    "title": "ASCII characters are not pixels: a deep dive into ASCII rendering",
    "url": "https://alexharri.com/blog/ascii-rendering",
    "summary": "This article explains how to build a high-quality ASCII art renderer that prioritizes sharp edges, unlike traditional methods that treat characters like blurry pixels.\n\nThe author begins by critiquing common image-to-ASCII techniques, which use nearest-neighbor or supersampling to map image lightness to character density. This results in blurry, jagged edges because it ignores the unique **shape** of each ASCII character.\n\nThe core innovation is a \"shape-based\" rendering method. This involves pre-calculating a **shape vector** for each character, quantifying how much it visually occupies specific regions (like upper vs. lower halves) of its grid cell using sampling circles. For each cell of the target image, a corresponding **sampling vector** is calculated from the image data.\n\nThe renderer then performs a nearest-neighbor search to find the ASCII character whose pre-computed shape vector most closely matches the sampling vector for each cell. This allows the characters' inherent shapes to align with the image contours, dramatically improving edge sharpness and effective resolution.\n\nThe article details the process from basic downsampling pitfalls to implementing the 2D vector-based lookup system, concluding that this shape-aware approach produces visually superior and crisper ASCII art compared to standard pixel-based methods.",
    "chinese_title": "ASCII字符并非像素：深入解析ASCII渲染技术",
    "chinese_summary": "本文阐述了如何构建一个注重锐利边缘的高质量ASCII艺术渲染器，与传统将字符视为模糊像素的方法不同。\n\n作者首先批评了常见的图像转ASCII技术，这些技术使用最近邻或超采样将图像亮度映射到字符密度。由于忽略了每个ASCII字符独特的**形状**，导致边缘模糊且锯齿明显。\n\n核心创新在于一种“基于形状”的渲染方法。该方法通过采样圆预先计算每个字符的**形状向量**，量化其在网格单元特定区域（如上半部分与下半部分）的视觉占比。针对目标图像的每个单元，从图像数据中计算对应的**采样向量**。\n\n渲染器随后执行最近邻搜索，为每个单元寻找预计算形状向量与采样向量最匹配的ASCII字符。这使得字符的固有形状能与图像轮廓对齐，显著提升边缘锐度与有效分辨率。\n\n文章详细阐述了从基础下采样缺陷到实现基于二维向量的查找系统的全过程，并总结指出：相较于标准的基于像素的方法，这种具备形状感知能力的技术能生成视觉效果更优、更清晰的ASCII艺术。"
  },
  {
    "id": "46588972",
    "title": "We put Claude Code in Rollercoaster Tycoon",
    "url": "https://labs.ramp.com/rct",
    "summary": "This article details a project where the AI model Claude Code was integrated into the 1999 game *Rollercoaster Tycoon* to autonomously manage a theme park.\n\nThe core achievement was connecting Claude Code to the game's memory, allowing it to read real-time data like guest counts, finances, and ride statuses. The AI was given a clear goal: maximize park value and guest happiness. It then issued commands by writing to the game's memory to perform actions such as building and pricing rides, hiring staff, and placing amenities.\n\nThe experiment revealed both the AI's strategic capabilities and its limitations. Claude successfully identified profitable strategies, like constructing popular rollercoasters and adjusting prices dynamically. However, it also exhibited \"hallucinations,\" misinterpreting game data and making irrational decisions, such as building paths to inaccessible locations or reacting to non-existent problems.\n\nThe project serves as a novel demonstration of applying a modern LLM to a complex, legacy game environment. It highlights the potential for AI to learn and execute long-term management strategies while also underscoring the current challenges of reliability and accurate real-world interaction.",
    "chinese_title": "我们把Claude Code放进了《过山车大亨》里。",
    "chinese_summary": "本文详述了一个将AI模型Claude Code集成至1999年游戏《过山车大亨》中、使其自主管理主题公园的项目。\n\n项目的核心突破在于将Claude Code与游戏内存相连，使其能读取实时数据，如游客数量、财务状况及游乐设施状态。AI被赋予明确目标：最大化公园价值与游客满意度。随后它通过向游戏内存写入指令来执行操作，包括建造并定价游乐设施、雇佣员工以及布置便利设施。\n\n实验既展现了AI的战略能力，也暴露了其局限性。Claude成功识别出盈利策略，例如建造热门过山车和动态调整价格。但它也出现了“幻觉”现象，曲解游戏数据并做出非理性决策，比如修建通往无法抵达区域的路径，或对不存在的问题作出反应。\n\n该项目作为将现代大语言模型应用于复杂怀旧游戏环境的新颖示范，既彰显了AI学习并执行长期管理策略的潜力，也凸显了当前在可靠性及与现实世界精准交互方面面临的挑战。"
  },
  {
    "id": "46659550",
    "title": "An Elizabethan mansion's secrets for staying warm",
    "url": "https://www.bbc.com/future/article/20260116-an-elizabethan-mansions-secrets-for-staying-warm",
    "summary": "This article explores how Hardwick Hall, an Elizabethan mansion built in the 1590s, was ingeniously designed to stay warm during the Little Ice Age, offering lessons for modern energy-efficient architecture.\n\nThe hall's design strategically maximized solar heat. It was oriented north-south to capture maximum sunlight, with living spaces positioned to follow the sun’s daily path. Large windows were placed on the sun-facing sides, while north-facing walls featured fake windows to minimize heat loss. Thick interior walls provided thermal mass, absorbing heat from fireplaces (which were centrally located) and releasing it slowly. Additional warmth came from tapestries, curtains, and layered clothing.\n\nThe article argues that these passive design principles—using orientation, thermal mass, and strategic glazing—are an \"underused tool\" today. Instead, modern buildings often rely on energy-intensive heating and cooling systems to compensate for poor design, like fully glazed facades that cause overheating in summer and heat loss in winter.\n\nWhile new buildings can integrate these historical strategies, the piece concludes that even small adjustments in existing homes, such as repositioning furniture to follow sunlight or planting trees for shade, can reduce reliance on fossil fuels and improve comfort, highlighting the enduring value of designing in harmony with the environment.",
    "chinese_title": "伊丽莎白时代宅邸的保暖秘诀",
    "chinese_summary": "本文探讨了哈德威克庄园——一座建于16世纪90年代的伊丽莎白时期宅邸——如何巧妙设计以在小冰河期保持温暖，为现代节能建筑提供了启示。\n\n庄园设计巧妙地最大化利用太阳能热量。建筑采用南北朝向以获取充足日照，生活空间布局遵循太阳日行轨迹。向阳面设置大型窗户，而北墙则采用假窗设计以减少热量流失。厚重的内墙形成蓄热体，吸收中央壁炉的热量并缓慢释放。挂毯、窗帘与多层衣物也提供了额外保暖。\n\n文章指出，这些利用朝向、蓄热体与策略性玻璃设计的被动式原则，在当今仍是“未充分利用的工具”。相反，现代建筑常依赖高耗能的供暖制冷系统来弥补设计缺陷，例如全玻璃幕墙导致夏季过热、冬季失热。\n\n文章总结道，新建建筑固然可以融入这些历史智慧，但即便对现有住宅进行微小调整——如根据阳光移动重新布置家具、种植遮荫树木——也能减少对化石燃料的依赖并提升舒适度，彰显了与环境和谐共生的设计理念的永恒价值。"
  },
  {
    "id": "46661308",
    "title": "Show HN: Minikv – Distributed key-value and object store in Rust (Raft, S3 API)",
    "url": "https://github.com/whispem/minikv",
    "summary": "**Minikv** is a distributed key-value and object store written in Rust, designed as a learning project that has evolved into a full-featured, production-ready system. It offers strong consistency through Raft consensus and two-phase commit (2PC) for transactions, along with durability via a write-ahead log (WAL).\n\nThe latest version (v0.7.0) introduces secondary indexes for searching by value, multi-key transactions, bulk import/export, and a durable S3-compatible object storage API. It also includes enterprise features like multi-tenancy with role-based access control, encryption at rest, quotas, and audit logging.\n\nBuilt for scalability, it uses 256 virtual shards for data distribution and supports pluggable storage backends (in-memory, RocksDB, Sled). The system provides both HTTP REST and S3 APIs, gRPC for internal communication, and real-time watch/subscribe capabilities. It emphasizes observability with Prometheus metrics, structured logging, and an admin dashboard.\n\nPerformance benchmarks show over 50,000 writes per second on a single node with sub-millisecond read latency. The project is open-source, encourages contributions, and serves as a practical reference for implementing distributed systems in Rust.",
    "chinese_title": "Show HN：Minikv – 基于 Rust 的分布式键值与对象存储（支持 Raft 协议与 S3 API）",
    "chinese_summary": "**Minikv** 是一个用 Rust 编写的分布式键值存储与对象存储系统，最初作为学习项目开发，现已演变为功能完备、可用于生产环境的系统。它通过 Raft 共识算法和两阶段提交（2PC）实现强一致性事务，并利用预写日志（WAL）确保数据持久性。\n\n最新版本（v0.7.0）引入了按值检索的二级索引、多键事务、批量导入/导出功能，以及兼容 S3 的持久化对象存储 API。该系统还包含多项企业级特性，例如基于角色访问控制的多租户架构、静态数据加密、配额管理和审计日志记录。\n\n为支持可扩展性，系统采用 256 个虚拟分片进行数据分布，并支持可插拔存储后端（内存、RocksDB、Sled）。系统同时提供 HTTP REST 与 S3 API，内部通信采用 gRPC，并具备实时监听/订阅功能。通过 Prometheus 指标监控、结构化日志和管理仪表板，系统特别注重可观测性。\n\n性能测试显示，单节点可实现每秒超过 5 万次写入操作，读取延迟低于毫秒级。该项目为开源项目，欢迎社区贡献，并可作为使用 Rust 实现分布式系统的实践参考。"
  },
  {
    "id": "46658345",
    "title": "The recurring dream of replacing developers",
    "url": "https://www.caimito.net/en/blog/2025/12/07/the-recurring-dream-of-replacing-developers.html",
    "summary": "This article traces a recurring 50-year pattern in technology: the persistent but unfulfilled dream of replacing software developers. It began with COBOL in the 1970s, which promised business users could write code, and continued through CASE tools (1980s), Visual Basic (1990s), and modern low-code/no-code platforms. Each wave aimed to democratize or automate software creation to reduce cost and speed delivery.\n\nThe author argues these attempts consistently fail because they misunderstand the core challenge. Software development is not a mechanical task of typing or syntax, but an intellectual exercise in managing complexity—handling edge cases, security, integration, and evolving requirements. While each new tool (including today's AI assistants) provides real value by improving efficiency and lowering barriers, it cannot eliminate the need for human judgment and deep reasoning.\n\nThe pattern reveals that demand for software perpetually outpaces our ability to build it, fueling the ongoing search for a shortcut. For leaders, the lesson is to evaluate new tools not on promises to replace developers, but on their ability to help developers work more effectively on complex problems. Ultimately, the \"dream\" drives valuable innovation, but the fundamental constraint remains the human thinking required to translate real-world complexity into reliable systems.",
    "chinese_title": "取代开发者的循环梦",
    "chinese_summary": "本文追溯了技术领域一个反复出现的50年模式：那个持续存在却未能实现的取代软件开发者的梦想。它始于1970年代的COBOL语言——当时承诺商业用户也能编写代码，随后延续至CASE工具（1980年代）、Visual Basic（1990年代）乃至现代的低代码/无代码平台。每一轮浪潮都试图通过民主化或自动化软件创建来降低成本、加快交付速度。\n\n作者认为这些尝试之所以屡屡失败，是因为它们误解了核心挑战。软件开发并非打字或语法的机械性任务，而是一种管理复杂性的智力活动——需要处理边界情况、安全性、集成以及不断变化的需求。虽然每一种新工具（包括当今的AI助手）都通过提升效率、降低门槛创造了实际价值，但它们始终无法取代人类判断与深度推理的必要性。\n\n这一模式揭示：软件需求永远超越我们的构建能力，从而持续催生着对捷径的追寻。对领导者而言，应当以“能否帮助开发者更有效地处理复杂问题”而非“能否取代开发者”为标准来评估新工具。最终，这个“梦想”推动了有价值的创新，但根本限制依然存在——将现实世界的复杂性转化为可靠系统，始终需要人类思维的深度参与。"
  },
  {
    "id": "46576581",
    "title": "The Olivetti Company – By Bradford Morgan White",
    "url": "https://www.abortretry.fail/p/the-olivetti-company",
    "summary": "The Olivetti Company, founded by Camillo Olivetti in 1908 in Ivrea, Italy, pioneered high-quality, beautifully designed typewriters like the M1 and M40. Camillo established a progressive, vertically integrated factory known for humane working conditions, profit-sharing, and extensive employee welfare programs.\n\nHis son, Adriano, who became president in 1938, expanded the company internationally and tripled production. A staunch anti-fascist, he used the factory to aid fugitives during WWII and worked as an Allied intelligence agent. Post-war, he championed the \"Community Movement,\" advocating for a blend of industrial efficiency, social welfare, and participatory democracy.\n\nUnder Adriano’s leadership, Olivetti invested heavily in urban planning, building housing and community infrastructure in Ivrea, which saw its population surge. The company’s success was built on a unique fusion of engineering excellence, artistic design, and a deep commitment to social responsibility.",
    "chinese_title": "奥利维蒂公司——布拉德福德·摩根·怀特著",
    "chinese_summary": "奥利维蒂公司由卡米洛·奥利维蒂于1908年在意大利伊夫雷亚创立，率先推出了M1和M40等高品质、设计精美的打字机。卡米洛建立了一家进步、垂直整合的工厂，以人性化的工作条件、利润分享和广泛的员工福利计划而闻名。\n\n他的儿子阿德里亚诺于1938年成为总裁，将公司业务拓展至全球，并使产量增长了两倍。作为坚定的反法西斯主义者，他在二战期间利用工厂帮助逃亡者，并担任盟军情报人员。战后，他倡导“社区运动”，主张工业效率、社会福利和参与式民主的结合。\n\n在阿德里亚诺的领导下，奥利维蒂大力投资城市规划，在伊夫雷亚建造住房和社区基础设施，使当地人口激增。公司的成功建立在工程卓越、艺术设计和对社会责任的深刻承诺的独特融合之上。"
  },
  {
    "id": "46659219",
    "title": "There's no single best way to store information",
    "url": "https://www.quantamagazine.org/why-theres-no-single-best-way-to-store-information-20260116/",
    "summary": "This article explains that there is no universally optimal method for storing information, as different data structures involve inherent trade-offs between time, memory, and efficiency.\n\nIt uses two primary examples to illustrate this. First, **hash tables** resolve the tension between fast data insertion and fast retrieval by using a hash function to assign items to bins. However, this introduces a new trade-off between the speed of operations and the amount of memory (space) required.\n\nSecond, **heaps** are ideal for managing prioritized data, like a to-do list, where the most urgent item must always be accessible. They allow for quick addition and retrieval of the highest-priority item by using a structure like a binary tree, though lower-priority items remain less organized.\n\nThe article concludes that, much like organizing physical objects, the \"best\" storage system depends entirely on the specific needs and priorities of the task, with each approach offering different compromises.",
    "chinese_title": "没有一种存储信息的绝对最佳方法。",
    "chinese_summary": "本文阐述了信息存储并无普遍最优方法，因为不同的数据结构在时间、内存和效率之间存在着固有的权衡。\n\n文章通过两个主要例子说明这一点。首先，**哈希表**通过哈希函数将数据项分配到存储桶中，解决了快速插入与快速检索之间的矛盾。然而，这又带来了操作速度与所需内存（空间）之间的新权衡。\n\n其次，**堆**非常适合管理优先级数据（如待办事项列表），其中最高优先级的项目必须始终可访问。它们通过二叉树等结构实现快速添加和检索最高优先级项目，尽管低优先级项目的组织性较弱。\n\n文章总结道，正如整理实物一样，“最佳”存储系统完全取决于任务的具体需求和优先级，每种方法都提供了不同的权衡方案。"
  },
  {
    "id": "46655524",
    "title": "Counterfactual evaluation for recommendation systems",
    "url": "https://eugeneyan.com/writing/counterfactual-evaluation/",
    "summary": "This article explains that traditional offline evaluation of recommendation systems is flawed because it treats recommendations as an observational problem, when they are actually an interventional one. The author argues that standard metrics like recall and precision evaluate how well new recommendations fit historical data, not how they would change user behavior.\n\nTo address this, the article introduces counterfactual evaluation as a method to simulate A/B tests offline. The core technique discussed is Inverse Propensity Scoring (IPS), which estimates the impact of a new recommender by reweighting historical rewards based on how often items were recommended by the old versus new model.\n\nThe article also covers practical challenges with IPS, such as high variance when models differ greatly, and presents solutions like Clipped IPS (CIPS) and Self-Normalized IPS (SNIPS). It notes that SNIPS often performs best without needing parameter tuning, though it requires more computation.\n\nThe author concludes that while conventional offline evaluation remains useful for benchmarking, counterfactual methods like SNIPS are a valuable addition to the evaluation toolbox, especially when offline metrics don't align with online A/B test results.",
    "chinese_title": "推荐系统的反事实评估",
    "chinese_summary": "本文指出，传统推荐系统的离线评估方法存在缺陷，因为它将推荐视为观测性问题，而实际上这是一个干预性问题。作者认为，像召回率和精确率这样的标准指标评估的是新推荐与历史数据的匹配程度，而非它们对用户行为的实际影响。\n\n为解决这一问题，文章引入了反事实评估作为离线模拟A/B测试的方法。讨论的核心技术是逆倾向评分（IPS），该方法通过根据新旧模型推荐物品的频率重新加权历史奖励，来估计新推荐系统的影响。\n\n文章还探讨了IPS在实际应用中的挑战，例如当模型差异较大时方差过高，并介绍了解决方案，如裁剪逆倾向评分（CIPS）和自归一化逆倾向评分（SNIPS）。文章指出，SNIPS通常表现最佳且无需参数调优，但需要更多计算资源。\n\n作者总结道，虽然传统离线评估在基准测试中仍有其价值，但像SNIPS这样的反事实评估方法是评估工具箱中的重要补充，尤其是在离线指标与在线A/B测试结果不一致时。"
  },
  {
    "id": "46661231",
    "title": "OpenAI to test ads in ChatGPT as it burns through billions",
    "url": "https://arstechnica.com/information-technology/2026/01/openai-to-test-ads-in-chatgpt-as-it-burns-through-billions/",
    "summary": "OpenAI is beginning a test of banner advertisements in ChatGPT for free users and those on the new $8/month \"Go\" plan, marking a strategic shift as the company faces immense financial pressure. CEO Sam Altman had previously expressed reluctance, calling ads a \"last resort\" due to concerns about eroding user trust.\n\nThe ads will appear as separate, labeled sections at the bottom of answers for relevant queries and will not be shown to paying Plus, Pro, Business, or Enterprise subscribers. OpenAI emphasizes that the ads will not influence ChatGPT's actual responses and that user conversations will not be shared with advertisers.\n\nThis move is driven by OpenAI's need to diversify revenue. Despite projected 2025 revenue of $13 billion, the company expects to burn through $9 billion and does not anticipate profitability until 2030, partly due to massive planned investments in AI infrastructure. With only about 5% of its 800 million weekly users paying for subscriptions, advertising represents a potential new income stream.\n\nThe company positions this as a compromise to fund AI development while maintaining trust, assuring users that the core chatbot output remains objective and uninfluenced by sponsors.",
    "chinese_title": "OpenAI在烧掉数十亿美元之际，将在ChatGPT中测试广告功能。",
    "chinese_summary": "OpenAI正对免费用户及每月8美元新“Go”计划的用户测试ChatGPT横幅广告，此举标志着该公司在面临巨大财务压力下的战略转变。首席执行官萨姆·奥尔特曼此前曾表示不愿采用广告，称其为“最后手段”，担心这会侵蚀用户信任。\n\n广告将以独立标注板块的形式出现在相关查询答案的底部，且不会向付费的Plus、Pro、Business或企业版订阅用户展示。OpenAI强调广告不会影响ChatGPT的实际回复内容，用户对话也不会与广告商共享。\n\n这一举措源于OpenAI对收入多元化的需求。尽管预计2025年收入将达130亿美元，但公司预计将消耗90亿美元，且部分由于对AI基础设施的大规模投资计划，预计2030年前难以实现盈利。目前每周8亿用户中仅有约5%付费订阅，广告因此成为潜在的新收入来源。\n\n公司将此视为在维持用户信任的同时为AI发展筹措资金的折中方案，并承诺核心聊天机器人的输出将保持客观，不受赞助商影响。"
  },
  {
    "id": "46584880",
    "title": "Common misunderstandings about large software companies",
    "url": "https://philipotoole.com/common-misunderstandings-about-large-software-companies/",
    "summary": "This article argues that common criticisms of large software companies often miss the underlying reasons for their characteristics. The author, drawing on experience at companies like Google, explains that many perceived dysfunctions are actually necessary consequences of scale.\n\nThe article addresses three frequent complaints:\n1.  **\"Too many meetings\"**: In large organizations, coordination across many teams is a primary challenge. Meetings are not an added dysfunction but an intrinsic tool for managing this complexity.\n2.  **\"Executives' opinions are too dominant\"**: Executives act as essential proxies for distant customers, making strategic decisions about priorities. Their influence is a structural feature of the role, not a flaw.\n3.  **\"Too much process and bureaucracy\"**: Process exists to manage the high stakes of software that millions depend on. Unlike in a startup, failure is not an option, necessitating more rigorous checks for risk, correctness, and scale.\n\nThe core message is that while large companies have real problems, many criticized behaviors are logical consequences of their size and responsibility. Effective criticism requires first understanding these structural reasons, rather than dismissing them as simple pathologies.",
    "chinese_title": "关于大型软件公司的常见误解",
    "chinese_summary": "本文认为，对大型软件公司的常见批评往往忽略了其特点背后的深层原因。作者借鉴了在谷歌等公司的经验，指出许多被诟病的“功能障碍”实际上是规模扩张的必然结果。\n\n文章针对三种常见批评进行了分析：\n1.  **“会议太多”**：在大型组织中，跨团队协调是首要挑战。会议并非附加的弊病，而是管理这种复杂性的必要工具。\n2.  **“高管意见过于主导”**：高管是连接遥远客户的重要桥梁，负责制定优先级战略决策。他们的影响力是职位本身的结构性特征，而非缺陷。\n3.  **“流程与官僚主义过多”**：流程的存在是为了管理影响数百万用户的软件所面临的高风险。与初创公司不同，失败是不可接受的，因此需要更严格的风险、正确性和规模检查。\n\n核心观点是：尽管大公司确实存在问题，但许多被批评的行为其实是其规模和责任的合理结果。有效的批评需要先理解这些结构性原因，而不是简单地将它们视为病态现象。"
  },
  {
    "id": "46578601",
    "title": "M8SBC-486 (Homebrew 486 computer)",
    "url": "https://maniek86.xyz/projects/m8sbc_486.php",
    "summary": "**Summary of \"M8SBC-486 (Homebrew 486 computer)\"**\n\nThe article details the author's personal project to design and build a functional, homebrew single-board computer (SBC) based on the Intel 486DX processor. The primary goal was to create a compact, self-contained system for retro computing and low-level programming experimentation.\n\nKey specifications and features of the M8SBC-486 include:\n*   **CPU:** An Intel i486DX running at 33 MHz.\n*   **Memory:** 64 MB of RAM.\n*   **Storage:** Boots from a CompactFlash card acting as an IDE hard drive.\n*   **Graphics:** Uses a Tseng Labs ET4000 ISA video card for VGA output.\n*   **Expansion:** Includes two 16-bit ISA slots, allowing for additional peripherals like sound cards or network adapters.\n*   **Firmware:** Utilizes a modern Coreboot payload (TinyCore) with SeaBIOS for system initialization and booting.\n*   **OS Compatibility:** Successfully runs period-appropriate operating systems, specifically MS-DOS 6.22 and Windows 95.\n\nThe author describes the design and assembly process, highlighting the use of a four-layer PCB and the integration of both vintage and modern components. The project is presented as a successful proof-of-concept, resulting in a stable and usable retro computer built from scratch. The board is shown fully assembled and running diagnostic software and games, demonstrating its practical functionality.",
    "chinese_title": "M8SBC-486（自制486计算机）",
    "chinese_summary": "**《M8SBC-486（自制486计算机）》概述**\n\n本文详述了作者的个人项目：基于英特尔486DX处理器设计并打造一台功能完备的自制单板计算机。该项目的主要目标是构建一套紧凑、独立的系统，用于复古计算和底层编程实验。\n\nM8SBC-486的关键规格与特性包括：\n*   **处理器：** 英特尔 i486DX，主频33 MHz。\n*   **内存：** 64 MB RAM。\n*   **存储：** 从充当IDE硬盘的CompactFlash卡启动。\n*   **显卡：** 使用Tseng Labs ET4000 ISA显卡实现VGA输出。\n*   **扩展：** 配备两个16位ISA插槽，可连接声卡或网卡等附加外设。\n*   **固件：** 采用现代化的Coreboot有效载荷（TinyCore）结合SeaBIOS进行系统初始化和引导。\n*   **系统兼容性：** 可成功运行同时代的操作系统，特别是MS-DOS 6.22和Windows 95。\n\n作者描述了设计与组装过程，重点介绍了四层PCB板的使用以及新旧组件的整合。该项目作为一个成功的概念验证，最终制成了一台稳定可用的、从头打造的复古计算机。文中展示了完全组装好的主板运行诊断软件和游戏的情景，证明了其实用功能。"
  },
  {
    "id": "46661217",
    "title": "Canada's deal with China signals it is serious about shift from US",
    "url": "https://www.bbc.com/news/articles/cm24k6kk1rko",
    "summary": "Canada has struck a deal with China to ease tariffs on Chinese electric vehicles in exchange for China lowering retaliatory tariffs on key Canadian agricultural products like canola. Prime Minister Mark Carney framed the move as a pragmatic shift, acknowledging that Canada's trade relationship with China has become \"more predictable\" than with the US under the Trump administration.\n\nThe deal signals Canada's strategic pivot amid uncertainty over the future of the USMCA trade agreement and ongoing US tariffs. Experts view it as Canada asserting its agency and preparing for a scenario where North American trade relations deteriorate. Domestically, the deal is contentious: it is welcomed by western farmers but criticized by Ontario's premier, who warns it will hurt Canada's auto sector and jobs.\n\nUnder the agreement, Canada will lower its EV levy from 100% to 6.1% for an initial annual quota, potentially making EVs cheaper for consumers but increasing competition for US automakers like Tesla. In return, China will significantly cut tariffs on Canadian farm goods and remove visa requirements for Canadian visitors.\n\nWhile US President Donald Trump called the deal \"a good thing,\" his trade representative labeled it \"problematic.\" The agreement underscores Canada's effort to diversify its trade partnerships as it navigates a volatile relationship with its largest trading partner, the United States.",
    "chinese_title": "加拿大与中国的协议表明其正认真考虑摆脱对美国的依赖。",
    "chinese_summary": "加拿大与中国达成协议，将降低对中国电动汽车的关税，以换取中国对加拿大油菜籽等关键农产品降低报复性关税。总理马克·卡尼将此举描述为务实的转变，承认加拿大与中国的贸易关系在特朗普政府时期已变得比与美国的关系“更具可预测性”。\n\n该协议标志着加拿大在美国-墨西哥-加拿大协定未来不确定以及美国持续加征关税的背景下，进行了战略性调整。专家认为，这是加拿大在展现其自主性，并为北美贸易关系恶化做准备。在国内，该协议引发争议：西部农民表示欢迎，但安大略省省长提出批评，警告这将损害加拿大汽车行业和就业。\n\n根据协议，加拿大将在初始年度配额内将电动汽车关税从100%降至6.1%，这可能降低消费者的购车成本，但会增加特斯拉等美国汽车制造商的竞争压力。作为回报，中国将大幅削减对加拿大农产品的关税，并取消对加拿大访客的签证要求。\n\n尽管美国总统唐纳德·特朗普称该协议是“好事”，但其贸易代表却称之为“有问题”。该协议凸显了加拿大在与最大贸易伙伴美国关系波动之际，努力实现贸易伙伴多元化的战略。"
  },
  {
    "id": "46648916",
    "title": "East Germany balloon escape",
    "url": "https://en.wikipedia.org/wiki/East_Germany_balloon_escape",
    "summary": "On September 16, 1979, two East German families—the Strelzyks and the Wetzels—successfully escaped to West Germany in a homemade hot-air balloon. This daring flight was the culmination of over 18 months of planning by Peter Strelzyk and Günter Wetzel, who built three different balloons after two failed attempts.\n\nTheir first full-scale attempt in July 1979 ended with a crash-landing just short of the heavily fortified border. The discovery of their balloon by East German authorities forced them to act quickly. They constructed a larger balloon and, on their second attempt, launched at night during a storm. Despite a tear in the fabric and freezing temperatures, the balloon carried all eight passengers across the border, landing near Naila, West Germany.\n\nThe escape prompted East Germany to tighten border controls and restrict sales of materials like propane and fabric. Relatives of the escapees who remained in East Germany were arrested but later released. After reunification, the families returned to their hometown. Their story became a famous symbol of the desperate ingenuity used to overcome the Iron Curtain.",
    "chinese_title": "东德热气球逃亡",
    "chinese_summary": "1979年9月16日，两个东德家庭——斯特雷尔奇克家和韦策尔家——乘坐自制的热气球成功逃往西德。这次大胆的飞行是彼得·斯特雷尔奇克和京特·韦策尔历经18个多月筹划的成果，他们在两次失败尝试后共制作了三个不同的热气球。\n\n1979年7月，他们首次完整尝试以迫降告终，气球坠落在戒备森严的边境线附近。东德当局发现气球残骸后，他们被迫加快行动。他们制作了更大的气球，在第二次尝试中趁着暴风雨夜起飞。尽管气囊出现裂口且气温极低，气球仍载着八人越过边境，最终降落在西德奈拉附近。\n\n这次逃亡事件促使东德加强了边境管制，并限制丙烷、织物等物资的销售。逃亡者留在东德的亲属曾遭逮捕，但后来获释。两德统一后，两个家庭重返故乡。他们的故事成为以惊人智慧冲破铁幕的著名象征。"
  },
  {
    "id": "46646475",
    "title": "The Dilbert Afterlife",
    "url": "https://www.astralcodexten.com/p/the-dilbert-afterlife",
    "summary": "This article, written by Scott Alexander, reflects on the life and career of Scott Adams, the creator of *Dilbert*, following Adams's death. It argues that *Dilbert* resonated because it perfectly captured the \"nerd experience\"—the feeling of being smarter and more competent than one's bosses in a dysfunctional corporate world, yet perpetually unrewarded.\n\nThe piece traces how Adams, despite his monumental success as a cartoonist, spent his life frustrated by being pigeonholed. He repeatedly attempted to escape this identity through failed business ventures (like the Dilberito burrito and a restaurant), management theory books, and other projects, driven by a desire to be seen as more than just \"the Dilbert guy.\"\n\nUltimately, the article portrays Adams as a tragicomic figure: a genius in his field who could never accept its limits. His later, more controversial public statements are framed as part of this lifelong, futile struggle to prove his broader cleverness, leaving him in an \"uncanny valley\" between the honest engineer and the slick consultant he satirized.",
    "chinese_title": "呆伯特来世",
    "chinese_summary": "本文由斯科特·亚历山大撰写，旨在回顾《呆伯特》创作者斯科特·亚当斯逝世后的生平与事业。文章认为，《呆伯特》之所以引发共鸣，是因为它精准捕捉了“书呆子体验”——在一个功能失调的企业世界中，感觉自己比上司更聪明、更能干，却始终得不到回报。\n\n文章追溯了亚当斯尽管作为漫画家取得了巨大成功，却一生因被定型而深感挫败。他多次尝试通过失败的商业冒险（如“呆伯特卷饼”和一家餐厅）、管理理论书籍及其他项目来摆脱这一身份，背后驱动力是渴望被视为不仅仅是“那个画呆伯特的人”。\n\n最终，文章将亚当斯描绘成一个悲喜剧式人物：一位在本领域的天才，却始终无法接受其局限性。他后期更具争议的公开言论，被视作这场徒劳终生斗争的一部分——试图证明自己拥有更广泛的智慧，却使他陷入一种“诡异境地”：既非他所讽刺的诚实工程师，亦非圆滑的咨询顾问。"
  },
  {
    "id": "46659943",
    "title": "Show HN: What if your menu bar was a keyboard-controlled command center?",
    "url": "https://extrabar.app/",
    "summary": "**Summary of ExtraBar for macOS**\n\nExtraBar is a new macOS application that transforms the static, limited native menu bar into a customizable, keyboard-driven command center. It allows users to create a personalized menu bar with instant access to apps, specific files, deep links, and custom actions tailored to their workflow.\n\n**Key Features:**\n*   **Custom Actions & Deep Links:** Create shortcuts to launch apps, open specific files/folders, trigger macOS Shortcuts, or jump directly to features within apps (like a specific Slack channel or Zoom meeting).\n*   **Multiple Display Modes:** Choose between an **inline mode** that integrates with the native menu bar or a **floating mode** for a separate, customizable bar.\n*   **Keyboard-Centric Control:** Assign one global hotkey to activate ExtraBar, then navigate using numbers or arrow keys for speed.\n*   **Privacy-Focused:** Requires zero system permissions for core functionality (optional accessibility permission enhances keyboard nav) and works entirely offline with no data collection.\n*   **Local Configuration:** All settings are stored locally on the user's Mac and can be exported/imported for syncing across devices.\n\n**Target Users:** The app is designed for power users like designers, developers, managers, and anyone seeking to streamline their daily workflows.\n\n**Launch Offer:** The app is available for a one-time purchase of €9.99 (regular price €24.99 after January 31), which includes lifetime access, all future updates, and a 14-day money-back guarantee. It supports macOS 12.4 and later.",
    "chinese_title": "Show HN：如果你的菜单栏变成一个键盘控制的命令中心会怎样？",
    "chinese_summary": "**macOS版ExtraBar概览**\n\nExtraBar是一款全新的macOS应用程序，它将静态、功能受限的原生菜单栏转变为可自定义的键盘驱动式命令中心。用户可创建个性化菜单栏，快速访问应用程序、特定文件、深度链接以及为其工作流程定制的自定义操作。\n\n**核心功能：**\n*   **自定义操作与深度链接：** 创建快捷方式以启动应用、打开特定文件/文件夹、触发macOS快捷指令，或直接跳转至应用内特定功能（如指定Slack频道或Zoom会议）。\n*   **多种显示模式：** 可选择与原生菜单栏集成的**内嵌模式**，或使用独立可自定义的**浮动模式**。\n*   **键盘中心化控制：** 分配一个全局热键激活ExtraBar，随后可使用数字键或方向键进行快速导航。\n*   **注重隐私：** 核心功能无需任何系统权限（可选辅助功能权限可增强键盘导航），完全离线运行且不收集任何数据。\n*   **本地化配置：** 所有设置均存储在用户Mac本地，并可导出/导入以实现跨设备同步。\n\n**目标用户：** 本应用专为设计师、开发者、管理者等高级用户，以及任何希望优化日常工作效率的人士设计。\n\n**首发优惠：** 应用现以9.99欧元一次性购买（原价24.99欧元，优惠截至1月31日），包含终身使用权、所有未来更新及14天退款保证。支持macOS 12.4及以上系统。"
  },
  {
    "id": "46656552",
    "title": "ClickHouse acquires Langfuse",
    "url": "https://langfuse.com/blog/joining-clickhouse",
    "summary": "ClickHouse has acquired Langfuse, an open-source LLM engineering platform. The core message for existing users is continuity: Langfuse will remain open-source and self-hostable with no immediate changes to its product, cloud service, licensing, or support channels.\n\nThe primary benefit of the acquisition is accelerated development. With ClickHouse's backing, Langfuse can invest more deeply in performance, reliability, and its roadmap. The partnership is natural, as Langfuse already uses ClickHouse as its core database, the companies share customers and a developer-focused culture, and ClickHouse itself uses Langfuse for its AI applications.\n\nThe founders emphasize they did not plan to sell but chose this path to advance their goal faster: helping teams build and improve production AI applications. The entire Langfuse team will join ClickHouse to continue focusing on the platform's north star, with upcoming investments in production monitoring, iteration workflows, scalability, and user experience.",
    "chinese_title": "ClickHouse收购Langfuse",
    "chinese_summary": "ClickHouse已收购开源LLM工程平台Langfuse。对现有用户的核心承诺是延续性：Langfuse将继续保持开源和自托管特性，其产品、云服务、许可协议及支持渠道均不会立即变更。\n\n此次收购的主要优势在于加速发展。依托ClickHouse的支持，Langfuse将能更深入投入性能优化、可靠性提升及路线图推进。双方合作水到渠成——Langfuse早已采用ClickHouse作为核心数据库，两家公司拥有共同客户群和以开发者为中心的文化，且ClickHouse自身也在AI应用中广泛使用Langfuse。\n\n创始人强调他们原本无意出售公司，但选择这条路径能更快推进其核心目标：帮助团队构建并优化生产级AI应用。整个Langfuse团队将加入ClickHouse，继续聚焦平台的核心发展方向，未来将在生产监控、迭代工作流、可扩展性及用户体验等领域加大投入。"
  },
  {
    "id": "46659465",
    "title": "Apples, Trees, and Quasimodes",
    "url": "https://systemstack.dev/2025/09/humane-computing/",
    "summary": "This article examines Jef Raskin's \"humane computing\" philosophy, placing him within the 1970s Bay Area counterculture tradition that viewed computers as tools for thought and liberation. While sharing this vision with figures like Engelbart and Nelson, Raskin's approach was distinctively protective, prioritizing simplicity, modelessness, and shielding users from complexity.\n\nHis principles were most fully realized in the Canon Cat, a text-first appliance that booted instantly and offered fluid navigation. However, its commercial failure highlighted a core tension: Raskin's humane design, while open at a technical level (featuring a hidden Forth programming environment), was presented as a sealed, constraining system. This created a paradox where user protection edged into hermetic limitation.\n\nThe article argues that labeling Raskin's work a historical \"cul-de-sac\" is mistaken. Instead, it represents a vital branch of computing thought. His ideals of undo, consistency, and low cognitive load became mainstream, but the deeper ethos of exploratory, user-empowering tools persists only on the margins—in systems like Emacs or Smalltalk. The central dilemma remains: commercial, large-scale platforms are structurally incapable of delivering truly humane *and* open systems, as their incentives favor lock-in and simplicity over genuine user agency. Thus, the future of humane computing likely depends on communities and experiments operating outside mainstream commercial constraints.",
    "chinese_title": "苹果、树木与准模式",
    "chinese_summary": "本文探讨了杰夫·拉斯金的“人性化计算”理念，将其置于1970年代湾区反文化传统中——该传统将计算机视为思维与解放的工具。尽管与恩格尔巴特、尼尔森等人共享这一愿景，拉斯金的方法却独具保护性，强调简洁性、无模式设计，并致力于为用户屏蔽复杂性。\n\n他的理念在佳能Cat上得到了最完整的体现：这台以文本为先的设备能即时启动并提供流畅的导航。然而，其商业失败揭示了一个核心矛盾：拉斯金的人性化设计虽然在技术层面保持开放（内置隐藏的Forth编程环境），却以封闭的约束性系统呈现。这形成了一种悖论——用户保护逐渐演变为封闭性限制。\n\n文章认为，将拉斯金的工作称为历史上的“死胡同”是错误的。相反，它代表了计算思想中一个重要分支。他的撤销、一致性、低认知负荷等理念已成为主流，但更深层的探索性、赋权于用户的技术精神，仅存活于边缘——如Emacs或Smalltalk等系统中。核心困境依然存在：商业化的规模化平台在结构上无法提供真正人性化且开放的系统，因为其内在动机倾向于锁定用户和简化功能，而非赋予用户真正的自主权。因此，人性化计算的未来很可能依赖于在主流商业约束之外运作的社群与实验。"
  },
  {
    "id": "46657296",
    "title": "The 600-year-old origins of the word 'hello'",
    "url": "https://www.bbc.com/culture/article/20260113-hello-hiya-aloha-what-our-greetings-reveal",
    "summary": "The word \"hello\" first appeared in print 200 years ago in an 1826 Connecticut newspaper, but its origins are much older, dating back to 15th-century influences like the French \"hol\" and the German \"halâ.\" Initially spelled variably as \"hullo\" or \"holla,\" it became standardized as \"hello\" partly due to Thomas Edison's advocacy for its clarity on early telephone lines.\n\nGreetings like \"hello\" are culturally significant and vary globally, from the health-focused Greek \"yah-soo\" to the multipurpose Italian \"ciao.\" The specific word a culture uses can reflect social norms, though linguists caution against simplistic links to national character.\n\nIn the digital age, the greeting continues to evolve. Its form is often shortened or replaced entirely by emojis (like the waving hand) in text-based communication, while elongated versions like \"heyyy\" can convey nuanced tones such as flirtation. Despite these changes—echoing the word's own history of variation—the core function of \"hello\" remains: a fundamental social act of recognition and connection.",
    "chinese_title": "“你好”一词600年前的起源",
    "chinese_summary": "“你好”这个词首次出现在印刷品中是200年前，在1826年康涅狄格州的一份报纸上，但其起源更为久远，可追溯至15世纪法语“hol”和德语“halâ”的影响。最初拼写多样，如“hullo”或“holla”，后来部分因托马斯·爱迪生提倡其在早期电话线路上的清晰度，逐渐标准化为“hello”。\n\n像“你好”这样的问候语具有文化重要性，全球各地各不相同，从注重健康的希腊语“yah-soo”到多功能的意大利语“ciao”。一个文化使用的特定词语可以反映社会规范，但语言学家警告不要简单地将其与国家性格联系起来。\n\n在数字时代，问候语持续演变。在文本交流中，其形式常被缩短或完全由表情符号（如挥手）替代，而拉长版本如“heyyy”可以传达微妙语气，如调情。尽管这些变化呼应了该词自身的历史多样性，但“你好”的核心功能依然不变：它是一种基本的社交行为，用于表达认可和建立联系。"
  },
  {
    "id": "46583914",
    "title": "16 Best Practices for Reducing Dependabot Noise",
    "url": "https://nesbitt.io/2026/01/10/16-best-practices-for-reducing-dependabot-noise.html",
    "summary": "This article presents 16 satirical \"best practices\" for minimizing Dependabot's automated dependency update alerts, framed as advice for enterprise teams. The core argument is that default security tooling creates disruptive noise, and stability should be prioritized over constant patching.\n\nKey strategies include aggressively delaying updates, extending check intervals to monthly or quarterly, and requiring extensive cross-functional reviews to slow the process. More extreme suggestions involve forking or vendoring dependencies to avoid external scans, removing lockfiles, and even using package aliases to obscure versions from scanners. The article ironically recommends switching to languages without Dependabot support and using AI to generate code fixes instead of updating packages.\n\nThe culmination is a sample `dependabot.yml` configuration that effectively neuters the tool by setting the open PR limit to zero, ignoring all security patches, and adding `[skip ci]` to bypass testing. The tone throughout is one of exaggerated pragmatism, suggesting that theoretical vulnerabilities and compliance burdens are less important than developer velocity and a clean PR queue. The author, Andrew Nesbitt, positions this as insights from optimizing workflows for large-scale clients.",
    "chinese_title": "减少Dependabot干扰的16个最佳实践",
    "chinese_summary": "本文为企业团队提供了16条讽刺性的“最佳实践”，旨在减少Dependabot自动依赖更新警报。核心论点是默认安全工具会产生干扰性噪音，稳定性应优先于持续修补。\n\n关键策略包括积极延迟更新、将检查间隔延长至每月或每季度，并要求进行广泛的跨职能评审以减缓流程。更极端的建议涉及分叉或内化依赖项以规避外部扫描、移除锁定文件，甚至使用包别名来隐藏版本信息以躲避扫描器。文章讽刺性地建议转向不支持Dependabot的编程语言，并使用AI生成代码修复而非更新软件包。\n\n最终呈现的示例`dependabot.yml`配置通过将开放PR限制设为零、忽略所有安全补丁以及添加`[skip ci]`绕过测试，有效废除了该工具的功能。全文以夸张的实用主义口吻贯穿始终，暗示理论上的漏洞和合规负担不如开发速度和整洁的PR队列重要。作者安德鲁·内斯比特将其定位为优化大型客户工作流程的洞见。"
  },
  {
    "id": "46656358",
    "title": "Show HN: Streaming gigabyte medical images from S3 without downloading them",
    "url": "https://github.com/PABannier/WSIStreamer",
    "summary": "**WSI Streamer** is a cloud-native tile server that enables efficient streaming of large Whole Slide Images (WSI) directly from S3-compatible object storage, without needing to download the entire multi-gigabyte files. It works by using HTTP range requests to fetch only the specific bytes required for each image tile, which are then served as JPEGs.\n\nKey features include a built-in OpenSeadragon-based web viewer for panning and zooming, support for Aperio SVS and pyramidal TIFF formats, and production-ready capabilities like HMAC-SHA256 URL authentication and multi-level caching. It can be installed via Rust's Cargo, Docker, or built from source.\n\nThe tool is configured and run via simple command-line arguments or environment variables, offering endpoints for listing slides, fetching metadata, retrieving tiles/thumbnails, and health checks. It is designed to be a lightweight, performant solution for medical imaging workflows where slides are stored in the cloud.",
    "chinese_title": "Show HN：无需下载，直接从S3流式传输千兆字节医学影像",
    "chinese_summary": "**WSI Streamer** 是一款云原生切片服务器，能够直接从 S3 兼容的对象存储中高效流式传输大型全切片图像（WSI），无需下载完整的数 GB 文件。它通过 HTTP 范围请求仅获取每个图像切片所需的特定字节，然后以 JPEG 格式提供。\n\n主要功能包括内置基于 OpenSeadragon 的网页查看器（支持平移和缩放）、兼容 Aperio SVS 和金字塔式 TIFF 格式，以及具备生产就绪能力，如 HMAC-SHA256 URL 身份验证和多级缓存。可通过 Rust 的 Cargo、Docker 或从源代码构建安装。\n\n该工具通过简单的命令行参数或环境变量进行配置和运行，提供列出幻灯片、获取元数据、检索切片/缩略图以及健康检查等端点。它专为医学影像工作流程设计，是一种轻量级、高性能的解决方案，适用于云端存储切片的应用场景。"
  },
  {
    "id": "46659456",
    "title": "The Resonant Computing Manifesto",
    "url": "https://resonantcomputing.org/",
    "summary": "The Resonant Computing Manifesto argues that modern technology, driven by hyper-scale and centralization, often leaves users feeling alienated and drained. It proposes an alternative path for the AI era, centered on building \"resonant\" digital environments that feel human, nourishing, and aligned with our deeper values.\n\nThe manifesto suggests five core principles to guide this shift: software should be **Private** (users steward their own data), **Dedicated** (working exclusively for the user), **Plural** (avoiding single-entity control), **Adaptable** (meeting specific user needs), and **Prosocial** (enabling positive connection).\n\nIt asserts that AI now allows for hyper-personalization not geared toward addiction, but toward empowering human agency and flourishing. The goal is to move from sterile, one-size-fits-all platforms to adaptive technology that serves individual and collective aspirations.\n\nThe document is presented as a starting point for a broader movement, inviting contributors to help develop its practical implementation. It lists numerous signatories from the tech industry, academia, and beyond who endorse this vision for a more humane technological future.",
    "chinese_title": "《共振计算宣言》",
    "chinese_summary": "《共鸣计算宣言》指出，由超大规模和中心化驱动的现代技术常让用户感到疏离与疲惫。它提出了人工智能时代的另一条路径——以构建“共鸣式”数字环境为核心，这种环境应充满人性关怀、滋养心灵，并与我们更深层的价值观相契合。\n\n宣言提出了引导这一转变的五项核心原则：软件应当具备**隐私性**（用户自主管理数据）、**专属性**（仅服务于用户）、**多元性**（避免单一实体控制）、**适应性**（满足具体用户需求）以及**亲社会性**（促进积极联结）。\n\n宣言主张，如今的人工智能技术能够实现超个性化设计，其目标不应导向成瘾机制，而应致力于增强人的能动性与繁荣发展。其愿景是从僵化、“一刀切”的平台转向适应性技术，以服务于个体与集体的共同理想。\n\n该文件被视为一场更广泛运动的起点，邀请各界贡献者共同推进其实际落地。文末列出了来自科技行业、学术界等多领域的众多签署者，他们共同支持这一迈向更人性化技术未来的愿景。"
  },
  {
    "id": "46656834",
    "title": "Map To Poster – Create Art of your favourite city",
    "url": "https://github.com/originalankur/maptoposter",
    "summary": "This tool, the City Map Poster Generator, creates minimalist map art for any city. Users provide a city and country name, and the script generates a stylized poster based on a chosen theme, with options for map radius.\n\n**Key Features:**\n*   **Customization:** Choose from 17 themes (like noir, blueprint, or sunset) and adjust the map's zoom level.\n*   **Automated Process:** The script handles geocoding, fetches map data from OpenStreetMap, and applies the visual style.\n*   **Structured Output:** Posters are saved as high-resolution PNG files with a standardized filename.\n*   **Extensibility:** The project is designed for hackers to easily add new themes or map layers (like railways) by modifying well-documented Python functions and JSON theme files.\n\nIn short, it's a programmable tool that turns geographic data into personalized art prints with minimal user effort.",
    "chinese_title": "地图变海报——将你心爱的城市化为艺术",
    "chinese_summary": "这款城市地图海报生成器，能为任意城市创作极简风格的地图艺术作品。用户只需提供城市与国家名称，脚本即可根据所选主题生成风格化海报，并支持自定义地图显示半径。\n\n**核心功能：**\n*   **个性化定制：** 可从17种主题（如暗黑系、蓝图、日落等）中选择，并自由调节地图缩放级别。\n*   **全自动处理：** 脚本自动完成地理编码、从OpenStreetMap获取地图数据并应用视觉样式。\n*   **标准化输出：** 海报以高分辨率PNG格式保存，采用统一命名的文件格式。\n*   **高扩展性：** 项目采用模块化设计，开发者可通过修改结构清晰的Python函数与JSON主题文件，轻松添加新主题或地图图层（如铁路线路）。\n\n简而言之，这是一个可编程工具，能以极简操作将地理数据转化为个性化的艺术海报。"
  },
  {
    "id": "46656045",
    "title": "The 'untouchable hacker god' behind Finland's biggest crime",
    "url": "https://www.theguardian.com/technology/2026/jan/17/vastaamo-hack-finland-therapy-notes",
    "summary": "In October 2020, a hacker breached the database of Vastaamo, Finland's largest private psychotherapy provider, stealing the confidential therapy notes of 33,000 patients. The attacker, using the alias \"ransom_man,\" first tried to extort the company and then began leaking sensitive patient records on the dark web, including details about politicians, children, and private struggles. He then sent extortion emails directly to thousands of victims, demanding bitcoin payments to keep their data private.\n\nThe hack had devastating consequences, causing profound psychological trauma for victims like Tiina Parikka and Meri-Tuuli Auer, who felt violently exposed. At least two victims died by suicide. An investigation revealed Vastaamo's security was shockingly lax, with the database accessible online with a blank password.\n\nCybersecurity expert Antti Kurittu, hired by Vastaamo, analyzed the leaked data and identified a crucial mistake: the hacker had accidentally uploaded his own home folder. The chaotic file structure and specific naming conventions led Kurittu to suspect Aleksanteri Kivimäki, a hacker known from his teenage years. The article concludes by framing the hack as Finland's biggest crime and sets up the pursuit of its perpetrator.",
    "chinese_title": "芬兰最大罪案背后的“不可触碰的黑客之神”",
    "chinese_summary": "2020年10月，一名黑客入侵了芬兰最大的私营心理治疗机构Vastaamo的数据库，窃取了33,000名患者的保密治疗记录。攻击者使用化名“ransom_man”，先是试图勒索该公司，随后开始在暗网上泄露敏感的患者档案，其中包括政客、儿童及私人困境等细节。接着，他直接向数千名受害者发送勒索邮件，要求支付比特币以保护其数据隐私。\n\n此次黑客攻击造成了毁灭性后果，给蒂娜·帕里卡和梅里-图利·奥尔等受害者带来了严重的心理创伤，她们感到自己的隐私被粗暴暴露。至少有两名受害者自杀身亡。调查显示，Vastaamo的安全防护令人震惊地松懈，其数据库竟可通过空密码在线访问。\n\n受Vastaamo雇用的网络安全专家安蒂·库里图分析了泄露的数据，发现了一个关键失误：黑客意外上传了自己的个人主文件夹。混乱的文件结构和特定的命名习惯让库里图锁定了嫌疑人——少年时期就已知名的黑客亚历山特里·基维迈基。文章最后将此案定性为芬兰史上最严重的犯罪事件，并展开了对罪犯的追捕。"
  },
  {
    "id": "46646777",
    "title": "Cursor's latest “browser experiment” implied success without evidence",
    "url": "https://embedding-shapes.github.io/cursor-implied-success-without-evidence/",
    "summary": "The article criticizes Cursor's January 2026 blog post about an autonomous coding experiment. In the post, Cursor claimed its AI agents successfully collaborated for weeks to build a web browser from scratch, generating over 1 million lines of code. However, the article argues this implied success is misleading.\n\nThe author investigated the linked GitHub repository and found the code does not compile, with dozens of errors and warnings. No commit in the project's history builds cleanly, and recent PRs were merged with failing CI checks. The article describes the output as \"AI slop\"—low-quality, non-functional code that lacks engineering intent.\n\nWhile Cursor's blog post used ambitious language and a screenshot to suggest meaningful progress, it provided no reproducible demo, build instructions, or a known-working commit to verify functionality. The article concludes that Cursor created an impression of a working prototype without providing evidence, as the \"browser\" fails the basic test of compiling and rendering a simple HTML file.",
    "chinese_title": "Cursor的最新“浏览器实验”在无证据的情况下暗示成功",
    "chinese_summary": "这篇文章批评了Cursor于2026年1月发布的关于自主编码实验的博客文章。文中，Cursor声称其AI代理成功协作数周，从零开始构建了一个网络浏览器，生成了超过100万行代码。然而，文章认为这种暗示的成功具有误导性。\n\n作者调查了链接的GitHub仓库，发现代码无法编译，存在数十个错误和警告。项目历史中没有一次提交能干净地构建，最近的合并请求甚至是在持续集成检查失败的情况下通过的。文章将这种输出描述为“AI垃圾”——即低质量、无法运行且缺乏工程意图的代码。\n\n尽管Cursor的博客文章使用了雄心勃勃的语言和截图来暗示有意义的进展，但它没有提供可复现的演示、构建说明或已知可运行的提交来验证功能。文章总结道，Cursor在没有提供证据的情况下制造了一个可运行原型的假象，因为这个“浏览器”连编译和渲染简单HTML文件的基本测试都无法通过。"
  },
  {
    "id": "46659913",
    "title": "2025 was the third hottest year on record",
    "url": "https://www.economist.com/science-and-technology/2026/01/14/2025-was-the-third-hottest-year-on-record",
    "summary": "**Summary of \"2025 was the third hottest year on record\"**\n\nThe article reports that 2025 was officially the third hottest year on record, continuing a long-term trend of global warming driven by human-caused greenhouse gas emissions. While it did not break the annual record set in 2024, the year was exceptionally warm, with temperatures significantly above historical averages.\n\nKey points include:\n*   The global average temperature in 2025 was approximately 1.3°C above the pre-industrial (1850-1900) baseline.\n*   This marks the **eleventh consecutive year** where global temperatures have reached at least 1°C above pre-industrial levels.\n*   The heat was not evenly distributed; some regions, including parts of Europe, Asia, and the oceans, experienced extreme and record-breaking temperatures and marine heatwaves.\n*   Scientists emphasize that the overall trend is unequivocal, with the past decade being the hottest on record. The minor year-to-year fluctuations, such as 2025 being slightly cooler than 2024, are less significant than the persistent upward trajectory.\n*   The article underscores that without rapid and substantial reductions in carbon dioxide and other greenhouse gas emissions, temperature records will continue to be broken, with increasing risks of severe heatwaves, droughts, floods, and other climate impacts.\n\nIn essence, the data for 2025 reinforces that global warming is an ongoing and accelerating crisis, with each year consistently ranking among the hottest ever measured.",
    "chinese_title": "2025年是有记录以来第三热的年份。",
    "chinese_summary": "**《2025年成为有记录以来第三热年份》摘要**\n\n文章报道，2025年正式成为有记录以来第三热的年份，延续了由人类温室气体排放导致的全球变暖长期趋势。尽管未打破2024年创下的年度纪录，但这一年异常温暖，气温显著高于历史平均水平。\n\n要点包括：\n*   2025年全球平均气温比工业化前（1850-1900年）基准高出约1.3°C。\n*   这标志着全球气温**连续第十一年**至少比工业化前水平高出1°C。\n*   热量分布不均；包括欧洲和亚洲部分地区以及海洋在内的区域经历了极端和破纪录的高温及海洋热浪。\n*   科学家强调，总体趋势是明确的，过去十年是有记录以来最热的十年。诸如2025年比2024年略凉这样的逐年微小波动，其重要性远不及持续上升的总体轨迹。\n*   文章指出，若不迅速大幅减少二氧化碳及其他温室气体排放，气温纪录将持续被打破，严重热浪、干旱、洪水及其他气候影响的风险将日益增加。\n\n本质上，2025年的数据进一步证实，全球变暖是一场持续且加速的危机，每一年都持续位列有测量记录以来最热的年份之中。"
  },
  {
    "id": "46647491",
    "title": "6-Day and IP Address Certificates Are Generally Available",
    "url": "https://letsencrypt.org/2026/01/15/6day-and-ip-general-availability",
    "summary": "Let’s Encrypt has announced the general availability of two new certificate types: short-lived certificates and IP address certificates.\n\nShort-lived certificates are valid for only 160 hours (just over six days). They are designed to improve security by requiring more frequent validation and reducing the risk window if a private key is compromised, as traditional 90-day certificates rely on an unreliable revocation system. These certificates are opt-in and obtained by selecting the 'shortlived' profile in an ACME client. Let’s Encrypt notes that while they encourage adoption, they have no immediate plans to make them the default, acknowledging that not all subscribers have fully automated renewal processes. The organization also reaffirmed its plan to reduce default certificate lifetimes from 90 to 45 days in the coming years.\n\nIP address certificates allow TLS authentication for servers using their IP addresses (both IPv4 and IPv6) instead of domain names. A key requirement is that these certificates must be short-lived, as IP addresses are more transient than domain names, making frequent re-validation necessary.\n\nThe development of these features was supported by the Open Technology Fund, Sovereign Tech Agency, and Let’s Encrypt's sponsors and donors.",
    "chinese_title": "6天和IP地址证书现已全面开放使用。",
    "chinese_summary": "Let’s Encrypt宣布推出两种新型证书的正式可用性：短期证书和IP地址证书。\n\n短期证书有效期仅为160小时（略超过六天）。这类证书旨在通过要求更频繁的验证来提升安全性，并降低私钥泄露时的风险窗口，因为传统的90天证书依赖不可靠的吊销机制。这些证书为可选类型，用户需在ACME客户端中选择“shortlived”配置文件来获取。Let’s Encrypt指出，虽然他们鼓励采用此类证书，但暂无计划将其设为默认选项，因为并非所有订阅者都具备完全自动化的续期流程。该组织还重申了未来几年将默认证书有效期从90天缩短至45天的计划。\n\nIP地址证书允许服务器使用其IP地址（包括IPv4和IPv6）而非域名进行TLS身份验证。一个关键要求是此类证书必须是短期的，因为IP地址比域名更具临时性，需要频繁重新验证。\n\n这些功能的开发得到了开放技术基金、主权技术机构以及Let’s Encrypt赞助方和捐赠者的支持。"
  },
  {
    "id": "46630816",
    "title": "High-Level Is the Goal",
    "url": "https://bvisness.me/high-level/",
    "summary": "The article argues that the key to building better, faster software is not low-level programming itself, but the perspective and freedom it provides. Modern software is often slow and bloated because developers are constrained by high-level frameworks like React, which force inefficient architectures (as illustrated by New Reddit's 200ms comment collapse). These frameworks represent a limited, top-heavy \"tech stack tree\" where foundational choices are already made.\n\nBy understanding lower levels (e.g., DOM APIs, native code, system fundamentals), programmers can see more options in this tree and make better initial choices for their projects—choosing the right \"frame\" for the software, just as a proper truck frame is better than a modified sedan. More importantly, this low-level knowledge is essential for true innovation. The software industry needs to \"prune\" the overgrown high-level ecosystem and grow new, healthier branches from lower down. However, very few people possess both the drive to innovate and the necessary low-level skills. Therefore, promoting low-level programming is critical to expanding this group and enabling meaningful progress beyond creating yet another JavaScript framework.",
    "chinese_title": "高层级是目标",
    "chinese_summary": "这篇文章认为，构建更优、更快软件的关键并非底层编程本身，而是它提供的视角与自由度。现代软件往往运行缓慢且臃肿，因为开发者受限于如React之类的高级框架，这些框架强制采用低效架构（正如新版Reddit折叠评论需200毫秒所揭示的）。这些框架代表了一种受限且头重脚轻的“技术栈树”——其基础选择早已被预设。\n\n通过理解更底层（如DOM API、原生代码、系统原理），程序员能在这棵树中看到更多可能性，并为项目做出更优的初始选择——如同为软件选择合适的“车架”，正如专用卡车底盘远胜于改装轿车。更重要的是，这种底层知识对实现真正的创新至关重要。软件行业需要“修剪”过度生长的高级生态，从更底层培育出健康的新枝。然而，兼具创新动力与必要底层技能的人寥寥无几。因此，推广底层编程对于扩大这类人才群体至关重要，唯有如此，我们才能实现超越“再造一个JavaScript框架”的真正进步。"
  },
  {
    "id": "46656903",
    "title": "US electricity demand surged in 2025 – solar handled 61% of it",
    "url": "https://electrek.co/2026/01/16/us-electricity-demand-surged-in-2025-solar-handled-61-percent/",
    "summary": "In 2025, U.S. electricity demand grew significantly by 135 TWh, a 3.1% increase. According to an analysis by Ember, solar power was central to meeting this surge, accounting for 61% of the new demand. Solar generation itself saw a record increase of 83 TWh, a 27% rise from the previous year.\n\nThe growth was particularly vital in regions with the fastest-rising demand, such as Texas and the Midwest, where solar met 81% of new demand. During daytime hours (10 am to 6 pm Eastern), the increase in solar generation alone covered the entire rise in electricity demand.\n\nA key factor in solar's effectiveness was the rapid expansion of battery storage, which allowed solar energy to be used more flexibly, including during evening hours. This shift is turning solar into a more reliable power source beyond just sunny periods. The analysis concludes that with electricity demand accelerating, solar power has the potential to meet all future demand growth and more.",
    "chinese_title": "2025年美国电力需求激增——太阳能满足了其中61%的需求。",
    "chinese_summary": "2025年，美国电力需求大幅增长135太瓦时，增幅达3.1%。根据Ember的分析，太阳能是满足这一激增需求的核心，占新增需求的61%。太阳能发电量本身创纪录地增加了83太瓦时，较前一年增长27%。\n\n在需求增长最快的地区，如德克萨斯州和中西部，太阳能的贡献尤为关键，满足了81%的新增需求。在东部时间白天时段（上午10点至下午6点），仅太阳能发电量的增长就完全覆盖了电力需求的全部增幅。\n\n太阳能发挥效用的一个关键因素是电池储能的快速扩张，这使得太阳能得以更灵活地利用，包括在晚间时段。这一转变正使太阳能超越阳光充足时段，成为更可靠的电力来源。分析总结指出，随着电力需求加速增长，太阳能有潜力满足未来全部乃至更多的需求增长。"
  },
  {
    "id": "46656759",
    "title": "Show HN: I built a tool to assist AI agents to know when a PR is good to go",
    "url": "https://dsifry.github.io/goodtogo/",
    "summary": "**Good To Go** is a tool designed to solve a key problem in AI-assisted software development: AI coding agents cannot reliably determine when a pull request (PR) is ready to merge. Currently, agents waste time and resources by endlessly polling for status updates, misinterpreting feedback, or asking developers for constant confirmation.\n\nThe tool provides a single, deterministic command (`gtg <PR_number>`) that analyzes a PR and returns one of four clear statuses: **READY** (merge), **ACTION_REQUIRED** (fix comments), **UNRESOLVED_THREADS** (resolve discussions), or **CI_FAILING** (fix build). It eliminates ambiguity by aggregating CI statuses from all checks and intelligently classifying review comments—distinguishing between critical, actionable feedback and non-blocking suggestions from tools like CodeRabbit or Claude.\n\nBuilt specifically for AI agents, **Good To Go** outputs structured JSON with actionable items, supports state persistence across sessions, and offers both AI-friendly and shell-script-friendly exit codes. Use cases include acting as a CI gate, guiding agent workflows, and automating PR monitoring. The tool prioritizes determinism, actionable insights, and an agent-first design. It is available via PyPI and open source on GitHub.",
    "chinese_title": "Show HN：我开发了一个工具，帮助AI代理判断何时可以合并PR",
    "chinese_summary": "**Good To Go** 是一款旨在解决AI辅助软件开发中关键问题的工具：AI编码代理无法可靠判断何时可以合并拉取请求（PR）。目前，代理会因无休止轮询状态更新、误解反馈或不断向开发者寻求确认而浪费时间和资源。\n\n该工具提供单一确定性命令（`gtg <PR编号>`），可分析PR并返回四种明确状态之一：**就绪**（可合并）、**需处理**（修复评论）、**未解决讨论**（需解决讨论）或**持续集成失败**（需修复构建）。它通过汇总所有检查的CI状态并智能分类评审评论——区分来自CodeRabbit或Claude等工具的关键可操作反馈与非阻塞建议——从而消除歧义。\n\n专为AI代理设计的**Good To Go**输出结构化JSON（含可操作项），支持跨会话状态持久化，并提供同时适配AI与Shell脚本的退出码。其用例包括作为CI关卡、指导代理工作流及自动化PR监控。该工具优先考虑确定性、可操作性见解及代理优先的设计理念，现已通过PyPI发布并在GitHub开源。"
  },
  {
    "id": "46656998",
    "title": "PCs refuse to shut down after Microsoft patch",
    "url": "https://www.theregister.com/2026/01/16/patch_tuesday_secure_launch_bug_no_shutdown/",
    "summary": "**Summary:**\n\nA Microsoft Patch Tuesday update for January 2026 has caused a significant bug affecting some Windows 11 23H2 systems. After installing the security patches, these PCs refuse to shut down, restart, or hibernate properly. Instead of powering off, the machines remain on, leading to potential battery drain.\n\nMicrosoft has confirmed the issue is linked to **Secure Launch**, a virtualization-based security feature. The company states that while the standard shutdown process fails, using the command prompt command `shutdown /s /t 0` will force the PC to turn off. No permanent fix is yet available; Microsoft only promises a resolution in a future update and advises users to manually shut down to prevent batteries from depleting.\n\nThis is not the only problem introduced by the January updates. Microsoft has also acknowledged a separate issue causing classic Outlook POP accounts to hang or freeze, describing it as an \"emerging issue\" still under investigation.\n\nThe situation highlights a recurring problem where critical security patches inadvertently introduce disruptive side effects, forcing users and administrators to choose between security and system stability while awaiting further fixes.",
    "chinese_title": "微软补丁后电脑无法关机",
    "chinese_summary": "**摘要：**\n\n微软2026年1月的“补丁星期二”更新引发了一个严重漏洞，影响部分Windows 11 23H2系统。安装安全补丁后，这些电脑无法正常关机、重启或休眠。机器不会断电，而是保持运行状态，可能导致电池耗尽。\n\n微软已确认该问题与基于虚拟化的安全功能**安全启动**有关。公司表示，虽然标准关机流程失效，但使用命令提示符命令`shutdown /s /t 0`可强制关闭电脑。目前尚无永久修复方案；微软仅承诺在后续更新中解决此问题，并建议用户手动关机以防电池耗尽。\n\n这并非一月份更新带来的唯一问题。微软还承认了另一个独立问题，导致经典Outlook POP账户卡死或冻结，称其为“新出现的问题”，仍在调查中。\n\n这一情况突显了一个反复出现的问题：关键安全补丁无意中引入破坏性副作用，迫使用户和管理员在等待进一步修复时，不得不在安全性与系统稳定性之间做出选择。"
  }
]