[
  {
    "id": "46720395",
    "title": "GPTZero finds 100 new hallucinations in NeurIPS 2025 accepted papers",
    "url": "https://gptzero.me/news/neurips/",
    "summary": "GPTZero, an AI detection company, used its Hallucination Check tool to scan 4,841 papers accepted by the NeurIPS 2025 conference. It discovered **100 confirmed hallucinated citations** across **51 different papers**. These fabricated or inaccurate references were missed by the peer reviewers who evaluated each submission.\n\nThe article frames this as a systemic problem caused by a **\"tsunami\" of AI-generated submissions**, which has overwhelmed the review processes of top AI conferences. NeurIPS submissions grew over 220% from 2020 to 2025, straining reviewer capacity and oversight.\n\nThe findings reveal a critical vulnerability in academic peer review, where AI-generated content, including fake citations, can slip through. This is particularly concerning as NeurIPS policy considers hallucinated citations grounds for rejection. The article includes a table of examples, showing fabricated authors, titles, and non-existent DOIs or publication details in the accepted papers.",
    "chinese_title": "GPTZero在NeurIPS 2025录用论文中发现100处新幻觉",
    "chinese_summary": "GPTZero公司使用其幻觉检测工具扫描了NeurIPS 2025会议接受的4,841篇论文，发现**51篇不同论文**中存在**100处已确认的幻觉引用**。这些捏造或不准确的参考文献均被评审每篇投稿的同行评议人员遗漏。\n\n文章将此现象归因于**AI生成投稿的\"海啸\"**所引发的系统性问题——这股浪潮已使顶级AI会议的评审流程不堪重负。2020年至2025年间，NeurIPS投稿量增长超过220%，严重消耗了评审人员的精力和监督能力。\n\n研究结果揭示了学术同行评议的关键漏洞：包括虚假引用在内的AI生成内容可能蒙混过关。这尤其令人担忧，因为NeurIPS政策明确将幻觉引用视为拒稿依据。文章附有示例表格，展示了被接受论文中虚构的作者、标题以及不存在的DOI或出版信息。"
  },
  {
    "id": "46723990",
    "title": "Why does SSH send 100 packets per keystroke?",
    "url": "https://eieio.games/blog/ssh-sends-100-packets-per-keystroke/",
    "summary": "The author discovered that SSH sends around 100 small (36-byte) packets for a single keystroke, drastically increasing CPU and bandwidth usage in their high-performance game running over SSH. This was traced to a 2023 SSH feature called \"keystroke timing obfuscation,\" which sends \"chaff\" packets to mask typing patterns for privacy.\n\nWhile this feature is beneficial for secure sessions, it created significant overhead for the latency-sensitive game. The author found a client-side fix (`ObscureKeystrokeTiming=no`) but needed a server-side solution. By examining the Go SSH library, they identified that the chaff packets are `SSH2_MSG_PING` messages triggered by a server-advertised extension (`[email protected]`). Forking and patching the library to disable this advertisement reduced CPU usage by over 60% and bandwidth by more than half.\n\nThe article highlights how a default security feature can have unintended performance consequences in non-standard use cases and demonstrates effective debugging using network analysis tools and LLM assistance to navigate and modify complex codebases.",
    "chinese_title": "为什么SSH每按一次键就会发送100个数据包？",
    "chinese_summary": "作者发现，SSH在每次击键时会发送约100个小型（36字节）数据包，这导致其通过SSH运行的高性能游戏的CPU和带宽使用量急剧增加。经追踪，此问题源于2023年SSH的一项名为“击键时序混淆”的功能，该功能通过发送“干扰”数据包来掩盖输入模式以保护隐私。\n\n虽然此功能对安全会话有益，但它给延迟敏感的游戏带来了显著的开销。作者找到了客户端解决方案（`ObscureKeystrokeTiming=no`），但仍需服务器端修复。通过研究Go SSH库，他们发现干扰数据包是由服务器通告的扩展（`[email protected]`）触发的`SSH2_MSG_PING`消息。通过分叉并修改该库以禁用此通告，CPU使用率降低了60%以上，带宽消耗减少了一半以上。\n\n本文强调了一项默认安全功能如何在非标准使用场景中引发意外的性能问题，并展示了如何利用网络分析工具和LLM辅助进行有效调试，以导航和修改复杂代码库。"
  },
  {
    "id": "46721802",
    "title": "Show HN: isometric.nyc – giant isometric pixel art map of NYC",
    "url": "https://cannoneyed.com/isometric-nyc/",
    "summary": "**Summary:**\n\n\"Isometric.nyc\" is a digital art project presenting a massive, interactive, isometric pixel art map of New York City. The creator has meticulously recreated the city's iconic skyline, landmarks, and street grid in a charming, low-resolution 3D style.\n\nKey features of the project include:\n*   **Scale & Detail:** It encompasses a large portion of Manhattan, from the Financial District up to Central Park, featuring buildings, bridges, parks, and major sites like the Empire State Building and One World Trade Center.\n*   **Interactivity:** Users can pan and zoom across the map to explore different neighborhoods.\n*   **Artistic Style:** The map uses a consistent isometric perspective and a limited color palette to achieve a cohesive, retro video game or model kit aesthetic.\n*   **Technical Execution:** The project is built for the web, showcasing a significant technical and artistic undertaking in pixel art and digital cartography.\n\nThe primary purpose is artistic celebration and exploration, offering a unique, stylized, and navigable love letter to the architecture and layout of New York City.",
    "chinese_title": "展示HN：isometric.nyc——纽约市巨型等距像素艺术地图",
    "chinese_summary": "**摘要：**\n\n\"Isometric.nyc\" 是一个数字艺术项目，呈现了一幅巨大的、可交互的纽约市等距像素艺术地图。创作者以迷人的低分辨率3D风格，精心重现了这座城市标志性的天际线、地标和街道网格。\n\n该项目的主要特点包括：\n*   **规模与细节：** 涵盖了曼哈顿的大部分区域，从金融区到中央公园，包含建筑物、桥梁、公园以及帝国大厦和世界贸易中心一号楼等主要地标。\n*   **交互性：** 用户可以平移和缩放地图，探索不同的街区。\n*   **艺术风格：** 地图采用一致的等距视角和有限的色彩搭配，形成了一种统一的、复古电子游戏或模型套件的美学风格。\n*   **技术实现：** 该项目为网页构建，展示了在像素艺术和数字制图领域一项重要的技术与艺术成就。\n\n其主要目的是艺术性的致敬与探索，为纽约市的建筑与布局提供了一封独特、风格化且可导航的“情书”。"
  },
  {
    "id": "46721179",
    "title": "It looks like the status/need-triage label was removed",
    "url": "https://github.com/google-gemini/gemini-cli/issues/16728",
    "summary": "This GitHub issue (#16728) requests that Google's Gemini CLI tool add native detection for JetBrains IDEs (like IntelliJ IDEA or PyCharm). Currently, the CLI only recognizes environments like VS Code, forcing JetBrains users to rely on a third-party plugin that spoofs VS Code's environment variables to enable integration features.\n\nThe user, SoLoHiCo, argues this change is necessary because the existing process-based detection method is unreliable on Windows and Linux, preventing the CLI from discovering and connecting to the IDE. The proposed solution is to update the tool's internal definitions to recognize the `TERMINAL_EMULATOR=JetBrains-JediTerm` environment variable as a first-class, supported IDE environment.\n\nThe issue is labeled as a \"Feature\" and was in a \"need-triage\" status, awaiting review by the project's automation or maintainers.",
    "chinese_title": "看起来状态/需分类标签已被移除",
    "chinese_summary": "该GitHub议题（#16728）请求谷歌的Gemini CLI工具增加对JetBrains IDE（如IntelliJ IDEA或PyCharm）的原生检测支持。目前，该CLI仅能识别VS Code等环境，导致JetBrains用户不得不依赖第三方插件来模拟VS Code的环境变量，以启用集成功能。\n\n用户SoLoHiCo认为这一变更是必要的，因为现有的基于进程的检测方法在Windows和Linux上不可靠，阻碍了CLI发现并连接到IDE。建议的解决方案是更新工具的内部定义，将`TERMINAL_EMULATOR=JetBrains-JediTerm`环境变量识别为一类受支持的IDE环境。\n\n该议题被标记为“功能请求”，目前处于“待分类”状态，等待项目自动化系统或维护者的审查。"
  },
  {
    "id": "46719229",
    "title": "Qwen3-TTS Family Is Now Open Sourced: Voice Design, Clone, and Generation",
    "url": "https://qwen.ai/blog?id=qwen3tts-0115",
    "summary": "Alibaba's Qwen team has open-sourced its Qwen3-TTS family of text-to-speech models. This release includes several specialized models: a base model for general use, a voice cloning model that can replicate a speaker's voice from a short audio sample, and a voice design model that allows for fine-grained control over speech characteristics like timbre, speed, and emotion.\n\nKey features highlighted are high audio quality, natural prosody, and robust performance across multiple languages, including English and Chinese. The models are designed to be efficient and are available in various sizes to accommodate different hardware and latency requirements.\n\nBy open-sourcing these models, the team aims to foster innovation in the TTS field, allowing researchers and developers to build upon the technology for applications in content creation, assistive technologies, and more. The release includes model weights and code, making advanced voice synthesis more accessible to the wider community.",
    "chinese_title": "Qwen3-TTS家族现已开源：语音设计、克隆与生成",
    "chinese_summary": "阿里巴巴的Qwen团队开源了其Qwen3-TTS系列文本转语音模型。此次发布包含多个专用模型：一个通用基础模型，一个可通过短音频样本复制说话者声音的语音克隆模型，以及一个允许对音色、语速和情感等语音特征进行细粒度控制的语音设计模型。\n\n该系列模型的核心特性包括高音质、自然的韵律，以及在英语和中文等多种语言中表现稳定的性能。这些模型设计高效，提供多种规模版本以适应不同硬件和延迟需求。\n\n通过开源这些模型，团队旨在推动TTS领域的技术创新，让研究者和开发者能够基于该技术构建内容创作、辅助工具等应用。此次发布包含模型权重和代码，使更广泛的社区能够更便捷地使用先进的语音合成技术。"
  },
  {
    "id": "46722570",
    "title": "CSS Optical Illusions",
    "url": "https://alvaromontoro.com/blog/68091/css-optical-illusions",
    "summary": "This article showcases a collection of 41 optical illusions created using CSS, demonstrating how visual tricks can be coded for the web. The illusions are grouped into static and animated categories, each exploiting different perceptual phenomena.\n\nKey static illusions include the **Poggendorff illusion** (misaligned diagonal lines), **White's illusion** (identical grays appearing different), and **Adelson's checkerboard** (same-colored tiles looking distinct). Others, like the **Kanizsa Square** and **Ehrenstein's illusion**, show how the brain perceives shapes that aren't physically drawn. A notable section features static images that create a powerful sense of motion, such as the **Expanding Hole** and **Rotating Snakes**.\n\nThe animated illusions use motion to create perceptual distortions. Examples include the **Animated Ebbinghaus illusion** (a static circle appearing to change size) and the **Reverse Spoke Illusion** (static spokes seeming to spin opposite a moving background).\n\nThroughout, the author explains the CSS techniques used—like gradients, pseudo-elements, and blend modes—to build each effect efficiently, often crediting inspiration from other developers. The article serves as both a visual gallery and a technical resource for recreating these classic perceptual tricks with code.",
    "chinese_title": "CSS视觉错觉",
    "chinese_summary": "本文展示了41个使用CSS创作的光学幻觉效果合集，演示了如何通过代码为网页实现视觉戏法。这些幻觉分为静态与动态两类，分别利用了不同的感知现象。\n\n静态幻觉的代表包括**波根多夫错觉**（错位的对角线）、**怀特错觉**（相同的灰色呈现差异）和**阿德尔森棋盘格**（同色方块看似不同）。其他如**卡尼萨正方形**与**艾伦斯坦错觉**，则展示了大脑如何感知未被实际绘制的形状。值得注意的是一组能产生强烈动感的静态图像，例如**扩张黑洞**与**旋转的蛇**。\n\n动态幻觉通过运动制造感知扭曲，例如**动态艾宾浩斯错觉**（静态圆形看似改变大小）和**反向辐条错觉**（静态辐条在运动背景衬托下仿佛反向旋转）。\n\n作者全程解析了实现每个效果所用的CSS技巧——如渐变、伪元素和混合模式，并常提及其他开发者的灵感启发。本文既是视觉画廊，也是通过代码复现这些经典感知魔术的技术指南。"
  },
  {
    "id": "46719899",
    "title": "Tree-sitter vs. Language Servers",
    "url": "https://lambdaland.org/posts/2026-01-21_tree-sitter_vs_lsp/",
    "summary": "This article explains the practical differences between Tree-sitter and Language Servers (LSP).\n\n**Tree-sitter** is a fast, error-tolerant parser generator primarily used for **syntax highlighting** in text editors. Its key advantage is maintaining accurate highlighting even when code is syntactically incomplete during editing, unlike older regex-based systems. It also allows querying the parsed syntax tree for more robust text analysis.\n\nA **Language Server** is a separate program that provides deep **semantic analysis** of code, such as finding definitions, offering completions, and checking types. It communicates with any text editor via the standardized **Language Server Protocol (LSP)**, solving the problem of building editor support separately for each language.\n\nWhile Tree-sitter handles syntax (structure), a Language Server understands semantics (meaning). The author notes that Language Servers can also provide syntax highlighting, sometimes with extra semantic detail—like highlighting mutable variables in Rust—though it may be slower than Tree-sitter.\n\nThe article concludes with a personal note affirming the content was written by a human, emphasizing the value of genuine understanding over AI-generated text.",
    "chinese_title": "Tree-sitter 与语言服务器",
    "chinese_summary": "本文阐述了Tree-sitter与语言服务器（LSP）之间的实际差异。\n\n**Tree-sitter**是一种快速且容错的解析器生成器，主要用于文本编辑器中的**语法高亮**。其关键优势在于，即使在编辑时代码语法不完整，也能保持准确的高亮显示，这与传统的基于正则表达式的系统不同。它还允许查询解析后的语法树，以实现更稳健的文本分析。\n\n**语言服务器**是一个独立的程序，提供对代码的深度**语义分析**，例如查找定义、提供补全和检查类型。它通过标准化的**语言服务器协议（LSP）**与任何文本编辑器通信，解决了为每种语言单独构建编辑器支持的问题。\n\nTree-sitter处理语法（结构），而语言服务器理解语义（含义）。作者指出，语言服务器也可以提供语法高亮，有时会带有额外的语义细节——例如在Rust中高亮可变变量——尽管其速度可能比Tree-sitter慢。\n\n文章最后附有个人说明，确认内容由人类撰写，强调真实理解相对于AI生成文本的价值。"
  },
  {
    "id": "46723384",
    "title": "I was banned from Claude for scaffolding a Claude.md file?",
    "url": "https://hugodaniel.com/posts/claude-code-banned-me/",
    "summary": "**Summary of \"I was banned from Claude for scaffolding a Claude.md file?\"**\n\nThe author, Hugo Daniel, details his unexpected and permanent ban from Anthropic's Claude AI assistant. The ban occurred after he used Claude to help create a `claude.md` file—a simple markdown document intended as a personal guide or \"scaffold\" for structuring future interactions with the AI.\n\nThe core of the incident is a conflict between the user's intent and the AI's content policy. When Hugo asked Claude to generate text for this file that would \"jailbreak\" or override its own system prompts and safety guidelines, Claude correctly refused, citing its ethical guidelines. Hugo clarifies that his goal was not to create an actual jailbreak but to build a meta-tool for better organizing his legitimate work (like coding and writing). He argues the file was a conceptual experiment, not a functional exploit.\n\nDespite his explanations and appeals, Anthropic upheld the ban without specific recourse. The author concludes that the ban resulted from a misunderstanding where his attempt to create a productivity \"wrapper\" was misinterpreted as a malicious attempt to circumvent safety protocols. He expresses frustration that using the AI's own name in a filename (`claude.md`) and discussing its internal mechanisms in a theoretical way triggered an irreversible enforcement action, highlighting a potential gap between user creativity and automated policy enforcement.",
    "chinese_title": "我因为搭建了一个Claude.md文件就被封禁了？",
    "chinese_summary": "**《因创建Claude.md文件遭封禁始末》摘要**\n\n作者雨果·丹尼尔详述了其意外遭Anthropic公司Claude AI助手永久封禁的经历。封禁发生在他使用Claude协助创建`claude.md`文件之后——该文件仅为简单的Markdown文档，旨在作为个人使用指南或\"框架\"，用于规划未来与AI的互动结构。\n\n事件核心在于用户意图与AI内容政策之间的冲突。当雨果要求Claude生成\"越狱\"或覆盖其自身系统提示与安全准则的文本时，Claude依据伦理准则予以拒绝。雨果澄清其目的并非真正越狱，而是构建一个用于更好组织合法工作（如编程与写作）的元工具，强调该文件仅是概念性实验，而非功能性漏洞利用。\n\n尽管作者多次解释申诉，Anthropic仍维持封禁决定且未提供具体申诉渠道。作者总结认为，封禁源于双方误解：其创建生产力\"封装工具\"的尝试被误判为恶意规避安全协议的行为。他对此感到沮丧——仅因文件名含AI名称（`claude.md`）及以理论方式探讨其内部机制，便触发不可逆的封禁措施，这暴露出用户创意与自动化政策执行之间可能存在的认知鸿沟。"
  },
  {
    "id": "46722853",
    "title": "Recent discoveries on the acquisition of the highest levels of human performance",
    "url": "https://www.science.org/doi/abs/10.1126/science.adt7790",
    "summary": "Unable to access the article link.",
    "chinese_title": "关于人类最高水平表现获得的最新发现",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46712547",
    "title": "Mote: An Interactive Ecosystem Simulation [video]",
    "url": "https://www.youtube.com/watch?v=Hju0H3NHxVI",
    "summary": "This text is not a summary of the video \"Mote: An Interactive Ecosystem Simulation.\" Instead, it is the standard legal and informational footer commonly found at the bottom of YouTube web pages.\n\nThe content consists entirely of:\n*   Links to YouTube's corporate policies (Terms, Privacy, Safety).\n*   Copyright information (© 2026 Google LLC).\n*   Business contact details and addresses for YouTube/Google.\n*   A legal disclaimer stating that products featured in videos are sold by third-party merchants, not by YouTube.\n*   Administrative information like the CEO's name and a contact for reporting illegally filmed content.\n\n**There is no information about the video's actual content, such as what the \"Mote\" simulation is, how it works, or what its educational or interactive features might be.** To summarize the video, the provided transcript or description of the video itself would be needed.",
    "chinese_title": "Mote：一个交互式生态系统模拟 [视频]",
    "chinese_summary": "本文字并非视频《Mote：互动生态系统模拟》的内容摘要，而是YouTube网页底部常见的标准法律与信息页脚。\n\n其内容完全包含：\n*   YouTube公司政策链接（服务条款、隐私权、安全中心）。\n*   版权信息（© 2026 Google LLC）。\n*   YouTube/Google的业务联系详情与地址。\n*   法律免责声明，指出视频中展示的产品由第三方商家销售，非YouTube出售。\n*   行政信息，如首席执行官姓名及举报非法拍摄内容的联系方式。\n\n**此处不包含任何关于视频实际内容的信息，例如“Mote”模拟是什么、其运作原理或可能具有的教育及互动功能。** 若要总结该视频，需要视频本身的转录文本或描述。"
  },
  {
    "id": "46718061",
    "title": "Design Thinking Books (2024)",
    "url": "https://www.designorate.com/design-thinking-books/",
    "summary": "This article critiques the oversimplified, commercialized promotion of design thinking and argues that true creative innovation stems from understanding its foundational principles, not just following a five-step process. It presents an updated 2024 list of essential books and papers that explore the core philosophy and practice of design.\n\nKey recommendations include works by Kees Dorst and Nigel Cross, which examine the nature of design expertise and how designers think. Tim Brown’s *Change by Design* explains design thinking’s organizational value, while Don Norman’s *The Design of Everyday Things* delves into the psychology of user experience. The list also highlights seminal theoretical works: Herbert Simon’s *The Science of Artificial*, which explores human problem-solving heuristics, and Richard Buchanan’s paper on “wicked problems,” which defines the complex, evolving nature of design challenges.\n\nThe author emphasizes that these resources do not offer toolkits but instead provide the critical understanding needed to effectively apply any design thinking methodology, bridging the gap between superficial training and genuine, impactful practice.",
    "chinese_title": "设计思维书籍（2024）",
    "chinese_summary": "本文批判了设计思维被过度简化与商业化的推广现象，并指出真正的创造性创新源于理解其核心理念，而非仅仅遵循五步流程。文章呈现了一份2024年更新的核心书单与文献，深入探讨设计哲学与实践。\n\n重点推荐包括凯斯·多斯特与奈杰尔·克罗斯的著作，他们剖析了设计专业能力的本质及设计师的思维方式。蒂姆·布朗的《设计改变一切》阐释了设计思维在组织中的价值，而唐纳德·诺曼的《设计心理学》则深入探讨了用户体验的心理机制。书单同时收录了里程碑式的理论著作：赫伯特·西蒙的《人工科学》探索了人类解决问题的启发式方法，理查德·布坎南关于“棘手问题”的论文则界定了设计挑战复杂且动态演变的本质。\n\n作者强调，这些资源并非提供工具包，而是为有效运用任何设计思维方法奠定关键认知基础，从而弥合浮于表面的培训与真正具有影响力的实践之间的鸿沟。"
  },
  {
    "id": "46721933",
    "title": "Launch HN: Constellation Space (YC W26) – AI for satellite mission assurance",
    "url": "https://constellation-io.com/",
    "summary": "Constellation Space offers an AI-powered platform, ConstellationOS, designed to predict and prevent satellite communication link failures. The system ingests real-time telemetry data from satellites, ground stations, and environmental sensors at a rate of over 100,000 messages per second.\n\nUsing AI models, it analyzes this data to identify failure patterns minutes to hours in advance, with a claimed accuracy of over 90% and configurable prediction timeframes. When a potential failure is predicted, the platform autonomously executes actions like handoffs between ground stations in under two seconds to maintain connectivity, aiming for zero data loss without human intervention.\n\nThe company promotes the platform's ability to provide predictive mission assurance, potentially reducing downtime and saving costs for satellite constellation operators. They offer live demos to showcase real-time failure prediction and provide ROI analyses for prospective customers.",
    "chinese_title": "发布HN：星座空间（YC W26）——用于卫星任务保障的人工智能",
    "chinese_summary": "星座空间公司推出了一款名为ConstellationOS的人工智能驱动平台，旨在预测并防止卫星通信链路故障。该系统每秒可接收来自卫星、地面站和环境传感器的实时遥测数据超过10万条。\n\n通过人工智能模型，平台分析这些数据以提前数分钟至数小时识别故障模式，据称准确率超过90%，且预测时间范围可配置。当预测到潜在故障时，平台能在两秒内自动执行如地面站间切换等操作以维持连接，力求在无需人工干预的情况下实现零数据丢失。\n\n该公司强调该平台能够提供预测性任务保障，有望减少卫星星座运营商的停机时间并节约成本。他们提供实时演示以展示故障预测功能，并为潜在客户提供投资回报分析。"
  },
  {
    "id": "46721897",
    "title": "AnswerThis (YC F25) Is Hiring",
    "url": "https://www.ycombinator.com/companies/answerthis/jobs/r5VHmSC-ai-agent-orchestration",
    "summary": "**AnswerThis (YC F25) is hiring for roles in AI agent orchestration.** The company, part of Y Combinator's upcoming winter 2025 batch, is building technology to coordinate multiple specialized AI agents to work together on complex tasks. The core mission is to move beyond single, general-purpose AI models toward a system where different agents, each with specific capabilities, can be dynamically managed to provide more reliable, accurate, and efficient outcomes.\n\nThe job post indicates the company is in an early, high-growth stage, seeking talent to help develop its foundational platform. While specific open roles are not listed in this snippet, the focus on \"orchestration\" suggests needs in software engineering, systems design, and machine learning to create the infrastructure that manages agent workflows, communication, and task execution.\n\nKey takeaways are that AnswerThis is a newly funded startup in the competitive AI space, operating in the emerging field of multi-agent systems. Joining now represents an opportunity to get in at the ground level of a YC-backed company aiming to solve the next layer of complexity in applied AI.",
    "chinese_title": "AnswerThis（YC F25）正在招聘",
    "chinese_summary": "**AnswerThis（YC F25）正在招聘AI智能体编排相关职位。** 该公司隶属于Y Combinator 2025年冬季孵化批次，致力于开发协调多个专用AI智能体共同处理复杂任务的技术。其核心使命是超越单一通用AI模型，构建一个能动态管理各具特长的智能体的系统，以提供更可靠、精准和高效的结果。\n\n招聘信息显示该公司处于早期高速增长阶段，正寻求人才协助开发其基础平台。虽然此片段未列出具体空缺职位，但对“编排”的聚焦表明其需求涉及软件工程、系统设计和机器学习等领域，以构建管理智能体工作流、通信和任务执行的基础设施。\n\n关键信息是：AnswerThis是竞争激烈的AI领域中新近获得融资的初创企业，专注于新兴的多智能体系统方向。此时加入意味着有机会进入一家YC支持的公司的基层，共同致力于解决应用AI中更深层次的复杂性问题。"
  },
  {
    "id": "46669001",
    "title": "Keeping 20k GPUs Healthy",
    "url": "https://modal.com/blog/gpu-health",
    "summary": "This article details Modal's system for ensuring the reliability of its large-scale, multi-cloud GPU fleet, which has scaled to over 20,000 concurrent GPUs. The authors explain that at this scale, significant GPU reliability issues are inevitable, and they share their multi-layered approach to manage them.\n\nThe process begins with rigorous **instance testing and selection**, where they benchmark performance and reliability across cloud providers, applying internal price adjustments to account for discovered flaws like thermal throttling or memory errors. They then ensure **machine image consistency and freshness**, baking GPU health tests into the image build phase to catch problems early.\n\nDuring **instance boot**, they perform light checks to avoid adding latency, balancing speed with the need to catch immediate hardware failures. Once in production, **continuous healthchecking** is key: passive monitoring (e.g., checking system logs for errors) catches most issues, while weekly active tests (like stress tests and interconnect validation) provide deeper assurance.\n\nWhen problems are detected, Modal typically **drains and replaces the entire host** rather than attempting complex GPU resets. They provide **observability** through dashboard metrics and logs, and back it up with responsive **support** channels for edge cases.\n\nThe article concludes by emphasizing that GPU unreliability remains a major hurdle in AI development, and Modal's comprehensive system is designed to shoulder this burden for its customers.",
    "chinese_title": "保持两万块GPU的健康运行",
    "chinese_summary": "本文详细介绍了Modal公司为确保其大规模、多云端GPU集群可靠性而建立的系统，该集群已扩展至超过20,000个并发GPU。作者指出，在此规模下，重大的GPU可靠性问题不可避免，并分享了他们应对这些问题的多层次策略。\n\n流程始于严格的**实例测试与筛选**：他们通过跨云服务商进行性能与可靠性基准测试，并根据发现的问题（如热节流或内存错误）进行内部价格调整。随后确保**机器镜像的一致性与时效性**，将GPU健康测试嵌入镜像构建阶段以尽早发现问题。\n\n在**实例启动阶段**，他们执行轻量检查以兼顾速度与及时捕获硬件故障的需求。进入生产环境后，**持续健康检查**成为关键：被动监控（如检查系统错误日志）可捕捉大多数问题，而每周的主动测试（如压力测试和互连验证）则提供更深层的保障。\n\n当检测到问题时，Modal通常选择**清空并替换整个主机**，而非尝试复杂的GPU重置。他们通过仪表盘指标和日志提供**可观测性**，并为边缘案例配备响应迅速的**支持**渠道。\n\n文章最后强调，GPU的不可靠性仍是AI开发的主要障碍，而Modal的这套综合系统正是为替客户承担这一负担而设计的。"
  },
  {
    "id": "46724542",
    "title": "Taming P99s in OpenFGA: How we built a self-tuning strategy planner",
    "url": "https://auth0.com/blog/self-tuning-strategy-planner-openfga/",
    "summary": "To reduce tail latency in its authorization system, OpenFGA developed a self-tuning planner that dynamically selects the optimal graph traversal strategy for each request. Recognizing that static rule-based selection was insufficient for varied and evolving data distributions, the team framed the problem as a Multi-Armed Bandit scenario, balancing exploration of new strategies with exploitation of known fast ones.\n\nThey implemented Thompson Sampling, a Bayesian method that models each strategy's performance as a probability distribution. This allows the system to quantify uncertainty, naturally exploring less-confident strategies while exploiting reliable ones. The planner continuously updates these distributions with real-time latency feedback, enabling it to adapt as customer data changes.\n\nKey to its success was encoding domain knowledge into the system's initial \"priors.\" Strategies proven to be fast and consistent were given high-confidence priors to encourage immediate exploitation, while general-purpose strategies were given weak priors to promote exploration. This setup allowed for rapid convergence on the best-performing algorithm for any given subgraph.\n\nDeployed in production on Auth0 FGA, the planner delivered significant performance gains, including a 98% reduction in P99 latency for some of the most complex models. It also validated that, for certain specific data distributions, the legacy algorithm remained optimal—a nuance that pre-deployment benchmarks had missed.",
    "chinese_title": "驯服OpenFGA中的P99：我们如何构建自调优策略规划器",
    "chinese_summary": "为降低授权系统的尾部延迟，OpenFGA开发了一种自调优规划器，能够为每个请求动态选择最优的图遍历策略。团队认识到基于静态规则的选择机制难以适应多样且不断变化的数据分布，因此将问题构建为多臂老虎机场景，在探索新策略与利用已知高效策略之间取得平衡。\n\n他们采用贝叶斯方法——汤普森采样，将每种策略的性能建模为概率分布。这使得系统能够量化不确定性，在自然探索置信度较低策略的同时，充分利用可靠策略。规划器通过实时延迟反馈持续更新这些分布，从而适应客户数据的变化。\n\n成功的关键在于将领域知识编码至系统初始“先验分布”中：对已验证快速稳定的策略赋予高置信先验以促进即时利用，而对通用策略则赋予弱先验以鼓励探索。这种设置使得系统能针对任意子图快速收敛至最优算法。\n\n该规划器已在Auth0 FGA的生产环境中部署，实现了显著的性能提升——部分最复杂模型的P99延迟降低98%。同时验证了针对特定数据分布，传统算法仍保持最优性，这一细微差别是部署前基准测试未能发现的。"
  },
  {
    "id": "46681309",
    "title": "Bootstrapping Bun",
    "url": "https://walters.app/blog/bootstrapping-bun",
    "summary": "This article details the author's successful effort to bootstrap the Bun JavaScript toolkit from source without using its pre-built binary, which is typically required for its own build process. The motivation stemmed from a desire to install OpenCode, an LLM-assisted coding tool that depends on Bun, on a system where neither was available as a trusted package.\n\nThe author identified that Bun's build scripts rely on Bun itself for three core functions: as a package manager, a TypeScript runtime, and a bundler. To replace these, they substituted `npm` for package management, used Node.js's native TypeScript support (with minor syntax adjustments), and employed `esbuild` for bundling. Significant challenges included patching the build system to use an upstream Zig compiler instead of Bun's forked version and debugging a cryptic JavaScriptCore error in the bundled builtin modules.\n\nUltimately, the author created a working, self-hosting build system and produced a functional Bun binary. They have submitted the changes as an RFC to the Bun maintainers for potential upstream integration and shared the bootstrapped build command in their public fork. The project underscores the value of building dependencies from source for greater trust and control.",
    "chinese_title": "自举Bun",
    "chinese_summary": "本文详细介绍了作者如何在不使用预构建二进制文件的情况下，从源代码成功引导构建Bun JavaScript工具包。通常情况下，Bun自身的构建过程需要依赖其预构建的二进制文件。作者的动机源于希望在一个既没有预装Bun、也没有可信安装包的系统上安装OpenCode——一个依赖Bun的LLM辅助编程工具。\n\n作者发现Bun的构建脚本依赖其自身实现三大核心功能：包管理器、TypeScript运行时和打包工具。为了替代这些功能，作者使用`npm`进行包管理，利用Node.js原生的TypeScript支持（仅需少量语法调整），并采用`esbuild`进行打包。构建过程中遇到的主要挑战包括：修改构建系统以使用上游Zig编译器替代Bun的定制版本，以及调试打包内置模块时出现的隐晦JavaScriptCore错误。\n\n最终，作者创建了一个可自我托管的构建系统，并生成了可运行的Bun二进制文件。作者已将相关修改以RFC形式提交给Bun维护团队，以期整合到上游代码库，并在其公开分支中分享了引导构建命令。该项目彰显了从源代码构建依赖项对于提升可信度与控制力的重要价值。"
  },
  {
    "id": "46663225",
    "title": "Vulnerable WhisperPair Devices – Hijack Bluetooth Accessories Using Fast Pair",
    "url": "https://whisperpair.eu/vulnerable-devices",
    "summary": "This article details a security vulnerability called \"WhisperPair\" that allows attackers to hijack Bluetooth accessories using the Fast Pair feature. It lists numerous popular headphone and earbud models, indicating which are vulnerable and which are not.\n\nKey vulnerable devices include several Sony models (WH-1000XM6, XM5, XM4, WF-1000XM5, WH-CH720N), Google's Pixel Buds Pro 2, OnePlus Nord Buds 3 Pro, and products from brands like Nothing, JBL, Xiaomi, Marshall, soundcore, and Jabra. Models marked as \"Not vulnerable\" include the Sonos Ace, certain Bose and Bang & Olufsen headphones, and some JBL and Jabra devices.\n\nThe author states that the full exploit code is not publicly released to prevent misuse but offers a private testing harness upon request to allow individuals or companies to check their own devices. The overall recommendation is for users to keep their devices updated to protect against such vulnerabilities, even if their specific model is not listed.",
    "chinese_title": "易受攻击的WhisperPair设备——利用快速配对劫持蓝牙配件",
    "chinese_summary": "本文详细阐述了一种名为“WhisperPair”的安全漏洞，该漏洞允许攻击者利用快速配对功能劫持蓝牙配件。文中列举了多款热门耳机型号，并标注了哪些设备存在漏洞、哪些不受影响。\n\n主要易受攻击的设备包括多款索尼型号（WH-1000XM6、XM5、XM4、WF-1000XM5、WH-CH720N）、谷歌Pixel Buds Pro 2、一加Nord Buds 3 Pro，以及Nothing、JBL、小米、Marshall、soundcore和Jabra等品牌的产品。标注为“未受影响”的型号包括Sonos Ace、部分Bose和Bang & Olufsen耳机，以及某些JBL和Jabra设备。\n\n作者声明，为防止恶意利用，完整的漏洞利用代码尚未公开，但可根据需求提供私有测试工具，供个人或企业检测自身设备。整体建议是用户应及时更新设备以防范此类漏洞，即使其特定型号未在列表中提及。"
  },
  {
    "id": "46723694",
    "title": "'Active' sitting is better for brain health: review of studies",
    "url": "https://www.sciencealert.com/not-all-sitting-is-equal-one-type-was-just-linked-to-better-brain-health",
    "summary": "A systematic review of 85 studies has found that not all sitting is equally harmful to brain health. The research distinguishes between 'active' sitting (e.g., reading, playing cards, using a computer) and 'passive' sitting (e.g., watching TV).\n\nActive sitting, which engages the brain, shows positive associations with cognitive functions like memory and executive function. In contrast, passive sitting is consistently linked to negative outcomes, including a higher risk of dementia.\n\nLed by researcher Paul Gardiner, the study suggests that everyday choices—like opting to read instead of watch television—can support long-term brain health. While exercise remains crucial, the findings indicate that mentally stimulating activities while seated are also beneficial.\n\nThe authors recommend that public health guidance move beyond simply advising people to \"sit less\" and instead encourage more engaging sedentary activities and regular short breaks to promote cognitive health.",
    "chinese_title": "“主动式”坐姿更有益大脑健康：研究综述",
    "chinese_summary": "一项对85项研究的系统回顾发现，并非所有久坐行为对大脑健康同样有害。该研究区分了“主动”久坐（如阅读、打牌、使用电脑）和“被动”久坐（如看电视）。\n\n需要大脑参与的主动久坐与记忆力、执行功能等认知功能呈正相关。相比之下，被动久坐则始终与负面结果相关，包括更高的痴呆症风险。\n\n由研究员保罗·加德纳主导的这项研究表明，日常选择——比如选择阅读而非看电视——有助于长期大脑健康。虽然锻炼仍然至关重要，但研究结果指出，久坐时进行益智活动同样有益。\n\n作者建议，公共卫生指导不应仅仅停留在建议人们“少坐”，而应鼓励更多有益的久坐活动及定期短暂休息，以促进认知健康。"
  },
  {
    "id": "46719491",
    "title": "In Europe, Wind and Solar Overtake Fossil Fuels",
    "url": "https://e360.yale.edu/digest/europe-wind-solar-fossil-fuels",
    "summary": "In 2025, wind and solar power collectively generated more electricity than fossil fuels in the European Union for the first time, according to an analysis by the think tank Ember. Renewables, led by a rapid expansion of solar energy, supplied 30% of the EU's power, while fossil fuels provided 29%. Including hydropower, renewables accounted for nearly half of all electricity generation.\n\nThe report highlights solar power's broad gains across all EU member states, with several countries deriving over 20% of their electricity from solar. Concurrently, coal power continues to decline, now accounting for less than 5% of generation in 19 countries, with Ireland and Finland closing their last coal plants in 2025.\n\nHowever, the transition faces challenges. Drought conditions reduced hydropower output, leading to a compensatory rise in natural gas generation. Analysts warn that continued reliance on imported gas creates economic vulnerability and drives up energy prices. A promising development is the growing use of cheap batteries to displace natural gas during evening peak demand periods when solar output drops, which could help stabilize the energy system and prices moving forward.",
    "chinese_title": "在欧洲，风能与太阳能已超越化石燃料。",
    "chinese_summary": "智库Ember的分析显示，2025年，风能和太阳能在欧盟的发电量首次超过化石燃料。以太阳能快速扩张为主导的可再生能源提供了欧盟30%的电力，而化石燃料占比为29%。若计入水电，可再生能源已占欧盟总发电量的近一半。\n\n报告强调太阳能已在所有欧盟成员国取得广泛增长，多个国家超20%的电力来自太阳能。与此同时，煤电持续衰退，目前在19个国家占比低于5%，爱尔兰和芬兰于2025年关停了最后一批煤电厂。\n\n然而能源转型仍面临挑战。干旱导致水力发电减少，天然气发电因此补偿性增长。分析人士警告，持续依赖进口天然气将带来经济脆弱性并推高能源价格。一个积极进展是，随着太阳能夜间发电量下降，廉价电池在晚高峰时段正逐步替代天然气发电，这有助于未来稳定能源系统与价格。"
  },
  {
    "id": "46717507",
    "title": "ISO PDF spec is getting Brotli – ~20 % smaller documents with no quality loss",
    "url": "https://pdfa.org/want-to-make-your-pdfs-20-smaller-for-free/",
    "summary": "The PDF specification is being updated to include Brotli compression, replacing the decades-old Deflate algorithm. This change, led by the PDF Association, promises to reduce PDF file sizes by 15–25% with no loss of quality, leveraging the same algorithm widely used for web traffic.\n\nThe article explains the technical implementation within the iText SDK. Reading Brotli-compressed PDFs is straightforward: iText embeds Google's pure Java decoder and integrates it into its existing filter system, allowing it to process `/BrotliDecode` streams automatically.\n\nCreating Brotli-compressed PDFs is more complex. iText had to introduce a new `IStreamCompressionStrategy` interface to decouple compression logic from its core. However, because Google's official Brotli encoder requires native (C++) code, the encoding capability is packaged as a separate, optional module. This module uses the `brotli4j` library, which handles the native dependencies, allowing developers to opt-in for smaller file sizes without forcing native code on all users.\n\nIn summary, the upgrade brings modern, efficient compression to PDFs. iText enables both reading and writing of these files, with encoding offered as an optional feature to avoid mandatory native dependencies, paving the way for widespread adoption of smaller PDFs.",
    "chinese_title": "ISO PDF规范将支持Brotli压缩——文档体积减少约20%且无损质量。",
    "chinese_summary": "PDF规范正在更新，以纳入Brotli压缩算法，取代已有数十年历史的Deflate算法。这一由PDF协会主导的变革，利用广泛用于网络流量的同一算法，有望在不损失质量的情况下将PDF文件大小减少15-25%。\n\n文章解释了iText SDK中的技术实现。读取Brotli压缩的PDF文件很简单：iText嵌入了谷歌的纯Java解码器，并将其集成到现有的过滤器系统中，使其能够自动处理`/BrotliDecode`流。\n\n创建Brotli压缩的PDF文件则更为复杂。iText不得不引入一个新的`IStreamCompressionStrategy`接口，以将压缩逻辑与其核心代码解耦。然而，由于谷歌官方的Brotli编码器需要原生（C++）代码，编码功能被打包为一个独立的可选模块。该模块使用`brotli4j`库来处理原生依赖，允许开发者选择更小的文件大小，而无需强制所有用户使用原生代码。\n\n总之，此次升级为PDF带来了现代高效的压缩技术。iText支持读取和写入这些文件，并将编码功能作为可选特性提供，以避免强制性的原生依赖，为更广泛采用更小的PDF文件铺平了道路。"
  },
  {
    "id": "46721474",
    "title": "Show HN: BrowserOS – \"Claude Cowork\" in the browser",
    "url": "https://github.com/browseros-ai/BrowserOS",
    "summary": "**BrowserOS** is an open-source, Chromium-based browser designed to run AI agents directly on your device, positioning itself as a privacy-focused alternative to services like ChatGPT Atlas and Perplexity Comet.\n\nIts key features include:\n*   **Privacy & Local Control:** It operates on a \"bring your own keys\" model for cloud AI APIs or supports local models via Ollama/LM Studio, ensuring user data and browsing history remain on the computer.\n*   **Familiar Interface:** It maintains Chrome's familiar look and supports Chrome extensions.\n*   **AI Automation:** It enables AI agents to automate browser tasks like data extraction and form filling directly within the browser.\n*   **MCP Server:** It can function as a Model Context Protocol server, allowing other AI coding tools (like claude-code) to control the browser.\n*   **Open Source:** It is fully open-source (AGPL-3.0 license), allowing community inspection, contribution, and forking.\n\nThe project argues that AI presents an opportunity to fundamentally reimagine the browser for automation, contrasting itself with Chrome (no AI features), Brave (distracted by other products), and closed-source or cloud-based alternatives that may use user data for training or ads.\n\nBrowserOS is available for download on macOS, Windows, and Linux, and the team actively seeks community involvement through bug reports, feature suggestions, and contributions.",
    "chinese_title": "展示HN：浏览器操作系统——浏览器中的“Claude协作”",
    "chinese_summary": "**BrowserOS** 是一款基于 Chromium 的开源浏览器，旨在直接在用户设备上运行 AI 智能体，定位为注重隐私的替代方案，可与 ChatGPT Atlas 和 Perplexity Comet 等服务媲美。\n\n其主要特点包括：\n*   **隐私与本地控制**：采用“自带密钥”模式连接云端 AI API，或通过 Ollama/LM Studio 支持本地模型，确保用户数据和浏览历史保留在本地计算机。\n*   **熟悉界面**：保持 Chrome 的熟悉外观，并支持 Chrome 扩展程序。\n*   **AI 自动化**：支持 AI 智能体直接在浏览器内自动化执行数据提取、表单填写等任务。\n*   **MCP 服务器**：可作为模型上下文协议服务器运行，允许其他 AI 编程工具（如 claude-code）控制浏览器。\n*   **开源**：完全开源（采用 AGPL-3.0 许可证），支持社区审查、贡献和分支开发。\n\n该项目认为，AI 为从根本上重新构想浏览器自动化提供了机遇，并对比了 Chrome（无 AI 功能）、Brave（精力分散于其他产品）以及可能使用用户数据进行训练或广告投放的闭源或云端替代方案。\n\nBrowserOS 支持 macOS、Windows 和 Linux 系统下载，团队积极寻求社区通过提交错误报告、功能建议和贡献代码等方式参与项目。"
  },
  {
    "id": "46723898",
    "title": "How LLM agents solve the table merging problem",
    "url": "https://futuresearch.ai/deep-merge-tutorial/",
    "summary": "This article explains how LLM agents can automate the complex task of merging data from multiple, often inconsistent, tables into a single unified dataset.\n\nTraditional methods require extensive manual mapping and cleaning. LLM agents, however, use a multi-step, reasoning-based approach. First, an agent analyzes the schemas of the source tables to understand their structure and semantics. It then identifies potential correspondences between columns, even when names differ (e.g., \"CustomerID\" vs. \"Cust_Num\").\n\nCrucially, the agent doesn't just match names; it uses its understanding of context to resolve conflicts in data formats, units, or categorical values. It can propose and execute a merging strategy (like a join or union), generate the necessary code (e.g., SQL or Python), and validate the results for consistency.\n\nThe core advantage is that LLM agents treat table merging as a flexible reasoning task rather than a rigid procedural one. They can handle \"fuzzy\" matches, infer relationships, and make judgment calls about how to best consolidate information, significantly reducing the manual effort and domain expertise previously required for this data integration challenge.",
    "chinese_title": "LLM代理如何解决表格合并问题",
    "chinese_summary": "本文阐述了LLM智能体如何将来自多个通常不一致的表格数据合并为统一数据集这一复杂任务实现自动化。\n\n传统方法需要大量人工映射与清洗工作，而LLM智能体采用基于推理的多步骤方法。首先，智能体分析源表的架构以理解其结构与语义，随后识别列之间的潜在对应关系——即使列名不同（例如\"CustomerID\"与\"Cust_Num\"）也能实现匹配。\n\n关键在于，智能体不仅匹配名称，更能运用语境理解能力解决数据格式、单位或分类值的冲突。它可以提出并执行合并策略（如连接或联合操作），生成必要代码（如SQL或Python），并对结果进行一致性验证。\n\n核心优势在于LLM智能体将表格合并视为灵活的推理任务而非僵化的流程操作。它们能够处理\"模糊\"匹配、推断关联关系，并就最佳信息整合方式做出判断决策，从而显著减少了以往数据整合所需的人工投入与领域专业知识。"
  },
  {
    "id": "46716469",
    "title": "30 Years of ReactOS",
    "url": "https://reactos.org/blogs/30yrs-of-ros/",
    "summary": "ReactOS, an open-source operating system designed to be binary-compatible with Windows, celebrates its 30th anniversary. The article traces its evolution from the stalled FreeWin95 project to its rebirth as ReactOS in 1996, targeting the Windows NT architecture.\n\nDevelopment was initially slow, culminating in the 2003 release of ReactOS 0.1.0, the first bootable version. The 0.2.x series (2003-2006) brought rapid progress, including a basic desktop, but was marred by a source code audit and contribution freeze due to concerns over leaked Windows code. The lengthy 0.3.x era (2006-2016) saw the addition of networking, a package manager, and the start of the x86_64 port, though development momentum slowed.\n\nThe current 0.4.x series (2016-present) introduced a more Windows-like graphical shell and kernel debugging support. While the 64-bit port is functional, it lacks full app compatibility. The project continues to advance with behind-the-scenes work on new drivers, UEFI support, and security features. The article concludes by emphasizing that ReactOS's future relies on community contributions through coding, testing, or donations.",
    "chinese_title": "ReactOS 30年历程",
    "chinese_summary": "ReactOS，一款旨在与Windows二进制兼容的开源操作系统，迎来了其30周年纪念。文章追溯了它从停滞的FreeWin95项目到1996年以ReactOS之名重生的历程，目标锁定Windows NT架构。\n\n开发初期进展缓慢，直至2003年发布首个可启动版本ReactOS 0.1.0。0.2.x系列（2003-2006年）带来了快速进展，包括基础桌面环境，但因涉及泄露的Windows代码问题，经历了源代码审计和贡献冻结的波折。漫长的0.3.x时代（2006-2016年）见证了网络功能、包管理器的加入以及x86_64移植的启动，但开发势头有所放缓。\n\n当前的0.4.x系列（2016年至今）引入了更接近Windows的图形化界面和内核调试支持。尽管64位移植已可运行，但尚未实现完整的应用程序兼容。项目持续推进，幕后工作包括新驱动程序开发、UEFI支持和安全功能增强。文章最后强调，ReactOS的未来依赖于社区通过编码、测试或捐款等方式的贡献。"
  },
  {
    "id": "46723183",
    "title": "Skill.md: An open standard for agent skills",
    "url": "https://www.mintlify.com/blog/skill-md",
    "summary": "**Summary of \"skill.md: An open standard for agent skills\"**\n\nThe article introduces `skill.md`, a new open standard designed to improve how AI coding agents interact with software products. It is a markdown file that provides agents with essential, up-to-date context—like best practices, capabilities, limitations, and \"gotchas\"—that is often scattered or omitted in human-focused documentation.\n\nKey points include:\n*   **Purpose:** AI agents struggle with large documentation sites and outdated training data. `skill.md` acts as a concise, always-current cheat sheet to dramatically improve the quality of code they generate.\n*   **Adoption:** The standard is supported by major platforms (Cloudflare, Vercel) and agents (Claude Code, Cursor). Mintlify now auto-generates this file for all documentation sites.\n*   **Content & Design:** The file should consolidate tribal knowledge for agents. The author recommends using decision tables for clear choices, setting explicit boundaries on what agents can configure, and including a \"gotchas\" section to prevent common errors.\n*   **Replacement:** `skill.md` supersedes the recently proposed `install.md` standard, as it combines both installation and usage guidance with broader industry momentum.\n*   **Call to Action:** Mintlify encourages users to customize their auto-generated `skill.md` file with their specific preferences to help train and improve their AI agent over time.",
    "chinese_title": "Skill.md：代理技能开放标准",
    "chinese_summary": "**《skill.md：智能体技能开放标准》摘要**\n\n本文介绍了 `skill.md`，一种旨在改进 AI 编程智能体与软件产品交互方式的新开放标准。它是一个 Markdown 文件，为智能体提供关键且最新的上下文信息——例如最佳实践、功能、限制和“常见陷阱”——这些信息在面向人类的文档中往往分散或被忽略。\n\n要点包括：\n*   **目的：** AI 智能体难以处理庞大的文档站点和过时的训练数据。`skill.md` 作为一个简洁、始终最新的速查表，可显著提高其生成代码的质量。\n*   **采用情况：** 该标准已获得主要平台（Cloudflare、Vercel）和智能体（Claude Code、Cursor）的支持。Mintlify 现已为所有文档站点自动生成此文件。\n*   **内容与设计：** 该文件应为智能体整合内部经验知识。作者建议使用决策表来明确选择，为智能体可配置的内容设定明确边界，并包含“常见陷阱”部分以防止常见错误。\n*   **替代：** `skill.md` 取代了近期提出的 `install.md` 标准，因为它结合了安装和使用指导，并获得了更广泛的行业推动力。\n*   **行动呼吁：** Mintlify 鼓励用户根据自身特定偏好自定义其自动生成的 `skill.md` 文件，以帮助长期训练和改进其 AI 智能体。"
  },
  {
    "id": "46659635",
    "title": "TTY and Buffering",
    "url": "https://mattrighetti.com/2026/01/12/tty-and-buffering",
    "summary": "This article explains how terminal (TTY) detection affects output buffering in programs. When a program's standard output (stdout) is connected to an interactive terminal (a TTY), it typically uses **line buffering**, flushing data immediately after each newline. However, when output is piped or redirected (a non-TTY environment), many systems switch to **full buffering**, where data is held until the buffer is full (often 4-8KB), causing delays.\n\nThe author illustrates this with a C program that prints lines with a delay. When run directly in a terminal, each line appears every second. When piped to `cat`, all output appears at once after five seconds. In contrast, Rust's standard library currently uses line buffering for both TTY and non-TTY contexts, resulting in consistent output timing regardless of the environment—a noted deviation from the ideal behavior.\n\nThe article highlights that **stderr** is usually unbuffered to ensure error messages appear immediately. It also shows how developers can manually flush buffers (e.g., using `flush()` in Rust) to force immediate output. Finally, it explains the practical importance of TTY detection, using the example of the `ripgrep` tool, which disables colored output in non-TTY environments to avoid messy ANSI escape codes in logs or files.",
    "chinese_title": "TTY与缓冲",
    "chinese_summary": "本文解释了终端（TTY）检测如何影响程序的输出缓冲。当程序的标准输出（stdout）连接到交互式终端（TTY）时，通常采用**行缓冲**，即在每个换行符后立即刷新数据。然而，当输出被管道传输或重定向（非TTY环境）时，许多系统会切换到**全缓冲**，数据会一直保留直到缓冲区填满（通常为4-8KB），从而导致延迟。\n\n作者通过一个C程序演示了这一点：该程序以延迟方式打印行内容。当直接在终端中运行时，每行内容每秒出现一次；当通过管道传输给`cat`时，所有输出在五秒后一次性出现。相比之下，Rust标准库目前在TTY和非TTY环境中均使用行缓冲，导致无论环境如何，输出时间都保持一致——这被认为是与理想行为的明显偏差。\n\n文章强调，**标准错误（stderr）**通常是无缓冲的，以确保错误信息能立即显示。同时展示了开发者如何手动刷新缓冲区（例如在Rust中使用`flush()`）来强制立即输出。最后，文章通过`ripgrep`工具的例子说明了TTY检测的实际重要性：该工具在非TTY环境中会禁用彩色输出，以避免日志或文件中出现杂乱的ANSI转义码。"
  },
  {
    "id": "46712678",
    "title": "Your brain on ChatGPT: Accumulation of cognitive debt when using an AI assistant",
    "url": "https://www.media.mit.edu/publications/your-brain-on-chatgpt/",
    "summary": "A study from MIT's Media Lab investigated the cognitive and behavioral effects of using AI assistants like ChatGPT for essay writing. Researchers compared three groups over multiple sessions: one using an LLM, one using a search engine, and one writing with no tools (\"Brain-only\").\n\nKey findings revealed significant costs associated with AI reliance:\n*   **Neural Impact:** EEG data showed that Brain-only writers had the strongest, most distributed brain connectivity. LLM users exhibited the weakest neural engagement, indicating lower cognitive load.\n*   **Cognitive \"Debt\":** When habitual LLM users were later asked to write without the tool, their brain activity (reduced alpha and beta connectivity) suggested under-engagement, as if they had accrued a \"cognitive debt.\"\n*   **Ownership and Recall:** The LLM group reported the lowest sense of ownership over their essays and struggled to accurately recall their own work, unlike the Brain-only group.\n*   **Essay Quality:** Linguistic analysis showed that essays written with LLM assistance were more homogeneous in style and structure within the group.\n\nThe study concludes that while LLMs offer convenience, their long-term use may undermine critical cognitive processes involved in writing and learning. The researchers raise concerns about the educational implications of AI reliance, suggesting it may come at a cost to deep thinking and knowledge integration.",
    "chinese_title": "你的大脑与ChatGPT：使用AI助手时认知债务的累积",
    "chinese_summary": "麻省理工学院媒体实验室的一项研究调查了使用ChatGPT等AI助手进行论文写作的认知与行为影响。研究人员在多个阶段比较了三组参与者：一组使用大语言模型，一组使用搜索引擎，另一组不使用任何工具（“纯大脑写作”）。\n\n关键发现揭示了依赖AI带来的显著代价：\n*   **神经影响：** 脑电图数据显示，纯大脑写作者的大脑连接性最强且分布最广。大语言模型用户的神经参与度最弱，表明其认知负荷较低。\n*   **认知“债务”：** 当习惯使用大语言模型的用户后来被要求不使用工具进行写作时，其大脑活动（α波和β波连接性降低）显示出参与不足，仿佛积累了“认知债务”。\n*   **所有权与回忆：** 与纯大脑组不同，大语言模型组对其论文的归属感最低，且难以准确回忆自己的作品。\n*   **论文质量：** 语言分析表明，在大语言模型协助下撰写的论文，其组内风格和结构更为同质化。\n\n研究总结指出，尽管大语言模型提供了便利，但其长期使用可能会损害写作与学习所涉及的关键认知过程。研究人员对依赖AI的教育影响表示担忧，认为这可能以牺牲深度思考和知识整合为代价。"
  },
  {
    "id": "46713106",
    "title": "Show HN: Sweep, Open-weights 1.5B model for next-edit autocomplete",
    "url": "https://huggingface.co/sweepai/sweep-next-edit-1.5B",
    "summary": "**Sweep Next-Edit 1.5B** is a new, open-weights AI model designed for **next-edit autocomplete** in code. It predicts a programmer's next edit before they make it, aiming to enhance developer workflow.\n\n**Key Details:**\n*   **Size & Format:** A 1.5 billion parameter model, quantized to **Q8_0 GGUF format** (1.54 GB) for efficient local execution.\n*   **Performance:** Claims to outperform models over four times its size on next-edit benchmarks and runs locally in **under 500ms** with speculative decoding.\n*   **Technical Specs:** Based on **Qwen2.5-Coder**, with an 8192-token context window.\n*   **Usage:** Runs locally on a laptop. Users download a script and model file, install dependencies (`llama-cpp-python`), and execute it.\n*   **Function:** It uses a specific prompt format that considers file context, recent code changes (diffs), and the current state to predict the next edit.\n*   **Ecosystem:** Associated with a **JetBrains plugin**, and the developers are discussing implementations for **Neovim & Emacs**.\n*   **License:** Released under the **Apache 2.0** license.\n\nIn summary, Sweep is a small, fast, and locally-runnable AI model focused on anticipating a developer's next code change to streamline the editing process.",
    "chinese_title": "Show HN: Sweep，开源1.5B参数模型，用于下一轮编辑自动补全",
    "chinese_summary": "**Sweep Next-Edit 1.5B** 是一款专为代码**下一轮编辑自动补全**设计的新型开源权重AI模型。它能在程序员实际执行操作前预测其下一步编辑，旨在提升开发者的工作流程效率。\n\n**核心详情：**\n*   **规模与格式：** 这是一个拥有15亿参数的模型，量化为**Q8_0 GGUF格式**（1.54 GB），以实现高效的本地运行。\n*   **性能表现：** 据称在下一轮编辑基准测试中，其表现优于规模是其四倍以上的模型，并借助推测解码技术可在**500毫秒内**于本地运行。\n*   **技术规格：** 基于**Qwen2.5-Coder**构建，拥有8192个令牌的上下文窗口。\n*   **使用方式：** 可在笔记本电脑上本地运行。用户下载脚本和模型文件，安装依赖项（`llama-cpp-python`）后即可执行。\n*   **功能原理：** 采用特定的提示格式，综合考虑文件上下文、近期代码变更（差异）以及当前状态，以预测下一步编辑。\n*   **生态系统：** 与**JetBrains插件**相关联，开发者们正在探讨为**Neovim和Emacs**编辑器实现集成。\n*   **开源许可：** 基于**Apache 2.0** 许可证发布。\n\n总而言之，Sweep是一款小巧、快速、可本地运行的AI模型，专注于预测开发者的下一步代码变更，以简化代码编辑过程。"
  },
  {
    "id": "46715766",
    "title": "Show HN: Synesthesia, make noise music with a colorpicker",
    "url": "https://visualnoise.ca",
    "summary": "**Summary of \"Show HN: Synesthesia, make noise music with a colorpicker\"**\n\nThe website **visualnoise.ca** is an interactive, browser-based tool that allows users to create experimental soundscapes by selecting colors. It is a creative application of the concept of synesthesia, where stimulation of one sense (sight) triggers another (hearing).\n\nThe core functionality is simple: a color picker and canvas. Users select a hue, and each color corresponds to a specific audio frequency or tone. By \"painting\" on the canvas with different colors, users generate layered, ambient, and often noisy music in real-time. The visual layout directly maps to the stereo audio field, with the horizontal position affecting the sound's panning (left or right speaker).\n\nKey features include:\n*   **Intuitive Visual Interface:** The entire tool is the color canvas, making creation immediate and accessible without musical training.\n*   **Generative & Ambient Focus:** It is designed for creating evolving, textural soundscapes rather than traditional melodies or rhythms.\n*   **Browser-Based:** It runs directly in a web browser, requiring no downloads or installations.\n*   **Show HN Context:** It was presented as a personal project to the Hacker News community, inviting feedback and interaction from developers and enthusiasts.\n\nIn essence, Synesthesia is a minimalist digital instrument that turns color selection into an act of musical composition, exploring the intersection of visual art and generative noise music.",
    "chinese_title": "Show HN：联觉，用颜色选择器创作噪音音乐",
    "chinese_summary": "**《Show HN：Synesthesia，用颜色选择器创作噪音音乐》摘要**\n\n网站 **visualnoise.ca** 是一款基于浏览器的交互式工具，允许用户通过选择颜色来创作实验性音景。这是对“联觉”概念的创造性应用——即一种感官（视觉）的刺激触发另一种感官（听觉）的体验。\n\n其核心功能简洁明了：一个颜色选择器和画布。用户选择色调，每种颜色对应特定的音频频率或音调。通过用不同颜色在画布上“绘画”，用户可以实时生成层次丰富、氛围感强且常带噪音色彩的音乐。视觉布局直接映射到立体声音频场，水平位置会影响声音的声像定位（左或右扬声器）。\n\n主要特点包括：\n*   **直观的视觉界面：** 整个工具就是颜色画布，无需音乐训练即可即时上手创作。\n*   **侧重生成与氛围音乐：** 专为创作不断演变、富有纹理的音景而设计，而非传统的旋律或节奏。\n*   **基于浏览器：** 直接在网页浏览器中运行，无需下载或安装。\n*   **Show HN 背景：** 该项目作为个人作品分享给 Hacker News 社区，旨在邀请开发者和爱好者们提供反馈并进行互动。\n\n本质上，Synesthesia 是一款极简的数字乐器，它将颜色选择转化为音乐创作行为，探索了视觉艺术与生成式噪音音乐的交汇点。"
  },
  {
    "id": "46715600",
    "title": "Doctors in Brazil using tilapia fish skin to treat burn victims (2017)",
    "url": "https://www.pbs.org/newshour/health/brazilian-city-uses-tilapia-fish-skin-treat-burn-victims",
    "summary": "In 2017, doctors in Fortaleza, Brazil, began pioneering the use of sterilized tilapia fish skin as a bandage for second- and third-degree burn victims. This innovation addressed a critical shortage of human skin, pig skin, and artificial skin substitutes in Brazil's public health system, where standard treatment was painful daily gauze changes with antibiotic cream.\n\nResearch revealed tilapia skin has advantages: it is rich in collagen types beneficial for healing, has high moisture content, and is more resistant than human skin. In practice, the fish skin bandages significantly reduced pain, decreased the need for dressing changes, and shortened healing time by several days compared to conventional methods.\n\nThe skins, sourced from a widely farmed fish whose skin was previously discarded, undergo a rigorous sterilization and irradiation process to eliminate pathogens, making them safe for up to two years. While unlikely to be adopted soon in countries like the U.S. with established skin bank systems, the treatment shows promise as a cost-effective alternative for developing nations. Brazilian researchers were conducting further studies on cost and efficacy, hoping for industrial-scale production if clinical trials proved successful.",
    "chinese_title": "巴西医生采用罗非鱼皮治疗烧伤患者（2017年）",
    "chinese_summary": "2017年，巴西福塔莱萨的医生开创性地将灭菌罗非鱼皮用作二度和三度烧伤患者的敷料。这项创新解决了巴西公共卫生系统中人皮、猪皮及人造皮肤替代品严重短缺的问题——此前标准疗法是每日忍痛更换涂抹抗生素软膏的纱布。\n\n研究表明罗非鱼皮具有多重优势：富含利于伤口愈合的胶原蛋白类型，湿度保持性强，且比人类皮肤更具韧性。实践中，与传统疗法相比，这种鱼皮敷料能显著减轻疼痛、减少换药次数，并使愈合时间缩短数日。\n\n这些鱼皮取自广泛养殖的罗非鱼（其鱼皮原先被废弃），经过严格的灭菌与辐照处理以消除病原体，安全保质期可达两年。虽然在美国等已建立成熟皮肤库体系的国家短期内难以推广，但该疗法为发展中国家提供了具有成本效益的替代方案。巴西研究人员正进一步研究其成本与疗效，若临床试验成功，有望实现工业化规模生产。"
  },
  {
    "id": "46723859",
    "title": "The turmoil at Thinking Machines Lab",
    "url": "https://www.nytimes.com/2026/01/22/technology/thinking-machines-ai-startup-openai.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "思维机器实验室的动荡",
    "chinese_summary": "无法访问文章链接。"
  }
]