[
  {
    "id": "46930961",
    "title": "Vouch",
    "url": "https://github.com/mitchellh/vouch",
    "summary": "Vouch is an experimental trust management system for open-source projects that requires users to be vouched for before interacting with specific, configurable parts of a project. It addresses the problem of low-quality, AI-generated contributions by shifting to an explicit trust model where trusted community members can vouch for others.\n\nThe system is generic but offers out-of-the-box GitHub integration via GitHub Actions and a CLI tool built in Nushell. Projects can automatically check if pull request authors are vouched and allow collaborators to vouch or denounce users via issue or discussion comments.\n\nA key feature is the ability to form a web of trust, where projects can import trust decisions (both vouches and denouncements) from other projects' lists, creating a shared ecosystem of trust.\n\nTrust data is stored in a simple, parseable `.td` (Trustdown) file format, with one user per line. The format supports platform-specific identifiers (e.g., `github:username`), denouncements marked with a `-` prefix, and optional reasons. The system is currently in use by the Ghostty project.",
    "chinese_title": "担保",
    "chinese_summary": "Vouch是一个面向开源项目的实验性信任管理系统，要求用户在参与项目中特定、可配置的模块前必须获得他人担保。它通过转向明确的信任模型来解决低质量、AI生成内容的问题，即由受信任的社区成员为他人提供担保。\n\n该系统具有通用性，但通过GitHub Actions和基于Nushell构建的CLI工具提供了开箱即用的GitHub集成功能。项目可自动检查拉取请求作者是否已获担保，并允许协作者通过议题或讨论评论为用户提供担保或提出谴责。\n\n其核心功能是能够构建信任网络——项目可以从其他项目的信任名单中导入信任决策（包括担保与谴责），从而形成共享的信任生态。\n\n信任数据以简洁可解析的`.td`（Trustdown）文件格式存储，每行记录一位用户。该格式支持平台特定标识符（如`github:用户名`）、以`-`前缀标记的谴责记录及可选的说明理由。该系统目前已在Ghostty项目中投入使用。"
  },
  {
    "id": "46935791",
    "title": "I put a real-time 3D shader on the Game Boy Color",
    "url": "https://blog.otterstack.com/posts/202512-gbshader/",
    "summary": "In this project, the developer created a real-time 3D shader for the Game Boy Color (GBC), a device with no hardware 3D support or floating-point math. The core technique uses pre-rendered normal maps—stored as spherical coordinates in the ROM—to simulate lighting via a Lambert shader.\n\nTo overcome the GBC's lack of a multiplication instruction, the system employs 8-bit logarithmic lookup tables. This allows multiplication to be performed through addition, with a custom encoding scheme handling negative values. The shader's key calculation simplifies to a per-pixel routine requiring only three additions/subtractions and two table lookups.\n\nPerformance is achieved by processing at least 15 tiles per frame, utilizing about 89% of the CPU's time. Critical optimizations include self-modifying code to hardcode variable values in the assembly loop, saving significant cycles.\n\nThe workflow involved creating normal map animations in Blender, using cryptomattes for specific color control. The developer notes that most of the project was coded manually, with limited and largely unsuccessful attempts to use AI for generating the complex SM83 assembly code.",
    "chinese_title": "我在Game Boy Color上应用了实时3D着色器。",
    "chinese_summary": "在此项目中，开发者为一款不具备硬件3D支持或浮点运算功能的Game Boy Color（GBC）设备创建了实时3D着色器。核心技术采用预渲染的法线贴图——以球面坐标形式存储在ROM中——通过朗伯着色器模拟光照效果。\n\n为克服GBC缺乏乘法指令的局限，该系统采用8位对数查找表。通过加法实现乘法运算，并采用自定义编码方案处理负值。着色器的核心计算简化为每像素处理程序，仅需三次加减运算和两次查表操作。\n\n通过每帧处理至少15个图块，并占用约89%的CPU时间来实现性能要求。关键优化包括采用自修改代码在汇编循环中硬编码变量值，从而显著节省运行周期。\n\n工作流程涉及在Blender中创建法线贴图动画，并使用加密遮罩实现特定色彩控制。开发者指出，该项目大部分代码均为手动编写，仅进行了有限且基本未成功的尝试——使用AI生成复杂的SM83汇编代码。"
  },
  {
    "id": "46937012",
    "title": "Roundcube Webmail: SVG feImage bypasses image blocking to track email opens",
    "url": "https://nullcathedral.com/posts/2026-02-08-roundcube-svg-feimage-remote-image-bypass/",
    "summary": "This article details a security vulnerability in Roundcube Webmail that allowed attackers to bypass the \"Block remote images\" setting to track email opens. The flaw was present in versions prior to 1.5.13 and 1.6.x before 1.6.13.\n\nThe issue resided in the `rcube_washtml` sanitizer. While it correctly blocked external URLs for common image-bearing elements like `<img>`, `<image>`, and `<use>`, it failed to properly handle the `<feImage>` SVG element. The sanitizer's logic mistakenly routed the `href` attribute of `<feImage>` through a permissive link-checking function (`wash_link()`) instead of the stricter image-blocking function (`is_image_attribute()`).\n\nAs a result, an attacker could embed a specially crafted, invisible SVG in an email. When the email was opened, the browser would automatically fetch the external image from the attacker's server, confirming the open and potentially leaking the victim's IP address and browser fingerprint.\n\nThe vulnerability was fixed in commit 26d7677 by updating the `is_image_attribute()` function to include `feimage` in its checks, ensuring its `href` attribute is blocked when remote images are disabled. Users are advised to update to Roundcube version 1.5.13 or 1.6.13.",
    "chinese_title": "Roundcube Webmail：SVG feImage绕过图像屏蔽以追踪邮件打开状态",
    "chinese_summary": "本文详细介绍了Roundcube Webmail中的一个安全漏洞，该漏洞允许攻击者绕过“阻止远程图像”设置来追踪邮件打开行为。该漏洞存在于1.5.13之前版本以及1.6.13之前的1.6.x版本中。\n\n问题源于`rcube_washtml`清理器。虽然该清理器能正确阻止常见图像元素（如`<img>`、`<image>`和`<use>`）的外部URL，但未能正确处理SVG元素`<feImage>`。清理器的逻辑错误地将`<feImage>`的`href`属性通过宽松的链接检查函数（`wash_link()`）处理，而非使用更严格的图像阻止函数（`is_image_attribute()`）。\n\n因此，攻击者可在邮件中嵌入特制的隐形SVG。当邮件被打开时，浏览器会自动从攻击者服务器获取外部图像，从而确认邮件已打开，并可能泄露受害者的IP地址和浏览器指纹。\n\n该漏洞在提交26d7677中得以修复，通过更新`is_image_attribute()`函数使其检查包含`feimage`元素，确保在禁用远程图像时阻止其`href`属性。建议用户升级至Roundcube 1.5.13或1.6.13版本。"
  },
  {
    "id": "46936828",
    "title": "The Little Bool of Doom (2025)",
    "url": "https://blog.svgames.pl/article/the-little-bool-of-doom",
    "summary": "This article details a compilation error encountered during a Fedora Linux mass rebuild of the chocolate-doom package. The issue stemmed from GCC 15's new default C standard, C23, which makes `false` and `true` keywords. This clashed with chocolate-doom's custom boolean enum, which defined these same identifiers.\n\nThe author's initial fix was to make the code use the built-in `bool` type when compiled as C23. However, upstream maintainers opted to declare the project as C99 and use `stdbool.h`. This change revealed a deeper bug: using the C99 `_Bool` type caused the game to crash on startup.\n\nDebugging showed that a sprite initialization array was filled with `-1` (0xFF) via `memset`. When stored in a 1-byte `_Bool`, this became 255. The compiler-generated assembly for comparing a `_Bool` to `false` only checks the least significant bit. Since 255 (0xFF) has its LSB set to 1, it was incorrectly evaluated as `true`, triggering a fatal error. The older 4-byte enum comparison worked because it checked the full integer value against 0.\n\nThe core problem was reliance on non-standard boolean values (`-1`). The solution was to ensure the code only assigns proper boolean values (`0` or `1`) to `_Bool` variables, fixing the underlying logic error exposed by the compiler upgrade.",
    "chinese_title": "《小布尔末日》（2025）",
    "chinese_summary": "本文详述了在Fedora Linux大规模重建chocolate-doom软件包时遇到的编译错误。该问题源于GCC 15采用的新默认C标准C23将`false`和`true`设为关键字，与chocolate-doom自定义布尔枚举中定义的相同标识符产生冲突。\n\n作者最初的修复方案是让代码在C23编译时使用内置的`bool`类型。但上游维护者选择将项目声明为C99标准并使用`stdbool.h`。这一改动暴露了更深层的错误：使用C99的`_Bool`类型导致游戏启动时崩溃。\n\n调试发现，精灵初始化数组通过`memset`填充了`-1`（即0xFF）。当存储到1字节的`_Bool`中时，该值变为255。编译器生成的`_Bool`与`false`比较汇编代码仅检查最低有效位。由于255（0xFF）的最低有效位为1，被错误判定为`true`，从而触发致命错误。而旧版4字节枚举比较能正常运作，是因为其将完整整数值与0进行比较。\n\n核心问题在于对非标准布尔值（`-1`）的依赖。解决方案是确保代码仅将正确的布尔值（`0`或`1`）赋给`_Bool`变量，从而修复了编译器升级暴露的底层逻辑错误。"
  },
  {
    "id": "46936237",
    "title": "Show HN: I created a Mars colony RPG based on Kim Stanley Robinson's Mars books",
    "url": "https://underhillgame.com/",
    "summary": "This is an announcement for a new browser-based game called \"Underhill: A Mars Colony Game.\" The game is a role-playing game (RPG) centered on survival and construction on Mars, directly inspired by Kim Stanley Robinson's acclaimed science fiction series, the *Mars Trilogy*.\n\nThe creator is Aria Alamalhodaei, who provides links for players to follow the project on social media (X), offer financial support, and send feedback. The announcement presents the game as a playable experience, inviting users to engage with it directly from their browser.",
    "chinese_title": "展示HN：我根据金·斯坦利·罗宾逊的火星系列小说创作了一款火星殖民地角色扮演游戏",
    "chinese_summary": "这是一则关于新浏览器游戏《地下城：火星殖民游戏》的公告。该游戏是一款以火星生存与建设为核心的角色扮演游戏（RPG），其灵感直接来源于金·斯坦利·罗宾逊广受赞誉的科幻系列作品《火星三部曲》。\n\n游戏创作者艾莉亚·阿拉马尔霍达伊提供了社交媒体（X）链接，供玩家关注项目进展、提供资金支持及反馈意见。公告将游戏定位为可直接在浏览器中游玩的体验，邀请用户即刻参与。"
  },
  {
    "id": "46934499",
    "title": "RFC 3092 – Etymology of \"Foo\" (2001)",
    "url": "https://datatracker.ietf.org/doc/html/rfc3092",
    "summary": "This RFC, published on April 1, 2001, provides a formal, tongue-in-cheek etymology of the common metasyntactic variables \"foo,\" \"bar,\" and \"foobar,\" which had appeared in over 200 technical documents without explanation.\n\nThe document traces \"foo\" to pre-WWII popular culture, notably Bill Holman's \"Smokey Stover\" comic strip, where it was used as a nonsense word. It gained traction in military slang during WWII, appearing in terms like \"foo fighters\" for UFOs and the acronym FUBAR (\"Fucked Up Beyond All Repair\"), from which \"foobar\" is likely derived. The terms were adopted by early computing communities at institutions like MIT and DEC in the 1960s and 70s, cementing their place as standard placeholders in programming examples.\n\nThe RFC also humorously lists various backronyms (like \"FTP Operation Over Big Address Records\") and includes an appendix cataloging the numerous RFCs that use these terms. Its purpose is to formally document the informal history behind these ubiquitous jargon words for the Internet community.",
    "chinese_title": "RFC 3092 – “Foo”一词的词源（2001年）",
    "chinese_summary": "这份于2001年4月1日发布的RFC文件，以正式而戏谑的方式追溯了常见元语法变量“foo”“bar”和“foobar”的词源——这些词汇曾出现在超过200份技术文档中却从未被解释。\n\n文件将“foo”的起源追溯至二战前的流行文化，尤其是比尔·霍尔曼的漫画《斯莫基·斯托弗》，其中该词被用作无意义字词。二战期间，“foo”在军事俚语中流行起来，例如用“foo fighters”指代不明飞行物，以及首字母缩略词FUBAR（意为“彻底损坏无法修复”）——而“foobar”很可能由此衍生。1960至70年代，这些术语被麻省理工学院、DEC等机构的早期计算机社群采纳，逐渐成为编程示例中的标准占位符。\n\n该RFC还幽默地列举了多种反向首字母缩写（例如“FTP Operation Over Big Address Records”），并附有附录收录了大量使用这些术语的RFC文件。其目的在于为互联网社群正式记录这些无处不在的行话背后非正式的历史渊源。"
  },
  {
    "id": "46934266",
    "title": "Running Your Own As: BGP on FreeBSD with FRR, GRE Tunnels, and Policy Routing",
    "url": "https://blog.hofstede.it/running-your-own-as-bgp-on-freebsd-with-frr-gre-tunnels-and-policy-routing/",
    "summary": "This article details how individuals can run their own Autonomous System (AS) on the public internet using FreeBSD. The primary motivation is to gain provider-independent IPv6 addressing, allowing network resources to move between hosting providers without changing IP addresses.\n\nThe setup requires obtaining an AS number and an IPv6 prefix from a Regional Internet Registry (RIR) via a sponsoring LIR. The core architecture involves a central FreeBSD BGP router that peers with two upstream providers using FRR (Free Range Routing) software. This router announces the owner's `/48` IPv6 prefix to the global internet.\n\nTo distribute address space, the router establishes GIF (IPv6-in-IPv4) tunnels to downstream servers and a GRE tunnel to one upstream. Specific subnets (like `/64` and `/62`) are routed through these tunnels. The FRR configuration is critical, implementing strict inbound route filtering to reject bogus routes and using BGP communities and AS-path prepending for traffic engineering.\n\nThe system also addresses key operational challenges: a blackhole route for the aggregate prefix prevents routing loops for unassigned subnets, and a detailed PF firewall configuration secures the control plane (BGP, SSH) while permitting data plane forwarding. The result is a resilient, self-controlled network where services can use stable, globally routable addresses independent of any single provider.",
    "chinese_title": "运行你自己的AS：在FreeBSD上使用FRR、GRE隧道和策略路由实现BGP",
    "chinese_summary": "本文详细介绍了个人如何利用FreeBSD在公共互联网上运行自己的自治系统（AS）。主要动机在于获取独立于服务提供商的IPv6地址，使得网络资源能够在不同托管服务商之间迁移而无需更改IP地址。\n\n该方案需要从区域互联网注册机构（RIR）通过赞助的本地互联网注册机构（LIR）获取AS号码和IPv6地址前缀。核心架构采用一台中央FreeBSD BGP路由器，通过FRR（自由范围路由）软件与两个上游提供商建立对等连接。这台路由器向全球互联网宣告所有者拥有的`/48` IPv6地址前缀。\n\n为分配地址空间，路由器通过GIF（IPv6-in-IPv4）隧道连接下游服务器，并通过GRE隧道连接一个上游提供商。特定子网（如`/64`和`/62`）通过这些隧道进行路由。FRR配置至关重要，需实施严格的入站路由过滤以拒绝虚假路由，并运用BGP团体属性和AS路径预置进行流量工程。\n\n该系统还解决了关键运维挑战：通过为聚合前缀设置黑洞路由来防止未分配子网的路由环路；详细的PF防火墙配置在保障控制平面（BGP、SSH）安全的同时允许数据平面转发。最终构建出一个具备弹性、自主可控的网络环境，使服务能够使用稳定、全球可路由且独立于单一提供商的地址。"
  },
  {
    "id": "46934107",
    "title": "GitHub Agentic Workflows",
    "url": "https://github.github.io/gh-aw/",
    "summary": "**GitHub Agentic Workflows** is a tool from GitHub Next and Microsoft Research that automates repository maintenance using AI coding agents (like GitHub Copilot, Claude, or Codex) within GitHub Actions. It enables \"Continuous AI\"—the systematic, automated application of AI to software collaboration.\n\nThe core idea is to define automation tasks in simple markdown files using natural language, which are then compiled into secure GitHub Actions workflows. These workflows can run on a schedule (e.g., daily) or on-demand to perform tasks like generating status reports, triaging issues, refactoring code, improving documentation, and analyzing CI failures.\n\nKey features include a security-first design: workflows run with read-only permissions by default, and any write operations (like creating an issue) require explicit approval through pre-vetted \"safe outputs.\" Execution is sandboxed and isolated for safety.\n\nThe process involves three steps: 1) writing a `.md` file with instructions, 2) using the `gh aw compile` CLI to convert it into a locked `.yml` workflow, and 3) letting GitHub Actions execute it. This approach aims to augment traditional CI/CD with AI-powered, context-aware automation while maintaining strong guardrails to keep repositories secure.",
    "chinese_title": "GitHub 智能代理工作流",
    "chinese_summary": "**GitHub 智能工作流**是 GitHub Next 与微软研究院联合推出的工具，它通过在 GitHub Actions 中集成 AI 编程代理（如 GitHub Copilot、Claude 或 Codex），实现仓库维护的自动化。该工具支持“持续 AI”——即系统化、自动化地将 AI 应用于软件协作。\n\n其核心理念是使用自然语言在简单的 Markdown 文件中定义自动化任务，随后将其编译为安全的 GitHub Actions 工作流。这些工作流可按计划（如每日）或按需运行，执行生成状态报告、分类议题、重构代码、改进文档、分析 CI 故障等任务。\n\n关键特性包括安全优先的设计：工作流默认以只读权限运行，任何写入操作（如创建议题）均需通过预先审核的“安全输出”获得明确批准。执行过程被沙盒化隔离以确保安全。\n\n流程包含三个步骤：1）编写包含指令的 `.md` 文件；2）使用 `gh aw compile` 命令行工具将其转换为锁定的 `.yml` 工作流；3）由 GitHub Actions 执行该工作流。此方法旨在通过具备上下文感知能力的 AI 自动化增强传统 CI/CD，同时通过严格的安全护栏保障仓库安全。"
  },
  {
    "id": "46934579",
    "title": "Exploiting signed bootloaders to circumvent UEFI Secure Boot",
    "url": "https://habr.com/en/articles/446238/",
    "summary": "This article details methods to bypass UEFI Secure Boot by exploiting signed bootloaders. Secure Boot is designed to prevent the execution of untrusted code during boot, requiring software to be signed by trusted keys, typically Microsoft's. The author aimed to create a universal recovery USB drive that works without disabling Secure Boot.\n\nTwo primary methods are explored:\n1.  **Super UEFIinSecureBoot Disk:** This combines a signed shim bootloader, a modified PreLoader that disables signature verification, and a modified GRUB2. It requires a one-time user interaction (via MokManager) to enroll a key, after which it can boot any unsigned software.\n2.  **Silent UEFIinSecureBoot Disk:** This method exploits a vulnerability in the signed GRUB bootloader from Kaspersky Rescue Disk 18, which lacked Secure Boot restrictions. By modifying its chainloader module, the author created a disk that can silently boot any unsigned .efi file without any user interaction, representing a more serious security flaw.\n\nThe article concludes that the existence of such insufficiently secure, Microsoft-signed bootloaders (like Kaspersky's) poses a risk, as they can be used for both legitimate recovery purposes and malicious bootkit installation. The author anticipates that the vulnerable Kaspersky certificate will likely be revoked via Windows Update.",
    "chinese_title": "利用已签名的引导程序绕过UEFI安全启动",
    "chinese_summary": "本文详细介绍了通过利用已签名的引导加载程序来绕过UEFI安全启动的方法。安全启动旨在防止在启动过程中执行不受信任的代码，要求软件必须由受信任的密钥（通常是微软的密钥）签名。作者的目标是创建一个无需禁用安全启动即可使用的通用恢复USB驱动器。\n\n探讨了两种主要方法：\n1.  **超级UEFI不安全启动盘**：该方法结合了已签名的shim引导加载程序、一个禁用签名验证的修改版PreLoader以及修改后的GRUB2。它需要用户通过MokManager进行一次交互以注册密钥，之后即可引导任何未签名的软件。\n2.  **静默UEFI不安全启动盘**：该方法利用了卡巴斯基救援盘18中已签名的GRUB引导加载程序的一个漏洞，该版本缺乏安全启动限制。通过修改其链式加载模块，作者创建了一个可以静默引导任何未签名的.efi文件的启动盘，无需任何用户交互，这代表了一个更严重的安全漏洞。\n\n文章总结指出，此类安全性不足且由微软签名的引导加载程序（如卡巴斯基的版本）的存在构成了风险，因为它们既可用于合法的恢复目的，也可用于恶意引导工具的安装。作者预计，存在漏洞的卡巴斯基证书很可能会通过Windows更新被撤销。"
  },
  {
    "id": "46935991",
    "title": "Omega-3 is inversely related to risk of early-onset dementia",
    "url": "https://pubmed.ncbi.nlm.nih.gov/41506004/",
    "summary": "This study investigated the link between blood levels of omega-3 fatty acids and the risk of developing early-onset dementia (EOD), defined as a diagnosis before age 65. Using data from over 217,000 UK Biobank participants aged 40-64, researchers tracked new dementia cases over an average of 8.3 years.\n\nThe key finding was a significant inverse association: higher blood levels of total omega-3s were linked to a lower risk of EOD. Specifically, participants in the top two quintiles (Q4 and Q5) of total omega-3 had approximately a 40% lower risk compared to those in the lowest quintile (Q1). Similar protective associations were observed for the specific omega-3s DHA and non-DHA omega-3s. The relationship held when omega-3 was analyzed as a continuous variable, and no interaction was found with the APOE-ε4 genetic risk factor for dementia.\n\nThe authors conclude that these findings extend the known evidence for omega-3's benefit in late-onset dementia to early-onset cases. They suggest that increasing omega-3 intake earlier in life may help slow the development of EOD, but note that more research in diverse populations is needed to confirm the results. The study's strengths include its large cohort and the use of objective blood biomarkers to measure omega-3 exposure.",
    "chinese_title": "Omega-3与早发性痴呆风险呈负相关。",
    "chinese_summary": "本研究探讨了血液中ω-3脂肪酸水平与早发性痴呆（EOD，定义为65岁前确诊）风险之间的关联。研究人员利用英国生物银行超过21.7万名40-64岁参与者的数据，平均追踪8.3年内的新发痴呆病例。\n\n关键发现表明两者存在显著负相关：血液中总ω-3水平越高，EOD风险越低。具体而言，总ω-3水平处于最高两个五分位数组（Q4和Q5）的参与者，其EOD风险比最低组（Q1）降低约40%。特定的ω-3成分DHA与非DHA型ω-3也显示出类似的保护性关联。当ω-3作为连续变量分析时，这种关系依然成立，且未发现与痴呆遗传风险因子APOE-ε4存在交互作用。\n\n作者总结称，这些发现将ω-3对晚发性痴呆的已知益处延伸至早发性病例。他们提出，在生命早期增加ω-3摄入可能有助于延缓EOD发展，但指出仍需在不同人群中进行更多研究以验证结果。本研究的优势包括大规模队列及采用客观血液生物标志物测量ω-3暴露水平。"
  },
  {
    "id": "46857115",
    "title": "Formally Verifying PBS Kids with Lean4",
    "url": "https://www.shadaj.me/writing/cyberchase-lean",
    "summary": "This blog post explores how the Lean4 theorem prover can be used to formally verify a strategy for a turn-based game from the PBS Kids show *Cyberchase*. The game involves two players taking turns removing 1, 2, or 3 dragons from a shared pool of 15 (14 green, 1 red), with the player who takes the red dragon losing.\n\nThe author begins by modeling the game in Lean, defining a naive strategy where the \"Cybersquad\" always takes one dragon. They then implement a simulator to determine if this strategy can win against an optimal opponent (\"Hacker\"), using mutual recursion to model alternating turns. Lean initially flags a termination error, prompting the author to write their first formal proof—demonstrating that the squad's move always reduces the dragon count—using tactics like `rw` (rewrite) and `decide`.\n\nTesting reveals the naive strategy fails. The post then details the squad's improved strategy from the episode: if the number of green dragons is a multiple of 4 (a \"poison number\"), the player is forced to lose. The squad's optimal move is to take `green_dragons mod 4` dragons, forcing Hacker into a poison state. The author updates the Lean code to reflect this strategy and adjusts the termination proof accordingly, using the `split` tactic to handle the new conditional logic.\n\nThe exercise illustrates how interactive theorem proving with Lean allows for rigorous, computer-verified reasoning about game strategies, drawing a parallel between the mathematical problem-solving in *Cyberchase* and the formal verification of software systems.",
    "chinese_title": "使用Lean4对PBS Kids进行形式化验证",
    "chinese_summary": "这篇博客探讨了如何运用Lean4定理证明器，对PBS Kids节目《数学小先锋》中一款回合制游戏的策略进行形式化验证。游戏规则是两名玩家轮流从共有15条龙（14条绿龙，1条红龙）的池中移除1、2或3条龙，最终拿走红龙的玩家判负。\n\n作者首先在Lean中建立游戏模型，定义了一种简单策略——\"数学小先锋\"队总是只拿一条龙。随后通过编写模拟器来测试该策略能否战胜最优对手\"黑客\"，并采用相互递归模拟双方交替回合。Lean起初提示终止性错误，这促使作者完成了首个形式化证明：通过`rw`（重写）和`decide`等策略，证明先锋队的操作总会减少龙的数量。\n\n测试显示简单策略会失败。文章接着详述了节目中先锋队的改进策略：若绿龙数量是4的倍数（即\"中毒数\"），玩家必败。先锋队的最优操作是拿走`绿龙数 mod 4`条龙，从而迫使黑客进入中毒状态。作者据此更新了Lean代码，并运用`split`策略处理新的条件逻辑，相应调整了终止性证明。\n\n这个案例展示了如何通过Lean交互式定理证明，对游戏策略进行严格的计算机验证推理，同时揭示了《数学小先锋》中的数学解题思维与软件系统形式化验证之间的深刻关联。"
  },
  {
    "id": "46936595",
    "title": "Bun v1.3.9",
    "url": "https://bun.com/blog/bun-v1.3.9",
    "summary": "Bun v1.3.9 introduces several new features and performance improvements. Key highlights include:\n\n*   **Enhanced Script Running:** New `bun run --parallel` and `--sequential` flags allow concurrent or sequential execution of package.json scripts with prefixed, color-coded output. They integrate with `--filter` and `--workspaces` for managing scripts across monorepos.\n\n*   **Improved Developer Experience:** `mock()` and `spyOn()` now support `Symbol.dispose`, enabling automatic cleanup with the `using` keyword. The `NO_PROXY` environment variable is now respected even when a proxy is explicitly set.\n\n*   **Performance & Compatibility:** The release includes faster Markdown-to-HTML rendering, optimized `AbortSignal.abort()`, and a fix for crashes on older ARM64 CPUs. Node.js compatibility is improved with fixes for `node:fs` operations on Windows and HTTP/2 connection upgrades via `net.Server`.\n\n*   **JavaScriptCore Upgrades:** Significant RegExp performance gains come from new SIMD-accelerated prefix searches. Optimizations for `String#startsWith`, `Set#size`, `Map#size`, `String#trim`, and `String#replace` also contribute to faster execution.\n\n*   **Other Additions:** A new `--cpu-prof-interval` flag allows finer control over CPU profiling, and ESM bytecode compilation is now supported with `--compile`. Several bug fixes address issues in WebSocket, HTTP servers, and TypeScript types.",
    "chinese_title": "Bun v1.3.9",
    "chinese_summary": "Bun v1.3.9 引入了多项新功能和性能改进。主要亮点包括：\n\n*   **增强的脚本运行：** 新增的 `bun run --parallel` 和 `--sequential` 标志允许并行或顺序执行 package.json 脚本，并带有前缀和颜色编码的输出。它们与 `--filter` 和 `--workspaces` 集成，便于管理 monorepo 中的脚本。\n\n*   **改进的开发者体验：** `mock()` 和 `spyOn()` 现在支持 `Symbol.dispose`，可通过 `using` 关键字实现自动清理。即使明确设置了代理，现在也会遵循 `NO_PROXY` 环境变量。\n\n*   **性能与兼容性：** 此版本包括更快的 Markdown 到 HTML 渲染、优化的 `AbortSignal.abort()`，以及修复了旧款 ARM64 CPU 上的崩溃问题。Node.js 兼容性得到改进，修复了 Windows 上的 `node:fs` 操作和通过 `net.Server` 进行的 HTTP/2 连接升级。\n\n*   **JavaScriptCore 升级：** 新的 SIMD 加速前缀搜索带来了显著的正则表达式性能提升。对 `String#startsWith`、`Set#size`、`Map#size`、`String#trim` 和 `String#replace` 的优化也促进了更快的执行速度。\n\n*   **其他新增功能：** 新的 `--cpu-prof-interval` 标志允许更精细地控制 CPU 性能分析，并且现在支持通过 `--compile` 进行 ESM 字节码编译。多个错误修复解决了 WebSocket、HTTP 服务器和 TypeScript 类型中的问题。"
  },
  {
    "id": "46933401",
    "title": "Dave Farber has died",
    "url": "https://lists.nanog.org/archives/list/nanog@lists.nanog.org/thread/TSNPJVFH4DKLINIKSMRIIVNHDG5XKJCM/",
    "summary": "**Summary: Dave Farber, Internet Pioneer, Dies at 91**\n\nDavid J. Farber, widely recognized as a \"grandfather of the Internet,\" passed away suddenly at his home in Tokyo on February 7, 2026. He was 91 years old.\n\nFarber had a long and distinguished career in technology and academia. After studying at Stevens Institute of Technology, he worked at Bell Labs and the RAND Corporation. He served as Chief Technologist for the U.S. Federal Communications Commission and was a board member of the Electronic Frontier Foundation. His most lasting impact came through his mentorship of students at universities including the University of Pennsylvania and Carnegie Mellon, where his work laid foundational groundwork for the Internet.\n\nIn 2018, at age 83, he moved to Japan to become a Distinguished Professor at Keio University and Co-Director of its Cyber Civilization Research Center. He remained active, teaching his final class just weeks before his death and co-hosting a long-running weekly online gathering called IP-Asia.\n\nHe is survived by his son Manny Farber, daughter-in-law Mei Xu, daughter-in-law Carol Hagan, and grandsons Nate and Sam Farber. He was preceded in death by his wife, Gloria, and son Joe Farber. An online remembrance was scheduled by the IP-Asia community for February 9, 2026.",
    "chinese_title": "戴夫·法伯已逝世",
    "chinese_summary": "**互联网先驱戴夫·法伯去世，享年91岁**\n\n被誉为“互联网祖父”的大卫·J·法伯于2026年2月7日在东京家中突然去世，享年91岁。\n\n法伯在科技界和学术界拥有漫长而杰出的职业生涯。他曾在史蒂文斯理工学院学习，后任职于贝尔实验室和兰德公司。他曾担任美国联邦通信委员会首席技术专家，也是电子前沿基金会的董事会成员。他最具持久影响力的贡献在于对宾夕法尼亚大学、卡内基梅隆大学等高校学生的指导，其工作为互联网奠定了重要基础。\n\n2018年，83岁的他移居日本，成为庆应义塾大学的特聘教授，并兼任其网络文明研究中心的联合主任。他始终活跃，去世前几周还在授课，并长期联合主持一个名为“IP-亚洲”的每周在线聚会。\n\n他的儿子曼尼·法伯、儿媳梅·徐、儿媳卡罗尔·黑根以及孙子内特·法伯和萨姆·法伯在世。他的妻子格洛丽亚和儿子乔·法伯此前已去世。IP-亚洲社区计划于2026年2月9日举行在线追思会。"
  },
  {
    "id": "46936105",
    "title": "Billing can be bypassed using a combo of subagents with an agent definition",
    "url": "https://github.com/microsoft/vscode/issues/292452",
    "summary": "This article reports a security vulnerability in Microsoft's Copilot Chat extension for VS Code that allows users to bypass billing for premium AI models. The core issue is that while premium models like Claude Opus 4.5 typically cost \"premium requests,\" their usage can be hidden from the billing system.\n\nThe primary method involves using a free model (e.g., GPT-5 Mini) to initiate a chat session. The user then instructs this free model to create a \"subagent\"—a secondary AI agent whose model is defined as a premium one. Because the billing system only charges for the initial model used in a request, and because creating subagents is itself a free operation, the premium model executes the user's task without consuming any premium credits. The report includes example configuration files demonstrating this exploit.\n\nA secondary, more complex method is also mentioned, involving scripts that can create loops to invoke a premium model hundreds of times from a single, billed initial request.\n\nThe reporter states they initially submitted this to Microsoft's Security Response Center (MSRC), but were directed to file it as a public bug report instead. The issue is tagged with `chat-billing` and is distinct from a previously closed, related report.",
    "chinese_title": "通过结合使用子代理与代理定义，可以绕过计费。",
    "chinese_summary": "本文报告了微软VS Code Copilot Chat扩展中的一个安全漏洞，该漏洞允许用户绕过高级AI模型的计费。核心问题在于，虽然像Claude Opus 4.5这样的高级模型通常需要消耗“高级请求次数”，但其使用情况可以被隐藏于计费系统之外。\n\n主要方法涉及使用免费模型（例如GPT-5 Mini）启动聊天会话。用户随后指示该免费模型创建一个“子代理”——一个被定义为高级模型的次级AI代理。由于计费系统仅对请求中使用的初始模型收费，且创建子代理本身是免费操作，因此高级模型执行用户任务时不会消耗任何高级额度。报告包含展示此漏洞利用的示例配置文件。\n\n文中还提到一种更复杂的次要方法，涉及使用脚本创建循环，从而通过单个计费的初始请求调用高级模型数百次。\n\n报告者表示，他们最初将此问题提交给微软安全响应中心（MSRC），但被引导将其作为公开漏洞报告提交。该问题标记为`chat-billing`，与之前已关闭的相关报告不同。"
  },
  {
    "id": "46932985",
    "title": "Curating a Show on My Ineffable Mother, Ursula K. Le Guin",
    "url": "https://hyperallergic.com/curating-a-show-on-my-ineffable-mother-ursula-k-le-guin/",
    "summary": "In an exhibition titled *A Larger Reality*, curator Theo Downes-Le Guin reflects on the experience of creating a show about his mother, the late author Ursula K. Le Guin. Centered around her first Underwood typewriter—which visitors are invited to use—the exhibition becomes a space for public interaction and tribute.\n\nDownes-Le Guin grapples with the inherent challenge of defining a person posthumously, acknowledging that any biographical curation risks the \"pigeon-holing\" his mother resisted. He rejects a linear narrative, instead embracing Le Guin's own \"carrier bag\" theory of storytelling—favoring a capacious, non-linear format that allows for exploration and multiple interpretations.\n\nThe exhibition features personal artifacts, audio recordings, and a re-creation of her writing room, evoking cycles of grief and joy for the curator. He concludes that freeing the exhibition from a tidy story allowed it to become a fittingly \"wordy, baggy, and inconclusive\" yet engaging tribute to an ever-evolving writer.",
    "chinese_title": "为我难以言喻的母亲厄休拉·K·勒古恩策展一场展览",
    "chinese_summary": "在名为《更大的现实》的展览中，策展人西奥·唐斯-勒古因反思了这场关于他已故母亲——作家厄休拉·K·勒古因的展览创作历程。展览以她的第一台安德伍德打字机为核心（参观者可亲手使用），成为一个公众互动与致敬的空间。\n\n唐斯-勒古因直面为逝者定义的内在挑战，承认任何传记式策展都可能陷入其母亲生前抗拒的“标签化”窠臼。他摒弃线性叙事，转而拥抱勒古因提出的“承载袋”故事理论——采用一种包容开放的非线性形式，允许探索与多重解读。\n\n展览通过个人物品、录音资料及书房场景重现，唤起策展人悲喜交织的循环记忆。他最终认为，让展览摆脱工整的故事框架，反而使其成为对这位不断演变的作家恰如其分的致敬——虽“冗长、松散且未定论”，却引人入胜。"
  },
  {
    "id": "46936920",
    "title": "Experts Have World Models. LLMs Have Word Models",
    "url": "https://www.latent.space/p/adversarial-reasoning",
    "summary": "This article argues that the core limitation of current large language models (LLMs) is not a lack of intelligence, but a lack of **adversarial world models**. Experts (like lawyers or negotiators) succeed by simulating how other self-interested agents will interpret and react to their actions in a dynamic environment. They anticipate counter-moves, manage hidden information, and avoid being predictable.\n\nIn contrast, LLMs are trained to produce text that is rated as helpful or reasonable in **isolation**. They are optimized for static, cooperative tasks and lack the training loop that teaches how an opponent adapts. While they can mimic strategic language when prompted, they cannot inherently detect when a situation is adversarial, model an opponent's private incentives, or adjust their strategy based on being observed and probed.\n\nThe author illustrates this with examples: an LLM drafts a polite but ineffective Slack message because it doesn't simulate the recipient's triage heuristics, and it would be exploitable in negotiations because its responses are consistent and readable. The solution isn't simply \"more intelligence\" or scaling, but developing systems, like the poker AI Pluribus, that are explicitly designed to be unexploitable by calculating balanced strategies across all possible states and hiding their intentions. True expertise requires simulating a multi-agent world where actions have recursive consequences, a dynamic poorly captured in the textual data LLMs learn from.",
    "chinese_title": "专家拥有世界模型，而大型语言模型拥有词汇模型。",
    "chinese_summary": "本文认为，当前大型语言模型（LLM）的核心局限并非智能不足，而是缺乏**对抗性世界模型**。专家（如律师或谈判者）之所以成功，是因为他们能在动态环境中模拟其他自利主体如何解读并回应自身行为。他们预判对手的反制措施、处理隐藏信息，并避免行为模式被预测。\n\n相比之下，LLM的训练目标是生成在**孤立情境**中被评价为有用或合理的文本。它们为静态合作性任务而优化，缺乏教导模型理解对手如何适应的训练循环。虽然LLM在被提示时可以模仿策略性语言，但它们本质上无法识别对抗性情境、模拟对手的私人动机，也无法根据被观察和试探的情况调整策略。\n\n作者通过案例说明这一点：LLM起草了一封礼貌但无效的Slack消息，因为它没有模拟收件人的信息筛选机制；在谈判中它易受利用，因为其回应始终一致且可被解读。解决方案并非简单地“增强智能”或扩大规模，而是开发像扑克AI Pluribus那样的系统——通过计算所有可能状态下的平衡策略并隐藏意图，实现不可被利用的设计。真正的专业能力需要模拟多主体世界，其中行动会产生递归影响，而这种动态性在LLM学习的文本数据中难以被充分捕捉。"
  },
  {
    "id": "46936274",
    "title": "Let's compile Quake like it's 1997",
    "url": "https://fabiensanglard.net/compile_like_1997/index.html",
    "summary": "This article details the process of compiling the 1997 Windows version of Quake using the original development tools. It explains that while early Quake was cross-compiled on NeXT systems, the Win32 binaries (like winquake.exe) were developed on Intergraph workstations running Windows NT with Visual C++ 4.x.\n\nThe guide walks through setting up a period-accurate environment, recommending options from using original hardware to a Windows NT 4.0 virtual machine. Key steps include installing Visual C++ 6 (the project was later migrated to this version), obtaining the correct `q1source.zip` archive to avoid file corruption issues, and installing the necessary \"Processor Pack\" and MDAC 2.5 to enable assembly code compilation.\n\nThe author successfully builds the executable after resolving these dependencies, noting that Visual C++ 6, despite its dated interface, was a powerful IDE for its time with features like debugging and \"Go to definition.\" The article serves as a historical recreation of late-1990s game development workflows.",
    "chinese_title": "让我们像1997年那样编译《雷神之锤》",
    "chinese_summary": "本文详细介绍了使用原始开发工具编译1997年Windows版《雷神之锤》的过程。文中说明，虽然早期《雷神之锤》是在NeXT系统上交叉编译的，但Win32二进制文件（如winquake.exe）实际上是在运行Windows NT的Intergraph工作站上使用Visual C++ 4.x开发的。\n\n本指南逐步讲解了如何搭建符合时代背景的开发环境，推荐了从使用原始硬件到Windows NT 4.0虚拟机的多种方案。关键步骤包括：安装Visual C++ 6（该项目后来迁移至此版本）、获取正确的`q1source.zip`压缩包以避免文件损坏问题，以及安装必要的“处理器包”和MDAC 2.5以支持汇编代码编译。\n\n作者在解决这些依赖项后成功构建了可执行文件，并指出Visual C++ 6虽然界面陈旧，但在当时是功能强大的集成开发环境，具备调试和“转到定义”等特性。本文堪称对1990年代末游戏开发工作流程的一次历史重现。"
  },
  {
    "id": "46888258",
    "title": "Show HN: It took 4 years to sell my startup. I wrote a book about it",
    "url": "https://derekyan.com/ma-book/",
    "summary": "In his book *The Toughest Sell: A Founder's Guide to Startup Exits*, author Derek Yan shares a comprehensive, firsthand account of the arduous four-year process to sell his startup. Framed as the guide he wished he had, the book details the complex journey from initial contemplation to final acquisition.\n\nThe content is structured into six parts, methodically covering the entire exit lifecycle. It begins with crucial pre-sale preparation, advising founders on aligning stakeholders, managing expectations, and getting their company and finances in order. It then walks through the tactical stages of engagement—from initial outreach and meetings to due diligence and negotiations—while candidly addressing common pitfalls and the emotional toll of the process.\n\nA key theme is managing a \"losing position,\" including how to approach competitors, handle a failed sale, or even shut down the company on your own terms. The guide concludes with the final deal stages and the personal aftermath for a founder post-exit.\n\nLicensed under CC BY-NC-ND 4.0, the book is freely available for non-commercial sharing as a resource built from Yan's direct experience of mistakes and hard-won lessons in startup M&A.",
    "chinese_title": "Show HN：我花了四年时间卖掉我的初创公司，并为此写了一本书。",
    "chinese_summary": "在《最难的一笔交易：创始人创业退出指南》一书中，作者德里克·严以第一视角完整呈现了其历经四年艰辛出售创业公司的全过程。本书以他当初渴望获得的指南为框架，细致剖析了从萌生退意到最终收购的复杂历程。\n\n全书分为六个部分，系统性地覆盖了退出周期的各个环节。开篇聚焦售前关键准备，指导创始人如何统一利益相关方、管理预期，并理顺公司业务与财务状况。随后逐步拆解实操阶段——从初步接洽、会议谈判到尽职调查与条款协商——同时坦率剖析了常见陷阱及这一过程带来的情感消耗。\n\n书中核心议题是如何应对“劣势局面”，包括如何与竞争对手周旋、处理交易失败的情况，乃至在自主掌控下有序关闭公司。指南最后阶段涵盖了最终交易环节，以及创始人退出后需面对的个人调整。\n\n本书基于知识共享署名-非商业性使用-禁止演绎4.0国际许可协议发布，作为严在创业公司并购中亲身试错、历经磨难得出的经验总结，可免费用于非商业性分享。"
  },
  {
    "id": "46859433",
    "title": "Kolakoski Sequence",
    "url": "https://en.wikipedia.org/wiki/Kolakoski_sequence",
    "summary": "The Kolakoski sequence is an infinite sequence of the numbers 1 and 2, defined as the sequence of run lengths in its own run-length encoding. This means it is a self-describing sequence: if you write down the lengths of consecutive runs of identical numbers in the sequence, you reproduce the original sequence itself.\n\nStarting with 1, 2, 2, 1, 1, 2, 1, 2, 2, 1..., it is generated by alternating between runs of 1s and 2s, where each term specifies the length of the next run. For example, the first term (1) means \"a run of one 1,\" the second term (2) means \"a run of two 2s,\" and so on.\n\nKey properties include that it is cube-free (no block repeats three times consecutively) and non-periodic. A major unsolved conjecture is whether the density of 1s in the sequence is exactly 1/2, though computational evidence supports this. The sequence can be generated by efficient algorithms and has connections to areas like fractal geometry and cyclic tag systems in theoretical computer science.",
    "chinese_title": "科拉科斯基序列",
    "chinese_summary": "科拉科斯基序列是一个由数字1和2组成的无限序列，其定义为自身游程编码中的游程长度序列。这意味着它是一个自描述序列：如果你写下序列中连续相同数字的游程长度，你将重现原始序列本身。\n\n从1, 2, 2, 1, 1, 2, 1, 2, 2, 1...开始，它通过在1和2的游程之间交替生成，其中每一项指定下一个游程的长度。例如，第一项（1）表示“一个1的游程”，第二项（2）表示“两个2的游程”，依此类推。\n\n关键性质包括它是无立方（没有连续重复三次的块）且非周期性的。一个尚未解决的重要猜想是序列中1的密度是否恰好为1/2，尽管计算证据支持这一点。该序列可以通过高效算法生成，并与分形几何和理论计算机科学中的循环标签系统等领域有关联。"
  },
  {
    "id": "46931805",
    "title": "OpenClaw is changing my life",
    "url": "https://reorx.com/blog/openclaw-is-changing-my-life/",
    "summary": "The author describes how OpenClaw has fundamentally transformed their work as a programmer, unlike previous AI coding tools like Claude Code. While those tools improved productivity, the author remained the \"code executor\"—deeply involved in writing, testing, and debugging.\n\nOpenClaw changed this by allowing the author to become a \"super manager.\" As a general-purpose agent, it operates independently via messaging apps, understands intent, and handles entire project lifecycles—from planning and coding (using tools like Claude Code) to testing and deployment. This enables the author to step away from the programming environment and manage projects purely through high-level communication.\n\nThis shift has liberated the author's productivity, allowing them to pursue multiple ideas simultaneously. They compare the experience to having a 24/7 standby programmer or a small team, moving closer to the dream of focusing on product design and strategy without the need for significant capital to hire people. The author concludes that OpenClaw represents a revolutionary step toward AGI for them, fundamentally altering their workflow and life trajectory.",
    "chinese_title": "OpenClaw正在改变我的生活",
    "chinese_summary": "作者描述了OpenClaw如何从根本上改变了他作为程序员的工作方式，这与之前如Claude Code这类AI编程工具截然不同。虽然那些工具提升了效率，但作者仍是“代码执行者”——深度参与编写、测试和调试。\n\nOpenClaw通过让作者成为“超级管理者”改变了这一切。作为一个通用智能体，它通过通讯应用独立运作，理解意图，并处理整个项目周期——从规划、编码（使用Claude Code等工具）到测试和部署。这使得作者能够脱离编程环境，仅通过高层级沟通来管理项目。\n\n这一转变解放了作者的生产力，让他能同时推进多个创意。他将这种体验比作拥有一个24小时待命的程序员或一个小型团队，更接近专注于产品设计与战略、无需大量资金雇佣人手的梦想。作者总结道，OpenClaw对他而言是迈向通用人工智能的革命性一步，彻底改变了他的工作流程与人生轨迹。"
  },
  {
    "id": "46933365",
    "title": "Why E cores make Apple silicon fast",
    "url": "https://eclecticlight.co/2026/02/08/last-week-on-my-mac-why-e-cores-make-apple-silicon-fast/",
    "summary": "This article explains that the speed of Apple silicon Macs is largely due to their **Efficiency (E) cores**, not just the Performance (P) cores. It illustrates this by describing how, after startup, numerous background tasks (like Spotlight indexing and system scans) heavily load the E cores while the P cores remain mostly idle for user applications.\n\nThe key mechanism is **Quality of Service (QoS)**, which macOS uses to strictly allocate threads. Foreground app threads can use both P and E cores, but background threads are restricted to E cores only. This prevents background tasks from interfering with user activity, ensuring responsive performance and better battery life.\n\nThe article notes that this design, based on Arm's big.LITTLE architecture, allows macOS to efficiently handle a large number of background processes. It also clarifies a visual quirk in Activity Monitor: an E core at \"100% CPU\" is often running at a much lower frequency (about a quarter) than a P core at the same displayed percentage, making the load look more alarming than it is.\n\nIn summary, the strategic separation of background and foreground tasks onto different core types is what makes Apple silicon Macs feel fast and responsive under load.",
    "chinese_title": "为什么效率核心让苹果芯片如此快速",
    "chinese_summary": "本文阐明，苹果芯片版Mac的速度优势主要源于其**能效核心**，而不仅是性能核心。文章通过描述启动后大量后台任务（如Spotlight索引和系统扫描）如何主要占用能效核心，同时性能核心基本处于空闲状态以供用户应用程序使用，来阐释这一原理。\n\n其核心机制在于**服务质量**分级系统，macOS借此严格分配线程。前台应用线程可同时调用性能核心与能效核心，但后台线程仅限使用能效核心。这种设计有效防止后台任务干扰用户操作，既保障系统响应速度，又提升电池续航能力。\n\n文章指出，这种基于Arm big.LITTLE架构的设计使macOS能高效处理大量后台进程。同时解释了活动监视器中一个视觉差异：显示为“100% CPU”占用率的能效核心，其实际运行频率通常远低于同显示数值的性能核心（约仅为四分之一），这使得负载显示数据比实际情况显得更为惊人。\n\n总之，通过将后台与前台任务策略性地分配至不同类型的核心，正是苹果芯片版Mac在负载下仍能保持流畅响应体验的关键所在。"
  },
  {
    "id": "46932678",
    "title": "Reverse Engineering Raiders of the Lost Ark for the Atari 2600",
    "url": "https://github.com/joshuanwalker/Raiders2600",
    "summary": "This repository contains the fully reverse-engineered and annotated source code for the Atari 2600 game *Raiders of the Lost Ark*. The project is structured for modern development, with organized source files, build scripts, and documentation.\n\nThe technical analysis details the game's 8KB ROM architecture, which uses a two-bank switching system to manage its complex logic. Bank 0 handles core gameplay like movement, inventory, and collisions, while Bank 1 contains the display kernels and graphics data.\n\nThe documentation provides a comprehensive breakdown of the game's frame-by-frame execution, mirroring the NTSC television signal. It explains how the CPU time is meticulously divided across the VSYNC, VBLANK, visible kernel, and overscan phases. Key routines are mapped to each phase, including input processing, room-specific AI, sprite positioning, and the distinct rendering kernels for different game areas (like static rooms, scrolling mesas, and the multiplexed thief sprites).\n\nFinally, the summary covers the overscan phase, where sound, death sequences, and final collision checks are processed before the loop restarts for the next frame.",
    "chinese_title": "逆向工程《夺宝奇兵》的Atari 2600版",
    "chinese_summary": "本仓库包含雅达利2600游戏《夺宝奇兵》的完整逆向工程及注释源代码。该项目采用现代化开发结构，包含组织有序的源文件、构建脚本和文档。\n\n技术分析详细说明了游戏8KB ROM的架构，该架构采用双存储体切换系统来管理复杂逻辑。存储体0处理核心游戏机制（如移动、物品栏和碰撞检测），而存储体1则包含显示内核与图形数据。\n\n文档提供了对游戏逐帧执行流程的全面解析，其时间节奏与NTSC电视信号同步。文中阐释了CPU时间如何精确分配至垂直同步、垂直消隐、可见内核和过扫描四个阶段，并将关键例程映射到各阶段，包括输入处理、场景专属AI、精灵定位，以及针对不同游戏区域（如静态房间、滚动台地、复用盗贼精灵）的独立渲染内核。\n\n最后，总结部分涵盖了过扫描阶段的工作内容：在循环重启进入下一帧前，系统会在此阶段处理音效、死亡序列及最终碰撞检测。"
  },
  {
    "id": "46867644",
    "title": "A Community-Curated Nancy Drew Collection",
    "url": "https://blog.openlibrary.org/2026/01/30/a-community-curated-nancy-drew-collection/",
    "summary": "A team of Open Library volunteers, led by Emily, has collaboratively created a public collection of Nancy Drew book series. The project involved librarians from around the world who connected via video calls and asynchronous planning to organize over 500 books across eight series.\n\nThe group decided to manually tag books with a `collectionid:` in their subject fields, after exploring and rejecting automated scripts due to technical limitations and the need for careful metadata review. A significant challenge was correcting widespread author attribution errors, as many books incorrectly listed individual ghostwriters instead of the collective pen name \"Carolyn Keene.\"\n\nVolunteers were motivated by nostalgia, a love for the character, and a desire to gain library and metadata skills. The project highlighted the importance of human connection in collaboration and identified that live training on metadata editing could streamline future efforts.\n\nWhile the core collection is live, work continues on ordering books chronologically within series and adding related materials. The project demonstrates a successful model of remote, volunteer-driven curation to make literature more accessible.",
    "chinese_title": "社区精选的南希·德鲁系列收藏",
    "chinese_summary": "由艾米丽领导的一支开放图书馆志愿者团队，共同创建了南茜·德鲁系列丛书的公共典藏。该项目汇集了来自世界各地的图书馆员，他们通过视频通话和异步协作，系统整理了八个系列超过500本书籍。\n\n在尝试并因技术限制与元数据审慎需求而放弃自动化脚本后，团队决定采用手动方式，在书籍主题字段中添加`collectionid:`标签。项目面临的主要挑战是修正普遍存在的作者归属错误——许多书籍误将代笔作者署为独立姓名，而非集体笔名“卡罗琳·基恩”。\n\n志愿者们因怀旧情怀、对角色的热爱，以及提升图书馆与元数据技能的愿望而投身其中。该项目凸显了人际联结在协作中的重要性，并发现开展元数据编辑的实时培训能提升未来工作效率。\n\n目前核心典藏已上线，团队仍在持续推进各系列书籍的时序编排与相关资料的增补工作。该项目成功展示了远程志愿者协同策展的模式，为提升文学可及性提供了实践范例。"
  },
  {
    "id": "46936315",
    "title": "The First Sodium-Ion Battery EV Is a Winter Range Monster",
    "url": "https://insideevs.com/news/786509/catl-changan-worlds-first-sodium-ion-battery-ev/",
    "summary": "The world’s first mass-produced electric vehicle powered by a sodium-ion battery, the Changan Nevo A06, is set to launch in China by mid-2026. Developed by battery giant CATL, this marks the beginning of a \"dual chemistry era\" where sodium-ion and lithium-ion batteries will coexist.\n\nThe sodium-ion battery, named Naxtra, offers a CLTC-rated range of about 250 miles, competitive with current lithium-iron phosphate (LFP) batteries. Its key advantages are superior cold-weather performance and lower cost. CATL claims it retains over 90% of its range at -40°F and operates stably at -58°F, with no risk of thermal runaway. Sodium is also more abundant and cheaper than lithium.\n\nWhile initially suited for lower-range EVs and energy storage, CATL expects future improvements to push ranges up to 373 miles. The technology is not slated for the U.S. market but demonstrates a shift toward diverse battery chemistries tailored to different climates and consumer needs.",
    "chinese_title": "首款钠离子电池电动车成为冬季续航猛兽。",
    "chinese_summary": "全球首款量产钠离子电池电动汽车——长安启源A06，计划于2026年年中在中国上市。该电池由电池巨头宁德时代研发，标志着钠离子电池与锂离子电池共存的“双化学体系时代”正式开启。\n\n这款名为Naxtra的钠离子电池在CLTC标准下续航里程约为250英里，与当前的磷酸铁锂电池相当。其核心优势在于出色的低温性能和更低的成本。宁德时代宣称，该电池在零下40华氏度环境下仍能保持超过90%的续航能力，在零下58华氏度仍可稳定运行，且无热失控风险。钠元素的储量也比锂更丰富、价格更低廉。\n\n虽然初期主要适用于中短程电动车和储能领域，但宁德时代预计未来技术升级可将续航提升至373英里。该技术暂未计划进入美国市场，但展现了电池化学体系正朝着适应不同气候和消费需求的多元化方向演进。"
  },
  {
    "id": "46932343",
    "title": "Matchlock – Secures AI agent workloads with a Linux-based sandbox",
    "url": "https://github.com/jingkaihe/matchlock",
    "summary": "Matchlock is a CLI tool that runs AI agents in isolated, ephemeral Linux microVMs to prevent security risks. It provides a full, disposable Linux environment that boots quickly, ensuring that any potentially malicious code executed by an agent cannot affect the host machine.\n\nKey features include:\n*   **Network Security:** The sandbox's network is blocked by default, with connections only allowed to explicitly permitted hosts.\n*   **Secret Injection:** Real API credentials are injected via a host-managed MITM proxy, so only placeholders ever enter the VM, preventing secret leakage.\n*   **Isolation:** Each sandbox uses a copy-on-write filesystem that is destroyed after use, and the VM is fully isolated via KVM (Linux) or Virtualization.framework (macOS).\n\nThe tool supports both one-off commands and long-lived sandboxes, can build images from Dockerfiles, and includes Go and Python SDKs for programmatic integration. It is designed for secure, controlled execution of AI agent workloads.",
    "chinese_title": "Matchlock – 通过基于Linux的沙箱保护AI代理工作负载",
    "chinese_summary": "Matchlock是一款CLI工具，通过在隔离的临时Linux微虚拟机中运行AI代理来防范安全风险。它提供完整的一次性Linux环境，启动迅速，确保代理执行的任何潜在恶意代码都无法影响宿主机。\n\n主要特性包括：\n*   **网络安全：** 沙箱网络默认被阻断，仅允许连接明确许可的主机。\n*   **密钥注入：** 真实API凭证通过宿主机管理的MITM代理注入，虚拟机内仅存占位符，防止密钥泄露。\n*   **隔离机制：** 每个沙箱使用写时复制文件系统，使用后即销毁，并通过KVM（Linux）或Virtualization.framework（macOS）实现完全虚拟机隔离。\n\n该工具支持单次命令与长期沙箱运行，可从Dockerfile构建镜像，并提供Go和Python SDK以支持程序化集成，专为安全可控地执行AI代理工作负载而设计。"
  },
  {
    "id": "46933067",
    "title": "Slop Terrifies Me",
    "url": "https://ezhik.jp/ai-slop-terrifies-me/",
    "summary": "This article expresses a deep fear that AI-generated \"slop\"—software that is just \"good enough\"—will become the permanent standard, eroding the craft of software development.\n\nThe author worries that AI progress will stall at a level capable of producing 90% of a solution but critically lacking the final 10% of quality, reliability, and originality. This would lead to a world of mediocre, uninspired applications, dominated by a uniform, templated aesthetic.\n\nWhile acknowledging that poor software is a long-standing human problem driven by misaligned incentives, the author argues AI will accelerate this decline. It enables \"agent herders\" to mass-produce low-quality software faster, while also discouraging developers from deeply understanding their own code.\n\nThe essay questions whether AI will truly democratize creation for non-coders or if a general \"tech learned helplessness\" means most users will passively accept subpar products. The core terror is not just that the craft of building excellent software will die, but that its passing will go unmourned by a society satisfied with \"good enough.\"",
    "chinese_title": "《潲水让我恐惧》",
    "chinese_summary": "本文表达了一种深切的担忧：AI生成的“粗制滥造品”——那些仅仅“勉强够用”的软件——将成为永久标准，侵蚀软件开发的技艺。\n\n作者担心，AI的发展将停滞在能够提供90%解决方案的水平，却严重缺乏最后10%的质量、可靠性和原创性。这将导致一个充斥着平庸、缺乏灵感的应用程序的世界，被千篇一律的模板化美学所主导。\n\n尽管承认劣质软件是人类长期存在的问题，源于不当的激励驱动，但作者认为AI将加速这种衰退。它使“代理牧民”能够更快地大规模生产低质量软件，同时也阻碍开发者深入理解自己的代码。\n\n文章质疑，AI是否真的能为非编程者实现创作的民主化，还是说普遍的“技术性习得性无助”意味着大多数用户将被动接受次优产品。核心的恐惧不仅在于构建优秀软件的技艺将消亡，更在于它的逝去将不会被一个满足于“够用就好”的社会所哀悼。"
  },
  {
    "id": "46930391",
    "title": "Show HN: LocalGPT – A local-first AI assistant in Rust with persistent memory",
    "url": "https://github.com/localgpt-app/localgpt",
    "summary": "**LocalGPT** is a local-first AI assistant built in Rust, designed to run entirely on your own machine without requiring Node.js, Docker, or Python. Its key features include:\n\n*   **Privacy & Portability:** It operates offline with a ~27MB binary, ensuring user data and memory remain private and local.\n*   **Persistent Memory:** It uses a simple markdown-based knowledge store (`MEMORY.md`, `SOUL.md`, etc.) in a workspace directory. This memory is indexed with SQLite for both fast full-text and semantic search.\n*   **Autonomous Operation:** A \"heartbeat\" feature allows it to run background tasks autonomously on a schedule.\n*   **Flexible Interfaces:** It offers a CLI, web UI, and desktop GUI, and supports multiple LLM providers like Anthropic, OpenAI, and Ollama.\n*   **OpenClaw Compatibility:** It works with the file formats and skills from the OpenClaw project.\n\nBasic usage involves installing via Cargo, initializing a config file, and then using commands like `localgpt chat` for conversation or `localgpt daemon start` to run it as a background service with an HTTP API. Configuration is managed via a TOML file for settings like the default AI model and heartbeat intervals.",
    "chinese_title": "Show HN：LocalGPT——采用Rust开发、具备持久化存储的本地优先AI助手",
    "chinese_summary": "**LocalGPT**是一款采用Rust构建的本地优先AI助手，设计为完全在您自己的设备上运行，无需Node.js、Docker或Python。其主要特点包括：\n\n*   **隐私与便携性：** 通过约27MB的二进制文件离线运行，确保用户数据和记忆始终保持私有与本地化。\n*   **持久化记忆：** 在工作区目录中使用基于Markdown的简易知识存储（如`MEMORY.md`、`SOUL.md`等）。这些记忆通过SQLite建立索引，支持快速全文搜索与语义搜索。\n*   **自主运行：** “心跳”功能使其能按计划自主执行后台任务。\n*   **灵活接口：** 提供CLI命令行界面、Web UI及桌面GUI，并支持Anthropic、OpenAI、Ollama等多种大语言模型服务商。\n*   **OpenClaw兼容性：** 支持OpenClaw项目的文件格式与技能工具。\n\n基本使用方式包括通过Cargo安装、初始化配置文件，随后可使用`localgpt chat`进行对话，或通过`localgpt daemon start`将其作为带HTTP API的后台服务运行。所有配置均通过TOML文件管理，可设置默认AI模型、心跳间隔等参数。"
  },
  {
    "id": "46930565",
    "title": "Beyond agentic coding",
    "url": "https://haskellforall.com/2026/02/beyond-agentic-coding",
    "summary": "This article critiques the current state of \"agentic coding\" (AI tools that write code autonomously), arguing they harm productivity by breaking a developer's flow state and reducing their familiarity with the codebase. The author supports this with personal experience, interview data, and research studies.\n\nInstead, the article advocates for AI tools designed around \"calm technology\" principles, which minimize attention demands, act as a \"pass-through\" to the code, and enhance a state of calm focus. Examples include IDE inlay hints and file tree previews.\n\nThe author contrasts this with chat-based coding agents, which are disruptive, indirect, and undermine calm. While praising some aspects of GitHub Copilot's inline and \"next edit\" suggestions, the piece calls for more innovative, calm AI interfaces.\n\nSeveral prototypes are proposed: semantic \"facet-based\" project navigation, automated commit refactoring, and \"file lens\" tools that let users focus on or edit specific aspects of code in simplified formats. The core message is to move beyond the chatbot paradigm and build AI assistants that seamlessly integrate into and support a developer's workflow.",
    "chinese_title": "超越代理编码",
    "chinese_summary": "本文批判了当前“代理式编程”（指能自主编写代码的AI工具）的现状，认为它们会破坏开发者的心流状态、降低其对代码库的熟悉度，从而损害工作效率。作者通过个人经验、访谈数据及研究结果支持这一观点。\n\n相反，文章主张围绕“平静技术”原则设计AI工具，这类工具能最小化注意力需求，充当代码的“透明通道”，并增强专注的平静状态。例如IDE的内联提示和文件树预览功能。\n\n作者将这种模式与基于聊天的编程代理工具进行对比，指出后者具有干扰性、间接性，且破坏专注状态。文章在肯定GitHub Copilot的部分内联和“下一处编辑”建议功能的同时，呼吁开发更具创新性、更符合平静技术理念的AI界面。\n\n文中提出了几种原型设想：基于语义的“分面式”项目导航、自动提交重构，以及“文件透镜”工具——允许用户以简化格式聚焦或编辑代码的特定部分。核心观点是超越聊天机器人范式，构建能无缝融入并支持开发者工作流程的AI助手。"
  },
  {
    "id": "46934906",
    "title": "Do Markets Believe in Transformative AI?",
    "url": "https://marginalrevolution.com/marginalrevolution/2025/09/do-markets-believe-in-transformative-ai.html",
    "summary": "A new study finds that financial markets reacted to major AI releases in 2023-24 as if they believed the technology could be transformative, but in a negative way.\n\nAnalyzing US bond yields, the researchers observed economically significant and lasting declines in long-term Treasury, inflation-protected (TIPS), and corporate bond yields following AI announcements. According to economic theory, such a pattern suggests investors revised down their long-term growth expectations and/or became more concerned about extreme negative outcomes, like existential AI risk.\n\nThe authors interpret these yield movements through a standard asset pricing model. The data is consistent with markets lowering their forecasts for future consumption growth or increasing the perceived probability of a catastrophic scenario. The results do not, however, support the idea that investors primarily saw AI as simply increasing general economic uncertainty.\n\nIn short, the bond market's reaction indicates a belief that transformative AI could materially reduce long-term economic prospects, potentially due to fears of severe downside risks.",
    "chinese_title": "市场是否相信变革性人工智能？",
    "chinese_summary": "一项新研究发现，金融市场对2023-24年间重大人工智能发布事件的反应，似乎表明市场认为这项技术可能具有变革性，但却是以负面方式呈现。\n\n通过分析美国债券收益率，研究人员观察到在人工智能相关公告发布后，长期国债、通胀保值债券（TIPS）及公司债券收益率均出现经济意义上显著且持续的下跌。根据经济理论，这种模式表明投资者下调了对长期增长的预期，和/或对极端负面结果（如人工智能带来的生存性风险）的担忧加剧。\n\n研究者通过标准资产定价模型解读这些收益率变动。数据与市场下调未来消费增长预期，或提高对灾难性情景发生概率的认知这两种解释相一致。然而，研究结果并不支持投资者主要将人工智能视为单纯增加整体经济不确定性的观点。\n\n简而言之，债券市场的反应表明，市场认为变革性人工智能可能实质性削弱长期经济前景，这或许源于对严重下行风险的担忧。"
  },
  {
    "id": "46926245",
    "title": "We mourn our craft",
    "url": "https://nolanlawson.com/2026/02/07/we-mourn-our-craft/",
    "summary": "This article is a lament for the traditional craft of software engineering in the age of AI coding tools. The author, a veteran programmer, acknowledges that AI tools like ChatGPT and Claude are now more effective at writing code than humans, creating a professional dilemma.\n\nHe addresses mid-career developers who may resist these tools on principle, warning that juniors using AI will soon outperform them, putting their jobs at risk. For those with financial obligations, he argues, adopting AI becomes a pragmatic necessity for survival, even if it betrays their younger, more idealistic selves.\n\nWhile accepting this inevitable shift, the author expresses profound grief for what is being lost: the intimate, hands-on artistry of coding, the personal struggle with bugs, and the deep satisfaction of creating something uniquely one's own. He frames current developers as the last generation to code \"by hand,\" whose craft will soon be a historical curiosity. The piece is an invitation to collectively mourn the end of an era, even as the industry moves inexorably forward.",
    "chinese_title": "我们哀悼我们的技艺",
    "chinese_summary": "本文是对人工智能编码工具时代传统软件工程技艺的一曲挽歌。作者作为一名资深程序员，承认ChatGPT和Claude等AI工具如今在编写代码方面已比人类更高效，这造就了一种职业困境。\n\n他特别向那些可能出于原则抵制这些工具的中年开发者喊话，警告说使用AI的初级开发者将很快超越他们，使其工作岌岌可危。对于身负经济压力的人，他认为即便这意味着背叛年轻时更理想主义的自我，采用AI已成为生存的务实选择。\n\n在接纳这一不可避免转变的同时，作者为正在消逝的事物表达了深切哀伤：亲手雕琢代码的亲密艺术感、与程序漏洞的个人搏斗、以及创造出独特成果的深层满足。他将当代开发者视为最后一代“手工”编码者，其技艺很快将成为历史陈迹。这篇文章邀请人们在行业不可阻挡向前之际，共同哀悼一个时代的终结。"
  }
]