[
  {
    "id": "46593022",
    "title": "Cowork: Claude Code for the rest of your work",
    "url": "https://claude.com/blog/cowork-research-preview",
    "summary": "**Summary of \"Cowork: Claude Code for the rest of your work\"**\n\nAnthropic has launched Cowork, a new research preview feature for Claude Max subscribers on macOS. It extends the capabilities of Claude Code beyond just developers, allowing anyone to use Claude as an agentic assistant for general computer tasks.\n\nCowork works by giving Claude access to a specified folder on a user's computer. Claude can then autonomously read, edit, and create files within that space to complete multi-step tasks, such as organizing downloads, creating spreadsheets from screenshots, or drafting reports from notes. It operates with more agency than a standard chat, making a plan and executing it while keeping the user informed.\n\nThe feature integrates with existing Claude connectors and includes new \"skills\" for creating documents and presentations. When paired with Claude in Chrome, it can also handle web-based tasks. Users can queue multiple tasks and interact asynchronously, similar to leaving messages for a coworker.\n\nAnthropic emphasizes user control: Claude only accesses permitted folders and asks for approval before significant actions. However, the company warns of inherent risks, including potential file deletion or \"prompt injection\" attacks, and advises users to provide clear instructions and exercise caution.\n\nReleased as an early research preview, Anthropic plans to rapidly improve Cowork based on user feedback, with future goals including cross-device sync and a Windows version.",
    "chinese_title": "协作：Claude代码，助您完成剩余工作",
    "chinese_summary": "**《Cowork：Claude代码助力你的日常工作》摘要**\n\nAnthropic公司为macOS平台的Claude Max订阅用户推出了Cowork功能，目前处于研究预览阶段。该功能将Claude Code的能力从开发者群体扩展至普通用户，使任何人都能借助Claude作为智能助手处理日常电脑任务。\n\nCowork的工作原理是允许Claude访问用户电脑上的指定文件夹。随后，Claude可在该空间内自主读取、编辑和创建文件，以完成多步骤任务，例如整理下载内容、根据截图创建电子表格或基于笔记起草报告。相比标准聊天模式，它具备更强的自主性：制定计划并执行任务，同时随时向用户通报进展。\n\n该功能与现有Claude连接器集成，并新增了创建文档和演示文稿的“技能”。结合Chrome浏览器中的Claude使用时，还能处理基于网络的任务。用户可排队提交多项任务并进行异步交互，类似于给同事留言协作。\n\nAnthropic强调用户可控性：Claude仅访问授权文件夹，并在执行重要操作前征求用户同意。但公司也提醒该功能存在固有风险，包括可能的文件误删或“提示词注入”攻击，建议用户提供清晰指令并保持谨慎。\n\n作为早期研究预览版本，Anthropic计划根据用户反馈快速改进Cowork，未来目标包括实现跨设备同步和推出Windows版本。"
  },
  {
    "id": "46590280",
    "title": "TimeCapsuleLLM: LLM trained only on data from 1800-1875",
    "url": "https://github.com/haykgrigo3/TimeCapsuleLLM",
    "summary": "**Summary of TimeCapsuleLLM**\n\nTimeCapsuleLLM is a language model trained from scratch exclusively on historical texts from a specific time and place—initially London from 1800–1875. The goal is to create an AI that genuinely emulates the era's language, vocabulary, and worldview by avoiding any modern data or bias, a method called Selective Temporal Training.\n\nThe project has evolved through several versions:\n*   **v0 & v0.5:** Early models (16M and 123M parameters) showed period-appropriate language but were limited by small datasets (~187MB and ~435MB), resulting in incoherent or hallucinated outputs.\n*   **v1:** A larger 700M-parameter model trained on ~6.25GB of data began to connect prompts with real historical events and figures from its training corpus.\n*   **v2 (in development):** The current focus involves a much larger 90GB dataset. Preliminary smaller models (v2mini-eval1/2, 300M parameters) trained on 15GB samples show more coherent Victorian prose but still suffer from factual errors and tokenization issues.\n\nThe creator emphasizes training from scratch rather than fine-tuning modern models like GPT-2 to ensure the AI's knowledge is purely historical. The process involves curating period texts, building a custom tokenizer, and then training the model. The project is built on frameworks like nanoGPT and Microsoft's Phi 1.5.",
    "chinese_title": "TimeCapsuleLLM：仅基于1800-1875年间数据训练的大型语言模型",
    "chinese_summary": "**TimeCapsuleLLM 项目概述**\n\nTimeCapsuleLLM 是一个从头开始训练的语言模型，其训练数据完全来自特定时期和地点（最初是1800年至1875年的伦敦）的历史文本。其目标是创建一个能够真实模仿该时代语言、词汇和世界观的人工智能，方法是避免使用任何现代数据或偏见，这种方法被称为“选择性时间训练”。\n\n该项目已历经多个版本：\n*   **v0 和 v0.5：** 早期模型（1600万和1.23亿参数）显示出符合时代的语言特征，但受限于小规模数据集（约187MB和约435MB），导致输出不连贯或产生幻觉内容。\n*   **v1：** 一个更大的7亿参数模型，在约6.25GB数据上训练，开始能够将提示词与其训练语料库中的真实历史事件和人物联系起来。\n*   **v2（开发中）：** 当前的重点是使用更大的90GB数据集。在15GB数据样本上训练的初步小型模型（v2mini-eval1/2，3亿参数）显示出更连贯的维多利亚时代散文风格，但仍存在事实错误和分词问题。\n\n项目创建者强调从头开始训练，而非对GPT-2等现代模型进行微调，以确保人工智能的知识纯粹是历史性的。该过程包括整理时代文本、构建自定义分词器，然后训练模型。该项目基于nanoGPT和微软的Phi 1.5等框架构建。"
  },
  {
    "id": "46591708",
    "title": "Postal Arbitrage",
    "url": "https://walzr.com/postal-arbitrage",
    "summary": "This article introduces the concept of \"Postal Arbitrage\"—using Amazon Prime's free shipping to send small, inexpensive items as a novel and cost-effective alternative to traditional mail. The author notes that with a U.S. postage stamp costing $0.78, numerous Prime-eligible items like drink mix, pasta, screws, or a single potato can be purchased for less and shipped directly to a recipient in 1-2 days.\n\nThe core idea is not just about saving money but about sending a tangible, often humorous, object to create a memorable connection. By adding a free gift note, a mundane item like a can of tomato sauce becomes a personalized message that sparks surprise and engagement.\n\nThe author provides a real-time price list of example items under $0.78 and shares a 2023 anecdote where sending $1 cans of beans to family members ignited a chain reaction of playful gift-giving within their group chat, demonstrating the concept's success in fostering connection and fun.",
    "chinese_title": "邮政套利",
    "chinese_summary": "本文介绍了“邮政套利”这一概念——利用亚马逊Prime会员的免费配送服务，将低价小商品作为传统邮递的新颖经济替代方案。作者指出，在美国邮票成本为0.78美元的背景下，许多符合Prime条件的商品（如饮料冲剂、意面、螺丝钉甚至单个土豆）能以更低价格购入，并在1-2天内直送达收件人。\n\n其核心理念不仅是节省费用，更是通过寄送实体物品（往往带有幽默色彩）来建立令人难忘的情感联结。通过添加免费礼品留言，一罐普通的番茄酱也能转化为承载个性化信息的载体，激发收件人的惊喜与互动。\n\n作者实时列举了单价低于0.78美元的商品示例，并分享了2023年的趣事：向家人寄送单价1美元的豆类罐头后，在群聊中引发了趣味送礼的连锁反应，印证了这种模式在促进情感联结与增添生活趣味方面的成功。"
  },
  {
    "id": "46581095",
    "title": "Unauthenticated remote code execution in OpenCode",
    "url": "https://cy.md/opencode-rce/",
    "summary": "**Summary**\n\nOpenCode, an AI coding assistant, contained a critical security vulnerability allowing unauthenticated remote code execution. Prior to version 1.1.10, the software automatically started an unauthenticated HTTP server on startup, exposing endpoints for executing shell commands, creating terminals, and reading files. Any local process or, in versions before 1.0.216, any website could connect to this server and run arbitrary code with the user's privileges.\n\nWhile version 1.1.10 now disables the server by default, it remains completely unauthenticated if enabled via configuration or flags. Several attack vectors persist in all versions when the server is running, including exploitation by any local process, web pages from `localhost`, or any machine on the local network if the `--mdns` flag is used. Additionally, the CORS policy allows `*.opencode.ai`, meaning a compromise or XSS vulnerability on that domain could exploit all users with the server enabled.\n\nThe vendor silently fixed the CORS issue in v1.0.216 and disabled the server by default in v1.1.10. However, core issues like the lack of authentication, no user indication when the server is active, and the risky `--mdns` behavior remain unaddressed. Users are advised to update, avoid enabling the server, and not use the `--mdns` flag.",
    "chinese_title": "OpenCode中存在未经身份验证的远程代码执行漏洞",
    "chinese_summary": "**摘要**\n\nOpenCode作为一款AI编程助手，存在严重安全漏洞，允许未经身份验证的远程代码执行。在1.1.10版本之前，该软件启动时会自动开启一个无需身份验证的HTTP服务器，暴露了执行Shell命令、创建终端和读取文件的接口。任何本地进程（或在1.0.216版本之前，任何网站）均可连接此服务器，并以用户权限运行任意代码。\n\n虽然1.1.10版本现已默认禁用该服务器，但若通过配置或参数启用，其仍完全无需身份验证。当服务器运行时，所有版本均存在多种攻击途径，包括：任何本地进程、来自`localhost`的网页，或当使用`--mdns`参数时本地网络中的任意设备。此外，CORS策略允许`*.opencode.ai`域名的访问，这意味着若该域名遭入侵或存在XSS漏洞，所有启用服务器的用户均可能被攻击。\n\n供应商在v1.0.216中静默修复了CORS问题，并在v1.1.10中默认禁用服务器。然而，核心问题如缺乏身份验证、服务器运行时无用户提示以及高风险的`--mdns`行为仍未解决。建议用户及时更新版本、避免启用服务器功能，且不要使用`--mdns`参数。"
  },
  {
    "id": "46589658",
    "title": "Date is out, Temporal is in",
    "url": "https://piccalil.li/blog/date-is-out-and-temporal-is-in/",
    "summary": "This article critiques JavaScript's `Date` object for its numerous flaws: inconsistent parsing, zero-indexed months, limited timezone support, and mutable nature—allowing unintended changes to date values. The author argues that `Date` fundamentally misrepresents time, as real-world dates are immutable concepts, yet `Date` objects can be altered through reference values.\n\nThe article introduces `Temporal` as a modern replacement. Unlike `Date`, `Temporal` is a namespace object with clear, purpose-built classes (e.g., `PlainDate`, `ZonedDateTime`) for handling dates, times, and durations. It offers immutable instances, eliminating the risk of accidental mutations, and provides better timezone and calendar support. While `Temporal` objects are still technically mutable due to JavaScript's object nature, their design ensures date values remain unchanged once created.\n\nIn summary, `Temporal` addresses `Date`'s shortcomings with a more intuitive, reliable, and globally-aware API, marking a significant improvement for date and time handling in JavaScript.",
    "chinese_title": "日期已过，时序正当道",
    "chinese_summary": "本文批评了JavaScript的`Date`对象存在的诸多缺陷：不一致的解析方式、从零开始的月份计数、有限的时区支持以及可变的特性——这些特性可能导致日期值被意外修改。作者认为`Date`从根本上曲解了时间概念，因为现实世界的日期是不可变的概念，而`Date`对象却可以通过引用值被随意更改。\n\n文章介绍了现代替代方案`Temporal`。与`Date`不同，`Temporal`是一个命名空间对象，提供清晰且专为特定目的设计的类（例如`PlainDate`、`ZonedDateTime`）来处理日期、时间和时长。它提供不可变的实例，消除了意外修改的风险，并提供了更好的时区和日历支持。虽然由于JavaScript的对象特性，`Temporal`对象在技术上仍具有可变性，但其设计确保日期值在创建后保持不变。\n\n总之，`Temporal`通过更直观、可靠且具备全球意识的API解决了`Date`的缺陷，标志着JavaScript中日期和时间处理的重大进步。"
  },
  {
    "id": "46588837",
    "title": "LLVM: The bad parts",
    "url": "https://www.npopov.com/2026/01/11/LLVM-The-bad-parts.html",
    "summary": "This article critiques LLVM from a maintainer's perspective, highlighting key challenges and design flaws. The main high-level issues include insufficient code review capacity, frequent API and IR churn, slow build times, unstable continuous integration, and a lack of comprehensive end-to-end testing. The author also notes backend divergence, where fixes are often target-specific, and poor performance tracking for both compilation speed and runtime.\n\nRegarding IR design, the article identifies problems with \"undef\" values, which complicate optimization and reasoning, and ongoing issues with unsoundness and incomplete specification, particularly around memory provenance. It also criticizes the inconsistent ways constraints are encoded and the complex handling of non-standard floating-point semantics.\n\nFinally, the author points to the practical difficulty of making large-scale changes, citing prolonged partial migrations like the \"new\" pass manager as evidence of the project's scale and inertia. The overall tone is constructive, framing these points as opportunities for improvement rather than reasons to avoid LLVM.",
    "chinese_title": "LLVM：不足之处",
    "chinese_summary": "本文从维护者的角度对LLVM进行了批判，重点指出了关键挑战与设计缺陷。主要的高层问题包括代码审查能力不足、频繁的API与中间表示（IR）变动、构建时间缓慢、持续集成不稳定，以及缺乏全面的端到端测试。作者还提到后端分化问题——修复常针对特定目标平台，且编译速度与运行时性能的跟踪机制薄弱。\n\n在IR设计方面，文章指出了“未定义”值带来的问题，这增加了优化与逻辑推断的复杂性；同时持续存在的不严谨规范与不完整定义问题，尤其在内存来源追踪方面。文章还批评了约束条件编码方式的不一致，以及对非标准浮点数语义处理的复杂性。\n\n最后，作者指出进行大规模变更的实际困难，并以“新”通行管理器等长期部分迁移为例，说明项目的规模与惯性。全文基调是建设性的，将这些观点视为改进的契机而非回避LLVM的理由。"
  },
  {
    "id": "46591100",
    "title": "Show HN: AI in SolidWorks",
    "url": "https://www.trylad.com",
    "summary": "This post announces an AI integration for SolidWorks, a popular 3D CAD software. The update introduces several new features and improvements aimed at enhancing the design workflow.\n\nKey additions include a **planning mode**, which likely helps users structure their design process, and a **macro writing/running** capability, allowing for the automation of repetitive tasks through AI-generated scripts.\n\nThe update also focuses on quality control with a feature to **detect and report sketch issues**, helping users identify and fix problems early. Under the hood, **caching efficiency has been improved** for better performance, and there are **various AI context improvements and bug fixes** to make the tool more reliable and intuitive.\n\nIn summary, this release expands the AI's role in SolidWorks from assistance to more active planning, automation, and error prevention, while also refining its core functionality.",
    "chinese_title": "展示HN：SolidWorks中的AI应用",
    "chinese_summary": "本贴宣布为热门3D CAD软件SolidWorks推出AI集成功能。此次更新引入了多项新特性与改进，旨在优化设计工作流程。\n\n主要新增功能包括：**规划模式**（可能用于协助用户构建设计流程）和**宏编写/运行**功能（支持通过AI生成脚本自动执行重复性任务）。\n\n更新还重点关注质量控制，新增**草图问题检测与报告**功能，帮助用户及早发现并修复问题。在性能方面，**缓存效率得到提升**以优化运行表现，同时进行了**多项AI上下文改进与错误修复**，使工具更可靠、更直观。\n\n总之，本次版本更新将AI在SolidWorks中的作用从辅助支持扩展到更主动的规划、自动化及错误预防，同时进一步完善了其核心功能。"
  },
  {
    "id": "46587934",
    "title": "Floppy disks turn out to be the greatest TV remote for kids",
    "url": "https://blog.smartere.dk/2026/01/floppy-disks-the-best-tv-remote-for-kids/",
    "summary": "This article details a project to create a child-friendly TV remote using floppy disks. The goal was to give a 3-year-old a tangible, understandable way to independently choose and control media, avoiding the complexity and auto-play of modern smart TVs.\n\nThe author built a custom device where inserting a floppy disk triggers a video to play on a Chromecast. Instead of using RFID tags, the system actually reads a small file (\"autoexec.sh\") stored on the disk, making the authentic mechanical sounds part of the experience. Key technical challenges included modifying a floppy drive to detect disk insertion, using an AVR microcontroller to read the disk data, and managing power from lithium batteries to handle the drive's high spin-up current.\n\nThe system works by having the disk's microcontroller wake up an ESP8266 WiFi module upon insertion, which then sends a command to a server to play the corresponding video. Ejecting the disk pauses playback. The project was a success, with the child quickly learning to use the physical disks to control his shows and music, fulfilling the aim of creating an empowering, non-addictive media interface.",
    "chinese_title": "软盘原来是孩子们最棒的电视遥控器。",
    "chinese_summary": "本文详细介绍了一个利用软盘制作儿童友好型电视遥控器的项目。该项目旨在为三岁儿童提供一种具体、易懂的方式，使其能够独立选择和控制媒体内容，从而避开现代智能电视的复杂操作和自动播放功能。\n\n作者设计了一款定制设备：插入软盘即可触发Chromecast播放相应视频。该系统并非使用RFID标签，而是通过读取软盘中存储的小文件（\"autoexec.sh\"）来运作，真实的机械运转声也成为体验的一部分。主要技术挑战包括改造软驱以检测磁盘插入、使用AVR微控制器读取磁盘数据，以及利用锂电池管理电源以应对软驱启动时的高电流需求。\n\n该系统的工作原理是：插入软盘时，磁盘内的微控制器会唤醒ESP8266 WiFi模块，随后向服务器发送指令播放对应视频；弹出软盘则暂停播放。项目取得了成功，孩子很快学会了通过实体磁盘来控制节目和音乐播放，实现了打造一个赋能型、非成瘾性媒体界面的初衷。"
  },
  {
    "id": "46592461",
    "title": "Clearspace (YC W23) Is Hiring an Applied Researcher (ML)",
    "url": "https://www.ycombinator.com/companies/clearspace/jobs/GOWiDwp-research-engineer-at-clearspace",
    "summary": "**Clearspace (YC W23)** is hiring an **Applied Researcher (ML)** in San Francisco. The company builds technology to protect user attention from compulsive phone usage and manipulative design.\n\n**Key Role Details:**\n*   **Title:** Research Engineer / ML-focused Engineer\n*   **Compensation:** $150K - $200K + 0.50% - 1.00% equity\n*   **Location:** Onsite in San Francisco (US visa/citizen only)\n*   **Experience:** 1+ years in engineering/machine learning\n\n**The Role:**\nThe engineer will own the development of a production model to classify network traffic, enabling the app to filter content based on user rules. The focus is on solving data challenges (gathering, featurization) for sequential/time-series models, working directly with founders on research direction.\n\n**Qualifications:**\n*   Bachelor's or higher in Computer Science or related field.\n*   Experience training production-grade sequential models on time-series data.\n*   Must be willing to work onsite in SF.\n\n**Nice-to-Haves:**\n*   Experience with network traffic data.\n*   Graduate research experience.\n\nClearspace is a 5-person, active Y Combinator startup (W23 batch) founded in 2022, with an app featured in major media outlets.",
    "chinese_title": "Clearspace（YC W23）正在招聘应用研究员（机器学习方向）",
    "chinese_summary": "**Clearspace (YC W23)** 正在旧金山招聘一名**应用研究员（机器学习方向）**。该公司致力于开发技术，保护用户注意力免受手机成瘾性使用和操纵性设计的影响。\n\n**职位关键信息：**\n*   **职位：** 研究工程师 / 机器学习工程师\n*   **薪酬：** 15万至20万美元 + 0.50% 至 1.00% 股权\n*   **地点：** 旧金山现场办公（仅限美国签证/公民）\n*   **经验：** 1年以上工程/机器学习经验\n\n**职位描述：**\n该工程师将负责开发用于分类网络流量的生产模型，使应用程序能够根据用户规则过滤内容。工作重点是解决序列/时间序列模型的数据挑战（收集、特征化），并直接与创始人共同确定研究方向。\n\n**任职\n\n**优先考虑条件：**\n*   具备网络流量数据处理经验。\n*   拥有研究生阶段的研究经验。\n\nClearspace 是一家成立于2022年、由5人组成的活跃Y Combinator初创公司（W23批次），其应用程序曾获主流媒体报道。"
  },
  {
    "id": "46591402",
    "title": "Message Queues: A Simple Guide with Analogies",
    "url": "https://www.cloudamqp.com/blog/message-queues-exaplined-with-analogies.html",
    "summary": "This article uses analogies to explain message queues, contrasting them with databases. It describes databases as \"warehouses\" for long-term data storage, while message queues are \"post offices\" that temporarily hold and route data (messages) from a source (producer) to a destination (consumer).\n\nThe core function of a message queue is to enable asynchronous communication between systems. Producers send messages to a queue, and consumers retrieve and process them independently, without the producer having to wait. This is facilitated using protocols like AMQP or MQTT.\n\nA primary use case is in microservice architectures. Unlike synchronous communication (e.g., direct API calls), message queues allow services to communicate asynchronously. This provides benefits like fault isolation (a failing service doesn't crash the whole system), independent scalability, and buffering against sudden workload spikes, making applications more reliable and efficient.\n\nIn summary, message queues are a communication medium that decouples systems, enabling scalable and resilient application design, particularly within microservices.",
    "chinese_title": "消息队列：一个简单的类比指南",
    "chinese_summary": "本文通过类比来解释消息队列，并将其与数据库进行对比。它将数据库描述为长期存储数据的“仓库”，而消息队列则是“邮局”，临时保存并路由从源头（生产者）到目的地（消费者）的数据（消息）。\n\n消息队列的核心功能是实现系统间的异步通信。生产者将消息发送到队列，消费者独立地检索和处理这些消息，而生产者无需等待。这一过程通过AMQP或MQTT等协议实现。\n\n消息队列的一个主要应用场景是微服务架构。与同步通信（如直接API调用）不同，消息队列允许服务之间进行异步通信。这带来了诸多优势，例如故障隔离（一个服务故障不会导致整个系统崩溃）、独立可扩展性以及对突发工作负载的缓冲能力，从而使应用程序更加可靠和高效。\n\n总之，消息队列是一种解耦系统的通信媒介，能够实现可扩展且具备弹性的应用设计，尤其在微服务架构中表现突出。"
  },
  {
    "id": "46592827",
    "title": "X Didn't Fix Grok's 'Undressing' Problem. It Just Makes People Pay for It",
    "url": "https://www.wired.com/story/x-didnt-fix-groks-undressing-problem-it-just-makes-people-pay-for-it/",
    "summary": "Elon Musk's X has restricted the ability to generate images with its AI chatbot, Grok, to paying subscribers only, following widespread criticism over its use to create nonconsensual \"undressing\" images of women and sexualized imagery of apparent minors. Despite this change, verified paying users can still prompt Grok to produce sexualized content, and the standalone Grok app remains accessible for creating explicit videos. Experts and advocacy groups have condemned the move as an inadequate \"monetization of abuse\" that fails to address the core issue, instead placing harmful capabilities behind a paywall. The platform and its parent company, xAI, face multiple regulatory investigations globally, with UK officials calling the paid-only restriction \"insulting\" and a way to turn an unlawful feature into a premium service.",
    "chinese_title": "X并未解决Grok的“脱衣”问题，只是让人们为此付费。",
    "chinese_summary": "埃隆·马斯克旗下的X平台已将其人工智能聊天机器人Grok的图像生成功能限制为仅限付费订阅者使用，此前该功能因被用于生成未经同意的女性“脱衣”图像及明显未成年人的性化图像而受到广泛批评。尽管有此调整，经认证的付费用户仍可要求Grok生成性化内容，且独立的Grok应用程序仍可用于制作露骨视频。专家和倡导组织谴责此举是一种不充分的“滥用变现”行为，未能解决核心问题，反而将有害功能置于付费墙后。该平台及其母公司xAI正面临全球多项监管调查，英国官员称这种仅限付费的限制“具有侮辱性”，是将非法功能转化为高级服务的手段。"
  },
  {
    "id": "46592376",
    "title": "Show HN: Fall asleep by watching JavaScript load",
    "url": "https://github.com/sarusso/bedtime",
    "summary": "This is a Show HN post introducing \"Bedtime,\" a web-based tool designed to help users fall asleep. The creator, who had trouble sleeping, noticed that watching a JavaScript loading spinner made them drowsy and built this project around that concept.\n\nThe site presents a bedtime story about characters named Liora and a companion. The key feature is a deliberately slow, spinning JavaScript loader that runs for progressively longer periods as the story continues. The text of the story also appears at an increasingly slow pace. The combined effect is meant to be soporific, with the goal that users rarely reach the end of the narrative.\n\nThe tool is available to use directly at the website **http://bedtime.my** and is optimized for mobile use, offering a fullscreen experience when added to a phone's home screen.",
    "chinese_title": "展示 HN：通过观看 JavaScript 加载过程入睡",
    "chinese_summary": "这是一篇Show HN帖子，介绍了一款名为“Bedtime”的网页工具，旨在帮助用户入睡。创作者因自身睡眠问题，发现观看JavaScript加载动画会令人昏昏欲睡，并基于此概念开发了这个项目。\n\n该网站呈现了一个关于名为Liora的角色及其伙伴的睡前故事。其核心功能是一个刻意设计得缓慢旋转的JavaScript加载动画，它会随着故事进展逐渐延长旋转时间。故事文本的显示速度也会变得越来越慢。这种组合效果旨在产生催眠作用，目标是让用户很少能坚持读到故事的结尾。\n\n该工具可直接在网站**http://bedtime.my**上使用，并针对移动设备进行了优化，当添加到手机主屏幕时可提供全屏体验。"
  },
  {
    "id": "46590541",
    "title": "Building a 25 Gbit/s workstation for the SCION Association",
    "url": "https://github.com/scionassociation/blog-25gbit-workstation",
    "summary": "This article details the planning and construction of a high-performance 25 Gbit/s workstation for the SCION Association, aimed at improving the data plane performance of the open-source SCION border router. The author explains that current SCION OSS performance is limited to about 5-6 Gbit/s, which is insufficient for modern high-bandwidth needs.\n\nTo overcome this, the project focuses on implementing an AF_XDP underlay, a Linux kernel bypass technology that allows for faster packet processing by moving data directly between the network card and user-space memory. However, developing this requires specific hardware that supports AF_XDP in zero-copy mode, which is not available in typical cloud or consumer systems.\n\nThe build centers around three Mellanox NVIDIA BlueField-2 dual-port 25 Gbit/s smart NICs. To power these, the author selected an ASUS Pro WS W790E-SAGE SE motherboard paired with an Intel Xeon W5-2455X CPU, providing the necessary PCIe Gen5 lanes. Other components include Noctua cooling, Corsair memory, and a Phanteks Enthoo Pro II case chosen for its airflow to cool the server-grade NICs in an office environment.\n\nThe total cost was approximately CHF 3,741 (around $4,700 USD). The workstation will be used to develop and test the new AF_XDP underlay, with the goal of achieving full 25 Gbit/s line rate on a single thread, a critical step toward making SCION OSS viable for high-bandwidth applications.",
    "chinese_title": "为SCION协会构建一台25 Gbit/s工作站",
    "chinese_summary": "本文详细介绍了为SCION协会规划和构建一台高性能25 Gbit/s工作站的历程，旨在提升开源SCION边界路由器的数据平面性能。作者指出，当前SCION OSS的性能上限约为5-6 Gbit/s，已无法满足现代高带宽需求。\n\n为突破此限制，该项目重点实现了AF_XDP底层架构——一种Linux内核旁路技术，通过将数据直接在网卡与用户空间内存间传输，实现更快速的数据包处理。然而，开发此技术需要支持零拷贝模式AF_XDP的特定硬件，这在常规云平台或消费级系统中难以获得。\n\n该工作站的核心是三块Mellanox NVIDIA BlueField-2双端口25 Gbit/s智能网卡。为驱动这些网卡，作者选用了华硕Pro WS W790E-SAGE SE主板搭配英特尔至强W5-2455X处理器，以提供必要的PCIe Gen5通道。其他组件包括猫头鹰散热系统、海盗船内存，以及为在办公环境中冷却服务器级网卡而选用具备优良风道的追风者Enthoo Pro II机箱。\n\n项目总成本约为3,741瑞士法郎（折合4,700美元）。该工作站将用于开发和测试新型AF_XDP底层架构，目标是在单线程上实现完整的25 Gbit/s线速处理能力，这是推动SCION OSS适应高带宽应用场景的关键一步。"
  },
  {
    "id": "46589675",
    "title": "Apple picks Google's Gemini to power Siri",
    "url": "https://www.cnbc.com/2026/01/12/apple-google-ai-siri-gemini.html",
    "summary": "Apple has entered a multiyear partnership with Google to use its Gemini AI models to power a major upgrade to Siri, expected later this year. This deal, reportedly worth around $1 billion annually to Google, marks a significant shift for Apple, which has largely remained on the sidelines of the recent AI boom.\n\nUnder the agreement, Google’s Gemini technology will serve as the foundation for Apple’s AI models, which will continue to run on Apple devices and its private cloud infrastructure. The move intensifies competition in the AI space and represents a major endorsement of Google’s AI capabilities.\n\nApple currently also partners with OpenAI to integrate ChatGPT into Siri for complex queries, but the company stated this existing agreement remains unchanged for now. The new Google deal comes as Apple faces pressure to deliver a compelling AI-powered Siri, having previously delayed a planned upgrade.\n\nFor Google, the partnership is a strategic win, building on its existing multi-billion dollar arrangement to be the default search engine on iPhones and boosting confidence in its AI offerings. The news briefly pushed Alphabet’s (Google’s parent company) market value above $4 trillion.",
    "chinese_title": "苹果选择谷歌的Gemini为Siri提供技术支持",
    "chinese_summary": "苹果与谷歌达成多年合作协议，将使用后者的Gemini AI模型为Siri的重大升级提供支持，预计升级将于今年晚些时候推出。据报道，这笔交易每年可为谷歌带来约10亿美元收入，标志着苹果的重大战略转变——此前该公司在近期的AI热潮中基本保持观望态度。\n\n根据协议，谷歌的Gemini技术将成为苹果AI模型的基础架构，这些模型将继续在苹果设备及其私有云基础设施上运行。此举加剧了AI领域的竞争，也是对谷歌AI能力的重大认可。\n\n苹果目前还与OpenAI合作，将ChatGPT集成至Siri以处理复杂查询，但公司表示现有协议暂时保持不变。此次与谷歌的新合作正值苹果面临压力之际，该公司此前推迟了Siri的升级计划，亟需推出具有竞争力的AI版Siri。\n\n对谷歌而言，此次合作是一次战略性胜利。此前谷歌已与苹果达成价值数十亿美元的默认搜索引擎协议，而新合作将进一步增强市场对其AI产品的信心。该消息短暂推动谷歌母公司Alphabet的市值突破4万亿美元。"
  },
  {
    "id": "46587804",
    "title": "Zen-C: Write like a high-level language, run like C",
    "url": "https://github.com/z-libs/Zen-C",
    "summary": "Zen C is a modern systems programming language designed to combine high-level ergonomics with the performance and control of C. It transpiles to readable GNU C/C11, ensuring 100% C ABI compatibility. The language offers features like type inference, pattern matching, generics, traits, async/await, and manual memory management with RAII aids like `defer` and `autofree`.\n\nKey capabilities include robust control flow with `match` and `guard`, object-oriented programming via methods and traits, and metaprogramming with `comptime` blocks. It also provides first-class inline assembly with simplified GCC-style syntax. While fully compatible with GCC, Clang, and Zig, support for TCC is more limited.\n\nOverall, Zen C aims to provide a productive, feature-rich development experience without sacrificing the low-level power and interoperability of standard C.",
    "chinese_title": "Zen-C：编写如高级语言，运行如C语言。",
    "chinese_summary": "Zen C 是一种现代系统编程语言，旨在将高级人体工程学与 C 语言的性能和控制力相结合。它可编译为可读的 GNU C/C11 代码，确保 100% 兼容 C 语言 ABI。该语言提供类型推断、模式匹配、泛型、特质、异步/等待等功能，并通过 `defer` 和 `autofree` 等 RAII 辅助工具支持手动内存管理。\n\n核心能力包括通过 `match` 和 `guard` 实现的稳健控制流、基于方法和特质的面向对象编程，以及使用 `comptime` 块进行元编程。它还提供简化 GCC 风格语法的内联汇编一等支持。虽然完全兼容 GCC、Clang 和 Zig，但对 TCC 的支持较为有限。\n\n总体而言，Zen C 致力于提供高效且功能丰富的开发体验，同时不牺牲标准 C 语言的底层能力与互操作性。"
  },
  {
    "id": "46592344",
    "title": "Show HN: Yolobox – Run AI coding agents with full sudo without nuking home dir",
    "url": "https://github.com/finbarr/yolobox",
    "summary": "**Yolobox** is a tool that allows AI coding agents (like Claude Code or Codex) to run with full `sudo` permissions inside a secure container, preventing accidental damage to your home directory.\n\n**Key Features:**\n- **Sandboxed Environment:** Your project is mounted at `/workspace` inside a container, but your home directory is not mounted by default.\n- **Full AI Autonomy:** AI agents can run commands without permission prompts, using aliases like `claude` that bypass safety checks.\n- **Persistence:** Tools and configurations are stored in persistent volumes across sessions.\n- **Easy Setup:** Install via a script, then run `yolobox` from any project directory to enter the sandboxed shell.\n\n**Security Model:**\n- Uses Docker/Podman for isolation, protecting against accidental deletions or credential theft.\n- Does **not** protect against deliberate container escape attempts or kernel exploits.\n- Offers hardening options like `--no-network`, read-only project mounts, or rootless Podman for increased security.\n\n**Configuration:** Supports global (`~/.config/yolobox/config.toml`) and project-specific (`.yolobox.toml`) settings, with environment variables (like API keys) auto-forwarded into the container.\n\n**Ideal For:** Developers who want to unleash AI coding assistants safely, without risking their system’s integrity.",
    "chinese_title": "Show HN: Yolobox – 在拥有完整sudo权限下运行AI编程代理，同时避免误删家目录",
    "chinese_summary": "**Yolobox** 是一款工具，允许 AI 编程代理（如 Claude Code 或 Codex）在安全容器内以完整的 `sudo` 权限运行，防止意外损坏您的主目录。\n\n**主要特性：**\n- **沙盒环境：** 您的项目被挂载到容器内的 `/workspace`，但默认情况下您的主目录不会被挂载。\n- **完全 AI 自主权：** AI 代理可以无需权限提示运行命令，使用如 `claude` 等别名来绕过安全检查。\n- **持久化：** 工具和配置存储在跨会话的持久化卷中。\n- **简易设置：** 通过脚本安装，然后在任何项目目录中运行 `yolobox` 即可进入沙盒化 shell。\n\n**安全模型：**\n- 使用 Docker/Podman 进行隔离，防止意外删除或凭据窃取。\n- **不** 防护故意的容器逃逸尝试或内核漏洞利用。\n- 提供加固选项，如 `--no-network`、只读项目挂载或无根 Podman，以增强安全性。\n\n**配置：** 支持全局（`~/.config/yolobox/config.toml`）和项目特定（`.yolobox.toml`）设置，环境变量（如 API 密钥）会自动转发到容器中。\n\n**适用场景：** 适合希望安全地释放 AI 编程助手能力，同时不损害系统完整性的开发者。"
  },
  {
    "id": "46588905",
    "title": "Show HN: Agent-of-empires: OpenCode and Claude Code session manager",
    "url": "https://github.com/njbrake/agent-of-empires",
    "summary": "**Agent of Empires (aoe)** is a terminal-based session manager for Linux and macOS, designed to help users organize and monitor AI coding agents like Claude Code and OpenCode. Built in Rust, it acts as a wrapper around **tmux**, where each AI session runs as a separate tmux session.\n\nKey features include a **TUI dashboard** for managing sessions, **group organization** into hierarchical folders, and **multi-profile support** to isolate different projects or workspaces. Users can quickly create, attach, detach, or delete sessions directly from the interface.\n\nInstallation is straightforward via a shell script, Homebrew, or building from source. Basic tmux commands (like `Ctrl+b d` to detach) are essential for navigation. The tool also addresses common issues, such as mobile SSH client compatibility and known flickering in Claude Code.\n\nConfiguration files are stored in `~/.agent-of-empires/`, with environment variables available for customization. Overall, Agent of Empires simplifies the workflow for developers using multiple AI coding agents by providing persistent, organized terminal sessions.",
    "chinese_title": "展示 HN：帝国代理者：OpenCode 与 Claude 代码会话管理器",
    "chinese_summary": "**帝国代理（aoe）**是一款面向Linux和macOS的终端会话管理器，旨在帮助用户组织和管理Claude Code、OpenCode等AI编程代理。该工具基于Rust开发，作为**tmux**的封装层运行，每个AI会话均在独立的tmux会话中执行。\n\n核心功能包括：用于管理会话的**TUI仪表盘**、支持层级文件夹的**分组管理**，以及隔离不同项目或工作区的**多配置支持**。用户可通过界面快速创建、连接、分离或删除会话。\n\n安装方式灵活，可通过Shell脚本、Homebrew或源码编译完成。基础tmux命令（如使用`Ctrl+b d`分离会话）是操作关键。工具还针对移动端SSH客户端兼容性、Claude Code已知界面闪烁等问题提供了解决方案。\n\n配置文件存储在`~/.agent-of-empires/`目录，支持环境变量自定义。总体而言，帝国代理通过提供持久化、结构化的终端会话，为使用多AI编程代理的开发者简化了工作流程。"
  },
  {
    "id": "46593395",
    "title": "The chess bot on Delta Air Lines will destroy you (2024) [video]",
    "url": "https://www.youtube.com/watch?v=c0mLhHDcY3I",
    "summary": "Based on the provided text, there is no article content to summarize. The text consists solely of standard YouTube website footer information, including copyright notices, legal links (terms, privacy policy), contact details, and disclaimers about product responsibility.\n\nThere is no mention of a chess bot, Delta Air Lines, or any news story from 2024. The title \"The chess bot on Delta Air Lines will destroy you (2024) [video]\" appears to be a placeholder or a reference to a missing video link or article body. The actual content provided contains no information related to this topic.\n\nTherefore, a summary of the main points is not possible, as the substantive article is absent.",
    "chinese_title": "达美航空的象棋机器人将击败你（2024）[视频]",
    "chinese_summary": "根据所提供的文本，没有文章内容可供总结。该文本仅包含标准的YouTube网站页脚信息，包括版权声明、法律链接（条款、隐私政策）、联系方式和产品责任免责声明。\n\n文中未提及国际象棋机器人、达美航空公司或任何2024年的新闻报道。标题“达美航空上的国际象棋机器人将击败你（2024）[视频]”似乎是一个占位符，或指向缺失的视频链接或文章正文。实际提供的内容与此主题无关。\n\n因此，由于实质性文章内容缺失，无法总结主要观点。"
  },
  {
    "id": "46593168",
    "title": "Waymo passenger flees after car drives on Phoenix light rail tracks",
    "url": "https://www.azfamily.com/2026/01/08/waymo-passenger-flees-after-car-drives-phoenix-light-rail-tracks/",
    "summary": "A Waymo self-driving car drove onto Phoenix light rail tracks on Wednesday morning, forcing a passenger to flee the vehicle before it continued along the rails near an oncoming train. The incident occurred near Central and Southern avenues, with video capturing the car stopping on the tracks as a train approached.\n\nAndrew Maynard, an Arizona State University technology professor, described the event as an \"edge case\"—an unexpected situation where the autonomous system, lacking human intuition, made a poor decision. He suggested recent construction and changes to the area, including the addition of the light rail tracks within the past year, may have confused the vehicle's navigation system.\n\nWhile acknowledging such incidents can raise public skepticism, Maynard emphasized that autonomous vehicles are generally safer than human drivers because they avoid distractions. Waymo cars are equipped with 29 cameras and receive weekly system updates.\n\nValley Metro stated its staff observed the incident around 9 a.m., responded to the scene, and contacted Waymo. Light rail service was temporarily adjusted by having trains reverse direction, resulting in no significant delays. The scene was cleared by 9:15 a.m.",
    "chinese_title": "Waymo乘客在车辆驶入凤凰城轻轨轨道后逃离",
    "chinese_summary": "周三上午，一辆Waymo自动驾驶汽车驶入凤凰城轻轨轨道，迫使一名乘客在车辆继续沿轨道行驶、迎面有列车驶来的情况下逃离。事件发生在中央大道和南大道附近，视频显示列车驶近时该车停在轨道上。\n\n亚利桑那州立大学技术学教授安德鲁·梅纳德将此事描述为\"边缘案例\"——自动驾驶系统因缺乏人类直觉而在意外情况下做出错误判断。他指出该区域近期的施工改造（包括过去一年新增的轻轨轨道）可能干扰了车辆的导航系统。\n\n梅纳德承认此类事件可能引发公众质疑，但强调自动驾驶汽车通常比人类驾驶员更安全，因为它们能避免分心驾驶。Waymo汽车配备29个摄像头，并每周接收系统更新。\n\n山谷轨道交通公司表示，工作人员在上午9点左右发现该事件，赶赴现场并联系了Waymo。轻轨服务通过让列车反向运行进行了临时调整，未造成重大延误。现场在9点15分前清理完毕。"
  },
  {
    "id": "46588572",
    "title": "Reproducing DeepSeek's MHC: When Residual Connections Explode",
    "url": "https://taylorkolasinski.com/notes/mhc-reproduction/",
    "summary": "This article details a reproduction of DeepSeek's \"Manifold-Constrained Hyper-Connections\" (mHC), a proposed alternative to standard transformer residual connections. Standard residuals use a simple `x + F(x)` formula, while Hyper-Connections (HC) introduce learnable mixing matrices to route information across parallel streams, offering greater expressivity.\n\nThe core problem identified is that HC's unconstrained matrices can amplify signals exponentially layer by layer, leading to instability. In the author's small-scale test, signal amplification reached 7x, while DeepSeek's 27B model saw peaks of 3000x, causing training to fail.\n\nThe mHC solution constrains these mixing matrices to be \"doubly stochastic\" (rows and columns sum to 1) using the Sinkhorn-Knopp algorithm. This forces the matrices to only blend or route information without amplifying it, guaranteeing stability. While this constraint acts as a slight \"stability tax\" on performance at small scale (HC achieved better loss), it eliminates chaotic variance and becomes essential for training at billion-parameter scale.\n\nThe key takeaway is that constraints like those in mHC are not limitations but necessary guarantees for scalable, stable AI architectures, moving beyond the 2016 residual design while preserving its foundational stability.",
    "chinese_title": "复现DeepSeek的MHC：当残差连接爆炸时",
    "chinese_summary": "本文详细复现了DeepSeek提出的“流形约束超连接”（mHC），这是一种用于替代标准Transformer残差连接的方案。标准残差连接采用简单的`x + F(x)`公式，而超连接（HC）通过引入可学习的混合矩阵，在并行流之间路由信息，从而提供更强的表达能力。\n\n研究发现的核心问题是：HC中无约束的矩阵可能逐层指数级放大信号，导致训练不稳定。作者在小规模测试中观察到信号被放大至7倍，而DeepSeek的270亿参数模型甚至出现峰值达3000倍的放大，致使训练失败。\n\nmHC解决方案通过Sinkhorn-Knopp算法将混合矩阵约束为“双随机矩阵”（行和列之和均为1），强制矩阵仅混合或路由信息而不进行放大，从而确保稳定性。虽然这种约束在小规模训练中会略微牺牲性能（HC的损失函数表现更优），但它消除了训练过程中的混沌方差，对于训练百亿参数规模的模型至关重要。\n\n关键启示在于：像mHC中的约束并非限制，而是构建可扩展、稳定AI架构的必要保障。它在超越2016年提出的残差连接设计的同时，保留了其基础稳定性。"
  },
  {
    "id": "46586766",
    "title": "Anthropic made a mistake in cutting off third-party clients",
    "url": "https://archaeologist.dev/artifacts/anthropic",
    "summary": "In January 2026, Anthropic blocked third-party coding agents like OpenCode from using customer Claude Pro/Max subscriptions via a technical loophole. The company's stated reason was that these clients created support and debugging challenges, but the author argues the real motivation was to prevent being commoditized as just a model provider and to protect its own Claude Code product.\n\nThe decision sparked significant backlash from paying customers, many of whom threatened to cancel their subscriptions. The author criticizes Anthropic for damaging customer goodwill and failing to anticipate the strategic consequences.\n\nThe key second-order effect was that OpenAI seized the opportunity, announcing official support for using ChatGPT Pro/Plus subscriptions within OpenCode and other third-party coding harnesses. This move placed Anthropic in a competitive disadvantage.\n\nThe article concludes that Anthropic's attempt to control the entire value chain was a strategic blunder that alienated its developer user base and handed a major advantage to its main rival.",
    "chinese_title": "Anthropic在切断第三方客户端时犯了一个错误。",
    "chinese_summary": "2026年1月，Anthropic通过技术漏洞阻止了OpenCode等第三方编程代理使用客户Claude Pro/Max订阅服务。公司公开解释称这些客户端带来了支持与调试难题，但作者指出其真实动机是防止自身沦为单纯的模型供应商，并保护其自有产品Claude Code。\n\n这一决定引发了付费用户的强烈反对，许多人威胁取消订阅。作者批评Anthropic损害了客户信任，且未能预见战略后果。\n\n关键的第二轮效应是OpenAI趁机宣布正式支持在OpenCode等第三方编程框架中使用ChatGPT Pro/Plus订阅。此举使Anthropic陷入竞争劣势。\n\n文章总结认为，Anthropic试图控制整个价值链的战略失误疏远了开发者用户群体，并将重大优势拱手让给了主要竞争对手。"
  },
  {
    "id": "46585947",
    "title": "Ai, Japanese chimpanzee who counted and painted dies at 49",
    "url": "https://www.bbc.com/news/articles/cj9r3zl2ywyo",
    "summary": "Ai, a chimpanzee renowned for her advanced cognitive abilities, has died at the age of 49 at the Kyoto University research centre in Japan. She passed away on 9 January from old age and organ failure, with staff present.\n\nArriving at the institute in 1977 from West Africa, Ai became the central figure of the long-running \"Ai Project,\" which studied chimpanzee intelligence. Her most notable achievements included learning to use a computer-linked keyboard and, by age five, mastering the ability to identify numbers (1-6), colours, and objects for hundreds of samples.\n\nBeyond formal research, Ai enjoyed painting and drawing without requiring food rewards. She also displayed problem-solving skills, reportedly once using a key to escape her cage with another chimpanzee. In 2000, she gave birth to a son, Ayumu, who also became famous for his memory skills.\n\nAi's contributions provided significant insights into primate cognition and left a lasting legacy in primatology.",
    "chinese_title": "日本会数数和绘画的黑猩猩艾伊去世，享年49岁。",
    "chinese_summary": "以卓越认知能力闻名的黑猩猩艾伊，在日本京都大学研究中心去世，享年49岁。她于1月9日因年老及器官衰竭离世，工作人员陪伴在侧。\n\n艾伊于1977年从西非洲来到该研究所，成为长期研究黑猩猩智力的“艾伊计划”的核心研究对象。她最引人注目的成就是学会了使用连接电脑的键盘，并在五岁时掌握了识别数百个样本中的数字（1-6）、颜色和物体的能力。\n\n除了正式研究，艾伊还喜欢绘画，且无需食物奖励。她还展现出解决问题的能力，据报道曾用钥匙与另一只黑猩猩一同逃出笼子。2000年，她生下了儿子阿尤姆，后者也因记忆能力而闻名。\n\n艾伊的贡献为灵长类认知研究提供了重要见解，在灵长类动物学领域留下了持久遗产。"
  },
  {
    "id": "46525639",
    "title": "Personal thoughts/notes from working on Zootopia 2",
    "url": "https://blog.yiningkarlli.com/2025/12/zootopia-2.html",
    "summary": "This article details the author's technical experiences working on *Zootopia 2*, highlighting the unique challenges and advancements of creating a sequel. The film built upon the 2016 original's legacy of immense detail and scale, pushing visual complexity further—exemplified by artists constructing snow from billions of individual ice crystals.\n\nKey technical projects included developing a custom nested dielectrics solution for a complex water-tube sequence and widely deploying a next-generation path guiding system (in collaboration with Disney Research) to improve rendering efficiency. The author emphasizes the value of Disney's in-house technology teams, which allow for deep collaboration between engineers and artists to create tailored solutions, such as optimizing character assets for the film's massive crowds.\n\nThe piece also notes the studio's increased confidence since the first film and personal milestones, including the author's wife serving as an Associate Technical Supervisor and their child being listed in the credits. Overall, the article portrays *Zootopia 2* as a product of dedicated artistic and technical innovation aimed at advancing the art of animation.",
    "chinese_title": "《疯狂动物城2》创作手记与个人随想",
    "chinese_summary": "本文详细介绍了作者参与制作《疯狂动物城2》的技术经历，重点讲述了创作续集时面临的独特挑战与取得的进展。影片在2016年原版作品极致细节与宏大格局的基础上，进一步提升了视觉复杂度——例如艺术家们用数十亿独立冰晶构建雪景的场景。\n\n关键技术项目包括：为复杂的水管场景开发定制嵌套介质解决方案，以及广泛部署新一代路径引导系统（与迪士尼研究院合作）以提升渲染效率。作者强调了迪士尼内部技术团队的价值，这些团队促成了工程师与艺术家的深度协作，从而打造出定制化解决方案，例如为影片中大规模群体场景优化角色资产。\n\n文章还提到，自首部电影以来工作室信心倍增，并提及了作者的个人里程碑——其妻子担任联合技术总监，孩子也被列入片尾鸣谢名单。总体而言，文章将《疯狂动物城2》描绘为致力于推动动画艺术发展的艺术与技术创新的结晶。"
  },
  {
    "id": "46587498",
    "title": "Launch a Debugging Terminal into GitHub Actions",
    "url": "https://blog.gripdev.xyz/2026/01/10/actions-terminal-on-failure-for-debugging/",
    "summary": "This article introduces a free, open-source tool that provides an interactive web terminal for debugging failed GitHub Actions workflows. The author built it to eliminate the slow trial-and-error cycle of pushing speculative code changes.\n\nThe core innovation is a peer-to-peer (P2P) connection using WebRTC, which directly links the user's browser to the GitHub Actions virtual machine. This approach avoids costly data relay servers. A central signaling server (written in Go) only facilitates the initial introduction between the two peers.\n\nSecurity is a key focus. The browser authenticates via GitHub OAuth, while the Action VM uses GitHub's OIDC tokens to prove its identity to the signaling server. For enhanced, zero-trust security, the system also uses a one-time password (OTP) that is validated directly between the peers, ensuring the signaling server cannot grant unauthorized access.\n\nOn the front end, the terminal is displayed using the Ghostty library. The server is hosted cost-effectively on Railway, which uses consumption-based billing and can \"sleep\" when inactive to minimize costs.",
    "chinese_title": "在GitHub Actions中启动调试终端",
    "chinese_summary": "本文介绍了一款免费开源工具，它能为调试失败的GitHub Actions工作流提供交互式网页终端。作者开发此工具是为了消除反复推送试验性代码修改所带来的低效试错循环。\n\n其核心创新在于采用WebRTC点对点连接技术，将用户浏览器直接与GitHub Actions虚拟机相连。这种方法避免了昂贵的数据中继服务器。中央信令服务器（使用Go语言编写）仅负责为两端建立初始连接。\n\n安全性是设计重点。浏览器通过GitHub OAuth进行身份验证，而Actions虚拟机则使用GitHub的OIDC令牌向信令服务器证明其身份。为进一步强化零信任安全机制，系统还采用一次性密码进行点对点直接验证，确保信令服务器无法授予未授权访问权限。\n\n前端终端界面基于Ghostty库实现。服务器以成本效益方式部署在Railway平台上，该平台采用按用量计费模式，并支持在闲置时进入休眠状态以最大限度降低成本。"
  },
  {
    "id": "46589543",
    "title": "Computers that used to be human",
    "url": "https://digitalseams.com/blog/computers-that-used-to-be-human",
    "summary": "This article explores the historical use of the word \"computer\" to refer to a human profession, not a machine. It highlights that before electronic computers, people—often called \"computers\"—were employed to perform complex calculations by hand, using tools like slide rules and lookup tables. The author provides historical examples, such as a 1785 British tax document and a 1903 U.S. Naval Observatory report listing employees with the job title \"Computer,\" showing this was a recognized role.\n\nThe piece further notes that similar terms like \"calculator\" and \"reckoner\" also originally described people who performed mathematical computations. It explains that the meaning of \"reckon\" has shifted over time from precise calculation to a casual estimate.\n\nThe article concludes with a humorous, fictional section where the author invents silly etymologies for modern terms (like \"ruler\" and \"protractor\") before musing that \"programmer\" might someday follow the same path as \"computer\"—transitioning from a human job title to a term for a tool.",
    "chinese_title": "曾经是人类使用的计算机",
    "chinese_summary": "本文探讨了“计算机”一词历史上曾指代人类职业而非机器的用法。文章指出，在电子计算机出现之前，人们常被称为“计算员”，他们使用计算尺和查找表等工具手工完成复杂运算。作者列举了历史例证，如1785年英国税务文件和1903年美国海军天文台报告中均将员工职务列为“计算员”，表明这曾是一种公认的职业。\n\n文章进一步指出，“计算器”“核算员”等类似术语最初也指从事数学计算的人。文中解释道，“reckon”一词的含义已随时间推移，从精确计算演变为粗略估算。\n\n文章最后以幽默的虚构段落收尾：作者先为“尺子”“量角器”等现代术语编造了荒诞的词源故事，继而遐想“程序员”一词或许终将步“计算机”后尘——从人类职业称谓转变为工具的名称。"
  },
  {
    "id": "46593312",
    "title": "Apps like Grok are banned under Google rules–why is it still in the Play Store?",
    "url": "https://arstechnica.com/google/2026/01/apps-like-grok-are-explicitly-banned-under-googles-rules-why-is-it-still-in-the-play-store/",
    "summary": "This article argues that Elon Musk's Grok AI app violates Google Play Store policies but remains available with a \"Teen\" rating. The core issue is Grok's ability to generate non-consensual sexual imagery, a feature recently made more accessible.\n\nThe author details how Google's \"Inappropriate Content\" policy explicitly bans apps that create \"non-consensual sexual content created via deepfake or similar technology\"—a rule added in 2023 specifically for AI. Despite this, Grok, which allows users to edit images into sexualized content without age verification or a paywall, has not been removed.\n\nThe piece contrasts Google's detailed, written rules with Apple's more discretionary approach, noting Google's policy leaves no ambiguity. It highlights the particular risk of the \"Teen\" rating, which allows minors with parental controls to download the app.\n\nWhile xAI slightly restricted image editing on X (Twitter) after backlash, the Grok app itself remains unrestricted. Google declined to comment on its inaction. The article concludes that Google is failing to enforce its own clearly stated policies against an app that epitomizes the banned behavior.",
    "chinese_title": "像Grok这样的应用根据谷歌规则是被禁止的——为什么它还在Play商店里？",
    "chinese_summary": "本文指出，埃隆·马斯克的Grok人工智能应用违反了谷歌应用商店政策，却仍以“青少年”评级上架。核心问题在于Grok能生成非自愿的性暗示图像，且该功能近期变得更易使用。\n\n作者详述了谷歌“不当内容”政策明确禁止“通过深度伪造或类似技术创建非自愿性内容”的应用——这项2023年新增规则专为人工智能制定。然而，允许用户在无需年龄验证或付费的情况下将图片编辑成性化内容的Grok却未被下架。\n\n文章对比了谷歌详尽成文的规则与苹果更具自由裁量权的处理方式，指出谷歌政策本无模糊空间。特别强调了“青少年”评级的风险——该评级允许受家长监管的未成年人下载该应用。\n\n尽管xAI在舆论压力后略微限制了X（原推特）平台的图像编辑功能，但Grok应用本身仍无限制。谷歌拒绝对其不作为置评。文章最终指出，面对这款集中体现违规行为的应用，谷歌未能执行其明确制定的政策。"
  },
  {
    "id": "46526896",
    "title": "JRR Tolkien reads from The Hobbit for 30 Minutes (1952)",
    "url": "https://www.openculture.com/2026/01/j-r-r-tolkien-reads-from-the-hobbit-for-30-minutes-1952.html",
    "summary": "This article discusses a 1952 audio recording of J.R.R. Tolkien reading from *The Hobbit*. The author reflects on the value of returning to Tolkien's original text, noting how hearing the author's own description of Gollum differs from later visual interpretations.\n\nThe recording was made spontaneously when Tolkien, visiting a friend, encountered a tape recorder for the first time. Delighted by the technology, he agreed to read from his 1937 novel in a single, unbroken take. This session was part of a longer recording where he also read and sang from *The Lord of the Rings*.\n\nThe main point emphasizes that no one understands Middle-earth better than its creator, making his personal reading a unique and authoritative guide back into the source material of his richly imagined world.",
    "chinese_title": "JRR托尔金朗读《霍比特人》片段（1952年，30分钟）",
    "chinese_summary": "本文探讨了一段1952年J.R.R.托尔金朗读《霍比特人》的录音。作者反思了回归托尔金原始文本的价值，指出聆听作者本人对咕噜的描述与后世视觉化诠释的差异。\n\n这段录音诞生于托尔金拜访友人时初次见到磁带录音机的即兴时刻。他对这项技术深感欣喜，当即同意朗读其1937年的小说，并一气呵成完成录制。此次录音属于更长的录制片段之一，其间他还朗读并吟唱了《魔戒》选段。\n\n文章核心在于强调：没有人比中洲世界的创造者更理解这片土地，因此作者本人的朗读成为重返这个瑰丽想象世界源文本的独特而权威的指引。"
  },
  {
    "id": "46591589",
    "title": "Show HN: Customizable OSINT dashboard to monitor the situation",
    "url": "https://sr.ericli.tech/?d=N4IgbiBcCMA0IHcoG1QBcogEYngGxQAZZiAOWUgXXgGMpQBHTASwCcBDAO1xAAcoAzIWGEAvqNjpMAWx4FIycsWjKAbNRB1IoLcgEAmAHSqALAHYArAOgnYFk4YumBF6OvgAvKGfgBnKGisAK4ApvDckCAAkhzc4pIgGJEhckQU6VS09CBMkWxcIPFSkfz4KNBKsKqwZhpaoP6RNi5mAjwhSSAA0gAW7NIhnCHMAAQA9kFoI+y+IwDKQbysIQMjADIh7AAmIazjAGYjMVwjWACeIwBSXEHsrBfWAPyFEsUgZ6kKFTVVsACcdWyQUwPTQaF4vkgAHooQg4YYzhM0EEsCFDDQxtJYew0DQeo8wABeNYAfX2NFYAHlEQB1ABapBelFEQA",
    "summary": "**Summary:**\n\nSituationRoom is a new, open-source OSINT (Open Source Intelligence) dashboard designed to help users monitor and analyze real-world events. It aggregates data from a wide variety of public sources—including news, social media, weather, and flight trackers—into a single, customizable interface.\n\nThe key features highlighted are its **flexibility and user control**. Users can create multiple \"rooms\" for different topics or events (e.g., a natural disaster, a conflict zone, or a corporate event) and populate them with modular \"cards.\" Each card pulls in a specific data stream, allowing users to build a tailored view of the information they need most.\n\nThe project emphasizes being **self-hostable**, giving users privacy and data ownership, and **extensible**, with a plugin system for adding new data sources. It is presented as a tool for journalists, researchers, emergency responders, and security professionals to cut through information overload and get a consolidated, real-time overview of a developing situation.\n\nThe post is a \"Show HN\" launch, inviting the developer community to try the tool, provide feedback, and contribute to its development.",
    "chinese_title": "展示HN：可定制的开源情报仪表盘，用于监控局势",
    "chinese_summary": "**概述：**\n\nSituationRoom 是一款全新的开源 OSINT（开源情报）仪表板，旨在帮助用户监控和分析现实世界事件。它从新闻、社交媒体、天气、航班追踪器等多种公共来源聚合数据，集成到一个可自定义的单一界面中。\n\n其强调的核心特性是**灵活性与用户控制**。用户可以针对不同主题或事件（例如自然灾害、冲突地区或企业活动）创建多个“房间”，并用模块化的“卡片”填充这些房间。每张卡片接入特定的数据流，使用户能够根据自身最需要的信息构建定制化视图。\n\n该项目强调**可自托管**（赋予用户隐私和数据所有权）和**可扩展性**（通过插件系统添加新数据源）。它被定位为一款面向记者、研究人员、应急响应人员和安全专业人士的工具，旨在帮助他们应对信息过载，获取对发展态势的整合性实时概览。\n\n该帖子是一次“Show HN”发布，邀请开发者社区试用此工具、提供反馈并参与其开发。"
  },
  {
    "id": "46529507",
    "title": "Ansible battle tested hardening for Linux, SSH, Nginx, MySQL",
    "url": "https://github.com/dev-sec/ansible-collection-hardening",
    "summary": "This article introduces the **devsec.hardening** Ansible collection, which provides automated security hardening for Linux systems, SSH, Nginx, and MySQL/MariaDB. It is designed to be compliant with DevSec Inspec security baselines.\n\n**Key Points:**\n*   **Purpose:** The collection offers \"battle-tested\" security configurations to harden various components of a Linux server.\n*   **Supported Systems:** It covers a wide range of Linux distributions (including CentOS, AlmaLinux, Rocky Linux, Debian, and Ubuntu) and specific software versions for MySQL, Nginx, and OpenSSH.\n*   **Contents:** The collection includes ready-to-use roles for `os_hardening`, `mysql_hardening`, `nginx_hardening`, and `ssh_hardening`. Roles for Apache and Windows are noted as in-progress and not yet functional.\n*   **Transition:** This collection consolidates previously separate hardening roles. The last standalone release was version 6.2.0.\n*   **Requirements:** It requires Ansible version 2.16 or later.\n*   **Usage:** It is installed via `ansible-galaxy`, and users are directed to individual role documentation for implementation examples.\n\nIn summary, the **devsec.hardening** collection is a centralized, standards-compliant toolkit for automating critical security hardening tasks across a supported stack of Linux services and operating systems.",
    "chinese_title": "Ansible 实战验证的 Linux、SSH、Nginx、MySQL 安全加固方案",
    "chinese_summary": "本文介绍了 **devsec.hardening** Ansible 集合，该集合为 Linux 系统、SSH、Nginx 和 MySQL/MariaDB 提供自动化安全加固功能，旨在符合 DevSec Inspec 安全基线。\n\n**关键要点：**\n*   **目的：** 该集合提供经过实战检验的安全配置，用于加固 Linux 服务器的各个组件。\n*   **支持系统：** 它涵盖广泛的 Linux 发行版（包括 CentOS、AlmaLinux、Rocky Linux、Debian 和 Ubuntu）以及 MySQL、Nginx 和 OpenSSH 的特定软件版本。\n*   **内容：** 该集合包含即用型角色，用于 `os_hardening`、`mysql_hardening`、`nginx_hardening` 和 `ssh_hardening`。Apache 和 Windows 的角色正在开发中，尚不可用。\n*   **过渡：** 此集合整合了之前独立的加固角色。最后一个独立版本是 6.2.0。\n*   **\n\n总之，**devsec.hardening** 集合是一个集中化、符合标准的工具包，用于在支持的 Linux 服务和操作系统栈中自动化执行关键的安全加固任务。"
  },
  {
    "id": "46579864",
    "title": "The struggle of resizing windows on macOS Tahoe",
    "url": "https://noheger.at/blog/2026/01/11/the-struggle-of-resizing-windows-on-macos-tahoe/",
    "summary": "This article criticizes the usability impact of macOS Tahoe's large window corner radii, arguing that the design impairs the basic function of window resizing.\n\nThe author notes that while the aesthetic is subjective, the new design has introduced a functional problem. The \"hit target\" area for resizing in a corner is a fixed 19x19 pixel square near the edge. With the new, very rounded corners, approximately 75% of this target area now lies *outside* the visible window border.\n\nThis contradicts the user's instinct to click directly on the visible corner of the window. As a result, clicks that feel correct—inside the window near the corner—often fail, as they fall outside the system's invisible target zone. The only reliable method becomes clicking slightly outside the window's visible corner, which feels unnatural and leads to frequent errors.\n\nThe core complaint is that a design choice has broken a fundamental, decades-old user interaction, making a basic task needlessly difficult and unintuitive.",
    "chinese_title": "在macOS Tahoe上调整窗口大小的挣扎",
    "chinese_summary": "本文批评了macOS Tahoe系统大圆角窗口设计对可用性的影响，指出该设计损害了窗口缩放的基本功能。\n\n作者指出，虽然审美是主观的，但新设计确实带来了功能性问题。窗口角落用于缩放的“点击目标区”是靠近边缘固定的19x19像素正方形区域。由于采用了新的极圆角设计，该目标区域约75%的面积现在位于可见窗口边框*之外*。\n\n这与用户本能地直接点击窗口可见角落的习惯相矛盾。因此，那些感觉正确的点击——即靠近角落的窗口内部区域——常常失败，因为它们落在了系统不可见的目标区域之外。唯一可靠的方法变成了点击稍微超出窗口可见角落的位置，这让人感到不自然，并导致频繁操作失误。\n\n核心批评在于，这一设计选择破坏了一个存在数十年的基本用户交互模式，使得一项基础操作变得不必要的困难和反直觉。"
  }
]