[
  {
    "id": "46313991",
    "title": "Beginning January 2026, all ACM publications will be made open access",
    "url": "https://dl.acm.org/openaccess",
    "summary": "**Summary of \"Beginning January 2026, all ACM publications will be made open access\"**\n\nThe Association for Computing Machinery (ACM) has announced a major policy shift: starting in January 2026, all new articles published in its journals, conference proceedings, and magazines will be made **immediately open access (OA)** upon publication.\n\n**Key Points:**\n\n*   **Policy Start Date:** The change takes effect for all manuscripts submitted from January 1, 2026, onward.\n*   **Scope:** It applies to the entirety of ACM's publishing portfolio, ensuring that all future research it publishes will be freely available to read worldwide without subscription barriers.\n*   **Funding Model:** To support this transition, ACM will adopt an **\"author-pays\" Open Access model**. The article processing charges (APCs) will be paid by authors, their institutions, or funders. ACM states it will set these fees responsibly and offer waivers and discounts to ensure equity for authors with limited funding.\n*   **Rationale:** The move is driven by ACM's mission to advance computing as a science and profession. By removing access barriers, ACM aims to maximize the dissemination, impact, and reuse of computing research for the global community.\n*   **Current Content:** The policy is forward-looking. Content published before 2026 will remain under its existing access terms, though much of ACM's historical archive is already freely available through various programs.\n*   **Transition Support:** ACM plans to work closely with institutions, libraries, and consortia over the coming years to facilitate a smooth transition to the new model.\n\nIn essence, this decision marks ACM's full commitment to a sustainable OA future, aligning with broader trends in scholarly publishing to ensure immediate and free access to publicly funded research.",
    "chinese_title": "自2026年1月起，所有ACM出版物将转为开放获取。",
    "chinese_summary": "**《自2026年1月起，所有ACM出版物将转为开放获取》摘要**\n\n美国计算机协会（ACM）宣布了一项重大政策调整：自2026年1月起，其所有期刊、会议论文集和杂志上发表的新文章将在出版后**立即转为开放获取（OA）**。\n\n**要点：**\n\n*   **政策生效日期：** 该变更适用于2026年1月1日及之后提交的所有稿件。\n*   **适用范围：** 适用于ACM全部出版内容，确保其未来发布的所有研究成果将在全球范围内免费阅读，无订阅障碍。\n*   **资助模式：** 为支持此转型，ACM将采用**“作者付费”的开放获取模式**。文章处理费将由作者、其所属机构或资助方承担。ACM表示将负责任地设定这些费用，并提供费用减免与折扣，以确保资金有限作者的公平性。\n*   **核心理由：** 此举源于ACM推动计算科学和专业发展的使命。通过消除获取障碍，ACM旨在最大限度地促进计算研究在全球范围内的传播、影响力及再利用。\n*   **现有内容：** 该政策具有前瞻性。2026年之前出版的内容将保持其现有获取条款，不过ACM的大部分历史档案已通过各种项目免费提供。\n*   **转型支持：** ACM计划在未来几年与各机构、图书馆和联盟密切合作，以促进向新模式的平稳过渡。\n\n本质上，这一决定标志着ACM对可持续开放获取未来的全面承诺，顺应了学术出版更广泛的趋势，以确保公共资助的研究能够立即免费获取。"
  },
  {
    "id": "46317098",
    "title": "We pwned X, Vercel, Cursor, and Discord through a supply-chain attack",
    "url": "https://gist.github.com/hackermondev/5e2cdc32849405fff6b46957747a2d28",
    "summary": "In November 2025, a 16-year-old security researcher discovered a critical cross-site scripting (XSS) vulnerability in Mintlify, a popular AI-powered documentation platform used by major companies like X, Vercel, Cursor, and Discord.\n\nThe flaw was in a Mintlify API endpoint (`/_mintlify/static/[subdomain]/[...route]`) that allowed fetching static files from *any* Mintlify-hosted documentation site, regardless of the domain. By uploading an SVG file containing embedded JavaScript to a test documentation site, the researcher could execute that script on the primary domains of Mintlify's customers when a user visited a crafted link.\n\nThis meant an attacker could have stolen user credentials or taken over accounts on platforms like Discord with a single malicious link. The researcher and two collaborators responsibly disclosed the vulnerability. Discord took its developer documentation offline temporarily and reverted to its old platform, while Mintlify's engineering team worked to patch the issue.\n\nThe incident highlights the significant supply-chain risk posed by a single vulnerability in a widely used service. The researchers collectively received approximately $11,000 in bug bounties for their findings.",
    "chinese_title": "我们通过供应链攻击成功入侵了X、Vercel、Cursor和Discord。",
    "chinese_summary": "2025年11月，一名16岁的安全研究员在Mintlify中发现了一个严重的跨站脚本（XSS）漏洞。Mintlify是一个流行的人工智能驱动文档平台，被X、Vercel、Cursor和Discord等大公司使用。\n\n该漏洞存在于Mintlify的一个API端点（`/_mintlify/static/[sub域名]/[...路由]`），允许从*任何*Mintlify托管的文档站点获取静态文件，无论域名如何。通过向一个测试文档站点上传包含嵌入式JavaScript的SVG文件，当用户访问一个特制链接时，该研究员可以在Mintlify客户的主要域名上执行该脚本。\n\n这意味着攻击者可以通过一个恶意链接窃取用户凭据或接管Discord等平台上的账户。该研究员和两名合作者负责任地披露了该漏洞。Discord暂时将其开发者文档下线并恢复到旧平台，而Mintlify的工程团队则努力修补该问题。\n\n这一事件突显了广泛使用的服务中单个漏洞所带来的重大供应链风险。研究人员因其发现总共获得了约11,000美元的漏洞赏金。"
  },
  {
    "id": "46315414",
    "title": "Agent Skills is now an open standard",
    "url": "https://claude.com/blog/organization-skills-and-directory",
    "summary": "This article announces that Claude's \"Skills\" feature—a way to teach Claude repeatable workflows—is now an open standard, making it portable across AI platforms. The update includes three major enhancements for enterprise users.\n\nFirst, organization-wide management allows admins on Team and Enterprise plans to centrally provision and deploy approved skills to all users by default, ensuring consistent workflows.\n\nSecond, the creation and discovery of skills is simplified. Users can describe a skill for Claude to build, edit existing ones, or browse a new public directory of pre-built skills from partners like Notion, Canva, Figma, Atlassian, and Cloudflare. These partner skills provide immediate, integrated workflows for popular tools.\n\nThird, by publishing Agent Skills as an open standard, Anthropic aims to ensure skills work beyond Claude, promoting interoperability across the AI ecosystem, similar to its Model Context Protocol (MCP).\n\nThe article concludes by directing users on how to get started across Claude Apps, Claude Code, and the API, noting that skills require Code Execution and File Creation to be enabled.",
    "chinese_title": "Agent Skills现已开放为标准",
    "chinese_summary": "本文宣布，Claude的“技能”功能——一种教授Claude可重复工作流程的方式——现已成为一个开放标准，使其能够在不同AI平台间移植。此次更新为企业用户带来了三项重大改进。\n\n首先，组织级管理功能允许团队和企业计划的管理员默认集中配置和部署已批准的技能给所有用户，确保工作流程的一致性。\n\n其次，技能的创建和发现过程得到简化。用户可以描述一个技能让Claude构建、编辑现有技能，或浏览来自Notion、Canva、Figma、Atlassian和Cloudflare等合作伙伴的全新公共预建技能目录。这些合作伙伴技能为常用工具提供了即用型集成工作流程。\n\n第三，通过将Agent Skills发布为开放标准，Anthropic旨在确保技能能在Claude之外运行，促进AI生态系统的互操作性，类似于其模型上下文协议（MCP）。\n\n文章最后指导用户如何在Claude Apps、Claude Code和API中开始使用，并指出技能需要启用代码执行和文件创建功能。"
  },
  {
    "id": "46316367",
    "title": "GPT-5.2-Codex",
    "url": "https://openai.com/index/introducing-gpt-5-2-codex/",
    "summary": "Unable to access the article link.",
    "chinese_title": "GPT-5.2-Codex",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46311856",
    "title": "Classical statues were not painted horribly",
    "url": "https://worksinprogress.co/issue/were-classical-statues-painted-horribly/",
    "summary": "This article challenges the widely accepted notion, popularized by modern reconstructions like the \"Gods in Color\" exhibition, that ancient Greek and Roman painted statues were garishly colored in a way modern viewers find ugly. The author argues that the reconstructions are poorly executed, not that ancient taste was alien to ours.\n\nThe evidence presented includes ancient frescoes and mosaics that depict statues with subtle, naturalistic coloring—often leaving large portions of marble white—and which align with modern aesthetic sensibilities. Furthermore, the author notes that other global traditions of polychrome sculpture (e.g., from Egypt or the Renaissance) are appreciated today without similar discomfort.\n\nThe article contends that the reconstructions are inaccurate because they are based only on trace pigments (the underlayers), ignoring the finished overlayers that have completely deteriorated. This results in flat, saturated colors that lack the nuance of the originals. The author suggests the reconstructions' ugliness may stem from the reconstructors' lack of artistic skill, restrictive conservation doctrines, or even a deliberate provocation to generate public interest. The conclusion is that classical statues were not painted \"horribly\"; they were likely painted beautifully, and the modern reconstructions are misleading.",
    "chinese_title": "古典雕像并非被涂得面目全非。",
    "chinese_summary": "本文挑战了一个广为流传的观点——即古希腊和罗马的彩绘雕像色彩俗艳，令现代观者感到丑陋，这一观点因“神祇的色彩”等现代重建展览而流行。作者指出，问题在于重建工作本身存在缺陷，而非古人的审美与现代人格格不入。\n\n文中列举的证据包括古代壁画和镶嵌画，它们描绘的雕像色彩细腻自然，常保留大理石大面积的白色，这与现代审美感受相符。此外，作者提到，其他地区的彩绘雕塑传统（如埃及或文艺复兴时期的作品）如今备受欣赏，并未引发类似的不适感。\n\n文章认为，重建之所以不准确，是因为它们仅依据残留的底层颜料，而忽略了已完全风化的表层修饰。这导致重建色彩单调饱和，缺乏原作的微妙层次。作者推测，重建作品的丑陋可能源于重建者艺术技巧的不足、保守的修复理念，甚至是为了吸引公众关注而刻意制造的争议。结论是：古典雕像并非被“糟糕地”彩绘；它们很可能原本精美绝伦，而现代重建则误导了公众认知。"
  },
  {
    "id": "46317199",
    "title": "Public Makes Millions on Plunging Crypto",
    "url": "https://cepr.net/publications/public-makes-trillions-on-plunging-crypto/",
    "summary": "**Summary of \"Public Makes Millions on Plunging Crypto\"**\n\nThe article from the Center for Economic and Policy Research (CEPR) analyzes the phenomenon of retail investors profiting from the decline in cryptocurrency prices through \"short\" positions. It challenges the common narrative that falling crypto prices uniformly harm the public.\n\nThe main argument is that the cryptocurrency market is a zero-sum game; for every loser, there is a winner. While long-term holders (\"HODLers\") and late buyers suffer losses during a market crash, other participants profit by betting against the market. The article highlights the accessibility of these \"short\" strategies to ordinary investors through various financial instruments like inverse Exchange-Traded Funds (ETFs) and derivatives on trading platforms.\n\nA key point is that significant profits from the 2022 crypto downturn were not confined to elite hedge funds. Public data from major inverse ETFs shows they generated billions of dollars in returns for their shareholders during the market plunge, indicating widespread retail investor participation in these gains.\n\nThe article concludes that the public's relationship with crypto volatility is complex. While many experience losses, a substantial number of retail investors actively use tools to profit from downturns, making them direct financial beneficiaries of the market's collapse alongside large institutional short-sellers. This counters the simplistic view that crypto crashes represent a pure wealth transfer from the public to Wall Street.",
    "chinese_title": "公众在加密货币暴跌中赚取数百万",
    "chinese_summary": "**《公众如何在加密货币暴跌中获利数百万》摘要**\n\n经济与政策研究中心（CEPR）的文章分析了散户投资者通过“做空”策略从加密货币价格下跌中获利的现象。文章挑战了“加密货币价格下跌必然损害公众利益”的普遍说法。\n\n核心论点是：加密货币市场是零和游戏，有亏必有盈。在市场崩盘时，长期持有者（“HODLer”）和后期买入者固然蒙受损失，但其他参与者通过做空市场获利。文章强调，普通投资者可通过反向交易所交易基金（ETF）和交易平台的衍生品等多种金融工具便捷地使用这些做空策略。\n\n关键一点在于，2022年加密货币暴跌中的巨额利润并非仅由精英对冲基金独享。主要反向ETF的公开数据显示，在市场暴跌期间，这些基金为股东创造了数十亿美元的回报，表明散户投资者广泛参与了这些收益的分配。\n\n文章总结道，公众与加密货币波动性的关系是复杂的。尽管许多人遭受损失，但大量散户投资者积极利用工具从市场下跌中获利，使他们与大型机构做空者一样，成为市场崩盘的直接财务受益者。这反驳了“加密货币崩盘纯粹是财富从公众转移到华尔街”的简单化观点。"
  },
  {
    "id": "46316907",
    "title": "How China built its ‘Manhattan Project’ to rival the West in AI chips",
    "url": "https://www.japantimes.co.jp/business/2025/12/18/tech/china-west-ai-chips/",
    "summary": "Based on the article, here is a concise summary:\n\nThe article details China's state-backed, Manhattan Project-like effort to achieve self-sufficiency in advanced AI chips and close the technological gap with the West, particularly the U.S. This national initiative was launched in response to escalating U.S. export controls that restrict China's access to cutting-edge semiconductor technology.\n\nThe core of China's strategy involves two parallel tracks. First, it aims to develop domestic alternatives to Western-designed chips, such as creating substitutes for Nvidia's dominant hardware and software ecosystem. Second, and more critically, China is attempting to leapfrog current technology by pioneering entirely new chip architectures and materials, including designs based on light (photonics) rather than electricity.\n\nThe program is characterized by immense scale and central coordination, pooling resources from top tech companies (like Huawei), research institutes, and universities under government direction. While significant progress has been made—notably Huawei's 7-nanometer Ascend AI chips—the effort faces major hurdles. These include persistent bottlenecks in acquiring advanced manufacturing tools (like EUV lithography machines) due to sanctions, the immense complexity of building a wholly independent supply chain, and a significant talent shortage in core semiconductor fields.\n\nThe overarching conclusion is that while China's ambitious project has made it more resilient and forced innovation in alternative technologies, complete independence from Western semiconductor technology remains a distant and highly challenging goal. The U.S. sanctions have slowed, but not stopped, China's advance, setting the stage for an ongoing technological competition.",
    "chinese_title": "中国如何打造其“曼哈顿计划”以在AI芯片领域与西方抗衡",
    "chinese_summary": "根据文章内容，以下是简明摘要：\n\n文章详述了中国为在高端AI芯片领域实现自给自足、缩小与西方（尤其是美国）技术差距而发起的一项国家主导的“曼哈顿计划”式行动。这项国家倡议的启动，是为了应对美国不断升级的出口管制，这些限制阻碍了中国获取尖端半导体技术。\n\n中国战略的核心包含两条并行路径。其一，旨在开发西方设计芯片的国产替代品，例如打造可替代英伟达主导的硬件和软件生态的方案。其二，也是更为关键的一点，中国正试图通过开创全新的芯片架构和材料（包括基于光子而非电子的设计）来实现技术跨越。\n\n该项目规模宏大且高度集中协调，在政府指导下汇聚了顶尖科技公司（如华为）、研究机构和大学的资源。尽管已取得显著进展——尤其是华为的7纳米昇腾AI芯片——但该计划仍面临重大障碍。这些障碍包括因制裁而在获取先进制造工具（如极紫外光刻机）方面持续存在的瓶颈、构建完全独立供应链的巨大复杂性，以及核心半导体领域严重的人才短缺。\n\n总体结论是，尽管中国的雄心勃勃的计划使其更具韧性，并推动了替代技术的创新，但要完全独立于西方半导体技术，仍是一个遥远且极具挑战性的目标。美国的制裁减缓了但并未阻止中国的进步，为持续的技术竞争奠定了基础。"
  },
  {
    "id": "46316533",
    "title": "FunctionGemma 270M Model",
    "url": "https://blog.google/technology/developers/functiongemma/",
    "summary": "Google has released **FunctionGemma**, a specialized version of its lightweight Gemma 3 270M model, fine-tuned for **function calling**. This enables the model to translate natural language into executable API actions, moving from conversational chatbots to active agents that can perform tasks.\n\nKey features of FunctionGemma include:\n*   **Unified Action and Chat:** It can generate structured function calls and then summarize the results in natural language.\n*   **Built for Customization:** It is designed to be fine-tuned for specific applications, with tests showing fine-tuning boosted accuracy from 58% to 85% on a \"Mobile Actions\" dataset.\n*   **Engineered for the Edge:** Its small size allows it to run locally on devices like mobile phones and NVIDIA Jetson Nano, ensuring low latency and data privacy.\n*   **Broad Ecosystem Support:** It is compatible with popular development and deployment tools like Hugging Face Transformers, vLLM, and Ollama.\n\nThe model is intended for developers who have a defined set of application actions, are ready to fine-tune for reliability, and prioritize local, private, and fast on-device execution. Demos include a \"Mobile Actions\" assistant for offline phone commands and a \"TinyGarden\" voice-controlled game.\n\nFunctionGemma is available for download on Hugging Face and Kaggle, with accompanying guides for fine-tuning and deployment.",
    "chinese_title": "FunctionGemma 270M 模型",
    "chinese_summary": "谷歌发布了**FunctionGemma**，这是其轻量级Gemma 3 270M模型的专用版本，专门针对**函数调用**进行了微调。这使得模型能够将自然语言转化为可执行的API操作，从对话式聊天机器人转变为能够执行任务的主动智能体。\n\nFunctionGemma的主要特点包括：\n*   **统一行动与对话：** 它能够生成结构化函数调用，并以自然语言总结执行结果。\n*   **专为定制设计：** 该模型旨在针对特定应用进行微调，测试显示，在“移动操作”数据集上，微调后其准确率从58%提升至85%。\n*   **为边缘计算打造：** 其小巧的体积使其能够在手机和NVIDIA Jetson Nano等设备上本地运行，确保低延迟和数据隐私。\n*   **广泛的生态系统支持：** 它与Hugging Face Transformers、vLLM和Ollama等主流开发和部署工具兼容。\n\n该模型面向那些已定义好应用操作集、准备通过微调提升可靠性，并优先考虑本地、私密且快速的设备端执行的开发者。演示案例包括一个用于离线手机指令的“移动操作”助手，以及一款名为“TinyGarden”的语音控制游戏。\n\nFunctionGemma现已在Hugging Face和Kaggle上提供下载，并附有微调和部署指南。"
  },
  {
    "id": "46313297",
    "title": "Your job is to deliver code you have proven to work",
    "url": "https://simonwillison.net/2025/Dec/18/code-proven-to-work/",
    "summary": "This article argues that a software engineer's core responsibility is to deliver code that is *proven to work*, not just written. It criticizes the practice of submitting large, untested AI-generated code and expecting reviewers to validate it, calling this a waste of time and a dereliction of duty.\n\nThe author outlines a mandatory two-step process for proving code works:\n1.  **Manual Testing:** The developer must personally see the code function correctly, documenting the steps and results. This includes testing both the \"happy path\" and edge cases.\n2.  **Automated Testing:** The change must include an automated test that fails if the implementation is reverted. The author notes that AI tools make writing these tests easier than ever.\n\nThe piece emphasizes that while AI coding agents are powerful for generating and even executing code, the human engineer must provide accountability. Developers should train these agents to prove their work through both manual execution (e.g., running CLI commands, taking screenshots) and writing automated tests. The final responsibility rests with the human to ensure any submitted code is accompanied by evidence that it functions as intended.",
    "chinese_title": "你的工作是交付经过验证可运行的代码。",
    "chinese_summary": "本文认为，软件工程师的核心职责是交付*经过验证可运行*的代码，而不仅仅是编写代码。文章批评了提交大量未经测试的AI生成代码并期望评审人员验证的做法，称这是浪费时间且失职的行为。\n\n作者概述了验证代码有效性的强制两步流程：\n1.  **手动测试：** 开发者必须亲自验证代码正确运行，并记录步骤和结果，包括测试“正常路径”和边界情况。\n2.  **自动化测试：** 代码变更必须包含自动化测试，当实现被回退时测试会失败。作者指出，AI工具使编写此类测试比以往更容易。\n\n文章强调，虽然AI编程助手在生成甚至执行代码方面很强大，但人类工程师必须承担最终责任。开发者应训练这些助手通过手动执行（如运行CLI命令、截屏）和编写自动化测试来证明其工作成果。人类需最终确保提交的任何代码都附带其按预期运行的证据。"
  },
  {
    "id": "46315547",
    "title": "Military Standard on Software Control Levels",
    "url": "https://entropicthoughts.com/mil-std-882e-software-control",
    "summary": "The MIL-STD-882E standard outlines four simplified levels of software control based on the potential danger posed by software failure:\n\n1.  **Most Dangerous:** Software has direct, immediate control of a system where a malfunction causes instant danger (e.g., flight control software).\n\n2.  **Highly Dangerous:** Either (a) software has direct control but there is a delay before a dangerous outcome, or (b) software is not in direct control but a human must immediately act on its signals to prevent imminent danger (e.g., software triggering a last-second reactor shutdown).\n\n3.  **Less Dangerous:** Software is not in direct control, and there is sufficient time for humans to verify its recommendations against independent methods before taking action.\n\n4.  **Least Dangerous:** Software has only an auxiliary, non-critical role and is not involved in controlling serious systems.\n\nThe author notes this framework is especially relevant today, as advancements in AI (like LLMs and computer vision) are creating new opportunities to integrate software into processes where human oversight was previously dominant.",
    "chinese_title": "软件控制等级军用标准",
    "chinese_summary": "MIL-STD-882E标准根据软件故障可能造成的危险程度，定义了四种简化的软件控制级别：\n\n1.  **最危险：** 软件直接、即时控制系统，其故障会立即引发危险（例如飞行控制软件）。\n\n2.  **高度危险：** 要么（a）软件直接控制，但危险后果的出现存在延迟；要么（b）软件不直接控制，但人员必须立即根据其信号采取行动以防止迫在眉睫的危险（例如触发反应堆最后一秒停堆的软件）。\n\n3.  **较不危险：** 软件不直接控制，且人员在采取行动前有足够时间通过独立方法验证其建议。\n\n4.  **最不危险：** 软件仅起辅助性、非关键作用，不参与控制重要系统。\n\n作者指出，这一框架在当今尤其具有现实意义，因为人工智能（如大语言模型和计算机视觉）的进步，正在创造新的机会将软件集成到以往以人为监督为主导的流程中。"
  },
  {
    "id": "46309359",
    "title": "Let a thousand societies bloom",
    "url": "https://vitalik.eth.limo/general/2025/12/17/societies.html",
    "summary": "This article explores the movement to create new, intentional communities—ranging from digital forums to physical cities—as a way to foster cultural innovation and personal choice beyond traditional nation-states. It draws on the author's experience with Zuzalu, a 2023 experimental \"popup city,\" to highlight the value of medium-term, immersive gatherings for building subcultures, while noting their limitations in cost, depth, and permanence.\n\nThe core argument is that modern society lacks meaningful \"intermediate institutions\" between individuals and states. To address this, the author proposes the development of modern \"tribes\": groups that actively innovate on culture, defined as the functional patterns of human behavior that determine a community's success, not just its aesthetics. These tribes should evolve organically rather than through top-down mandates.\n\nThe article also envisions \"zones\"—physical areas with legal autonomy to experiment with novel policies in urbanism, governance, and regulation. Host countries could benefit from the economic activity and innovation these zones generate. The ultimate goal is an \"archipelago\" of diverse, cooperating tribes and zones, allowing a pluralistic ecosystem where different social models can be tested and refined.",
    "chinese_title": "让千种社会百花齐放",
    "chinese_summary": "本文探讨了创建新型、有意识的社区运动——从数字论坛到实体城市——作为超越传统民族国家、促进文化创新和个人选择的一种方式。文章借鉴了作者在2023年实验性“快闪城市”Zuzalu的经历，强调了中期沉浸式聚会对构建亚文化的价值，同时也指出了其在成本、深度和持久性方面的局限性。\n\n核心论点是现代社会缺乏介于个人与国家之间的有意义的“中间机构”。为此，作者提出发展现代“部落”：这些群体积极创新文化，而文化被定义为决定社区成功与否的人类行为功能模式，而不仅仅是其美学表现。这些部落应有机演化，而非通过自上而下的指令形成。\n\n文章还设想了“特区”——拥有法律自治权的实体区域，用于在城市规划、治理和监管方面试验新政策。东道国可以从这些特区产生的经济活动和创新中受益。最终目标是形成一个由多样化、相互合作的部落和特区组成的“群岛”，构建一个多元化的生态系统，让不同的社会模式得以测试和完善。"
  },
  {
    "id": "46292266",
    "title": "Meta Segment Anything Model Audio",
    "url": "https://ai.meta.com/samaudio/",
    "summary": "Unable to access the article link.",
    "chinese_title": "Meta分段任意模型音频",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46308748",
    "title": "Ringspace: A proposal for the human web",
    "url": "https://taggart-tech.com/ringspace/",
    "summary": "The author proposes reviving and modernizing the concept of webrings to combat the decline of the \"human web\"—a space for genuine, person-to-person connection and creativity, as opposed to AI-generated content and corporate platforms.\n\nThey argue that the original webring model, which linked related sites in a circular structure, was built on a foundation of communal trust and shared focus. To adapt this for today's needs, the author has created **Ringspace**, a proof-of-concept tool that uses asymmetric cryptography to provide readers with verifiable assurances: that a site is authentically operated by its claimed creator and is in good standing within its specific community.\n\nA key design principle is that Ringspace rings are intentionally small to medium in scale, as the author believes meaningful trust cannot exist at an internet-wide level. The system includes a CLI tool and a browser extension to manage and verify this trust.\n\nThe project is presented not as a finished product, but as a demonstration of how applying human-centric principles and modern trust mechanisms to older, simpler web concepts could help reclaim a more authentic and connected internet.",
    "chinese_title": "环空间：人类网络的一项提案",
    "chinese_summary": "作者提出复兴并现代化“网络环”的概念，以对抗“人性化网络”的衰落——后者是一个促进真实人际连接与创造力的空间，与人工智能生成内容和企业化平台形成鲜明对比。\n\n他们认为，最初以环形结构链接相关网站的网络环模式，建立在社群信任与共同关注的基础之上。为适应当今需求，作者开发了**Ringspace**，这是一个概念验证工具，采用非对称加密技术为读者提供可验证的保证：确保网站确实由其声明的创建者运营，并在特定社群中保持良好的声誉。\n\n一个关键设计原则是，Ringspace的环被刻意控制在中小规模，因为作者认为有意义的信任无法在互联网整体层面实现。该系统包含命令行工具和浏览器扩展，用于管理和验证这种信任关系。\n\n该项目并非作为成品推出，而是旨在展示：将以人为本的原则与现代信任机制应用于更早期、更简单的网络概念，或许能帮助我们重拾一个更真实、更具连接性的互联网。"
  },
  {
    "id": "46317765",
    "title": "Interactive Fluid Typography",
    "url": "https://electricmagicfactory.com/articles/interactive-fluid-typography/",
    "summary": "This article explores the evolution of fluid typography in CSS, moving from basic viewport-based scaling to more sophisticated, controlled methods.\n\nIt begins with a simple technique using `calc()` to scale font size relative to viewport width, but notes its drawback of unlimited scaling. The `clamp()` function is introduced as a solution, allowing designers to set minimum, preferred, and maximum sizes for smooth scaling within a range.\n\nThe author then highlights a limitation: using a single typographic scale (like the golden ratio) for all screen sizes isn't ideal. They present the Utopia fluid scale generator as a powerful tool that creates different scales for small and large viewports, ensuring harmonious typography everywhere. However, this method requires external tools and lacks live-editing flexibility.\n\nThe \"missing piece\" is identified as CSS Typed Arithmetic (now in Chrome), which allows calculations with mixed units. This enables the creation of a fully fluid system where both the base font size *and* the typographic scale ratio can transition smoothly between defined minimum and maximum viewport sizes, all controllable within CSS.\n\nThe article concludes by looking ahead to future CSS functions for even more elegant solutions and provides an interactive demo for the reader to experiment with the concepts.",
    "chinese_title": "交互式流体排版",
    "chinese_summary": "本文探讨了CSS中流体排版的演变，从基于视口的基本缩放发展到更精细、可控的方法。\n\n文章首先介绍了一种使用`calc()`根据视口宽度缩放字体大小的简单技术，但指出了其无限缩放的缺点。随后引入`clamp()`函数作为解决方案，允许设计者设置最小、首选和最大尺寸，实现在一定范围内的平滑缩放。\n\n作者接着强调了一个局限：为所有屏幕尺寸使用单一排版比例（如黄金比例）并不理想。他们介绍了Utopia流体比例生成器作为强大工具，可为小视口和大视口创建不同比例，确保在任何设备上都能实现和谐的排版。但这种方法需要借助外部工具，且缺乏实时编辑的灵活性。\n\n文章指出“缺失的一环”是CSS类型化算术（现已在Chrome中实现），它允许混合单位计算。这使得创建完全流体系统成为可能，其中基础字体大小*和*排版比例系数都能在定义的最小和最大视口尺寸之间平滑过渡，且完全可通过CSS控制。\n\n文章最后展望了未来CSS函数可能带来的更优雅解决方案，并提供了交互式演示供读者实践这些概念。"
  },
  {
    "id": "46240855",
    "title": "Jonathan Blow has spent the past decade designing 1,400 puzzles",
    "url": "https://arstechnica.com/gaming/2025/12/jonathan-blow-has-spent-the-past-decade-designing-1400-puzzles-for-you/",
    "summary": "Jonathan Blow, the creator of *The Witness*, is nearing completion of his next puzzle game, *Order of the Sinking Star*, after approximately nine years of development. Initially conceived as a short proof-of-concept project, the game has expanded to feature around 1,400 puzzles, which could take dedicated players 400–500 hours to complete.\n\nThe game is built on 2D grid-based navigation, with four distinct puzzle worlds focusing on mechanics like block-pushing, mirror-based teleportation, path-building, and an ability-granting exoskeleton. After an initial linear section (estimated at 8–40 hours), these mechanics begin to intersect, creating complex combined puzzles that Blow describes as the core of the game's \"combinatoric explosion\" of possibilities. A first ending arrives after roughly 60–100 hours, with additional secret content beyond.\n\nBlow credits the commercial success of *The Witness* (which grossed over $5 million in its first week) for allowing this extended, ambitious development cycle. He also notes that the game's scale necessitated more extensive playtesting than his previous projects, a departure from his earlier skepticism about the process. While acknowledging the project's high cost, Blow states the team is now focused on finishing and releasing the game in 2026.",
    "chinese_title": "乔纳森·布洛花了十年时间设计了1400个谜题",
    "chinese_summary": "《见证者》创作者乔纳森·布洛历经约九年开发，其新作解谜游戏《沉星之序》已接近完成。这款最初仅作为概念验证的短篇项目，现已扩展至包含约1400个谜题，专注玩家可能需要400-500小时才能通关。\n\n游戏采用二维网格化导航系统，构建了四个风格迥异的谜题世界，分别聚焦方块推动、镜面传送、路径构建以及赋能式外骨骼等核心机制。在约8-40小时的线性引导章节后，这些机制开始相互交织，形成布洛所称游戏“组合爆炸”可能性的核心——复杂的复合型谜题。首个结局将在60-100小时后呈现，其后更隐藏着额外秘密内容。\n\n布洛坦言，《见证者》首周超500万美元的商业成功，为此次漫长而雄心勃勃的开发周期提供了支撑。他同时指出，游戏规模迫使其开展比以往项目更广泛的试玩测试——这改变了他早年对该流程的质疑态度。尽管承认项目成本高昂，布洛表示团队目前正全力推进开发，计划于2026年正式发行。"
  },
  {
    "id": "46312792",
    "title": "Virtualizing Nvidia HGX B200 GPUs with Open Source",
    "url": "https://www.ubicloud.com/blog/virtualizing-nvidia-hgx-b200-gpus-with-open-source",
    "summary": "This article details the technical challenges and solutions for virtualizing NVIDIA HGX B200 GPUs using open-source tools. It explains that the B200's SXM modules and NVLink/NVSwitch fabric make it trickier to virtualize than PCIe GPUs.\n\nThe author recommends \"Shared NVSwitch Multitenancy\" as the optimal model, allowing flexible 1-, 2-, 4-, or 8-GPU VMs with full NVLink bandwidth within each partition, managed by the host's Fabric Manager.\n\nKey implementation steps include:\n1.  Preparing the host by binding GPUs to the `vfio-pci` driver for passthrough.\n2.  Ensuring strict version alignment between the host's Fabric Manager and the guest's `nvidia-open` driver.\n3.  Overcoming a critical \"PCI Topology Trap\": The B200's CUDA initialization fails if the GPU's complex PCIe hierarchy is flattened by the hypervisor. The solution involves using QEMU to preserve the correct multi-level topology.\n4.  Solving a \"Large-BAR Stall\" issue related to memory mapping, either by upgrading QEMU or disabling BAR mmap.\n5.  Using the Fabric Manager API to create and assign GPU partitions to VMs.\n\nThe post concludes that while complex, a fully functional, open-source virtualization stack for the HGX B200 is achievable, providing a flexible alternative to proprietary cloud offerings.",
    "chinese_title": "开源虚拟化Nvidia HGX B200 GPU",
    "chinese_summary": "本文详细介绍了使用开源工具虚拟化NVIDIA HGX B200 GPU的技术挑战与解决方案。文章指出，由于B200采用SXM模块和NVLink/NVSwitch架构，其虚拟化难度高于PCIe GPU。\n\n作者推荐“共享NVSwitch多租户”作为最优模型，该模型允许在主机Fabric Manager管理下，创建具有完整NVLink带宽的灵活1、2、4或8卡虚拟机分区。\n\n关键实施步骤包括：\n1. 将GPU绑定至`vfio-pci`驱动以实现直通。\n2. 确保主机Fabric Manager与虚拟机`nvidia-open`驱动版本严格对齐。\n3. 破解“PCI拓扑陷阱”：若虚拟机管理器扁平化GPU的多层PCIe层级结构，B200的CUDA初始化将失败，需通过QEMU保持正确的多级拓扑结构。\n4. 解决与内存映射相关的“大BAR停滞”问题，可通过升级QEMU或禁用BAR内存映射实现。\n5. 使用Fabric Manager API创建GPU分区并分配给虚拟机。\n\n文章总结指出，尽管过程复杂，但通过开源虚拟化方案实现功能完备的HGX B200虚拟化是可行的，这为专有云服务提供了灵活的替代方案。"
  },
  {
    "id": "46317546",
    "title": "How to hack Discord, Vercel and more with one easy trick",
    "url": "https://kibty.town/blog/mintlify/",
    "summary": "This article details a series of critical security vulnerabilities discovered in Mintlify, a popular documentation platform used by major companies like Discord, Vercel, and Twitter. The primary findings were:\n\n1.  **Server-Side Remote Code Execution (CVE-2025-67843):** By injecting malicious MDX/JSX code into documentation, an attacker could execute arbitrary code on Mintlify's serverless environment, gaining access to internal files, environment variables, and the ability to poison caches for widespread site defacement or XSS.\n\n2.  **Targeted Cross-Site Scripting (CVE-2025-67842 & CVE-2025-67845):** A flaw in the static asset serving endpoint allowed an attacker to access and serve malicious files (like an XSS-laden SVG) from one organization's repository to any other Mintlify customer's domain. A patch bypass using path traversal was also discovered.\n\n3.  **Additional Vulnerabilities:** These included a GitHub IDOR allowing unauthorized access to commit data, and a downgrade attack leveraging old, vulnerable Vercel deployments.\n\nCollectively, these flaws enabled supply chain attacks against Mintlify's clients, potentially leading to one-click XSS, data theft, and site defacement on high-profile domains. The vulnerabilities were responsibly disclosed, promptly patched by Mintlify, and the researcher was awarded a $5,000 bounty.",
    "chinese_title": "如何用一个简单技巧入侵Discord、Vercel及其他平台",
    "chinese_summary": "本文详细介绍了在Mintlify这一被Discord、Vercel、Twitter等大型企业广泛使用的文档平台中发现的一系列关键安全漏洞。主要发现包括：\n\n1.  **服务器端远程代码执行漏洞（CVE-2025-67843）：** 攻击者可通过在文档中注入恶意MDX/JSX代码，在Mintlify的无服务器环境中执行任意代码，从而访问内部文件、环境变量，并能够污染缓存以实现大规模网站篡改或跨站脚本攻击。\n\n2.  **定向跨站脚本漏洞（CVE-2025-67842与CVE-2025-67845）：** 静态资源服务端点存在缺陷，允许攻击者从一个组织的存储库中获取恶意文件（如携带XSS的SVG文件）并分发给任何其他Mintlify客户的域名。此外还发现了利用路径遍历的补丁绕过方法。\n\n3.  **其他漏洞：** 包括允许未经授权访问提交数据的GitHub IDOR漏洞，以及利用老旧脆弱的Vercel部署实施的降级攻击。\n\n这些漏洞共同构成了针对Mintlify客户的供应链攻击，可能导致高知名度域名遭受一键式XSS攻击、数据窃取和网站篡改。相关漏洞已通过负责任的方式披露，Mintlify迅速发布了修复补丁，研究人员因此获得了5000美元奖金。"
  },
  {
    "id": "46303406",
    "title": "How did IRC ping timeouts end up in a lawsuit?",
    "url": "https://mjg59.dreamwidth.org/73777.html",
    "summary": "**Summary of \"How did IRC ping timeouts end up in a lawsuit?\"**\n\nThe article details how a technical detail from Internet Relay Chat (IRC) protocols became central to a significant software licensing lawsuit. The case involved Artifex Software, creator of the Ghostscript PDF interpreter, and a company that integrated it without complying with its open-source license (GNU GPL).\n\nArtifex needed to prove the software was actively used over a network to invoke a specific legal claim. They discovered that the infringing product's update mechanism used an **IRC client library (libircclient)**. This library, by default, sends periodic \"PING\" messages to an IRC server to maintain the connection. Logs from the defendant's own servers showed these automated PING/PONG exchanges, even though no human was chatting.\n\nThis technical artifact provided concrete, machine-generated evidence that the software was transmitting data over a network as part of its normal operation. This evidence was crucial in defeating the defendant's motion to dismiss, allowing the lawsuit to proceed and ultimately helping Artifex secure a favorable settlement.\n\nThe core takeaway is that an obscure, default behavior of a minor software component—IRC ping timeouts—served as the definitive proof required for a successful copyright enforcement case, bridging the gap between a software licensing violation and a specific legal statute.",
    "chinese_title": "IRC的ping超时问题是如何演变成一场诉讼的？",
    "chinese_summary": "**《IRC ping超时如何成为诉讼关键？》摘要**\n\n本文详述了互联网中继聊天（IRC）协议中的一项技术细节，如何成为一起重大软件许可诉讼的核心。案件涉及Ghostscript PDF解释器的开发商Artifex Software，以及一家未遵守其开源许可证（GNU GPL）即集成该软件的公司。\n\nArtifex需证明该软件在网络中被主动使用，以援引特定法律主张。他们发现侵权产品的更新机制使用了**IRC客户端库（libircclient）**。该库默认会定期向IRC服务器发送“PING”消息以维持连接。被告自家服务器的日志显示，即使无人实际聊天，这些自动的PING/PONG交互依然存在。\n\n这一技术痕迹提供了具体、机器生成的证据，表明该软件在正常操作中通过网络传输数据。此证据对驳回被告撤销动议至关重要，使诉讼得以推进，并最终帮助Artifex达成有利和解。\n\n核心启示在于：一个次要软件组件（IRC ping超时）的隐蔽默认行为，成为了成功维权诉讼所需的关键证据，弥合了软件许可违规与具体法律条文之间的举证鸿沟。"
  },
  {
    "id": "46262031",
    "title": "Dogalog: A realtime Prolog-based livecoding music environment",
    "url": "https://github.com/danja/dogalog",
    "summary": "**Dogalog** is a realtime, Prolog-based livecoding environment for creating algorithmic music directly in a web browser. Users write logic rules to generate rhythmic patterns and melodies, with code changes applying automatically for immediate auditory feedback.\n\nKey features include state preservation (counters and cooldowns persist across code edits), a built-in interactive tutorial, PWA support for offline use, and a mobile-first, touch-friendly interface. The system uses a custom Prolog engine to evaluate rules that define when sounds play, querying `event(Voice, Pitch, Velocity, Time)` on each musical step.\n\nIt provides a rich library of built-in predicates for timing (like `beat`, `every`, and Euclidean rhythms `euc`), randomness (`prob`, `choose`), musical operations (`scale`, `chord`), and logic control (`cooldown`, `within`). Examples range from simple drum patterns to complex polyrhythms and melodic sequences using scales and chords.\n\nThe project is built with vanilla JavaScript and WebAudio API, featuring a modular architecture, comprehensive testing, and full documentation. It runs in modern browsers and is installable as a progressive web app.",
    "chinese_title": "Dogalog：基于Prolog的实时编程音乐环境",
    "chinese_summary": "**Dogalog** 是一款基于 Prolog 的实时编程环境，可直接在网页浏览器中创作算法音乐。用户通过编写逻辑规则来生成节奏模式和旋律，代码修改会自动应用，提供即时听觉反馈。\n\n主要功能包括状态保存（计数器和冷却时间在代码编辑间持续保留）、内置交互式教程、支持离线使用的渐进式网页应用（PWA），以及移动优先、触控友好的界面。该系统使用自定义的 Prolog 引擎，通过在每个音乐步骤中查询 `event(音色, 音高, 力度, 时间)` 来评估定义声音播放时机的规则。\n\n它提供了丰富的内置谓词库，涵盖时序控制（如 `beat`、`every` 和欧几里得节奏 `euc`）、随机性（`prob`、`choose`）、音乐操作（`scale`、`chord`）和逻辑控制（`cooldown`、`within`）。示例涵盖从简单的鼓点模式到使用音阶与和弦的复杂复节奏及旋律序列。\n\n该项目基于原生 JavaScript 和 WebAudio API 构建，采用模块化架构，包含全面测试和完整文档。它可在现代浏览器中运行，并可安装为渐进式网页应用。"
  },
  {
    "id": "46313061",
    "title": "Are Apple gift cards safe to redeem?",
    "url": "https://daringfireball.net/linked/2025/12/17/are-apple-gift-cards-safe-to-redeem",
    "summary": "This article, by John Gruber, discusses the safety concerns surrounding Apple gift cards following a high-profile incident where a user, Paris Buttfield-Addison, had his Apple account locked after redeeming a tampered $500 card purchased from a major retailer.\n\nThe main points are:\n*   The incident created significant uncertainty, leading the author and others to question whether redeeming Apple gift cards is safe, as it can potentially trigger fraud algorithms and result in a permanent, unexplained account lockout.\n*   While Buttfield-Addison's account was eventually restored by Apple's Executive Relations team after a week of publicity, the article emphasizes that the underlying problem remains unresolved.\n*   Key unanswered questions persist: the exact cause of the lock, why resolution was so difficult, and whether such decisions are made by algorithms without human oversight.\n*   The author concludes by expressing personal nervousness about using gift cards tied to an Apple ID and suggests the community consider avoiding them until Apple provides clarity and ensures the redemption process is safe.",
    "chinese_title": "苹果礼品卡兑换安全吗？",
    "chinese_summary": "本文由约翰·格鲁伯撰写，讨论了围绕苹果礼品卡的安全隐患。此前发生了一起备受关注的事件：用户帕里斯·巴特菲尔德-艾迪森从一家大型零售商处购买了一张被篡改的500美元礼品卡，兑换后其苹果账户遭到锁定。\n\n文章要点如下：\n*   该事件引发了巨大不确定性，使作者等人质疑兑换苹果礼品卡是否安全——此举可能触发欺诈算法，导致账户被永久且无理由地封锁。\n*   尽管巴特菲尔德-艾迪森的账户在事件曝光一周后由苹果高管关系团队恢复，但文章强调根本问题仍未解决。\n*   关键疑问持续存在：账户锁定的确切原因、解决过程为何如此困难，以及此类决定是否由算法在无人监督的情况下作出。\n*   作者最后表示，对使用与苹果ID绑定的礼品卡感到不安，建议在苹果明确说明并确保兑换流程安全之前，用户群体应考虑避免使用此类礼品卡。"
  },
  {
    "id": "46311637",
    "title": "Hightouch (YC S19) Is Hiring",
    "url": "https://hightouch.com/careers",
    "summary": "Hightouch (YC S19), a Series C startup, is hiring across multiple departments. The company emphasizes a culture built on core values like ambition, kindness, efficient execution, compassion, impact, high standards, and humility.\n\nThe roles are primarily remote across North America and Europe, with some positions based in offices in San Francisco, NYC, Charlotte, and London. Open positions span several functions, including:\n*   **Engineering:** Multiple roles in AI, backend, full-stack, distributed systems, and machine learning.\n*   **Sales & Customer Success:** Account executives, solutions engineers, customer success managers, and sales development representatives.\n*   **Marketing, Partnerships, & Operations:** Field marketing, alliances leads, and operations roles.\n*   **Other Departments:** AI strategy, legal, finance, data, people operations, and technical recruiting.\n\nThe company offers competitive benefits such as competitive compensation with equity, flexible PTO, full health premium coverage for US employees, parental leave, professional development support, and remote work stipends.\n\nHightouch states it is committed to growth for its customers, business, and employees in a fast-paced environment.",
    "chinese_title": "Hightouch (YC S19) 正在招聘",
    "chinese_summary": "Hightouch（YC S19）是一家C轮初创公司，正在多个部门进行招聘。公司强调以核心价值观为基础的文化，包括雄心、友善、高效执行、同理心、影响力、高标准和谦逊。\n\n职位主要面向北美和欧洲的远程办公者，部分岗位位于旧金山、纽约、夏洛特和伦敦的办公室。开放职位涵盖多个职能领域，包括：\n*   **工程部：** AI、后端、全栈、分布式系统和机器学习等多个职位。\n*   **销售与客户成功部：** 客户经理、解决方案工程师、客户成功经理和销售开发代表。\n*   **市场、合作伙伴关系与运营部：** 现场营销、联盟负责人和运营职位。\n*   **其他部门：** AI战略、法律、财务、数据、人事运营和技术招聘。\n\n公司提供具有竞争力的福利，如含股权的优厚薪酬、灵活带薪休假、美国员工全额健康保险、育儿假、专业发展支持和远程工作津贴。\n\nHightouch表示，致力于在快节奏的环境中实现客户、业务和员工的共同成长。"
  },
  {
    "id": "46269625",
    "title": "Hell is other people's markup",
    "url": "https://www.htmhell.dev/adventcalendar/2025/13/",
    "summary": "In this article, Ian Lloyd describes the frustration of analyzing poorly structured HTML during accessibility audits. To address the problem of cluttered, non-semantic markup filled with unnecessary attributes, he first created the \"HTML De-crapulator\" tool. While helpful, it still required a multi-step process to clean up code.\n\nHis solution is the improved \"1-Click De-Crapulator.\" This tool simplifies the workflow dramatically: with a single click on a webpage element, it instantly strips away irrelevant classes and attributes, leaving only the HTML that impacts accessibility—such as roles, states, ARIA attributes, and referenced IDs. It also offers options to view the original markup or flatten excessive nesting for clarity, and it formats the output for easy reporting.\n\nThe tool’s core purpose is to save time for professionals who must diagnose and fix inaccessible markup, making the \"hell\" of deciphering other developers' code more manageable.",
    "chinese_title": "地狱是别人的标记。",
    "chinese_summary": "在这篇文章中，伊恩·劳埃德描述了在无障碍审计中分析结构混乱的HTML时的挫败感。为了解决充斥着不必要属性、杂乱且缺乏语义的标记问题，他最初创建了“HTML去糟粕器”工具。虽然有用，但它仍需要多步操作来清理代码。\n\n他的解决方案是改进版的“一键去糟粕器”。这个工具极大地简化了工作流程：只需点击网页上的某个元素，它就能立即剥离无关的类和属性，只保留影响无障碍性的HTML——例如角色、状态、ARIA属性以及引用的ID。它还提供查看原始标记或展平过度嵌套以提升清晰度的选项，并格式化输出以便于报告。\n\n该工具的核心目的是为必须诊断和修复无障碍标记的专业人士节省时间，让解读其他开发者代码的“地狱般”过程变得更易管理。"
  },
  {
    "id": "46312481",
    "title": "Partial Inlining",
    "url": "https://xania.org/202512/18-partial-inlining",
    "summary": "This article explains the compiler optimization technique of **partial inlining**, which balances performance and code size.\n\nThe core idea is that a function with a \"fast path\" and a \"slow path\" doesn't need to be fully inlined. Using a contrived example of a `process` function, the article shows how a compiler (GCC) first performs **function outlining**: it extracts the expensive \"slow path\" into a separate function, leaving the original as a thin wrapper that checks for the fast path.\n\nWhen this outlined function is called (e.g., from a `compute` function), the compiler then performs **partial inlining**. It inlines only the wrapper's fast-path check and simple arithmetic directly into the caller, while keeping a call to the separate outlined function for the slow path.\n\nThis achieves the best of both worlds:\n*   **Performance**: The hot, fast-path code avoids function call overhead.\n*   **Code Size**: The cold, complex slow-path code is not duplicated, preventing code bloat.\n\nThe article notes that compilers use heuristics to decide when to apply this optimization, and these choices can vary significantly between compilers like GCC and Clang. The technique allows for nuanced trade-offs, inlining beneficial parts of a function while keeping expensive sections shared.",
    "chinese_title": "部分内联",
    "chinese_summary": "本文阐述了**部分内联**这一编译器优化技术，它能在性能与代码体积间取得平衡。\n\n其核心思想在于：对于包含“快速路径”和“慢速路径”的函数，无需完整内联。文章通过一个精心设计的`process`函数示例，展示了编译器（以GCC为例）如何先进行**函数外提**：将耗时的“慢速路径”提取为独立函数，原函数则简化为仅检查快速路径的薄封装层。\n\n当此外提函数被调用时（例如从`compute`函数中），编译器随即执行**部分内联**。它仅将封装层的快速路径检查与简单算术操作直接内联至调用处，而对慢速路径仍保留对外提函数的调用。\n\n这实现了两全其美的效果：\n*   **性能**：高频执行的快速路径代码避免了函数调用开销。\n*   **代码体积**：低频执行的复杂慢速路径代码无需重复，防止代码膨胀。\n\n文章指出，编译器通过启发式规则决定何时应用此优化，且不同编译器（如GCC与Clang）的具体策略可能差异显著。该技术实现了精细的权衡——内联函数中有益的部分，同时保持昂贵代码段的共享性。"
  },
  {
    "id": "46312973",
    "title": "Please Just Try Htmx",
    "url": "http://pleasejusttryhtmx.com/",
    "summary": "This article is a plea for developers to try HTMX as a simpler alternative to modern JavaScript frameworks. It argues that web development presents a false choice between basic HTML (which lacks interactivity) and complex frameworks like React (which bring heavy tooling and overhead). HTMX offers a middle path: it extends HTML with attributes that allow any element to make HTTP requests and swap content without writing JavaScript.\n\nThe core idea is that the server returns HTML fragments, not JSON, and HTMX handles the dynamic updates. This results in less code, fewer dependencies, and faster builds and page loads, as demonstrated by a case study showing dramatic improvements. The author acknowledges HTMX isn't suitable for applications like real-time collaborative tools but contends it's ideal for most typical web apps (dashboards, admin panels, CRUD apps). The final call is for developers to experiment with HTMX on a small project to experience its simplicity firsthand.",
    "chinese_title": "请务必试试Htmx",
    "chinese_summary": "本文呼吁开发者尝试将HTMX作为现代JavaScript框架的更简洁替代方案。文章指出，当前网页开发似乎只能在缺乏交互性的基础HTML与带来繁重工具链和开销的复杂框架（如React）之间做出选择，而这是一种虚假的两难。HTMX提供了一条中间道路：它通过扩展HTML属性，使任何元素都能发起HTTP请求并替换内容，而无需编写JavaScript代码。\n\n其核心理念在于服务器返回HTML片段而非JSON数据，由HTMX处理动态更新。如案例研究所展示，这种方式能显著减少代码量、降低依赖复杂度、加快构建与页面加载速度。作者承认HTMX不适用于实时协作工具等场景，但强调其对大多数典型网页应用（仪表盘、管理后台、增删改查程序）极为理想。文末鼓励开发者在小型项目中亲身体验HTMX，感受其简洁之道。"
  },
  {
    "id": "46310104",
    "title": "RCE via ND6 Router Advertisements in FreeBSD",
    "url": "https://www.freebsd.org/security/advisories/FreeBSD-SA-25:12.rtsold.asc",
    "summary": "**Summary**\n\nA critical vulnerability (CVE-2025-14558) in FreeBSD allows remote code execution (RCE) via malicious IPv6 Router Advertisement (RA) packets. The flaw exists in the `rtsold` and `rtsol` programs, which handle IPv6 stateless address autoconfiguration (SLAAC).\n\n**Problem:** These programs fail to validate the \"domain search list\" option within RA packets. They pass the unvalidated data directly to the `resolvconf` shell script, which also lacks proper input sanitization. This allows an attacker on the same local network segment to inject and execute arbitrary shell commands by crafting a malicious RA packet.\n\n**Impact:** Systems running `rtsold` or `rtsol` are vulnerable to RCE from any device on the same network segment. The attack is limited to the local link, as routers typically do not forward RA packets.\n\n**Affected:** All supported versions of FreeBSD.\n\n**Solution:** Users must apply the provided security patches immediately. Binary updates are available via `freebsd-update` for RELEASE versions on amd64, arm64, and i386 (13.x). Source patches are also provided. Systems not using IPv6 or not configured to accept RA packets (lacking the `ACCEPT_RTADV` flag on the interface) are not vulnerable.",
    "chinese_title": "FreeBSD中通过ND6路由器广告实现远程代码执行",
    "chinese_summary": "**摘要**\n\nFreeBSD 中存在一个严重漏洞（CVE-2025-14558），允许通过恶意 IPv6 路由器通告（RA）数据包实现远程代码执行（RCE）。该漏洞存在于处理 IPv6 无状态地址自动配置（SLAAC）的 `rtsold` 和 `rtsol` 程序中。\n\n**问题：** 这些程序未能验证 RA 数据包中的“域名搜索列表”选项。它们将未经验证的数据直接传递给 `resolvconf` shell 脚本，而该脚本也缺乏适当的输入清理机制。这使得同一本地网段上的攻击者能够通过构造恶意 RA 数据包来注入并执行任意 shell 命令。\n\n**影响：** 运行 `rtsold` 或 `rtsol` 的系统容易受到同一网段上任何设备的 RCE 攻击。由于路由器通常不转发 RA 数据包，此攻击仅限于本地链路。\n\n**受影响版本：** 所有受支持的 FreeBSD 版本。\n\n**解决方案：** 用户必须立即应用提供的安全补丁。对于 amd64、arm64 和 i386 架构的 13.x RELEASE 版本，可通过 `freebsd-update` 获取二进制更新。同时提供了源代码补丁。未使用 IPv6 或未配置为接受 RA 数据包（接口上缺少 `ACCEPT_RTADV` 标志）的系统不受影响。"
  },
  {
    "id": "46314947",
    "title": "Making the most of bit arrays in Gleam",
    "url": "https://gearsco.de/blog/bit-array-syntax/",
    "summary": "This article is a comprehensive guide to using bit arrays in Gleam, a powerful syntax inherited from Erlang for constructing and pattern-matching binary data.\n\n**Key Points:**\n\n*   **Syntax:** Bit arrays are created with `<<` and `>>`, containing comma-separated segments like `<<value:options>>`.\n*   **Segment Types:** The default is `Int` (8-bit signed). Other types require specific options: `Float`, `String` (UTF-8/16/32), `UtfCodepoint`, and `BitArray` (using the `bits` option).\n*   **Size & Unit:** The `size(N)` option controls how many bits a segment uses, with a shorthand `value:N`. The `unit(N)` option multiplies the size.\n*   **Endianness:** Segments are big-endian by default but can be set to `little` or `native`.\n*   **Pattern Matching:** The same syntax can deconstruct bit arrays, extracting values into variables or matching literals. A key detail is that segment type information isn't stored; a `Float` can be matched as an `Int`.\n*   **Special Notes:** Strings can't be matched arbitrarily (only literals or codepoints). The `signed` option interprets integers as two's complement. On JavaScript targets, `native` endianness and UTF codepoint matching are not yet supported.\n*   **Practical Example:** The article concludes with a practical example showing how to encode and decode data in Minecraft's NBT format using bit arrays, demonstrating construction, pattern matching, and recursion.",
    "chinese_title": "充分利用Gleam中的位数组",
    "chinese_summary": "本文是关于在Gleam中使用位数组的全面指南，Gleam继承了Erlang的强大语法，用于构建和模式匹配二进制数据。\n\n**核心要点：**\n\n*   **语法：** 位数组使用`<<`和`>>`创建，包含逗号分隔的段，如`<<值:选项>>`。\n*   **段类型：** 默认是`Int`（8位有符号）。其他类型需要特定选项：`Float`、`String`（UTF-8/16/32）、`UtfCodepoint`和`BitArray`（使用`bits`选项）。\n*   **大小与单位：** `size(N)`选项控制一个段使用的位数，简写为`值:N`。`unit(N)`选项用于倍增大小。\n*   **字节序：** 段默认是大端序，但可设置为`little`或`native`。\n*   **模式匹配：** 相同语法可解构位数组，将值提取到变量中或匹配字面量。一个关键细节是段类型信息不被存储；`Float`可以被匹配为`Int`。\n*   **特别说明：** 字符串不能任意匹配（只能匹配字面量或代码点）。`signed`选项将整数解释为二进制补码。在JavaScript目标上，尚不支持`native`字节序和UTF代码点匹配。\n*   **实用示例：** 文章最后通过一个实用示例，展示了如何使用位数组在Minecraft的NBT格式中编码和解码数据，演示了构建、模式匹配和递归。"
  },
  {
    "id": "46282001",
    "title": "Statistical Learning Theory and ChatGPT",
    "url": "https://kamalikachaudhuri.substack.com/p/statistical-learning-theory-and-chat",
    "summary": "This article examines how Statistical Learning Theory (SLT) explains the behavior of models like ChatGPT. SLT frames generalization as learning from an underlying data distribution to perform well on new, similar data.\n\nThe author argues that SLT correctly predicts that well-trained models will reflect the statistical patterns of their training data. Key examples include:\n*   **Frequency Reproduction:** When asked for a random number, both humans and LLMs most often say \"7,\" likely because this is the most frequent response in the training text.\n*   **Fine-Tuning Fidelity:** A language model fine-tuned on medical chats generates conversations where patient demographics (e.g., 30% women) match the frequencies in the training data.\n*   **Negation Failure:** Text-to-image models struggle with prompts like \"a cat but not a dog\" because their web-based training data is annotated with what *is* present, not what is absent.\n\nThe conclusion is that SLT provides valuable insights, showing how models internalize and replicate the statistical regularities of their training corpora. The author notes a follow-up post will address where SLT's explanations fall short.",
    "chinese_title": "统计学习理论与ChatGPT",
    "chinese_summary": "本文探讨了统计学习理论（SLT）如何解释像ChatGPT这类模型的行为。SLT将泛化定义为从潜在数据分布中学习，从而在新的相似数据上表现良好。\n\n作者认为，SLT正确地预测了训练良好的模型将反映其训练数据的统计模式。关键例子包括：\n*   **频率再现**：当被要求给出一个随机数字时，人类和大型语言模型最常回答“7”，这可能是因为这是训练文本中最常见的回答。\n*   **微调保真度**：在医疗聊天数据上微调的语言模型生成的对话中，患者人口统计数据（例如30%为女性）与训练数据中的频率相符。\n*   **否定失败**：文本到图像模型难以处理如“一只猫但不是狗”这样的提示，因为其基于网络的训练数据标注的是*存在*的内容，而非不存在的内容。\n\n结论是，SLT提供了宝贵的见解，展示了模型如何内化并复制其训练语料库中的统计规律。作者指出，后续文章将讨论SLT解释的不足之处。"
  },
  {
    "id": "46304195",
    "title": "How the RESISTORS put computing into 1960s counter-culture",
    "url": "https://spectrum.ieee.org/teenage-hackers",
    "summary": "This article details the history of the RESISTORS, a 1960s teenage computer club in New Jersey that pioneered personal computing before the PC era. Formed around engineer and mentor Claude Kagan, the group met in his barn, which housed his collection of early computers like the Burroughs Datatron 205.\n\nThe RESISTORS distinguished themselves by focusing on hands-on, interactive learning and real-time programming using languages like TRAC. The club was notably inclusive for its time, actively involving young women and reaching out to recruit African American teens from nearby Trenton.\n\nTheir technical prowess gained public attention, such as at a 1968 computer conference where they ingeniously bypassed a telecom strike. The group also intersected with the counter-cultural tech scene, most significantly through hypertext visionary Ted Nelson. He recruited them to provide technical support for the landmark 1970 *Software* exhibition at the Jewish Museum, where they helped artists realize computer-based works and demonstrated Nelson's early hypertext system, *Labyrinth*.\n\nThe article positions the RESISTORS as important forerunners to later hobbyist communities like the Homebrew Computer Club. Many members, including a future co-founder of Cisco Systems and best-selling authors, pursued significant careers in technology, underscoring the club's lasting impact.",
    "chinese_title": "电阻器如何将计算带入1960年代的反文化运动",
    "chinese_summary": "本文详述了“电阻器”俱乐部的历史——这是1960年代新泽西州的一个青少年计算机社团，在个人电脑时代到来之前就开创了个人计算的先河。该团体围绕工程师兼导师克劳德·卡根组建，成员们在他存放着Burroughs Datatron 205等早期计算机藏品的谷仓中聚会。\n\n“电阻器”俱乐部的独特之处在于注重动手实践、互动学习以及使用TRAC等语言进行实时编程。该俱乐部在当时具有显著的包容性，积极吸纳年轻女性成员，并主动招募来自附近特伦顿市的非裔美国青少年。\n\n他们的技术实力曾引起公众关注，例如在1968年的一次计算机会议上，他们巧妙地绕过了一场电信罢工。该团体还与反主流文化技术圈有所交集，其中最重要的联系是通过超文本先驱泰德·纳尔逊建立。纳尔逊邀请他们为1970年犹太博物馆里程碑式的《软件》展览提供技术支持——他们不仅帮助艺术家实现基于计算机的作品，还演示了纳尔逊早期的超文本系统《迷宫》。\n\n文章将“电阻器”俱乐部定位为后来诸如家酿计算机俱乐部等业余爱好者社区的重要先驱。许多成员后来在科技领域成就斐然，包括思科系统的联合创始人和畅销书作家，这印证了该俱乐部持久的影响力。"
  },
  {
    "id": "46311355",
    "title": "Independent review of UK national security law warns of overreach",
    "url": "https://www.techradar.com/vpn/vpn-privacy-security/creating-apps-like-signal-or-whatsapp-could-be-hostile-activity-claims-uk-watchdog",
    "summary": "An independent review of UK national security law has warned that its broad powers risk significant overreach. The report, by government reviewer Jonathan Hall KC, states that developers of encrypted messaging apps like Signal and WhatsApp could technically be considered \"hostile actors\" under the law simply because their technology makes it harder for UK intelligence agencies to monitor communications. The report also notes that journalists carrying sensitive information could face similar scrutiny.\n\nThis warning comes amid increasing pressure from UK lawmakers against encryption. Legislation like the Investigatory Powers Act has already been used to challenge tech companies, and the Online Safety Act contains provisions experts fear could undermine encryption further. A recent parliamentary debate on the Act saw calls for stricter enforcement and a review of encrypted tools like VPNs, with minimal discussion of the security risks.\n\nDigital rights advocates argue that weakening encryption threatens national security and the privacy of dissidents, journalists, and the general public. They warn of a stark disconnect between lawmakers, who view encryption as a law enforcement obstacle, and security experts, who see it as vital protection in an era of rising cyberattacks. Major encrypted services have previously pledged to leave the UK market rather than compromise user security, setting the stage for continued conflict.",
    "chinese_title": "英国国家安全法独立审查警告存在越权风险",
    "chinese_summary": "英国国家安全法独立审查报告警告称，该法律赋予的广泛权力存在严重越权的风险。政府审查员乔纳森·霍尔皇家大律师撰写的报告指出，根据该法律，Signal和WhatsApp等加密通讯应用的开发者仅因其技术增加了英国情报机构监控通讯的难度，就可能被技术上认定为\"敌对行为者\"。报告还指出，携带敏感信息的记者也可能面临类似审查。\n\n这一警告发布之际，英国立法者正对加密技术施加越来越大的压力。《调查权力法案》等立法已被用于挑战科技公司，而《网络安全法》中的条款被专家担忧可能进一步破坏加密技术。近期议会就该法案的辩论中，出现了要求加强执法并审查VPN等加密工具的呼声，而对安全风险的讨论却微乎其微。\n\n数字权利倡导者认为，削弱加密技术将威胁国家安全以及异议人士、记者和公众的隐私。他们警告称，立法者将加密技术视为执法障碍，而安全专家则视其为网络攻击激增时代的重要保护措施，两者之间存在明显分歧。主要加密服务商此前已承诺宁愿退出英国市场也不愿损害用户安全，这预示着冲突将持续升级。"
  },
  {
    "id": "46269985",
    "title": "Apples, Trees, and Quasimodes",
    "url": "https://systemstack.dev/2025/09/humane-computing/",
    "summary": "This article examines Jef Raskin's vision for \"humane computing\" and its complex legacy. Raskin, a key early figure at Apple, was part of the 1970s Bay Area tradition that saw computers as tools for thought and liberation. His principles—modelessness, undo, and low cognitive load—aimed to create intuitive, user-centric systems, most fully realized in the commercial Canon Cat.\n\nHowever, the Cat embodied a central tension: its humane, protective design also made it constricting, hiding its underlying extensibility (a Forth programming environment) from users. This highlights a key dilemma: balancing simplicity with openness. The article argues that while Raskin's specific products were commercial dead-ends, his ideas were a vital branch, not a cul-de-sac, influencing modern interface design.\n\nThe deeper conclusion is that truly radical, humane computing systems cannot emerge from mainstream commercial giants like Apple or Google, whose scale and incentives favor lock-in and simplicity over genuine empowerment. Instead, such innovation has historically come from and must continue to come from the margins—hobbyists, research labs, and niche communities—where the ethos of computers as open tools for thought can survive.",
    "chinese_title": "苹果、树木与准模式",
    "chinese_summary": "本文探讨了杰夫·拉斯金对“人性化计算”的构想及其复杂的遗产。作为苹果公司早期的关键人物，拉斯金承袭了1970年代湾区将计算机视为思维与解放工具的传统。他提出的无模式交互、撤销功能和低认知负荷等原则，旨在创建直观、以用户为中心的系统，这些理念在商用产品佳能猫上得到了最充分的体现。\n\n然而，佳能猫也体现了一个核心矛盾：其人本化、保护性的设计同时带来了限制性，其底层的可扩展性（基于Forth编程环境）对用户是隐藏的。这突显了一个关键困境：如何在简洁性与开放性之间取得平衡。文章认为，尽管拉斯金的具体产品在商业上未能成功，但他的思想并非死胡同，而是影响了现代界面设计的重要分支。\n\n更深层的结论是，真正具有革命性的人性化计算系统无法从苹果或谷歌这样的主流商业巨头中诞生——它们的规模和商业逻辑更倾向于用户锁定和简化操作，而非真正的赋能。相反，此类创新历来且必须继续来自边缘地带——爱好者、研究实验室和小众社区——在那里，计算机作为开放思维工具的理念才能得以存续。"
  }
]