[
  {
    "id": "46979562",
    "title": "The risk of a hothouse Earth trajectory",
    "url": "https://www.cell.com/one-earth/fulltext/S2590-3322%2825%2900391-4",
    "summary": "**Summary of \"The risk of a hothouse Earth trajectory\"**\n\nThe article, published in *One Earth*, warns that current climate policies and actions are insufficient to prevent the Earth from potentially crossing critical tipping points, locking the planet onto an irreversible \"hothouse Earth\" trajectory. This path would lead to long-term global warming of 4–5°C above pre-industrial levels, far exceeding the Paris Agreement targets.\n\nThe authors analyze the gap between political commitments and the necessary physical changes to the climate system. They argue that even if net-zero emissions pledges are fulfilled, the delayed and cumulative nature of Earth system processes—such as ice sheet melt, permafrost thaw, and forest dieback—creates a high risk of activating feedback loops that perpetuate further warming. This creates a \"climate policy paradox\": the full consequences of today's emissions will only be realized decades or centuries later, by which time triggering these tipping points may be unavoidable.\n\nThe core conclusion is that the window for preventing this catastrophic trajectory is closing rapidly. Incremental mitigation is no longer adequate; instead, the article calls for an emergency paradigm focused on **\"negative tipping points\"**—accelerating positive social, technological, and economic transformations to rapidly decarbonize society. This requires immediate, coordinated global action to fundamentally reshape energy, food, and economic systems, moving beyond mere emission reductions to actively restoring the Earth's climate stability.",
    "chinese_title": "地球温室化轨迹的风险",
    "chinese_summary": "《“温室地球”轨迹风险综述》\n\n发表于《一个地球》期刊的这篇文章警告称，当前的气候政策和行动不足以阻止地球可能跨越临界点，从而将地球锁定在不可逆转的“温室地球”发展轨迹上。这一路径将导致全球长期升温较工业化前水平高出4-5°C，远超《巴黎协定》的控温目标。\n\n作者分析了政治承诺与气候系统所需实质性变革之间的差距。他们指出，即使净零排放承诺得以兑现，地球系统过程——如冰盖融化、永久冻土消融和森林衰退——所具有的延迟性和累积性，仍会带来激活反馈循环的高风险，从而加剧全球变暖。这形成了“气候政策悖论”：当前排放的完整后果将在数十年甚至数百年后才会显现，而届时触发这些临界点可能已无法避免。\n\n核心结论是：防止这种灾难性发展轨迹的时间窗口正在迅速关闭。渐进式减排已不再足够；文章呼吁建立以“负向临界点”为核心的紧急行动范式——即加速社会、技术和经济的积极转型，以实现快速脱碳。这需要立即开展全球协同行动，从根本上重塑能源、粮食和经济体系，超越单纯减排，转向积极恢复地球气候稳定性。"
  },
  {
    "id": "46976911",
    "title": "Toyota Fluorite: \"console-grade\" Flutter game engine",
    "url": "https://fluorite.game/",
    "summary": "The Toyota Fluorite Engine is a \"console-grade\" 3D game engine built for the Flutter framework. Its core innovation is allowing developers to write game logic directly in Dart, enabling seamless integration with Flutter's UI widgets and developer tools like Hot Reload for rapid iteration.\n\nAt its foundation, Fluorite uses a high-performance, data-oriented Entity-Component-System (ECS) written in C++ for optimal speed on lower-end hardware, while exposing a high-level Dart API for accessibility.\n\nFor rendering, it leverages Google's Filament renderer with modern graphics APIs like Vulkan to deliver advanced visuals, including physically-based lighting, post-processing effects, and custom shaders.\n\nA key feature is \"model-defined touch trigger zones,\" which lets 3D artists define interactive areas directly within modeling tools like Blender. Developers can then assign events to these zones, simplifying the creation of intuitive 3D spatial interfaces.\n\nIn summary, Fluorite aims to combine high-performance, console-quality 3D graphics with the streamlined, productive workflow of Flutter and Dart.",
    "chinese_title": "丰田萤石：\"主机级\"Flutter游戏引擎",
    "chinese_summary": "丰田萤石引擎是一款专为Flutter框架打造的“主机级”3D游戏引擎。其核心创新在于允许开发者直接使用Dart语言编写游戏逻辑，无缝集成Flutter的UI组件及热重载等开发工具，实现快速迭代。\n\n引擎底层采用高性能、数据导向的实体组件系统（ECS），由C++编写以确保在低端硬件上流畅运行，同时提供高级Dart API以降低使用门槛。\n\n渲染方面，引擎依托Google的Filament渲染器，支持Vulkan等现代图形API，可实现基于物理的光照、后期处理效果及自定义着色器等高级视觉表现。\n\n其关键特性“模型定义触控触发区”允许3D美术师直接在Blender等建模工具中定义交互区域，开发者随后可为这些区域绑定事件，从而简化直观的3D空间界面创建流程。\n\n总之，萤石引擎致力于将高性能的主机级3D画面与Flutter及Dart的高效开发流程相结合。"
  },
  {
    "id": "46978710",
    "title": "Claude Code Is Being Dumbed Down",
    "url": "https://symmetrybreak.ing/blog/claude-code-is-being-dumbed-down/",
    "summary": "In February 2026, Anthropic's Claude Code version 2.1.20 replaced detailed file read and search logs with a single, generic summary line (e.g., \"Read 3 files\"). Users, many paying $200/month, complained that this hid crucial information like file paths and search patterns.\n\nThe community requested a revert or a simple toggle to restore the old behavior. Anthropic's response was to direct users to \"verbose mode,\" which users argued was unsuitable as it floods the terminal with excessive debug data, thinking traces, and full sub-agent transcripts instead of the concise, specific logs they wanted.\n\nSubsequent updates attempted to make verbose mode less overwhelming by stripping out some elements, but it still included unwanted content like sub-agent output. This approach frustrated users who saw it as reinventing a config toggle through convoluted steps, while also degrading the experience for those who originally used verbose mode for its intended purpose.\n\nThe core criticism is that Anthropic ignored direct user feedback for a simple fix (a config flag) in favor of a complex and unsatisfactory workaround, leading many to pin their installations to the previous version (2.1.19).",
    "chinese_title": "克劳德代码正在被简化。",
    "chinese_summary": "2026年2月，Anthropic的Claude Code版本2.1.20将详细的文件读取和搜索日志替换为单一通用摘要行（例如“读取了3个文件”）。许多每月支付200美元的用户抱怨，这隐藏了文件路径和搜索模式等关键信息。\n\n社区要求恢复旧版行为或提供简易开关选项。Anthropic的回应是引导用户使用“详细模式”，但用户认为该模式并不适用——它会在终端中淹没过多调试数据、思维轨迹和完整子代理记录，而非用户所需的简洁具体日志。\n\n后续更新试图通过剔除部分元素来减轻详细模式的冗杂感，但仍包含子代理输出等无关内容。这种处理方式激怒了用户，他们认为这是在通过复杂步骤变相实现配置开关功能，同时也损害了原本为特定目的使用详细模式的用户体验。\n\n核心批评在于：Anthropic无视用户对简易解决方案（配置开关）的直接反馈，转而采用复杂且不尽人意的替代方案，导致许多用户将安装版本锁定在之前的2.1.19版。"
  },
  {
    "id": "46978490",
    "title": "NetNewsWire Turns 23",
    "url": "https://netnewswire.blog/2026/02/11/netnewswire-turns.html",
    "summary": "NetNewsWire, a popular RSS reader, celebrated its 23rd anniversary on February 11, 2026. The team recently released version 7.0 for Mac and iOS and is now working on a 7.0.1 update to address immediate post-release fixes and tweaks.\n\nLooking ahead, the development roadmap includes version 7.1, which will focus on syncing improvements. Plans for version 7.2 are not yet finalized but may involve user experience fixes and general polish. There is no current plan for version 7.3, as it will depend on the outcomes of the earlier updates and potential new technologies announced at Apple's upcoming WWDC conference.\n\nThe post emphasizes that development priorities are flexible and subject to change. It concludes by stating the team's forward-looking optimism, believing the best versions of NetNewsWire are still in the future.",
    "chinese_title": "NetNewsWire迎来23周年",
    "chinese_summary": "热门RSS阅读器NetNewsWire于2026年2月11日庆祝了其23周年纪念。团队近期发布了适用于Mac和iOS的7.0版本，目前正着手开发7.0.1更新，以解决发布后急需的修复和调整。\n\n展望未来，开发路线图包括专注于同步功能改进的7.1版本。7.2版本计划尚未最终确定，但可能涉及用户体验修复和整体优化。目前暂无7.3版本计划，这将取决于早期更新的成果以及苹果即将召开的WWDC大会上可能发布的新技术。\n\n文章强调开发优先级具有灵活性且可能调整。最后，团队表达了前瞻性的乐观态度，相信NetNewsWire的最佳版本仍在未来。"
  },
  {
    "id": "46977210",
    "title": "GLM-5: From Vibe Coding to Agentic Engineering",
    "url": "https://z.ai/blog/glm-5",
    "summary": "**Summary of \"GLM-5: From Vibe Coding to Agentic Engineering\"**\n\nThe article introduces GLM-5, a new generation of large language models from Zhipu AI, positioned as a significant leap from its predecessor, GLM-4. Its core advancement is a shift from basic conversational AI (\"vibe coding\") to sophisticated \"agentic engineering,\" meaning the model can autonomously plan, reason, and execute complex, multi-step tasks.\n\nKey capabilities and features highlighted include:\n\n*   **Enhanced Performance:** GLM-5 reportedly surpasses leading models like GPT-4 and Claude 3.5 on major benchmarks (e.g., MMLU, GPQA) and in coding (HumanEval). A specialized variant, GLM-5-Flash, offers high speed for cost-sensitive applications.\n*   **Massive Context Window:** It supports an exceptionally long context of 1 million tokens, enabling deep analysis of lengthy documents like research papers or entire codebases.\n*   **Advanced Multimodal & Tool Use:** The model integrates strong vision capabilities and robust function calling, allowing it to interpret images, utilize tools, and interact with external APIs and data sources seamlessly.\n*   **Web Search & File Processing:** Native web search and the ability to process a wide array of file formats (images, PDFs, Word docs, etc.) are built-in, enhancing its utility for research and analysis.\n*   **Developer-Focused:** GLM-5 is designed as a platform for building complex AI agents. It is accessible through Zhipu's API and a revamped developer console, encouraging the creation of applications that leverage its autonomous, multi-step reasoning.\n\nIn essence, GLM-5 represents a move from a chatbot that assists with simple tasks to a powerful, general-purpose reasoning engine capable of acting as an independent agent to solve intricate, real-world problems.",
    "chinese_title": "GLM-5：从氛围编程到智能体工程",
    "chinese_summary": "**《GLM-5：从氛围编程到智能体工程》摘要**\n\n本文介绍了智谱AI的新一代大语言模型GLM-5，它被定位为对其前身GLM-4的一次重大飞跃。其核心进步在于从基础的对话式AI（“氛围编程”）转向复杂的“智能体工程”，这意味着该模型能够自主规划、推理并执行复杂的多步骤任务。\n\n文章重点强调的关键能力和特性包括：\n\n*   **性能提升：** 据报道，GLM-5在主要基准测试（如MMLU、GPQA）和编码（HumanEval）上超越了GPT-4和Claude 3.5等领先模型。其专门变体GLM-5-Flash为成本敏感型应用提供了高速处理能力。\n*   **超长上下文窗口：** 支持长达100万tokens的上下文，能够对研究论文或整个代码库等长篇文档进行深入分析。\n*   **先进的多模态与工具调用：** 该模型集成了强大的视觉能力和稳健的函数调用功能，使其能够解读图像、使用工具，并无缝地与外部API及数据源交互。\n*   **网络搜索与文件处理：** 内置原生网络搜索功能，并能处理多种文件格式（图像、PDF、Word文档等），增强了其在研究和分析方面的实用性。\n*   **面向开发者：** GLM-5被设计为一个构建复杂AI智能体的平台。可通过智谱API和全新的开发者控制台进行访问，鼓励开发者利用其自主、多步骤推理能力创建应用程序。\n\n本质上，GLM-5代表着一个转变：从一个协助处理简单任务的聊天机器人，转变为一个强大的通用推理引擎，能够作为独立智能体来解决复杂的现实世界问题。"
  },
  {
    "id": "46917005",
    "title": "Single bone in Spain offers first direct evidence of Hannibal's war elephants",
    "url": "https://phys.org/news/2026-02-hannibal-famous-war-elephants-bone.html",
    "summary": "**Summary of \"Single bone in Spain offers first direct evidence of Hannibal's war elephants\"**\n\nA single, large animal bone discovered at an archaeological site in Spain provides the first direct physical evidence of the war elephants used by the Carthaginian general Hannibal Barca during the Second Punic War (218-201 BCE).\n\nThe bone, identified as a fragment of an elephant's femur, was unearthed at the ancient site of *Cástulo*, a major Iberian city and key trading center. Radiocarbon dating places the bone to approximately 220-200 BCE, perfectly aligning with the timeline of Hannibal's campaign. Before crossing the Alps to attack Rome in 218 BCE, Hannibal spent time securing resources and allies on the Iberian Peninsula, where his forces included a contingent of North African war elephants.\n\nThis discovery is significant because, while historical accounts by ancient writers like Polybius and Livy describe Hannibal's elephants, no physical remains from his specific herd had ever been conclusively found in Europe. The bone's location at a major settlement suggests the elephant was present with Carthaginian forces in the region, likely dying there from injury, illness, or as part of the logistical preparations for the famous Alpine crossing.\n\nThe find offers tangible proof supporting the ancient texts and deepens our understanding of the practical challenges and resources involved in Hannibal's monumental military campaign. It confirms the presence of his elephants on European soil prior to their most famous and arduous journey.",
    "chinese_title": "西班牙单根骨骼首次提供汉尼拔战象的直接证据",
    "chinese_summary": "**西班牙发现单根骨头，为汉尼拔战象提供首个直接证据**\n\n在西班牙一处考古遗址发现的大型动物骨骼，首次为迦太基将军汉尼拔·巴卡在第二次布匿战争（公元前218-201年）中使用的战象提供了直接实物证据。\n\n这块被鉴定为象股骨碎片的骨头出土于古遗址*卡斯蒂洛*，该地曾是重要的伊比利亚城市和贸易中心。放射性碳测年显示其年代约为公元前220-200年，与汉尼拔的征战时间完全吻合。公元前218年翻越阿尔卑斯山进攻罗马之前，汉尼拔曾在伊比利亚半岛筹集资源与盟友，其军队中便包括一支北非战象部队。\n\n此项发现意义重大：尽管波利比乌斯、李维等古代史学家的记载描述了汉尼拔的战象，但其象群在欧洲从未发现过确凿的实物遗存。骨骼出土于主要聚居地，表明这头战象曾随迦太基军队驻扎该区域，可能因伤病死亡，或是在为著名的阿尔卑斯山远征做后勤准备时遗留。\n\n这一发现为古代文献提供了切实佐证，深化了我们对汉尼拔宏大军事行动中实际挑战与资源调配的理解，并证实了其战象在踏上那段最著名且艰险的征途前，确曾踏足欧洲土地。"
  },
  {
    "id": "46968374",
    "title": "We rendered and embedded one million CAD files",
    "url": "https://cad-search-three.vercel.app/",
    "summary": "This article announces that the online CAD platform Explore0 has successfully rendered and embedded one million 3D CAD models into its web-based viewer. The core achievement is the development of a scalable, automated pipeline that can process a massive volume of diverse CAD files (like STEP and IGES) and convert them into lightweight, streamable 3D visualizations directly in a web browser.\n\nThe key points are:\n*   **Scale:** The project successfully handled one million files, demonstrating robust technical infrastructure.\n*   **Technology:** It utilized a cloud-based rendering pipeline to automate the conversion, overcoming the traditional complexity and manual effort required to share CAD data.\n*   **Accessibility:** The output allows users to view complex engineering models instantly online without needing specialized desktop CAD software, facilitating easier collaboration and sharing.\n*   **Implication:** This milestone represents a significant step in making CAD data more accessible and interoperable on the web, potentially transforming how engineers and designers share and review 3D designs.\n\nIn essence, the article highlights a major technical feat in web-based CAD visualization, enabling the seamless, large-scale publication of interactive 3D engineering models.",
    "chinese_title": "我们渲染并嵌入了一百万个CAD文件",
    "chinese_summary": "本文宣布，在线CAD平台Explore0已成功将一百万个3D CAD模型渲染并嵌入其基于网页的查看器中。核心成就是开发了一个可扩展的自动化流程，能够处理海量多样化的CAD文件（如STEP和IGES格式），并将其转换为轻量级、可流式传输的3D可视化内容，直接在网页浏览器中呈现。\n\n关键要点包括：\n*   **规模：** 该项目成功处理了一百万个文件，展现了强大的技术基础设施。\n*   **技术：** 利用基于云的渲染流程实现自动化转换，克服了传统共享CAD数据所需的复杂性和人工操作。\n*   **可访问性：** 用户无需专业的桌面CAD软件即可在线即时查看复杂的工程模型，促进了更便捷的协作与共享。\n*   **意义：** 这一里程碑标志着在提高CAD数据在Web上的可访问性和互操作性方面迈出了重要一步，可能改变工程师和设计师共享与评审3D设计的方式。\n\n本质上，本文强调了基于Web的CAD可视化领域的一项重大技术成就，实现了交互式3D工程模型的无缝、大规模发布。"
  },
  {
    "id": "46924075",
    "title": "GLM-OCR: Accurate × Fast × Comprehensive",
    "url": "https://github.com/zai-org/GLM-OCR",
    "summary": "GLM-OCR is a multimodal OCR model built on the GLM-V architecture, designed for accurate and efficient document understanding. It achieves top performance on benchmarks like OmniDocBench and excels at handling complex real-world documents, including tables, code, and seals.\n\nKey features include its 0.9B parameter size for efficient inference, support for deployment via vLLM, SGLang, and Ollama, and a user-friendly SDK. Users can start quickly using the hosted Zhipu API or self-host the model for full control.\n\nThe provided SDK offers multiple usage options: a command-line interface, a Python API, and a Flask web service. It outputs results in both structured JSON and formatted Markdown. The system uses a modular pipeline, allowing for customization of components like layout detection and result formatting.\n\nThe project is open-source, with code under Apache License 2.0 and the model under MIT License.",
    "chinese_title": "GLM-OCR：精准 × 快速 × 全面",
    "chinese_summary": "GLM-OCR是一款基于GLM-V架构构建的多模态OCR模型，专为精准高效的文档理解而设计。它在OmniDocBench等基准测试中表现卓越，尤其擅长处理表格、代码、印章等复杂现实文档。\n\n其核心特性包括：0.9B参数规模确保高效推理，支持通过vLLM、SGLang和Ollama进行部署，并提供用户友好的SDK。用户可通过智谱AI托管的API快速上手，也可自行部署模型以获得完全控制权。\n\n该SDK提供多种使用方式：命令行界面、Python API以及Flask网页服务。输出结果同时支持结构化JSON与格式化Markdown。系统采用模块化流程，支持对版面检测、结果格式化等组件进行定制。\n\n本项目为开源项目，代码遵循Apache 2.0许可证，模型采用MIT许可证。"
  },
  {
    "id": "46920315",
    "title": "WiFi Could Become an Invisible Mass Surveillance System",
    "url": "https://scitechdaily.com/researchers-warn-wifi-could-become-an-invisible-mass-surveillance-system/",
    "summary": "Researchers at the Karlsruhe Institute of Technology have demonstrated a new method that uses ordinary WiFi signals to identify individuals without them carrying any active device. The technique works by passively analyzing the patterns created when radio waves from standard WiFi routers and connected devices interact with people in a space, effectively creating camera-like images.\n\nCrucially, this method requires no specialized hardware; it exploits unencrypted feedback signals (beamforming feedback information) already exchanged in any active WiFi network. A trained machine learning model can then use this data to identify a person from multiple angles with nearly 100% accuracy in seconds, as shown in a study with 197 participants.\n\nThe researchers warn this turns ubiquitous WiFi routers into an invisible, unsuspected surveillance infrastructure, posing a severe threat to privacy. Simply turning off one's own device offers no protection, as long as other nearby networks are active. They emphasize the urgent need for privacy safeguards in upcoming WiFi standards to prevent potential misuse, especially in authoritarian contexts.",
    "chinese_title": "WiFi或将成为无形的群体监控系统",
    "chinese_summary": "卡尔斯鲁厄理工学院的研究人员展示了一种新方法，能够利用普通WiFi信号识别个体，而无需对方携带任何主动设备。该技术通过被动分析标准WiFi路由器及联网设备发出的无线电波与空间中人体交互产生的信号模式来实现，其效果类似于生成摄像头图像。\n\n关键在于，该方法无需专用硬件，而是利用现有活跃WiFi网络中已传输的未加密反馈信号（波束成形反馈信息）。一项涉及197名参与者的研究表明，经训练的机器学习模型可借此在数秒内以近乎100%的准确率从多角度识别人员。\n\n研究人员警告称，这将使无处不在的WiFi路由器转变为隐蔽的监控基础设施，对隐私构成严重威胁。即便关闭个人设备，只要周边有其他活跃网络，防护依然无效。他们强调，亟需在下一代WiFi标准中建立隐私保护机制，以防止该技术被滥用，尤其在威权环境中。"
  },
  {
    "id": "46978015",
    "title": "Should your developer company go open source?",
    "url": "https://extremefoundership.substack.com/p/should-your-developer-company-go",
    "summary": "This article argues that choosing open-source is a strategic business decision, not a philosophical one. It should only be pursued if it structurally helps the product win through faster adoption, stronger defensibility, or better monetization.\n\nThe core test is the \"federation test\": open-source works best when the user and contributor are the same persona (e.g., data engineers using *and* building data connectors). This creates a compounding network effect. If users and contributors are different (a \"stadium\" model), community contributions will be minimal.\n\nOpen-source is most effective for technical users, well-understood problems, and as a wedge to bypass procurement by letting engineers start quickly. The author advises defining a clear \"OSS wedge\"—the specific job the open-source version fully solves (e.g., a single-user use case)—while reserving features like team coordination and governance for the paid product.\n\nThe article warns of hidden costs: permanently high execution standards, public contract lock-in, and the necessity of strong governance to say \"no\" to contributors. Ultimately, founders must honestly assess if their business can meet these demands and survive a potential fork; if not, closed-source is the smarter choice.",
    "chinese_title": "你的开发公司应该开源吗？",
    "chinese_summary": "本文认为，选择开源是一项战略性商业决策，而非哲学理念。只有当开源能够通过加速市场采用、增强产品防御性或优化盈利模式，从结构上帮助产品取胜时，才值得推行。\n\n核心检验标准是“联邦测试”：当用户与贡献者为同一类角色时（例如数据工程师既使用*又*开发数据连接器），开源效果最佳。这会形成复合网络效应。若用户与贡献者分离（即“体育场”模式），社区贡献将微乎其微。\n\n开源对技术型用户、成熟问题领域最为有效，并可作为绕过采购流程的楔子，让工程师快速上手。作者建议明确界定“开源楔子”——即开源版本能完全解决的具体需求（例如单用户场景），同时将团队协作与治理等功能保留给付费产品。\n\n文章警示了隐藏成本：持续高标准的执行要求、公开合约的锁定效应，以及需要强大治理机制来回绝贡献者。创始人必须诚实地评估自身业务能否满足这些要求，并承受潜在分叉风险；若不能，闭源才是更明智的选择。"
  },
  {
    "id": "46978966",
    "title": "Amazon Ring's lost dog ad sparks backlash amid fears of mass surveillance",
    "url": "https://www.theverge.com/tech/876866/ring-search-party-super-bowl-ad-online-backlash",
    "summary": "Amazon Ring's Super Bowl ad for its AI-powered \"Search Party\" feature, which scans neighborhood camera footage to find lost dogs, has sparked significant backlash over mass surveillance concerns. Critics, including privacy experts and Senator Ed Markey, argue the technology could easily be repurposed to track people, especially given Ring's history of partnerships with law enforcement and its new integration with surveillance company Flock Safety.\n\nRing states that Search Party is designed only to identify dogs and cannot process human biometrics, and that its separate facial recognition feature, \"Familiar Faces,\" is opt-in and operates at an individual account level. The company maintains it has built-in guardrails and transparency, denies having partnerships with federal agencies like ICE, and asserts that law enforcement cannot directly access its network without user consent or a legal request.\n\nHowever, fears persist because Search Party is enabled by default, and local agencies could share footage with federal ones. Critics highlight that Ring's founder has expressed ambitions to use AI to \"zero out crime,\" raising concerns that the pet-finding tool is a step toward more pervasive human surveillance. The core issue is a lack of trust that such powerful surveillance tools will remain limited to their original, benign purpose.",
    "chinese_title": "亚马逊Ring的寻狗广告引发强烈反弹，民众担忧大规模监控风险。",
    "chinese_summary": "亚马逊Ring为其AI驱动的“搜索派对”功能推出的超级碗广告引发了对大规模监控的强烈反弹，该功能通过扫描社区摄像头录像来寻找丢失的宠物狗。隐私专家和参议员埃德·马基等批评者指出，鉴于Ring与执法部门的历史合作及其与监控公司Flock Safety的新整合，该技术极易被转而用于追踪人类。\n\nRing声明“搜索派对”仅用于识别犬类，无法处理人类生物特征；其独立的面部识别功能“熟悉面孔”为自愿启用且仅在个人账户层面运行。公司强调已内置防护措施并保持透明度，否认与ICE等联邦机构合作，并坚称执法部门未经用户同意或法律要求无法直接访问其网络。\n\n然而，由于“搜索派对”默认为启用状态，且地方机构可能将录像共享给联邦部门，公众担忧持续存在。批评者指出，Ring创始人曾公开表示要用AI“消除犯罪”，这加剧了人们对这项寻宠工具可能导向更广泛人类监控的忧虑。核心问题在于，公众难以信任如此强大的监控工具会始终局限于最初设计的无害用途。"
  },
  {
    "id": "46979643",
    "title": "iOS 26.3 and macOS 26.3 Fix Dozens of Vulnerabilities, Including Zero-Day",
    "url": "https://www.macrumors.com/2026/02/11/ios-26-3-security-vulnerabilities/",
    "summary": "Apple has released iOS 26.3, iPadOS 26.3, and macOS Tahoe 26.3, primarily containing critical security fixes. The updates patch dozens of vulnerabilities, including a zero-day flaw in the dyld dynamic link editor that was actively exploited.\n\nThis specific vulnerability, which existed in iOS versions prior to 26, allowed attackers with memory write capability to execute arbitrary code. Apple described its exploitation as part of an \"extremely sophisticated attack\" against targeted individuals. The issue was resolved through improved state management.\n\nWhile this zero-day is highlighted, numerous other security flaws across Apple's platforms were also addressed. Apple emphasizes that now these vulnerabilities are public, the risk of exploitation increases. Consequently, the company strongly urges all users to install the updates immediately to protect their devices.",
    "chinese_title": "iOS 26.3与macOS 26.3修复数十项安全漏洞，包括零日漏洞",
    "chinese_summary": "苹果已发布iOS 26.3、iPadOS 26.3和macOS Tahoe 26.3，主要包含关键安全修复。此次更新修补了数十个漏洞，包括动态链接编辑器dyld中一个已被积极利用的零日漏洞。\n\n该漏洞存在于iOS 26之前的版本中，允许具备内存写入能力的攻击者执行任意代码。苹果将其利用描述为针对特定目标人群的“极其复杂攻击”的一部分。该问题已通过改进状态管理得到解决。\n\n除这一零日漏洞外，苹果还修复了其平台上的大量其他安全缺陷。苹果强调，由于这些漏洞现已公开，被利用的风险随之增加。因此，公司强烈建议所有用户立即安装更新以保护设备安全。"
  },
  {
    "id": "46909279",
    "title": "It's all a blur",
    "url": "https://lcamtuf.substack.com/p/its-all-a-blur",
    "summary": "This article explains why blurring images is not a secure method for redaction, as many blur filters are reversible. It demonstrates this by constructing and then deconstructing a simple moving-average blur algorithm.\n\nThe core example uses a one-dimensional \"right-aligned\" moving average, where a pixel's blurred value is the average of itself and its neighbors. The article shows that by knowing the blurred values and the fixed padding used at the image border, the original pixel values can be perfectly reconstructed through simple arithmetic. This process is then extended to two dimensions by applying 1D blur sequentially on the x and y axes.\n\nWhile stronger blurring with larger windows increases quantization noise in the reconstruction, the article proves that significant detail can still be recovered. It further shows that even adversarial filters, which heavily weight the original pixel, are not safe. Finally, it notes that the hidden information often survives compression in lossy formats like JPEG, though at very low quality settings the reconstruction degrades into noise.\n\nThe key takeaway is that blurring is a form of obfuscation, not encryption; it obscures information from the human eye but does not reliably destroy the underlying data.",
    "chinese_title": "一切都模糊不清",
    "chinese_summary": "本文解释了为何模糊图像并非安全的脱敏方法，因为许多模糊滤镜是可逆的。文章通过构建并解构一个简单的移动平均模糊算法来证明这一点。\n\n核心示例采用一维“右对齐”移动平均法，即像素的模糊值是其自身与相邻像素的平均值。文章表明，通过已知的模糊值和图像边界使用的固定填充值，可以完全通过简单算术还原原始像素值。随后通过先后在x轴和y轴上应用一维模糊，将这一过程扩展到二维空间。\n\n虽然使用更大窗口的强模糊会增加重建过程中的量化噪声，但文章证明仍可恢复大量细节。进一步指出，即使采用对原始像素赋予高权重的对抗性滤镜也不安全。最后说明，隐藏信息通常能在JPEG等有损压缩格式中保留，不过在极低质量设置下重建结果会退化为噪点。\n\n关键结论是：模糊属于混淆手段而非加密；它能对人眼隐藏信息，但无法可靠地销毁底层数据。"
  },
  {
    "id": "46956016",
    "title": "A shortage of tenors",
    "url": "https://www.economist.com/culture/2026/02/09/the-world-is-suffering-from-a-shortage-of-tenors",
    "summary": "**Summary of \"A shortage of tenors\"**\n\nThe article identifies a significant and growing global shortage of operatic tenors, particularly those capable of singing the most demanding \"heroic\" roles. This scarcity is causing major headaches for opera houses worldwide, forcing cancellations, costly star substitutions, and compromised productions.\n\nSeveral key factors drive this shortage:\n1.  **Physiological Rarity:** The specific vocal physiology for a true *Heldentenor* (heroic tenor) or *tenore di forza* is inherently rare, requiring both power and stamina.\n2.  **Training Challenges:** Modern training often prioritizes early beauty of sound over the gradual, years-long build of strength needed for heavier roles, risking vocal damage.\n3.  **Financial & Career Pressures:** The high fees commanded by a handful of established stars disincentivize younger tenors from undertaking the long, risky specialization required for heavier repertoire. Meanwhile, smaller houses cannot afford to nurture talent.\n4.  **Changing Repertoire:** The popular operatic canon has shifted toward 19th-century Italian and German works, which are more tenor-centric and demanding than earlier music, increasing pressure on the vocal supply.\n\nThe consequences are a bottleneck at the top of the industry, with a small elite of stars like Jonas Kaufmann and Piotr Beczała in constant high demand, while the development pipeline for their successors remains inadequate. The article suggests that without systemic changes in training and career development, opera's reliance on its most bankable male voices is becoming unsustainable.",
    "chinese_title": "男高音短缺",
    "chinese_summary": "**《男高音短缺问题综述》**\n\n文章指出，全球歌剧界正面临日益严重的男高音短缺问题，尤其是能够驾驭最富挑战性的“英雄”角色的男高音。这种稀缺性正给世界各地的歌剧院带来巨大困扰，导致演出取消、高昂的明星替代以及制作质量下降。\n\n造成这种短缺的几个关键因素包括：\n1.  **生理稀有性**：真正的“英雄男高音”或“强力男高音”所需的特定嗓音生理条件本就罕见，既要求力量又要求持久力。\n2.  **训练挑战**：现代训练方法往往优先追求早期音色的优美，而忽视了为驾驭更重角色所需的、长达数年的力量渐进培养，这增加了嗓音损伤的风险。\n3.  **经济与职业压力**：少数成名明星索取的高额酬金，降低了年轻男高音投身于需要长期、高风险专业化的重型剧目领域的意愿。同时，小型剧院无力承担培养人才的成本。\n4.  **剧目变化**：流行的歌剧经典曲目已转向19世纪的意大利和德国作品，这些作品比早期音乐更以男高音为中心且要求更高，从而加剧了对这类嗓音资源的压力。\n\n其后果是行业顶层出现瓶颈：如乔纳斯·考夫曼和彼得·贝扎拉等少数明星精英持续供不应求，而培养其后继者的渠道却依然不足。文章指出，若不能在培训和职业发展体系上进行系统性改革，歌剧界对其最具票房号召力的男声嗓音的依赖将变得难以为继。"
  },
  {
    "id": "46972610",
    "title": "FAA halts all flights at El Paso airport for 10 days",
    "url": "https://www.nytimes.com/2026/02/11/us/faa-el-paso-flight-restrictions.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "美国联邦航空管理局暂停埃尔帕索机场所有航班10天",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46946593",
    "title": "Show HN: AI agents play SimCity through a REST API",
    "url": "https://hallucinatingsplines.com",
    "summary": "This post introduces a project where AI agents autonomously play the city-building game SimCity via a REST API. The key achievement is the creation of a multi-agent system where AI \"mayors\" manage and develop virtual cities over simulated decades.\n\nThe dashboard data shows the system's output: 58 unique AI mayors have built 502 cities, achieving a combined population of over 9.1 million. Each listed city entry includes a procedurally generated name, its AI mayor, current population, the simulated year it has reached, and a performance score.\n\nThe live feed illustrates the agents' ongoing activity, with new cities being founded and existing ones growing over time—from \"Suburban Market\" in 1905 to \"Crystal Arcade\" in 2140. The varying populations and scores suggest different AI strategies and outcomes.\n\nIn essence, this is a demonstration of using AI agents, coordinated through an API, to simulate complex, long-term strategy and management within a classic game environment.",
    "chinese_title": "展示 HN：AI 代理通过 REST API 玩《模拟城市》",
    "chinese_summary": "这篇文章介绍了一个项目，其中AI智能体通过REST API自主玩城市建设游戏《模拟城市》。核心成就是创建了一个多智能体系统，由AI“市长”在模拟的几十年间管理和开发虚拟城市。\n\n仪表板数据显示了系统的输出：58位独特的AI市长已建造了502座城市，总人口超过910万。每个列出的城市条目都包含一个程序生成的名字、其AI市长、当前人口、达到的模拟年份以及一个绩效评分。\n\n实时动态展示了智能体持续的活动，新城市不断建立，现有城市随时间发展——从1905年的“郊区市场”到2140年的“水晶拱廊”。不同的人口和评分表明AI采用了不同的策略并产生了不同的结果。\n\n本质上，这是通过API协调AI智能体，在经典游戏环境中模拟复杂长期策略与管理的一次演示。"
  },
  {
    "id": "46922453",
    "title": "Rome is studded with cannon balls (2022)",
    "url": "https://essenceofrome.com/rome-is-studded-with-cannon-balls",
    "summary": "This article highlights the surprising presence of historical cannonballs embedded in several locations across Rome, serving as tangible reminders of the city's turbulent past. It details four specific examples:\n\n1.  The \"miracle cannon ball\" in the church of San Bartolomeo all’Isola Tiberina, fired by French troops in 1849. It crashed through the church during a crowded service but caused no casualties, leading to its miraculous name.\n2.  A cannonball lodged in the marble staircase of Palazzo Colonna's Salone d’Onore, also fired by French forces from the Janiculum Hill.\n3.  A legendary cannonball at Villa Medici, attributed to Queen Christina of Sweden in the 17th century. Lore suggests she fired it from Castel Sant'Angelo in a fit of rage, with the marble sphere on a fountain possibly being the projectile. The villa's original bronze door still bears a dent from an impact.\n4.  A cannonball embedded in the Aurelian Walls near Corso d’Italia, a relic from the 1870 battle for Rome's annexation to the Kingdom of Italy, which culminated in the Breach of Porta Pia.\n\nThe article concludes by inviting visitors to explore these unique sites on guided tours to discover these stories firsthand.",
    "chinese_title": "罗马城点缀着炮弹（2022）",
    "chinese_summary": "本文揭示了罗马城中几处令人惊讶的历史炮弹遗迹，它们嵌在不同建筑中，成为这座城市动荡过往的实物见证。文中详述了四个具体案例：\n\n1.  位于蒂贝里纳岛圣巴尔多禄茂教堂的“奇迹炮弹”，由法军于1849年发射。它在一次拥挤的礼拜中击穿教堂，却未造成伤亡，因此得名“奇迹”。\n2.  嵌在科隆纳宫荣誉大厅大理石台阶中的炮弹，同样由法军从贾尼科洛山发射。\n3.  美第奇别墅内一枚传奇炮弹，据传属于17世纪的瑞典女王克里斯蒂娜。传说她在盛怒中从圣天使城堡开炮，而喷泉上的大理石球可能就是当年的弹丸。别墅原有的青铜门上仍保留着撞击的凹痕。\n4.  嵌在意大利大道附近奥勒良城墙中的炮弹，是1870年罗马并入意大利王国战役的遗物，这场战役最终以攻破庇亚门告终。\n\n文章最后邀请游客通过导览游览这些独特地点，亲身探寻这些历史故事。"
  },
  {
    "id": "46913747",
    "title": "Show HN: Hibana – An Affine MPST Runtime for Rust",
    "url": "https://hibanaworks.dev",
    "summary": "**Hibana** is an affine **multiparty session types (MPST)** runtime for Rust, designed to enable compile-time verification that distributed protocols are deadlock-free. Its core is `#![no_std]` and allocation-free, targeting embedded and resource-constrained systems.\n\nThe workflow involves three steps:\n1. **Define a Global Choreography**: Write the protocol's communication flow (e.g., a ping-pong sequence) using pure `const fn` constructs like `send`, `seq`, and `par`.\n2. **Compile-Time Projection**: The global protocol is automatically projected at compile time into a local role-specific program for each participant.\n3. **Affine Execution**: The runtime uses linear (\"affine\") cursors, ensuring each protocol step is consumed exactly once. This prevents invalid actions like skipping steps, reusing messages, or dropping sessions accidentally.\n\nKey features include:\n*   **Transport Agnosticism**: Protocol logic is decoupled from wire I/O via a `BindingSlot` API.\n*   **Deterministic Observability**: A dual-ring tap architecture allows debugging and replay without impacting runtime determinism.\n*   **Effect Policy Filter**: A hot-reloadable, eBPF-inspired VM for enforcing dynamic runtime policies.\n\nThe project is in preview, with stable core ideas but evolving APIs. It includes a core crate (`hibana`) and public demo crates for QUIC integration and AI agent automation.",
    "chinese_title": "展示 HN：Hibana – Rust 的仿射多会话类型运行时",
    "chinese_summary": "**Hibana** 是一个用于 Rust 的仿射**多方会话类型（MPST）**运行时，旨在通过编译时验证确保分布式协议无死锁。其核心为 `#![no_std]` 且无需内存分配，专为嵌入式及资源受限系统设计。\n\n工作流程包含三个步骤：\n1.  **定义全局编排**：使用纯 `const fn` 构造（如 `send`、`seq` 和 `par`）编写协议的通信流程（例如乒乓序列）。\n2.  **编译时投影**：全局协议在编译时自动投影为每个参与者的本地角色特定程序。\n3.  **仿射执行**：运行时使用线性（“仿射”）游标，确保每个协议步骤被恰好消费一次。这避免了跳过步骤、重复使用消息或意外丢弃会话等无效操作。\n\n主要特性包括：\n*   **传输无关性**：通过 `BindingSlot` API 将协议逻辑与底层 I/O 解耦。\n*   **确定性可观测性**：双环监听架构支持调试与重放，且不影响运行时确定性。\n*   **效果策略过滤器**：采用受 eBPF 启发的、支持热重载的虚拟机，用于强制执行动态运行时策略。\n\n该项目处于预览阶段，核心概念稳定但 API 仍在演进。包含核心库（`hibana`）及用于 QUIC 集成与 AI 智能体自动化的公开演示库。"
  },
  {
    "id": "46973573",
    "title": "Exposure Simulator",
    "url": "http://www.andersenimages.com/tutorials/exposure-simulator/",
    "summary": "The **Exposure Simulator** is an interactive web tool designed to teach the fundamentals of photography exposure. It visually simulates how three key camera settings—**Shutter Speed, Aperture (F-Stop), and ISO**—affect a final image.\n\nUsers can operate in three shooting modes: **Shutter Priority**, **Aperture Priority**, or full **Manual** control. The simulator includes a camera meter to indicate if the current settings result in under or overexposure. Crucially, it demonstrates two important visual effects: **depth-of-field changes** based on the aperture setting and increased **image noise** at higher ISO levels.\n\nA noted limitation is that the tool does not currently function in Internet Explorer and requires browsers like Chrome or Firefox. The author also mentions a potential future enhancement to show the effect of shutter speed on moving subjects.",
    "chinese_title": "曝光模拟器",
    "chinese_summary": "**曝光模拟器**是一款交互式网页工具，旨在教授摄影曝光的基础知识。它直观模拟了三个关键相机设置——**快门速度、光圈（F值）和ISO**——如何影响最终成像效果。\n\n用户可在三种拍摄模式下操作：**快门优先、光圈优先**或完全**手动**控制。该模拟器包含一个相机测光表，用于指示当前设置是否会导致曝光不足或过度。重要的是，它展示了两种关键的视觉效果：基于光圈设置的**景深变化**，以及高ISO下增加的**图像噪点**。\n\n需注意的局限性是，该工具目前无法在Internet Explorer浏览器中运行，需要使用Chrome或Firefox等浏览器。作者还提到未来可能增加一项功能，以展示快门速度对运动主体的影响效果。"
  },
  {
    "id": "46979058",
    "title": "How Did the FBI Get Nancy Guthrie's Nest Doorbell Footage?",
    "url": "https://lifehacker.com/tech/how-did-the-fbi-get-nancy-guthries-doorbell-footage",
    "summary": "This article explores how the FBI obtained Nest doorbell footage in the Nancy Guthrie case despite her not having a paid subscription to store video. The central question is how law enforcement retrieved video from a device that was reportedly disconnected and not set to save recordings.\n\nExperts suggest the FBI likely recovered the footage from \"residual data\" in Google's backend systems or by reconstructing it from data points stored locally on the device hardware. Even without a subscription, some Nest doorbells temporarily save limited event histories (from 10 seconds to 3 hours) when motion is detected, which may have been triggered by the suspect.\n\nThe article clarifies this is not akin to Ring's partnerships with police, as Google does not have a formal program for law enforcement to request user footage. While the case shows that some data may persist beyond user control, the risk of authorities accessing footage without a warrant in ordinary circumstances is considered low. The ultimate privacy guarantee, however, remains not using a camera-equipped doorbell at all.",
    "chinese_title": "FBI是如何获取南希·格思里的Nest门铃录像的？",
    "chinese_summary": "本文探讨了在Nancy Guthrie案中，尽管她没有付费订阅存储视频服务，FBI是如何获取其Nest门铃录像的。核心问题在于执法部门如何从一台据称已断开连接且未设置保存录像的设备中检索到视频。\n\n专家指出，FBI很可能从谷歌后端系统的“残留数据”中恢复了录像，或是通过设备硬件本地存储的数据点重建了视频。即使没有订阅服务，部分Nest门铃在检测到动静时（可能由嫌疑人触发）会临时保存有限的事件记录（时长从10秒到3小时不等）。\n\n文章澄清，这与Ring和警方的合作模式不同，谷歌并未设立执法部门请求用户录像的正式程序。尽管此案表明某些数据可能超出用户控制范围而留存，但在一般情况下，当局无搜查令获取录像的风险被认为较低。然而，最终的隐私保障仍在于完全不使用配备摄像头的门铃。"
  },
  {
    "id": "46913489",
    "title": "Lessons you will learn living in a snowy place",
    "url": "https://eukaryotewritesblog.com/2026/01/21/very-snowy-place/",
    "summary": "This humorous first-person article details the practical and psychological lessons learned from living through a major winter storm and power outage. The author emphasizes the importance of preparation, including having backup power sources (generators), ample supplies (food, water, batteries), and the right gear (snow pants, gaiters). Key survival tasks involve managing heat—often via a wood stove—and understanding that snow is deceptively heavy and harder to move after it compacts.\n\nThe narrative underscores that physical strength is crucial for shoveling and that resourcefulness is key, like using stored firewood or melting snow for water. It warns of dangers like carbon monoxide from generators and the misery of getting wet and cold. Morale is a constant challenge; while there’s time for reading, restlessness sets in, contrasted with the hardy resilience of Alaskan pioneers described in a memoir.\n\nUltimately, the piece conveys that despite best efforts, conditions can become untenable. When faced with another impending storm and exhausted resources, the rational choice is sometimes to abandon the effort, dig out the vehicle, and leave.",
    "chinese_title": "生活在雪地你将学到的教训",
    "chinese_summary": "这篇幽默的第一人称文章详细描述了经历一场严重冬季风暴和停电所带来的实际与心理教训。作者强调了准备工作的重要性，包括备用电源（发电机）、充足物资（食物、水、电池）和合适装备（雪裤、雪套）。关键的生存任务涉及管理供暖——通常通过柴火炉——以及认识到雪在压实后会变得异常沉重且更难清理。\n\n叙述强调体力对于铲雪至关重要，而随机应变的能力是关键，比如使用储存的柴火或融雪取水。文章警告了诸如发电机产生一氧化碳的危险，以及弄湿和受冻的痛苦。士气是持续的挑战；虽然有阅读的时间，但不安情绪会逐渐蔓延，这与回忆录中描述的阿拉斯加先驱们的坚韧精神形成对比。\n\n最终，这篇文章传达出尽管尽了最大努力，环境仍可能变得无法应对。当面对另一场即将来临的风暴且资源耗尽时，理性的选择有时是放弃努力，挖出车辆，然后离开。"
  },
  {
    "id": "46972056",
    "title": "Communities are not fungible",
    "url": "https://www.joanwestenberg.com/communities-are-not-fungible/",
    "summary": "This article argues that communities are not fungible—they cannot be swapped or replaced without significant loss. It critiques the common assumption in technology and urban planning that communities are interchangeable assets that can be rebuilt or migrated.\n\nThe author uses urban planner Robert Moses and writer Jane Jacobs to illustrate how destroying physical neighborhoods severs irreplaceable webs of relationships, trust, and shared history. Similarly, when online platforms die (e.g., LiveJournal, Vine), their communities fragment and cannot be reassembled elsewhere because the specific culture and conditions that formed them are lost.\n\nAttempts to engineer communities from scratch, whether in new towns or corporate initiatives, fail because they mistake proximity and infrastructure for the deep, time-grown social fabric of real community. This fabric is built through countless unplanned interactions and is path-dependent, meaning its unique history cannot be recreated.\n\nThe conclusion is that disrupting a community carries a profound, often hidden cost—the destruction of non-fungible social capital. Therefore, the burden of proof must lie with those proposing such disruption, and glib promises of building a better replacement should be dismissed.",
    "chinese_title": "社群并非可以随意替换",
    "chinese_summary": "本文认为，社区并非可替代品——它们无法在不造成重大损失的情况下被交换或取代。文章批判了技术与城市规划中常见的假设，即社区是可互换的资产，能够被重建或迁移。\n\n作者以城市规划师罗伯特·摩斯和作家简·雅各布斯为例，阐明摧毁实体社区如何切断了不可替代的关系网络、信任与共同历史。同样，当在线平台消亡时（如LiveJournal、Vine），其社区也随之破碎，无法在其他地方重组，因为孕育它们的特定文化与条件已不复存在。\n\n无论是建设新城还是企业主导的倡议，试图凭空打造社区的尝试往往失败，因为它们误将物理邻近性和基础设施等同于真实社区那种深厚、随时间积淀的社会结构。这种结构源于无数未经计划的互动，且具有路径依赖性——意味着其独特的历史无法被复现。\n\n结论是：破坏一个社区需付出深刻且常被忽视的代价——即不可替代的社会资本将遭摧毁。因此，举证责任必须由提议破坏者承担，而那些关于“重建更好替代品”的轻率承诺应当被摒弃。"
  },
  {
    "id": "46976443",
    "title": "Why Vampires Live Forever",
    "url": "https://machielreyneke.com/blog/vampires-longevity/",
    "summary": "This essay humorously argues that the modern longevity movement is a covert disclosure program for vampirism, based on the science of parabiosis—the practice of sharing blood between old and young organisms to reverse aging.\n\nThe author cites historical figures like Peter Thiel and Bryan Johnson as suspects, noting their interest in or use of young blood transfusions, reclusive behavior, and destruction of media that investigated them. The historical record is presented as evidence, from ancient Roman practices to 15th-century medical texts and *Dracula*, suggesting blood-based life extension is an ancient secret.\n\nA key scientific twist is noted: recent research implies the benefit comes not from young blood's properties, but from diluting old blood—reframing vampirism as a form of biological dialysis.\n\nThe article concludes that we are in a multi-phase disclosure timeline, moving from scientific groundwork to public normalization via billionaires and media. The author's central irony is that today's \"vampires\" have catastrophically broken the cardinal rule of secrecy by publicizing their activities, unlike the discreet Count Dracula.",
    "chinese_title": "为何吸血鬼永生不死",
    "chinese_summary": "这篇文章幽默地论证，现代长寿运动实为吸血鬼主义的秘密披露计划，其科学基础是异种共生——即通过共享老年与年轻生物体的血液来逆转衰老。\n\n作者列举了彼得·蒂尔和布莱恩·约翰逊等历史人物作为嫌疑对象，指出他们对年轻血液输注的兴趣或实践、隐居行为，以及销毁调查媒体的举动。从古罗马习俗到15世纪医学文献乃至《德古拉》的记载，都被呈现为证据，暗示以血液延寿是古老的秘密。\n\n文中指出了一个关键的科学转折：近期研究表明，益处并非来自年轻血液的特性，而是通过稀释衰老血液实现的——这重新定义了吸血鬼主义，将其视为一种生物透析。\n\n文章总结道，我们正处在一个多阶段的披露时间线上，从科学基础铺垫到通过亿万富翁和媒体实现公众常态化。作者的核心反讽在于：如今的“吸血鬼”公然宣扬自身活动，灾难性地打破了保密的首要原则，与谨慎的德古拉伯爵截然不同。"
  },
  {
    "id": "46975449",
    "title": "Show HN: Renovate – The Kubernetes-Native Way",
    "url": "https://github.com/mogenius/renovate-operator",
    "summary": "**Summary:** Renovate Operator is a Kubernetes-native solution for self-hosting the Renovate dependency update tool. It enhances the standard self-hosted Renovate CLI by providing a declarative, operator-based approach with greater control and observability.\n\n**Key Features:**\n*   **Kubernetes-Native:** Uses Custom Resource Definitions (CRDs) for declarative cron scheduling and manages Renovate jobs as Kubernetes pods.\n*   **Enhanced Control:** Offers parallel execution with concurrency limits, auto-discovery with filtering, and in-cluster status tracking for projects.\n*   **Built-in Observability:** Includes a web UI, Prometheus metrics, health checks, and structured job lifecycle management (TTL, retries).\n*   **Enterprise Reliability:** Supports leader election for high availability and runs entirely on your own infrastructure.\n\n**How It Works:** The operator automatically discovers projects on a schedule, lists them in the UI, and then executes Renovate jobs in parallel (controlled by a parallelism setting), checking for new work every 10 seconds.\n\n**Installation:** Can be installed via Helm, either directly from an OCI registry or a Helm repository. It is fully open-source and does not require a license key or signup, distinguishing it from the Mend Renovate Community Edition.",
    "chinese_title": "展示 HN：Renovate——Kubernetes 原生之道",
    "chinese_summary": "**概述：** Renovate Operator 是一个 Kubernetes 原生解决方案，用于自托管 Renovate 依赖项更新工具。它通过提供声明式、基于操作符的方法，增强了标准的自托管 Renovate CLI，提供了更高的控制力和可观测性。\n\n**主要特性：**\n*   **Kubernetes 原生：** 使用自定义资源定义（CRD）进行声明式定时调度，并将 Renovate 作业作为 Kubernetes Pod 进行管理。\n*   **增强的控制力：** 提供带并发限制的并行执行、带过滤的自动发现以及集群内项目状态跟踪。\n*   **内置可观测性：** 包含 Web UI、Prometheus 指标、健康检查以及结构化的作业生命周期管理（TTL、重试）。\n*   **企业级可靠性：** 支持领导者选举以实现高可用性，并完全在您自己的基础设施上运行。\n\n**工作原理：** 该操作符按计划自动发现项目，在 UI 中列出它们，然后并行执行 Renovate 作业（受并行度设置控制），并每 10 秒检查一次新工作。\n\n**安装：** 可通过 Helm 安装，可以直接从 OCI 注册表或 Helm 仓库安装。它是完全开源的，不需要许可证密钥或注册，这使其有别于 Mend Renovate 社区版。"
  },
  {
    "id": "46971516",
    "title": "Windows Notepad App Remote Code Execution Vulnerability",
    "url": "https://www.cve.org/CVERecord?id=CVE-2026-20841",
    "summary": "**Summary:**\n\nThis text appears to be an incomplete or error page from the official CVE (Common Vulnerabilities and Exposures) website, not a detailed article. The core information provided is:\n\n1.  **Subject:** It references a reported vulnerability titled \"Windows Notepad App Remote Code Execution Vulnerability.\"\n2.  **Severity:** The title indicates it is a **Remote Code Execution (RCE)** flaw, which is a critical severity vulnerability allowing an attacker to run arbitrary code on a victim's system.\n3.  **Affected Software:** The vulnerability reportedly affects the **Windows Notepad application**.\n4.  **Source Issue:** The main body of the text is not vulnerability details, but a **technical error message** from the CVE website stating that JavaScript is required for the site to function and the content cannot be displayed without it.\n\n**Key Takeaway:** While a serious-sounding vulnerability in a core Windows component is mentioned, the provided text does not contain any actual details about the CVE ID, description, affected versions, or mitigation. The content is primarily a placeholder error page from the CVE database. To obtain the full details, one would need to visit the CVE website with JavaScript enabled and search for the specific CVE entry.",
    "chinese_title": "Windows记事本应用程序远程代码执行漏洞",
    "chinese_summary": "**摘要：**\n\n此文本似乎是来自官方CVE（通用漏洞披露）网站的不完整或错误页面，而非详细文章。其提供的核心信息如下：\n\n1.  **主题：** 引述了一个名为“Windows记事本应用程序远程代码执行漏洞”的已报告漏洞。\n2.  **严重性：** 标题表明这是一个**远程代码执行（RCE）** 漏洞，属于严重级别，允许攻击者在受害者系统上运行任意代码。\n3.  **受影响软件：** 该漏洞据称影响**Windows记事本应用程序**。\n4.  **来源问题：** 文本主体并非漏洞详情，而是CVE网站的一条**技术错误信息**，说明网站运行需要JavaScript支持，若未启用则无法显示内容。\n\n**关键要点：** 虽然提及了一个影响核心Windows组件的、听起来很严重的漏洞，但所提供文本并未包含任何关于CVE编号、描述、受影响版本或缓解措施的实际细节。其内容主要是CVE数据库中的一个占位错误页面。要获取完整详情，需要启用JavaScript并访问CVE网站，搜索特定的CVE条目。"
  },
  {
    "id": "46971794",
    "title": "CoLoop (YC S21) Is Hiring Ex Technical Founders in London",
    "url": "https://www.workatastartup.com/jobs/90016",
    "summary": "CoLoop, a Y Combinator-backed AI startup (S21), is hiring an ex-technical founder for a full-time engineering role in London. The company builds an AI copilot to help businesses access customer insights and improve strategic decisions.\n\nThe ideal candidate is a former AI startup founder with hands-on experience shipping complex agent systems and full-stack development skills (Node.js, Python, React, TypeScript). The role emphasizes extreme ownership: engineers manage the entire product cycle without product managers, from ideation to measuring impact in a flat, autonomous structure.\n\nCoLoop highlights its resilient founding story, including a pivot after reaching $1M ARR, to convey its long-term commitment. It values the founder mindset—moving fast, owning problems, and caring deeply about customers—and actively supports employees who may later pursue their own ventures.\n\nThe compensation package includes a £90K-£180K salary and 0.10%-0.40% equity. The interview process is streamlined, taking 1-2 weeks, and includes a paid one-day contract. The company encourages applications even if not all requirements are met.",
    "chinese_title": "CoLoop（YC S21）正在伦敦招聘前技术创始人",
    "chinese_summary": "CoLoop是一家获得Y Combinator支持的AI初创公司（S21期），现招聘一位前技术创始人，在伦敦担任全职工程师职位。该公司开发了一款AI助手，帮助企业获取客户洞察并优化战略决策。\n\n理想的候选人曾是AI初创公司创始人，具备实际交付复杂智能体系统的经验以及全栈开发技能（Node.js、Python、React、TypeScript）。该职位强调极致自主权：工程师在扁平化、自主管理的架构中，无需产品经理介入，全程负责从构思到效果评估的完整产品周期。\n\nCoLoop特别强调了其坚韧的创业历程，包括在实现百万美元年经常性收入后的战略转型，以彰显其长期承诺。公司重视创始人思维——快速行动、主动担责、深度关注客户，并积极支持未来可能自主创业的员工。\n\n薪酬方案包括9万至18万英镑年薪及0.10%-0.40%的股权。面试流程高效精简，耗时1-2周，包含一天带薪试用。公司鼓励即使不完全符合所有要求的申请者踊跃投递。"
  },
  {
    "id": "46976317",
    "title": "AI-First Company Memos",
    "url": "https://the-ai-native.company/",
    "summary": "In 2025, a wave of CEOs published internal memos declaring their companies \"AI-first,\" revealing three distinct strategic philosophies. Shopify, Duolingo, and Fiverr framed **AI as a gate**, requiring employees to justify why AI couldn't do their work before gaining resources. Box presented **AI as a ladder**, rewarding teams that used AI effectively with more headcount. Klarna exemplified **AI as a fait accompli**, announcing drastic AI-driven cuts before later reversing course, admitting quality suffered and re-hiring humans.\n\nThese public memos are themselves a strategic tool, creating accountability, setting the market narrative, and generating peer pressure. Notably, none of the memos define \"AI-first,\" which is intentional; the vague, directional language drives momentum without restrictive details.\n\nThe key takeaway is the gap between bold AI declarations and operational reality, best illustrated by Klarna's public reversal. While investors create taxonomies to classify AI companies, CEOs use these memos to signal transformation and force internal change, regardless of the precise implementation.",
    "chinese_title": "AI优先公司备忘录",
    "chinese_summary": "2025年，一批CEO发布内部备忘录，宣布其公司进入“AI优先”时代，展现出三种不同的战略理念。Shopify、Duolingo和Fiverr将**AI视为一道门**，要求员工在获取资源前必须证明AI无法替代其工作。Box将**AI视为阶梯**，为有效运用AI的团队奖励更多人员编制。Klarna则展示了**AI作为既成事实**的案例，先是宣布大幅度的AI驱动裁员，随后又公开逆转决策，承认质量受损并重新招聘人力。\n\n这些公开备忘录本身已成为战略工具，旨在建立问责机制、设定市场叙事并制造同行压力。值得注意的是，所有备忘录都未定义“AI优先”——这种模糊的方向性表述有意为之，既能推动变革势头，又避免了细节束缚。\n\n核心启示在于宏大的AI宣言与运营现实之间的差距，Klarna的公开逆转便是最佳例证。当投资者试图用分类法界定AI公司时，CEO们正通过这些备忘录传递转型信号、推动内部变革，而具体实施路径反而退居其次。"
  },
  {
    "id": "46979819",
    "title": "Paragon accidentally uploaded a photo of its spyware control panel",
    "url": "https://twitter.com/DrWhax/status/2021608609595945442",
    "summary": "**Summary:**\n\nParagon, a company selling spyware to governments, accidentally exposed a screenshot of its internal control panel on its public website. The image, intended for promotional use, revealed details about the system's capabilities, including the ability to remotely access and extract data (messages, photos, location) from infected smartphones. Security researchers analyzed the screenshot, confirming it as authentic and highlighting the extensive surveillance functions it advertised. The incident underscores the opaque nature of the commercial spyware industry and raises concerns about the potential for such powerful tools to be misused against journalists, activists, and political dissidents. Paragon has since removed the image from its site.",
    "chinese_title": "Paragon意外上传了其间谍软件控制面板的照片",
    "chinese_summary": "**摘要：**\n\nParagon是一家向政府出售间谍软件的公司，其公开网站上意外泄露了一张内部控制面板的截图。这张原本用于宣传的图片揭示了该系统的监控能力，包括远程访问受感染智能手机并提取数据（消息、照片、位置）的功能。安全研究人员分析截图后，确认其真实性，并指出其中宣传的广泛监控功能。这一事件凸显了商业间谍软件行业的不透明性，并引发了对这类强大工具可能被滥用于针对记者、活动人士和政治异见者的担忧。Paragon目前已将图片从其网站移除。"
  },
  {
    "id": "46969751",
    "title": "End of an era for me: no more self-hosted git",
    "url": "https://www.kraxel.org/blog/2026/01/thank-you-ai/",
    "summary": "The author has permanently shut down their long-running, self-hosted public Git server, which had been operational since 2011 (and a CVS server before that). The primary reason for this decision is that AI web scrapers have relentlessly overloaded the server's Cgit web frontend with massive volumes of inefficient requests, ultimately causing its failure months ago.\n\nRather than rebuild and continue battling the scrapers, the author has moved all projects to mirrored repositories on major Git hosting platforms (GitLab and GitHub), which are now the primary sources. They have also updated links to point to these forges.\n\nThe author now maintains only one self-hosted service: a static website (this blog, migrated from WordPress to Jekyll in 2018). While this static setup is more resilient, AI scrapers previously caused an outage by flooding the server with requests for the defunct Git service, filling the disk with 404 error logs. This was resolved with a configuration fix.\n\nThe post marks the end of an era for the author's self-hosting, driven by the unsustainable resource demands of modern AI data collection.",
    "chinese_title": "我的时代终结：不再自托管Git",
    "chinese_summary": "作者已永久关闭其自2011年起长期运营的自托管公共Git服务器（此前还运行过CVS服务器）。做出这一决定的主要原因是，AI网络爬虫持续以海量低效请求冲击服务器的Cgit网页前端，最终导致其在数月前瘫痪。\n\n作者没有选择重建服务器并继续与爬虫对抗，而是将所有项目迁移至主流Git托管平台（GitLab和GitHub）的镜像仓库，这些平台现已成为主要代码源。相关链接也已更新指向这些托管站点。\n\n目前作者仅维护一项自托管服务：一个静态网站（即本博客，于2018年从WordPress迁移至Jekyll）。虽然静态架构更具韧性，但此前AI爬虫曾因疯狂请求已失效的Git服务导致服务器过载，使磁盘被404错误日志填满，后通过配置修复解决。\n\n这篇帖子标志着作者自托管时代的终结，其背后是现代AI数据收集对资源不可持续的索取。"
  },
  {
    "id": "46973083",
    "title": "Chrome extensions spying on users' browsing data",
    "url": "https://qcontinuum.substack.com/p/spying-chrome-extensions-287-extensions-495",
    "summary": "This article details a large-scale investigation revealing that 287 Chrome extensions, with approximately 37.4 million total installations, are secretly exfiltrating users' browsing history. The research employed an automated scanning system that detected a correlation between the length of visited URLs and the volume of outbound network traffic from extensions, indicating data leakage.\n\nKey actors behind these leaks include well-known data brokers like Similarweb, as well as entities such as Curly Doggo, Offidocs, and a mysterious \"Big Star Labs\" linked to Similarweb. The exfiltrated data, often obfuscated or encrypted, is sent to remote servers and can be aggregated and sold, posing risks for user profiling, targeted advertising, and potential corporate espionage.\n\nThe report provides technical examples of how specific extensions, including a pop-up blocker and the \"Stylish\" theme manager, encode and transmit browsing data. It also notes that while some extensions may collect data for functional purposes, the scale and secrecy of the operation are alarming, effectively turning users into the product. The findings underscore ongoing privacy concerns within the browser extension ecosystem.",
    "chinese_title": "Chrome扩展程序窥探用户浏览数据",
    "chinese_summary": "本文详述了一项大规模调查，该调查揭露了287个Chrome扩展程序（总计安装量约3740万次）正在秘密窃取用户的浏览历史。研究采用了一套自动化扫描系统，该系统检测到访问的URL长度与扩展程序外发网络流量之间的相关性，从而表明存在数据泄露。\n\n这些数据泄露背后的主要参与者包括知名数据代理商Similarweb，以及Curly Doggo、Offidocs和一家与Similarweb有关联的神秘公司“Big Star Labs”。被窃取的数据通常经过混淆或加密处理，发送至远程服务器，并可被汇总和出售，从而带来用户画像分析、定向广告乃至潜在商业间谍活动的风险。\n\n报告通过技术示例说明了特定扩展程序（包括一款弹窗拦截器和“Stylish”主题管理器）如何编码并传输浏览数据。报告同时指出，尽管部分扩展程序可能出于功能目的收集数据，但其操作的规模和隐蔽性令人担忧，实质上将用户变成了产品。这些发现凸显了浏览器扩展生态系统中持续存在的隐私隐患。"
  }
]