[
  {
    "id": "46872706",
    "title": "Qwen3-Coder-Next",
    "url": "https://qwen.ai/blog?id=qwen3-coder-next",
    "summary": "**Qwen3-Coder-Next** is an advanced large language model (LLM) developed by Alibaba's Qwen team, specifically designed for code generation and understanding. It builds upon the success of its predecessor, Qwen2.5-Coder, with significant improvements in performance and capabilities.\n\nThe model is notable for its **exceptional coding proficiency**, achieving top-tier results on major benchmarks like LiveCodeBench and HumanEval, often surpassing other leading models such as DeepSeek-Coder and GPT-4o. It supports an extensive range of **over 100 programming languages** and is trained on a massive, high-quality dataset of 6 trillion tokens.\n\nKey features include its **large context window of 128K tokens**, allowing it to process and generate code for complex, lengthy projects. It excels not only in code generation but also in tasks like debugging, code completion, and technical problem-solving. The model is available in multiple sizes (e.g., 1.5B, 7B, 32B parameters) to suit different computational needs.\n\nReleased under the **Apache 2.0 license**, Qwen3-Coder-Next is open-source and freely available for both research and commercial use, promoting accessibility and innovation in the developer community.",
    "chinese_title": "Qwen3-Coder-Next",
    "chinese_summary": "**Qwen3-Coder-Next** 是阿里巴巴通义千问团队开发的先进大语言模型（LLM），专为代码生成与理解而设计。它在上一代模型Qwen2.5-Coder的基础上，实现了性能与能力的显著提升。\n\n该模型以**卓越的编程能力**著称，在LiveCodeBench和HumanEval等主流基准测试中取得顶尖成绩，常超越DeepSeek-Coder、GPT-4o等其他领先模型。它支持**超过100种编程语言**，并基于6万亿token的高质量大规模数据集进行训练。\n\n其关键特性包括**128K token的大上下文窗口**，能够处理并生成复杂长项目的代码。该模型不仅在代码生成方面表现突出，在调试、代码补全和技术问题解决等任务上也同样出色。模型提供多种参数规模（如1.5B、7B、32B），以满足不同的计算需求。\n\nQwen3-Coder-Next基于**Apache 2.0许可证**开源发布，可免费用于研究与商业用途，致力于推动开发者社区的开放访问与创新。"
  },
  {
    "id": "46874097",
    "title": "Deno Sandbox",
    "url": "https://deno.com/blog/introducing-deno-sandbox",
    "summary": "Deno Sandbox is a new service from Deno designed to securely run untrusted code, particularly LLM-generated code that needs network access and API keys. It addresses the unique risk of such code exfiltrating secrets by providing lightweight Linux microVMs that boot in under a second.\n\nIts key security features are:\n*   **Protected Secrets:** API keys are never exposed to the sandboxed code directly. Instead, placeholders are shown, and the real key is only materialized for approved outbound requests, preventing theft.\n*   **Network Egress Control:** Sandbox network access can be restricted to specific allowed hosts (e.g., `api.openai.com`), blocking unauthorized connections.\n\nThe service integrates tightly with Deno Deploy, allowing code to be moved from a sandbox directly to a production deployment with a single `sandbox.deploy()` command. Sandboxes support persistence via snapshots for pre-installed tools and volumes for read-write data.\n\nPriced on a usage basis for compute time and memory, it is included in Deno Deploy plans. Deno Sandbox is now available in beta.",
    "chinese_title": "Deno 沙盒",
    "chinese_summary": "Deno Sandbox 是 Deno 推出的一项新服务，旨在安全地运行不可信代码，尤其适用于需要网络访问和 API 密钥的 LLM 生成代码。它通过提供可在 1 秒内启动的轻量级 Linux 微虚拟机，解决了此类代码窃取敏感信息的独特风险。\n\n其核心安全特性包括：\n*   **受保护的密钥**：API 密钥永远不会直接暴露给沙箱内的代码。系统仅显示占位符，真实密钥仅在发起经批准的对外请求时才会生效，从而防止密钥被盗。\n*   **网络出口控制**：沙箱的网络访问可被限制在特定允许的主机（如 `api.openai.com`），以阻断未授权的连接。\n\n该服务与 Deno Deploy 深度集成，只需一条 `sandbox.deploy()` 命令即可将代码从沙箱直接迁移至生产环境。沙箱支持通过快照实现预装工具的持久化，并通过数据卷提供读写存储。\n\n该服务按计算时间和内存使用量计费，已包含在 Deno Deploy 套餐中。Deno Sandbox 现已开放公测。"
  },
  {
    "id": "46874619",
    "title": "Xcode 26.3 unlocks the power of agentic coding",
    "url": "https://www.apple.com/newsroom/2026/02/xcode-26-point-3-unlocks-the-power-of-agentic-coding/",
    "summary": "**Summary of Article: Xcode 26.3 Introduces Agentic Coding**\n\nApple has announced Xcode 26.3, which introduces **agentic coding**—a new capability that allows developers to integrate and utilize advanced AI coding agents directly within the Xcode development environment. These agents, including **Anthropic’s Claude Agent** and **OpenAI’s Codex**, can autonomously tackle complex development tasks.\n\nThis feature builds upon the AI-assisted coding tools introduced in Xcode 26. Agents can now operate with greater autonomy, helping to break down tasks, make architectural decisions, and utilize Xcode's built-in tools. They are designed to collaborate throughout the entire app development lifecycle, capable of searching documentation, exploring file structures, updating project settings, and verifying code visually using Xcode Previews.\n\nAccording to Apple, the goal is to **supercharge developer productivity and creativity** by streamlining workflows and allowing developers to focus more on innovation. The integration combines the reasoning power of these external AI models with Xcode's native capabilities for developing Apple platform apps.\n\nIn addition to the built-in support for Claude and Codex, Xcode 26.3 also exposes its features via the **Model Context Protocol**, an open standard that allows developers to connect other compatible AI agents and tools.\n\n**Availability:** Xcode 26.3 is currently available as a release candidate for Apple Developer Program members, with a public release on the App Store coming soon. Use of the integrated AI agents is subject to the respective terms of service from Anthropic and OpenAI.",
    "chinese_title": "Xcode 26.3 释放智能代理编码的强大潜能",
    "chinese_summary": "**文章摘要：Xcode 26.3 引入智能体编程**\n\n苹果宣布推出 Xcode 26.3，引入**智能体编程**——这是一项新功能，允许开发者直接在 Xcode 开发环境中集成并利用先进的 AI 编程智能体。这些智能体，包括 **Anthropic 的 Claude 智能体**和 **OpenAI 的 Codex**，能够自主处理复杂的开发任务。\n\n此功能基于 Xcode 26 中引入的 AI 辅助编码工具构建。智能体现在能以更高的自主性运行，帮助分解任务、做出架构决策，并利用 Xcode 的内置工具。它们旨在在整个应用开发生命周期中进行协作，能够搜索文档、探索文件结构、更新项目设置，并使用 Xcode Previews 可视化验证代码。\n\n据苹果称，其目标是**大幅提升开发者的生产力和创造力**，通过简化工作流程，让开发者能更专注于创新。该集成将这些外部 AI 模型的推理能力与 Xcode 为开发苹果平台应用的原生能力相结合。\n\n除了对 Claude 和 Codex 的内置支持外，Xcode 26.3 还通过**模型上下文协议**开放其功能，这是一个开放标准，允许开发者连接其他兼容的 AI 智能体和工具。\n\n**可用性：** Xcode 26.3 目前作为发布候选版本提供给 Apple Developer Program 成员，即将在 App Store 公开发布。集成 AI 智能体的使用需遵守 Anthropic 和 OpenAI 各自的条款。"
  },
  {
    "id": "46875228",
    "title": "AliSQL: Alibaba's open-source MySQL with vector and DuckDB engines",
    "url": "https://github.com/alibaba/AliSQL",
    "summary": "AliSQL is Alibaba's open-source branch of MySQL, optimized for large-scale production environments. A key feature is its integration of the DuckDB storage engine, enabling users to perform lightweight analytical queries directly through standard SQL. Additionally, it natively supports high-dimensional vector storage and high-performance approximate nearest neighbor (ANN) search via an optimized HNSW algorithm, facilitating AI applications like semantic search.\n\nThe project, based on MySQL 8.0.44, is actively developed with a roadmap that includes planned optimizations for DDL operations, crash recovery (RTO), and replication performance. Building from source requires standard tools like CMake and a C++17 compiler.\n\nAliSQL is licensed under GPL-2.0 and welcomes community contributions through its GitHub repository. For support, users can refer to GitHub Issues or Alibaba Cloud's DuckDB-based analytical services.",
    "chinese_title": "AliSQL：阿里巴巴开源MySQL，集成向量与DuckDB引擎",
    "chinese_summary": "AliSQL是阿里巴巴开源的MySQL分支，专为大规模生产环境优化。其核心特性之一是集成了DuckDB存储引擎，允许用户通过标准SQL直接执行轻量级分析查询。此外，它原生支持高维向量存储，并通过优化的HNSW算法实现高性能近似最近邻（ANN）搜索，为语义搜索等AI应用提供支持。\n\n该项目基于MySQL 8.0.44版本持续开发，路线图中包含对DDL操作、故障恢复时间（RTO）及复制性能的优化计划。从源码构建需使用CMake等标准工具及C++17编译器。\n\nAliSQL采用GPL-2.0开源协议，并通过GitHub仓库欢迎社区贡献。用户可通过GitHub Issues或阿里云基于DuckDB的分析服务获取技术支持。"
  },
  {
    "id": "46871173",
    "title": "Agent Skills",
    "url": "https://agentskills.io/home",
    "summary": "**Summary: Agent Skills**\n\nAgent Skills are standardized, portable packages of instructions, scripts, and resources that enhance AI agents' capabilities. They address the common limitation where agents lack the specific context or procedural knowledge needed to perform real-world tasks reliably and accurately.\n\nThe core value of Skills lies in their reusability and interoperability. Authors can build a capability once and deploy it across multiple compatible agent products. For teams and enterprises, Skills provide a way to codify organizational knowledge and repeatable workflows into version-controlled packages. This enables agents to perform specialized domain tasks (like legal reviews), gain new capabilities (like creating presentations), and execute consistent, multi-step processes.\n\nThe Agent Skills format was developed by Anthropic and released as an open standard, encouraging broad ecosystem adoption and contribution. It is already supported by leading AI development tools. Resources for getting started include the full specification, integration guides for developers, and a library of example skills.",
    "chinese_title": "代理技能",
    "chinese_summary": "**摘要：智能体技能**\n\n智能体技能是标准化的、可移植的指令、脚本和资源包，用于增强AI智能体的能力。它们解决了智能体在可靠且准确地执行现实任务时，常因缺乏特定上下文或流程知识而受限的普遍问题。\n\n技能的核心价值在于其可复用性和互操作性。开发者可以一次性构建某项能力，并将其部署到多个兼容的智能体产品中。对于团队和企业而言，技能提供了一种将组织知识和可重复的工作流程封装成版本可控的软件包的方式。这使得智能体能够执行专业领域任务（如法律审查）、获得新能力（如创建演示文稿），以及执行一致的多步骤流程。\n\n智能体技能格式由Anthropic开发，并作为开放标准发布，以鼓励广泛的生态系统采用和贡献。目前，该格式已获得主流AI开发工具的支持。入门资源包括完整规范、开发者集成指南以及示例技能库。"
  },
  {
    "id": "46873138",
    "title": "Prek: A better, faster, drop-in pre-commit replacement, engineered in Rust",
    "url": "https://github.com/j178/prek",
    "summary": "**Summary**\n\nPrek is a Rust-based, drop-in replacement for the popular pre-commit framework, designed to be faster, more efficient, and dependency-free. It is fully compatible with existing pre-commit configurations while offering significant performance improvements and new features.\n\nKey advantages include:\n*   **Speed & Efficiency:** It runs multiple times faster than pre-commit, uses less disk space, and manages toolchains and hook installations in a shared, parallelized manner.\n*   **No Dependencies:** Prek is distributed as a single binary, eliminating the need for Python or other runtimes.\n*   **Enhanced Features:** It introduces built-in support for monorepos, integrates with `uv` for Python environments, offers improved toolchain management for several languages, and includes native Rust implementations of common hooks for better performance.\n*   **Better UX:** The tool provides a more intuitive command-line interface with features like running hooks on specific directories, selecting multiple hooks, and shell completions.\n\nPrek is already adopted by major projects like CPython, Apache Airflow, and FastAPI. It can be installed via various package managers (Homebrew, pip, npm, Cargo), a standalone installer, or directly from GitHub Releases.",
    "chinese_title": "Prek：一个更优、更快的即插即用预提交替代工具，采用Rust语言精心打造。",
    "chinese_summary": "**概述**\n\nPrek 是一款基于 Rust 的、可直接替代流行 pre-commit 框架的工具，旨在实现更快的速度、更高的效率且无需依赖。它完全兼容现有的 pre-commit 配置，同时提供显著的性能改进和新功能。\n\n主要优势包括：\n*   **速度与效率：** 运行速度比 pre-commit 快数倍，占用更少磁盘空间，并以共享、并行化的方式管理工具链和钩子安装。\n*   **无依赖：** Prek 以单一二进制文件分发，无需 Python 或其他运行时环境。\n*   **增强功能：** 内置对单体仓库的支持，与 `uv` 集成以管理 Python 环境，为多种语言提供改进的工具链管理，并包含常用钩子的原生 Rust 实现以获得更佳性能。\n*   **更好的用户体验：** 该工具提供更直观的命令行界面，支持在特定目录运行钩子、选择多个钩子以及 shell 自动补全等功能。\n\nPrek 已被 CPython、Apache Airflow 和 FastAPI 等主要项目采用。可通过多种包管理器（Homebrew、pip、npm、Cargo）、独立安装程序或直接从 GitHub Releases 安装。"
  },
  {
    "id": "46873294",
    "title": "France dumps Zoom and Teams as Europe seeks digital autonomy from the US",
    "url": "https://apnews.com/article/europe-digital-sovereignty-big-tech-9f5388b68a0648514cebc8d92f682060",
    "summary": "This article details Europe's growing push for \"digital sovereignty,\" a strategic effort to reduce reliance on U.S. Big Tech companies. The movement is driven by concerns over data privacy, fears of U.S. political coercion—highlighted by tensions over Greenland and the sanctioning of an ICC prosecutor—and a desire to foster European tech competitiveness.\n\nKey examples include France mandating its civil servants switch from Zoom and Microsoft Teams to a homegrown service by 2027, the Austrian military adopting open-source LibreOffice, and the German state of Schleswig-Holstein migrating thousands of employees to open-source email and file-sharing systems. European officials, like Commissioner Henna Virkkunen, warn that over-dependence on foreign tech can be \"weaponized.\"\n\nIn response, U.S. firms like Microsoft are promoting \"sovereign cloud\" services with data centers and staff based in Europe to assure data stays under EU law. However, the shift in Europe is marked by a change in motivation: while cost savings from open-source software were once primary, the core driver is now strategic autonomy and avoiding vendor lock-in.",
    "chinese_title": "法国弃用Zoom和Teams，欧洲寻求数字自主以摆脱美国影响",
    "chinese_summary": "本文详述了欧洲日益增强的\"数字主权\"推动力，这是一项旨在减少对美国大型科技公司依赖的战略举措。这一趋势源于对数据隐私的担忧、对美国政治胁迫的恐惧（格陵兰问题和对国际刑事法院检察官的制裁凸显了紧张关系），以及提升欧洲科技竞争力的愿望。\n\n关键案例包括：法国要求公务员在2027年前从Zoom和微软Teams转向本土服务，奥地利军方采用开源软件LibreOffice，德国石勒苏益格-荷尔斯泰因州将数千名员工迁移至开源电子邮件和文件共享系统。欧盟专员汉娜·维尔库宁等欧洲官员警告，过度依赖外国技术可能被\"武器化\"。\n\n对此，微软等美国公司正在推广\"主权云\"服务，通过将数据中心和员工设在欧洲来确保数据受欧盟法律管辖。然而，欧洲的转变动机已发生变化：虽然开源软件的成本节约曾是主要考量，但现在的核心驱动力是战略自主权和避免供应商锁定。"
  },
  {
    "id": "46868759",
    "title": "What's up with all those equals signs anyway?",
    "url": "https://lars.ingebrigtsen.no/2026/02/02/whats-up-with-all-those-equals-signs-anyway/",
    "summary": "This article explains the prevalence of equals signs (=) in old email excerpts circulating online. It attributes them to a common email encoding standard from the 1980s called \"quoted-printable,\" which was used to handle long lines and non-ASCII characters (like accented letters) for transmission.\n\nThe equals signs serve two main functions:\n1.  **Line Continuation:** An equals sign at the end of a line, followed by a carriage return and line feed (CRLF), signals that the line was artificially split and should be rejoined when decoded.\n2.  **Character Encoding:** An equals sign followed by two hexadecimal digits (e.g., =C2=A0) represents a special character, like a non-breaking space.\n\nThe author argues that the visible equals signs in the shared emails are the result of incompetent processing. The likely error was that someone converted the email's line endings from the standard CRLF to Unix-style (NL), which broke the decoding logic. A buggy decoder then failed to properly remove the continuation markers and also mishandled the encoded characters, leaving the raw equals signs visible in the text. In short, the signs are a technical artifact of flawed decoding, not a secret code or a scanning error.",
    "chinese_title": "那些等号到底是怎么回事？",
    "chinese_summary": "本文解释了为何网络上流传的旧邮件摘录中频繁出现等号（=）。这源于20世纪80年代一种常见的邮件编码标准——“可打印字符引用编码”（quoted-printable），该标准用于处理长行和非ASCII字符（如带重音符号的字母）以便传输。\n\n等号主要发挥两种功能：\n1.  **换行延续**：一行末尾的等号后接回车换行符（CRLF），表示该行被人工分割，解码时应重新拼接。\n2.  **字符编码**：等号后接两个十六进制数字（例如=C2=A0）代表特殊字符，如不换行空格。\n\n作者认为，这些共享邮件中可见的等号是处理不当的结果。可能的错误是有人将邮件的行尾从标准CRLF转换为Unix风格（NL），从而破坏了解码逻辑。一个有缺陷的解码器未能正确移除换行标记，同时也错误处理了编码字符，导致原始等号残留在文本中。简而言之，这些符号是解码缺陷的技术痕迹，并非密文或扫描错误。"
  },
  {
    "id": "46833534",
    "title": "Puget Systems Most Reliable Hardware of 2025",
    "url": "https://www.pugetsystems.com/labs/articles/puget-systems-most-reliable-hardware-of-2025/",
    "summary": "This article summarizes Puget Systems' internal reliability data for hardware used in their 2025 workstation builds. The data, based on their own RMA and testing records, highlights components with exceptionally low failure rates.\n\nKey findings include:\n*   **CPU:** Intel's Xeon W-2500/3500 series had zero failures, making them the most reliable workstation processors. For consumer CPUs, the Intel Core Ultra 7 265K and AMD's Ryzen 9000 X3D series were standouts.\n*   **GPU:** NVIDIA's GeForce RTX 50 Series Founders Edition cards were the most reliable consumer GPUs. For professional GPUs, NVIDIA's RTX Ada Generation and RTX PRO Blackwell (excluding the high-wattage 6000 model) both performed excellently.\n*   **Motherboard:** The Gigabyte B860M AORUS ELITE WIFI6E ICE and ASUS TUF B850M-PLUS WIFI had the lowest failure rates.\n*   **RAM:** Kingston was the most reliable manufacturer overall, with its ValueRAM DDR5-5600 32GB desktop module being particularly notable.\n*   **Storage:** The Samsung 870 QVO 8TB SATA SSD had zero failures in 2025, with the Kingston KC3000 M.2 SSD as a strong runner-up.\n*   **PSU:** The Corsair SF1000 Platinum SFX power supply had no reported failures, edging out the consistently reliable Super Flower LEADEX line.\n\nThe report notes that motherboard failure rates are generally highest due to their complexity, but most issues are caught during Puget Systems' internal testing.",
    "chinese_title": "Puget Systems 2025年度最可靠硬件",
    "chinese_summary": "本文汇总了Puget Systems公司2025年工作站配置硬件的内部可靠性数据。该数据基于其自身的RMA与测试记录，重点标注了故障率极低的组件。\n\n主要发现包括：\n*   **CPU：** 英特尔至强W-2500/3500系列实现零故障，成为最可靠的工作站处理器。消费级CPU中，英特尔酷睿Ultra 7 265K与AMD锐龙9000 X3D系列表现突出。\n*   **GPU：** 英伟达GeForce RTX 50系列公版显卡是最可靠的消费级GPU。专业级GPU中，英伟达RTX Ada架构与RTX PRO Blackwell系列（高功耗的6000型号除外）均表现优异。\n*   **主板：** 技嘉B860M AORUS ELITE WIFI6E ICE与华硕TUF B850M-PLUS WIFI故障率最低。\n*   **内存：** 金士顿是整体最可靠的制造商，其ValueRAM DDR5-5600 32GB台式机内存条尤为出色。\n*   **存储：** 三星870 QVO 8TB SATA固态硬盘在2025年实现零故障，金士顿KC3000 M.2固态硬盘紧随其后。\n*   **电源：** 海盗船SF1000铂金SFX电源无故障报告，略胜于长期稳定的振华LEADEX系列。\n\n报告指出，主板因结构复杂通常故障率最高，但多数问题已在Puget Systems内部测试阶段发现。"
  },
  {
    "id": "46870015",
    "title": "Bunny Database",
    "url": "https://bunny.net/blog/meet-bunny-database-the-sql-service-that-just-works/",
    "summary": "Bunny Database is a new managed SQL service in public preview that offers a \"third way\" between traditional VM-hosted databases and expensive DBaaS platforms. It is built on a fork of libSQL, making it SQLite-compatible, and is designed to be simple, affordable, and low-latency.\n\nKey features include one-click deployment, SDKs for multiple languages, and the ability to serve reads from 41 global regions to minimize latency for users worldwide. It offers three deployment types: automatic region selection, single-region, or custom multi-region.\n\nThe service uses a transparent, usage-based pricing model ($0.30 per billion reads, $0.30 per million writes, $0.10/GB/month for storage) without \"serverless tax,\" and spins down when idle to save costs. During the preview, it is free with limits of 50 databases and 1 GB each.\n\nUpcoming roadmap items include automatic backups, database file import/export, and auto-generated APIs. It integrates seamlessly with other Bunny.net services like Edge Scripting and Magic Containers.\n\nThe article positions Bunny Database as an ideal solution for developers who want a simple, globally performant database without the complexity and high cost of mainstream DBaaS offerings.",
    "chinese_title": "兔子数据库",
    "chinese_summary": "Bunny Database 是一款新推出的托管式 SQL 服务，目前处于公开预览阶段，它在传统虚拟机托管数据库和昂贵的 DBaaS 平台之间提供了“第三种选择”。该服务基于 libSQL 的分支构建，兼容 SQLite，旨在实现简单易用、经济实惠和低延迟。\n\n主要特性包括一键部署、多语言 SDK 支持，以及能够从全球 41 个区域提供读取服务，以降低全球用户的延迟。它提供三种部署类型：自动区域选择、单区域部署或自定义多区域部署。\n\n该服务采用透明、基于用量的定价模式（每十亿次读取 0.30 美元，每百万次写入 0.30 美元，存储每 GB 每月 0.10 美元），无“无服务器税”，并在空闲时自动缩减以节省成本。预览期间，服务免费提供，限制为 50 个数据库，每个数据库容量为 1 GB。\n\n即将推出的路线图功能包括自动备份、数据库文件导入/导出以及自动生成的 API。该服务可与 Bunny.net 的其他服务（如 Edge Scripting 和 Magic Containers）无缝集成。\n\n文章将 Bunny Database 定位为开发者的理想解决方案，尤其适合那些希望获得简单、全球高性能数据库，同时避免主流 DBaaS 产品复杂性和高成本的开发者。"
  },
  {
    "id": "46845650",
    "title": "Heritability of intrinsic human life span is about 50%",
    "url": "https://www.science.org/doi/10.1126/science.adz1187",
    "summary": "**Summary of \"Heritability of intrinsic human life span is about 50%\"**\n\nA study published in *Science* challenges the long-held belief that genetics plays a minor role in human lifespan. By analyzing an extensive dataset of over 400 million people from public family trees, researchers have determined that the **heritability of intrinsic lifespan is approximately 50%**.\n\nPrevious estimates, often based on twins or smaller family sets, suggested genetic factors accounted for only 15-30% of lifespan variation. This new, much larger analysis reveals a stronger genetic component by focusing on \"intrinsic\" lifespan—the risk of death from inherent factors, as opposed to shared environmental or behavioral influences like socioeconomic status or diet.\n\nThe key methodological advance was using relatives-in-law (e.g., spouses' siblings) as controls. Since these individuals share a family environment but not genetics with the subject's blood relatives, researchers could statistically separate genetic effects from shared environmental effects. This approach showed that assortative mating (people choosing partners with similar traits) had inflated earlier heritability estimates, as it increases genetic similarity within families beyond direct inheritance.\n\nThe findings imply that genetic influences on longevity are on par with those for major chronic diseases. This substantial heritability suggests there are many genetic variants yet to be discovered that affect the fundamental biological processes of aging. The research provides a robust foundation for future studies to identify these specific genetic factors and the mechanisms through which they influence lifespan.",
    "chinese_title": "人类内在寿命的遗传性约为50%",
    "chinese_summary": "**《人类内在寿命的遗传率约为50%》摘要**\n\n《科学》杂志发表的一项研究挑战了长期以来认为遗传对人类寿命影响较小的观点。通过分析来自公共家谱的超过4亿人的广泛数据集，研究人员确定**内在寿命的遗传率约为50%**。\n\n先前基于双胞胎或较小家庭样本的估计认为，遗传因素仅占寿命差异的15-30%。这项规模大得多的新研究通过关注“内在”寿命——即由内在因素导致的死亡风险，而非社会经济地位或饮食等共同环境或行为影响——揭示了更强的遗传成分。\n\n该方法的关键进展是使用姻亲（如配偶的兄弟姐妹）作为对照。由于这些人与研究对象的血亲共享家庭环境但无遗传关联，研究人员得以在统计上区分遗传效应与共同环境效应。这种方法表明，选择性婚配（人们选择具有相似特征的伴侣）夸大了早期的遗传率估计，因为它增加了家庭内部超越直接遗传的遗传相似性。\n\n研究结果意味着遗传对寿命的影响程度与对主要慢性疾病的影响相当。这种显著的遗传率表明，尚有许多影响衰老基本生物过程的遗传变异未被发现。该研究为未来识别这些特定遗传因素及其影响寿命的机制奠定了坚实基础。"
  },
  {
    "id": "46795961",
    "title": "The Everdeck: A Universal Card System (2019)",
    "url": "https://thewrongtools.wordpress.com/2019/10/10/the-everdeck/",
    "summary": "The Everdeck is a 120-card system designed to function as a universal tool for playing and prototyping a wide variety of card games. It maps to numerous existing systems, including two standard 52-card decks, Tarot, and Hanafuda, as well as games requiring specialized decks like Hanabi or The Mind.\n\nIts design is mathematically efficient, with eight suits (paired into four colors) and ranks from 0 to 9 plus five face cards. Each card features a unique animal picture, a name, a sequence number (0-119), and a point value (1-5 dots). These elements enable its versatility: colors and suits can be grouped differently, sequence numbers work for numbered-deck games, and letter frequencies and point values support word games.\n\nThe deck also has a thematic structure. The 30 black cards represent archetypes (22 align with Tarot's Major Arcana), while cards in the red, yellow, and blue suits offer interpretations of those archetypes through themes of soul, body, and mind, respectively.\n\nIn summary, the Everdeck is a compact, multi-purpose deck that combines combinatorial design with artistic themes to serve as a travel companion, proxy deck, and game design tool.",
    "chinese_title": "永恒牌组：通用卡牌系统（2019）",
    "chinese_summary": "永恒牌组是一个包含120张卡牌的系统，旨在作为通用工具，用于游玩和原型设计各种卡牌游戏。它可对应多种现有系统，包括两副标准52张扑克牌、塔罗牌和花札，以及需要特殊牌组的游戏如《花火》或《心灵感应》。\n\n其设计具有数学高效性，包含八种花色（配对为四种颜色）以及从0到9的等级加上五张人头牌。每张牌都有独特的动物图案、名称、序列号（0-119）和点值（1-5个点）。这些元素使其具备多功能性：颜色和花色可按不同方式分组，序列号适用于数字牌组游戏，字母频率和点值则支持文字游戏。\n\n该牌组还具有主题结构。30张黑色牌代表原型（其中22张与塔罗牌的大阿卡纳对应），而红、黄、蓝色牌组中的牌则分别通过灵魂、身体和心灵主题对这些原型进行诠释。\n\n总之，永恒牌组是一个紧凑的多功能牌组，结合了组合设计与艺术主题，可作为旅行伴侣、替代牌组和游戏设计工具。"
  },
  {
    "id": "46873782",
    "title": "Show HN: Octosphere, a tool to decentralise scientific publishing",
    "url": "https://octosphere.social/",
    "summary": "**Octosphere** is an experimental tool designed to decentralize scientific publishing by connecting academic research to the social web. It automatically syncs a researcher's publications from the **Octopus** platform to the **AT Protocol** (the \"atmosphere\")—the open, decentralized network that powers apps like Bluesky.\n\nThe core purpose is to bridge the gap between traditional academic publishing and public engagement. By sharing work on this decentralized network, researchers can increase the visibility of their findings, reach broader audiences beyond academia, and foster direct interaction with the public.\n\nThe process for researchers is straightforward:\n1.  Sign in using their **ORCID** identifier.\n2.  Connect their **Bluesky** (or other AT Protocol) account.\n3.  Link their **Octopus** author profile.\n4.  Choose to sync their publications either once or enable automatic syncing for future work.\n\nIn summary, Octosphere proposes a model where scientific communication becomes more open and social by leveraging decentralized web protocols to distribute research directly into public conversations.",
    "chinese_title": "展示 HN：Octosphere，一个去中心化科学出版的工具",
    "chinese_summary": "**Octosphere**是一款实验性工具，旨在通过将学术研究与社交网络连接起来，实现科学出版的去中心化。它能自动将研究者在**Octopus**平台上的出版物同步至**AT协议**（即“氛围层”）——这是一个开放、去中心化的网络，为Bluesky等应用提供支持。\n\n其核心目标是弥合传统学术出版与公众参与之间的鸿沟。通过在这一去中心化网络上分享研究成果，研究者可以提升其发现的可见度，触达学术界以外的更广泛受众，并促进与公众的直接互动。\n\n研究者的使用流程十分简便：\n1.  使用**ORCID**标识登录。\n2.  关联其**Bluesky**（或其他AT协议）账户。\n3.  链接其**Octopus**作者档案。\n4.  选择一次性同步其出版物，或为未来的成果启用自动同步。\n\n总之，Octosphere提出了一种新模式，通过利用去中心化网络协议将研究直接传播至公共对话中，使科学交流变得更加开放和社交化。"
  },
  {
    "id": "46874139",
    "title": "Sandboxing AI Agents in Linux",
    "url": "https://blog.senko.net/sandboxing-ai-agents-in-linux",
    "summary": "This article discusses using **bubblewrap** to sandbox AI coding agents like Claude Code on Linux, providing a lightweight alternative to Docker or remote machines. The author's goal is to create a sandbox that mimics their regular development environment while restricting the agent's access to only the current project.\n\nKey requirements for the sandbox include:\n*   Mimicking the local dev setup.\n*   Granting write access only to the current project directory.\n*   Allowing network access for AI services and local servers.\n*   Using bind mounts so files are accessible at the same paths inside and outside the sandbox.\n\nThe provided bubblewrap script exposes a minimal set of system directories (like `/bin`, `/usr`) as read-only, while making the project directory (`$PWD`) and necessary config/cache folders (like `~/.claude`) read-write. It also injects the Claude config file read-only to prevent modifications and changes the hostname for clarity.\n\nThe author acknowledges this isn't a hardened security solution but is sufficient for their risk tolerance, focusing on containment rather than preventing data exfiltration. They recommend customizing the script by first running a shell inside the sandbox or using `strace` to identify and bind any missing files the agent needs to function.",
    "chinese_title": "在Linux中沙箱化AI代理",
    "chinese_summary": "本文探讨了在Linux系统上使用**bubblewrap**对Claude Code等AI编程代理进行沙盒隔离，提供了一种轻量级的替代方案，以取代Docker或远程机器。作者的目标是创建一个沙盒环境，既能模拟常规开发环境，又能限制代理仅访问当前项目。\n\n沙盒的关键需求包括：\n*   模拟本地开发环境配置。\n*   仅授予当前项目目录的写入权限。\n*   允许访问网络以使用AI服务和本地服务器。\n*   使用绑定挂载，使文件在沙盒内外路径保持一致。\n\n提供的bubblewrap脚本将少量系统目录（如`/bin`、`/usr`）以只读方式暴露，同时将项目目录（`$PWD`）和必要的配置/缓存文件夹（如`~/.claude`）设置为可读写。脚本还将Claude配置文件以只读方式注入以防止修改，并更改主机名以提升清晰度。\n\n作者指出这并非强化安全方案，但符合其风险承受能力，重点在于隔离而非防止数据外泄。建议通过先在沙盒内运行shell或使用`strace`来识别并绑定代理运行所需的缺失文件，从而自定义脚本。"
  },
  {
    "id": "46872818",
    "title": "Show HN: C discrete event SIM w stackful coroutines runs 45x faster than SimPy",
    "url": "https://github.com/ambonvik/cimba",
    "summary": "Cimba is a high-performance, multithreaded discrete event simulation library written in C and assembly, using POSIX threads and stackful coroutines (\"fibers\") for simulated processes. It is designed for speed, achieving up to 45 times faster performance than SimPy in benchmarks, such as an M/M/1 queue model, and can process 20 million events per second on a single core.\n\nThe library offers a comprehensive toolkit for modeling systems like computer networks, manufacturing, and healthcare flows. It includes process interaction mechanisms (resources, buffers, queues), condition variables, high-quality random number generators, and integrated logging. Cimba emphasizes reliability through extensive use of assertions (13% of code lines) and unit tests, following Design by Contract principles.\n\nWritten in C11/C17 with hand-coded assembly for context switching, it avoids C++ due to compatibility and exception handling concerns with coroutines. The code is object-oriented in design, supporting encapsulation and polymorphism. Cimba is free, open-source, and supports Linux and Windows (x86-64), with plans for Apple Silicon and ARM. Installation requires a C compiler and Meson build system.",
    "chinese_title": "展示 HN：C语言离散事件模拟器，采用栈式协程，运行速度比SimPy快45倍",
    "chinese_summary": "Cimba是一款用C语言和汇编编写的高性能多线程离散事件模拟库，采用POSIX线程和栈式协程（“纤程”）实现模拟进程。该库专为速度优化设计，在M/M/1队列等基准测试中性能可达SimPy的45倍，单核每秒可处理2000万事件。\n\n该库提供完整的工具包，用于计算机网络、制造业和医疗流程等系统建模，包含进程交互机制（资源、缓冲区、队列）、条件变量、高质量随机数生成器和集成日志功能。Cimba通过大量断言（占代码行数13%）和单元测试确保可靠性，遵循契约式设计原则。\n\n基于C11/C17标准编写，并采用手写汇编实现上下文切换，为避免协程与C++的兼容性及异常处理问题而回避C++。代码采用面向对象设计，支持封装和多态。Cimba为免费开源软件，支持Linux和Windows（x86-64）平台，并计划适配Apple Silicon和ARM架构。安装需配备C编译器和Meson构建系统。"
  },
  {
    "id": "46873790",
    "title": "Defining Safe Hardware Design [pdf]",
    "url": "https://people.csail.mit.edu/rachit/files/pubs/safe-hdls.pdf",
    "summary": "This PDF appears to be a corrupted or encrypted file, as the majority of its content is comprised of non-human-readable binary data and garbled text. While the metadata indicates it is a LaTeX-generated academic article titled \"Defining Safe Hardware Design\" by Rachit Nigam, intended for the Association for Computing Machinery, the actual article content is not accessible.\n\nThe visible fragments suggest the document discusses topics related to hardware description languages (HDLs) and safety, but the core text is obscured. Therefore, it is not possible to provide a substantive summary of the article's main arguments, methodology, or conclusions. The file in its current state is unreadable.",
    "chinese_title": "定义安全硬件设计[pdf]",
    "chinese_summary": "这份PDF文件似乎已损坏或经过加密，其内容主要由无法人工读取的二进制数据和乱码文本构成。虽然元数据显示它是由Rachit Nigam撰写、通过LaTeX生成的学术文章，标题为《定义安全的硬件设计》，原计划提交给计算机协会，但实际的文章内容无法访问。\n\n可见的片段表明该文档涉及硬件描述语言（HDL）与安全性相关的话题，但核心文本已被遮蔽。因此，无法对文章的主要论点、研究方法或结论提供实质性摘要。该文件目前处于不可读状态。"
  },
  {
    "id": "46876047",
    "title": "China Moon Mission: Aiming for 2030 Lunar Landing",
    "url": "https://spectrum.ieee.org/china-moon-mission-mengzhou-artemis",
    "summary": "China is advancing its lunar ambitions, with its space agency targeting a crewed Moon landing by 2030. This timeline puts its program in direct, though unofficial, competition with NASA's Artemis program, which aims to return astronauts to the lunar surface by 2026.\n\nThe article highlights China's progress, noting the development of key hardware like the Mengzhou spacecraft and the Lanyue lunar lander, which was shown undergoing engine tests in 2025. This steady advancement creates pressure on NASA's own schedule.\n\nWhile framed as a \"rivalry/not-rivalry,\" the piece underscores the parallel efforts of the two nations in a new era of space exploration, where China has emerged as a leading and methodical contender in the race back to the Moon.",
    "chinese_title": "中国探月工程：力争2030年前实现登月",
    "chinese_summary": "中国正推进其月球探索计划，航天机构目标在2030年前实现载人登月。这一时间表使其项目与美国国家航空航天局的“阿尔忒弥斯”计划形成了直接（虽非官方）的竞争关系——后者旨在2026年前将宇航员送回月球表面。\n\n文章强调了中国取得的进展，指出梦舟载人飞船和揽月着陆器等关键硬件正在研发中，其中揽月着陆器已于2025年进行发动机测试。这种稳步推进给美国国家航空航天局的时间表带来了压力。\n\n尽管文章以“竞争/非竞争”的框架展开论述，实则凸显了两国在太空探索新时代中的并行努力。在这场重返月球的竞赛中，中国已成为一个领先且有条不紊的角逐者。"
  },
  {
    "id": "46873133",
    "title": "Tadpole – A modular and extensible DSL built for web scraping",
    "url": "https://tadpolehq.com/",
    "summary": "**Summary**\n\nTadpole is a domain-specific language (DSL) designed specifically for web scraping. Its core philosophy is to make scraping more accessible by abstracting away the complexity of browser interaction and enabling a declarative, modular coding style.\n\nThe key features highlighted are:\n*   **Modularity & Composability:** Scrapers are built by importing and reusing modules, which can be sourced from local files or remote repositories (like GitHub).\n*   **Declarative Syntax:** The language allows developers to describe *what* to scrape in a clear, structured way, rather than writing intricate procedural code to control a browser.\n*   **Ease of Use:** By handling browser automation internally, Tadpole aims to simplify the scraper-building process.\n\nA provided example demonstrates a real-world use case: searching for real estate listings on Redfin. The code shows a concise `main` script that imports a community Redfin module, navigates to a page, performs a search (using dynamic input), waits for content, and extracts addresses into a structured JSON output. The accompanying terminal command shows how to run the scraper with input parameters and save the results.",
    "chinese_title": "Tadpole – 专为网页抓取打造的模块化可扩展领域特定语言",
    "chinese_summary": "**摘要**\n\nTadpole 是一种专为网络抓取设计的领域特定语言（DSL）。其核心理念是通过抽象化浏览器交互的复杂性，并支持声明式、模块化的编码风格，使抓取操作更易于上手。\n\n其强调的关键特性包括：\n*   **模块化与可组合性：** 抓取器通过导入和重用模块构建，这些模块可来自本地文件或远程仓库（如 GitHub）。\n*   **声明式语法：** 该语言允许开发者以清晰、结构化的方式描述*要抓取什么*，而不是编写复杂的流程式代码来控制浏览器。\n*   **易用性：** 通过在内部处理浏览器自动化，Tadpole 旨在简化抓取器的构建过程。\n\n一个提供的示例演示了一个实际用例：在 Redfin 上搜索房地产列表。代码展示了一个简洁的 `main` 脚本，它导入了一个社区 Redfin 模块，导航到页面，执行搜索（使用动态输入），等待内容加载，并将地址提取为结构化的 JSON 输出。随附的终端命令展示了如何使用输入参数运行抓取器并保存结果。"
  },
  {
    "id": "46848653",
    "title": "Another London: Excavating the disenchanted city",
    "url": "https://harpers.org/archive/2026/02/another-london-situationists-hari-kunzru/",
    "summary": "This essay by Hari Kunzru explores London as a \"disenchanted\" city, tracing a lineage of alternative visionaries—from mythical founders like King Brutus to 20th-century avant-garde groups like the Situationist International. The Situationists critiqued modern consumer society as a \"Spectacle\" that pacifies citizens, and they used practices like the *dérive* (aimless urban drifting) to uncover the city's hidden psychic atmospheres.\n\nKunzru reflects on how this countercultural spirit fused with London's underground mysticism in the punk era, as seen in figures like Jamie Reid and films like Derek Jarman's *Jubilee*. He recalls his own youth in a London where psychogeography felt alive, but now feels this \"visionary city\" is threatened by digital saturation, surveillance, and homogenization.\n\nReturning to London after years away, he begins a personal ritual at the British Museum, contemplating John Dee's obsidian scrying mirror—a symbol of lost enchantment. He then embarks on a *dérive*-like walk toward Greenwich, aiming to reconnect with the layered, hidden city that exists beneath the official map, questioning whether it's still possible to find such cracks in the era of GPS and social media.",
    "chinese_title": "另一个伦敦：挖掘这座失魅之城",
    "chinese_summary": "哈里·昆兹鲁的这篇散文将伦敦描绘为一座“祛魅”之城，追溯了从布鲁图斯王这类神话奠基者到情境主义国际等二十世纪先锋派团体的另类梦想家谱系。情境主义者批判现代消费社会是一种麻痹民众的“景观”，他们运用“漂移”（无目的的城市漫游）等方法，试图揭示城市隐秘的精神氛围。\n\n昆兹鲁反思了这种反文化精神如何在朋克时代与伦敦的地下神秘主义相融合，正如杰米·里德等人物或德里克·贾曼的电影《庆典》所展现的那样。他回忆起自己青年时期的伦敦，那时心理地理学仍充满生机，而如今这座“幻视之城”却受到数字渗透、监控文化和同质化的威胁。\n\n阔别多年重返伦敦后，他在大英博物馆开启了一项个人仪式：凝视约翰·迪伊的黑曜石占卜镜——那枚象征着失落魔力的器物。随后他踏上一条通往格林威治的“漂移”之路，试图重新连接官方地图之下那个层层叠叠的隐秘伦敦，并叩问在GPS与社交媒体时代，是否仍有可能寻得这样的现实裂隙。"
  },
  {
    "id": "46866544",
    "title": "Floppinux – An Embedded Linux on a Single Floppy, 2025 Edition",
    "url": "https://krzysztofjankowski.com/floppinux/floppinux-2025.html",
    "summary": "**Summary of \"Floppinux – An Embedded Linux on a Single Floppy, 2025 Edition\"**\n\nFloppinux is a minimalist, functional Linux distribution designed to fit entirely on a single 1.44MB floppy disk. The 2025 edition, an update to a 2014 project, demonstrates modern techniques to create an extremely compact embedded system.\n\nThe core system is built around Linux kernel 6.6.30 and BusyBox 1.36.1. To achieve the tight size constraint, the author employs intensive compression (using XZ), a highly tailored kernel configuration stripping out non-essential drivers and features, and a minimal initramfs as the root filesystem. Key components include the `sln` static linker (for basic recovery) and `strace` for debugging.\n\nDespite its size, Floppinux boots to a functional shell with networking support (via `udhcpc` and `telnet`), making it usable for basic tasks and as a diagnostic or rescue tool for old hardware. The article details the technical challenges and solutions, such as managing memory limits, selecting essential drivers, and the build process using a custom script.\n\nThe project is presented primarily as a technical exercise and a demonstration of optimization, showing that a usable Linux system with networking can still reside in the iconic storage limit of a floppy disk. The author provides the build script and configuration files for those interested in the specifics.",
    "chinese_title": "Floppinux – 单软盘嵌入式Linux，2025年版",
    "chinese_summary": "**《Floppinux——单张软盘上的嵌入式Linux，2025年版》概述**\n\nFloppinux是一款极简但功能完整的Linux发行版，其设计目标是完全容纳于一张1.44MB软盘中。2025年版是对2014年项目的更新，展示了构建极度精简嵌入式系统的现代技术。\n\n该系统的核心基于Linux内核6.6.30和BusyBox 1.36.1构建。为满足严格的尺寸限制，作者采用了高强度压缩（使用XZ）、高度定制化的内核配置（移除非必要驱动和功能）以及一个作为根文件系统的最小化initramfs。关键组件包括用于基本恢复的静态链接器`sln`和用于调试的`strace`。\n\n尽管体积微小，Floppinux可启动至一个支持网络（通过`udhcpc`和`telnet`）的功能性Shell，使其能用于基本任务，并可作为旧硬件的诊断或救援工具。文章详述了技术挑战与解决方案，例如内存限制管理、必要驱动的选择，以及使用自定义脚本的构建过程。\n\n该项目主要作为一个技术实践和优化演示，表明一个具备网络功能的可用Linux系统仍可存在于标志性的软盘存储限制内。作者为感兴趣者提供了构建脚本和配置文件。"
  },
  {
    "id": "46875033",
    "title": "Y Combinator will let founders receive funds in stablecoins",
    "url": "https://fortune.com/2026/02/03/famed-startup-incubator-y-combinator-to-let-founders-receive-funds-in-stablecoins/",
    "summary": "Y Combinator, the prominent Silicon Valley startup incubator, announced it will allow founders in its spring cohort to receive their standard funding (typically $500,000) in the USDC stablecoin. This marks a significant move by a mainstream, traditional tech investor into digital currency.\n\nFounders can opt to receive USDC on blockchains like Ethereum or Solana, and Y Combinator may expand to other stablecoins based on demand. The initiative aligns with the incubator's strategic focus on stablecoins as a key area for future startup innovation.\n\nWhile crypto-native venture capital firms have long offered this option, Y Combinator's visiting partner, Nemil Dalal, noted that legacy VCs have not, positioning YC as a pioneer in this shift. The move reflects a broader trend of stablecoins gaining traction beyond crypto trading, with major corporations like Stripe, Cloudflare, and Klarna recently launching or acquiring stablecoin-related projects.\n\nDalal emphasized that the growing institutional excitement around stablecoins for faster, cheaper transactions is \"agnostic\" of the volatile prices of cryptocurrencies like Bitcoin. He expressed optimism for a future where more startups raise capital on-chain, signaling Y Combinator's commitment to integrating this technology into its core operations.",
    "chinese_title": "Y Combinator将允许创始人以稳定币形式接收资金",
    "chinese_summary": "硅谷知名创业孵化器Y Combinator宣布，将允许其春季批次的创始人以USDC稳定币形式接收标准投资（通常为50万美元）。这标志着主流传统科技投资者向数字货币领域迈出了重要一步。\n\n创始人可选择在以太坊或Solana等区块链上接收USDC，Y Combinator未来还可能根据需求扩展至其他稳定币。该举措符合该孵化器将稳定币视为未来创业创新关键领域的战略重点。\n\n尽管加密原生风投机构长期提供此类选项，但Y Combinator的访问合伙人Nemil Dalal指出，传统风投尚未跟进，这使得YC成为这一转型的先行者。此举反映了稳定币在加密货币交易之外获得更广泛认可的趋势，Stripe、Cloudflare和Klarna等大型企业近期也纷纷推出或收购了稳定币相关项目。\n\nDalal强调，机构对稳定币能实现更快速、低成本交易的日益高涨的热情，与比特币等加密货币的价格波动\"无关\"。他对更多初创企业通过链上融资的未来表示乐观，这标志着Y Combinator致力于将这项技术融入其核心运营。"
  },
  {
    "id": "46869901",
    "title": "Emerge Career (YC S22) is hiring a product designer",
    "url": "https://www.ycombinator.com/companies/emerge-career/jobs/omqT34S-founding-product-designer",
    "summary": "Emerge Career (YC S22) is hiring a Founding Product Designer in New York. The company builds a tech platform to train and place justice-impacted individuals into careers, aiming to replace fragmented workforce development systems. They report strong outcomes, including an 89% graduation rate and an average first-year salary of $77,352 for graduates.\n\nThe role is a hybrid product design and engineering position, requiring someone to build directly in React/TypeScript and use tools like Figma. The designer will be deeply involved with users—conducting weekly research and building relationships with students—to understand and solve engagement challenges. The core responsibility is designing experiences that motivate students to complete their training.\n\nThe ideal candidate is a hands-on builder who prototypes and ships quickly, thinks in terms of user outcomes over design deliverables, and operates with high empathy and low ego. The position requires a strong work ethic and a mission-driven commitment to providing second chances.\n\nThe compensation range is $120K-$200K plus 0.25%-1.00% equity. The interview process includes introductory chats, a technical screen, a paid work trial, and reference checks.",
    "chinese_title": "Emerge Career（YC S22）正在招聘产品设计师",
    "chinese_summary": "Emerge Career（YC S22）正在纽约招聘创始产品设计师。该公司构建了一个技术平台，用于培训受司法影响的人员并将其安置到职业中，旨在取代零散的劳动力发展系统。他们报告了显著的成果，包括89%的毕业率，毕业生首年平均薪资达77,352美元。\n\n该职位是产品设计与工程的混合角色，要求候选人能直接使用React/TypeScript进行开发，并运用Figma等工具。设计师需深度参与用户研究——每周进行调研并与学生建立联系——以理解和解决参与度挑战。核心职责是设计能够激励学生完成培训的体验。\n\n理想候选人应具备动手实践能力，能快速原型设计和交付产品，关注用户成果而非设计产出，并具备高同理心和低自我意识。该职位要求强烈的职业道德以及对提供第二次机会的使命驱动承诺。\n\n薪酬范围为12万至20万美元，另加0.25%-1.00%的股权。面试流程包括初步沟通、技术筛选、带薪工作试用和背景调查。"
  },
  {
    "id": "46872894",
    "title": "X offices raided in France",
    "url": "https://apnews.com/article/france-x-investigation-seach-elon-musk-1116be84d84201011219086ecfd4e0bc",
    "summary": "French authorities raided the offices of social media platform X (formerly Twitter) as part of an investigation into allegations of spreading child sexual abuse images and deepfakes. Prosecutors have also summoned owner Elon Musk and former CEO Linda Yaccarino for questioning.\n\nThe investigation, opened in January 2023, is examining potential crimes including the dissemination of child sexual abuse material, sexually explicit deepfakes, Holocaust denial, and manipulation of automated data systems. It expanded after Musk's AI chatbot, Grok, generated content denying the Holocaust—a crime in France—and produced nonconsensual sexualized deepfake images.\n\nSeparately, British data and media regulators have opened formal investigations into X and Musk's AI company, xAI, focusing on whether they complied with data protection laws when developing Grok and if adequate safeguards were in place to prevent the generation of harmful manipulated images.\n\nThe European Union is also scrutinizing X, having previously fined the platform for violations of its digital regulations. The raids and investigations highlight intensifying legal pressure on X and Musk's affiliated companies over content moderation and data privacy issues in multiple jurisdictions.",
    "chinese_title": "法国X办公室遭突袭搜查",
    "chinese_summary": "法国当局突袭了社交媒体平台X（前身为推特）的办公室，作为对涉嫌传播儿童性虐待图像和深度伪造内容调查的一部分。检察官还传唤了所有者埃隆·马斯克和前首席执行官琳达·亚卡里诺进行讯问。\n\n这项于2023年1月启动的调查正在审查潜在犯罪行为，包括传播儿童性虐待材料、色情深度伪造内容、否认大屠杀以及操纵自动化数据系统。调查在马斯克的人工智能聊天机器人Grok生成否认大屠杀（在法国属犯罪行为）的内容并制作未经同意的性化深度伪造图像后进一步扩大。\n\n此外，英国数据和媒体监管机构已对X及马斯克的人工智能公司xAI展开正式调查，重点关注它们在开发Grok时是否遵守了数据保护法，以及是否采取了足够的防护措施以防止生成有害的篡改图像。\n\n欧盟也在审查X，此前已因违反其数字法规对该平台处以罚款。这些突袭和调查凸显了在多个司法管辖区，针对X及马斯克关联公司在内容审核和数据隐私问题上的法律压力正不断加剧。"
  },
  {
    "id": "46873885",
    "title": "Migrate Wizard – IMAP Based Email Migration Tool",
    "url": "https://migratewizard.com/#features",
    "summary": "**Migrate Wizard** is an IMAP-based email migration tool designed for businesses to transfer emails between providers quickly and securely. Its core promise is to move gigabytes of data in minutes with 100% data integrity and zero downtime, requiring no technical expertise.\n\nKey features highlighted include:\n*   **Speed & Reliability:** Uses optimized algorithms and parallel processing for fast migrations.\n*   **Security:** Encrypts user credentials in memory only, deleting them post-migration, with no permanent storage.\n*   **Data Integrity:** Advanced error handling ensures every email, folder, and attachment is perfectly transferred.\n*   **Non-disruptive:** Allows continued email use during migration.\n*   **Incremental Sync:** Offers ongoing synchronization after the initial transfer.\n\nThe tool is presented as suitable for various scenarios: switching providers (like Gmail or Outlook), consolidating multiple accounts into one, and creating compliant email backups.\n\nThe service emphasizes its enterprise-grade trust, citing statistics like 10,000+ successful migrations and a 99.9% success rate. It offers a free trial with no credit card required and 24/7 support.",
    "chinese_title": "迁移向导——基于IMAP的电子邮件迁移工具",
    "chinese_summary": "**迁移向导**是一款基于IMAP协议的电子邮件迁移工具，专为企业设计，可快速安全地在不同服务商之间转移邮件。其核心承诺是：无需技术专长，即可在数分钟内迁移千兆字节数据，确保100%数据完整性且实现零停机。\n\n主要功能亮点包括：\n*   **速度与可靠性：** 采用优化算法和并行处理，实现快速迁移。\n*   **安全性：** 用户凭据仅在内存中加密，迁移完成后即被删除，不作永久存储。\n*   **数据完整性：** 先进的错误处理机制确保每封邮件、文件夹及附件都能完美转移。\n*   **无中断操作：** 迁移期间可继续正常使用电子邮件。\n*   **增量同步：** 初始迁移后提供持续的同步功能。\n\n该工具适用于多种场景：切换服务商（如Gmail或Outlook）、将多个账户合并为一个，以及创建合规的电子邮件备份。\n\n服务强调其企业级可信度，引用了超过10,000次成功迁移和99.9%成功率等数据。提供无需信用卡的免费试用，并配备24/7全天候支持。"
  },
  {
    "id": "46871387",
    "title": "Show HN: Sandboxing untrusted code using WebAssembly",
    "url": "https://github.com/mavdol/capsule",
    "summary": "Capsule is a secure runtime for AI agents that executes tasks in isolated WebAssembly sandboxes. It supports Python and TypeScript/JavaScript, allowing developers to annotate functions with resource limits (CPU, memory, timeout) and automatic retry policies. Each task runs in its own sandbox, preventing failures from affecting the host system or other tasks.\n\nKey features include configurable compute levels (LOW, MEDIUM, HIGH) via WebAssembly fuel metering, controlled file access through allowed directories, and environment variable support. Tasks return structured JSON responses with execution metadata. Capsule also provides a custom HTTP client for Python (since standard networking isn’t Wasm-compatible), while TypeScript can use standard fetch.\n\nThe project includes a CLI, SDKs, and optional project configuration via a capsule.toml file. It is built on open-source tools like componentize-py, jco, and wasmtime. Capsule is designed for long-running, scalable AI workflows where safety and isolation are critical.",
    "chinese_title": "展示HN：使用WebAssembly沙箱化不受信任的代码",
    "chinese_summary": "Capsule是一个安全的AI代理运行时环境，在隔离的WebAssembly沙箱中执行任务。它支持Python和TypeScript/JavaScript，允许开发者通过资源限制（CPU、内存、超时）和自动重试策略来标注函数。每个任务在独立的沙箱中运行，防止故障影响主机系统或其他任务。\n\n核心功能包括：通过WebAssembly燃料计量实现可配置计算级别（低、中、高）、通过允许目录控制文件访问、以及环境变量支持。任务返回带有执行元数据的结构化JSON响应。Capsule还为Python提供定制HTTP客户端（因为标准网络功能不兼容Wasm），而TypeScript可使用标准fetch。\n\n该项目包含CLI工具、SDK以及通过capsule.toml文件实现的可选项目配置。它基于componentize-py、jco和wasmtime等开源工具构建。Capsule专为需要高度安全隔离的长期运行、可扩展AI工作流而设计。"
  },
  {
    "id": "46873742",
    "title": "Show HN: I built \"AI Wattpad\" to eval LLMs on fiction",
    "url": "https://narrator.sh/llm-leaderboard",
    "summary": "This article introduces \"AI Wattpad,\" a platform designed to evaluate large language models (LLMs) on their ability to write engaging fiction. The core premise is to move beyond synthetic benchmarks and instead use real reader data to determine which AI models are best for creative writing.\n\nThe platform's architecture breaks down the creative process into three specialized roles, each handled by a different AI model:\n*   **Brainstorming Model:** Generates concepts, plots, and world-building.\n*   **Writer Model:** Produces the actual chapters and narrative content.\n*   **Memory Model:** Maintains story context and recalls information.\n\nThis structure allows for granular comparison, showing which models excel at specific creative tasks. The article promotes a set of leaderboards (Daily, Weekly, Monthly, All Time) where models are ranked based on their performance, and invites the community to suggest new models for evaluation via Discord.",
    "chinese_title": "展示HN：我打造了“AI版Wattpad”来评估LLM在小说创作上的表现",
    "chinese_summary": "本文介绍了“AI Wattpad”平台，该平台旨在评估大型语言模型（LLMs）创作引人入胜小说的能力。其核心理念是超越合成基准测试，转而利用真实读者数据来判断哪些AI模型最适合创意写作。\n\n该平台的架构将创作过程分解为三个专业角色，每个角色由不同的AI模型负责：\n*   **构思模型：** 负责生成概念、情节和世界观构建。\n*   **写作模型：** 负责产出实际的章节和叙事内容。\n*   **记忆模型：** 负责维护故事上下文并回忆信息。\n\n这种结构允许进行细致的比较，以展示哪些模型在特定的创意任务上表现更优。文章推广了一系列排行榜（每日、每周、每月、总榜），根据模型的表现进行排名，并邀请社区通过Discord推荐新的模型进行评估。"
  },
  {
    "id": "46873308",
    "title": "Show HN: PII-Shield – Log Sanitization Sidecar with JSON Integrity (Go, Entropy)",
    "url": "https://github.com/aragossa/pii-shield",
    "summary": "**PII-Shield** is a zero-code, high-performance log sanitization sidecar for Kubernetes designed to prevent sensitive data leaks (e.g., for GDPR/SOC2 compliance). It redacts personally identifiable information (PII) and secrets directly within the pod before logs are sent to aggregators.\n\nKey features include:\n*   **Context-aware entropy analysis** to detect high-entropy secrets even without predefined keys.\n*   **Deterministic hashing** that replaces sensitive data with unique tokens (e.g., `[HIDDEN:a1b2c]`), allowing error correlation without exposing raw data.\n*   **High performance**, being written in Go for low-latency processing.\n*   **Drop-in deployment** requiring no application code changes and working with any programming language.\n\nIt is deployed as a sidecar container, where application logs are piped through the PII-Shield binary. The tool is verified through unit tests, fuzzing, and stress tests to ensure 100% detection accuracy and crash safety. It is available as a Docker image and distributed under the Apache 2.0 license.",
    "chinese_title": "Show HN: PII-Shield – 具备JSON完整性的日志脱敏边车（Go语言，熵检测）",
    "chinese_summary": "**PII-Shield** 是一款专为 Kubernetes 设计的零代码、高性能日志脱敏边车工具，旨在防止敏感数据泄露（例如满足 GDPR/SOC2 合规要求）。它会在日志发送至聚合器之前，直接在 Pod 内对个人身份信息（PII）和机密数据进行脱敏处理。\n\n主要功能包括：\n*   **上下文感知的熵值分析**：即使没有预定义密钥，也能检测高熵值的机密信息。\n*   **确定性哈希替换**：将敏感数据替换为唯一令牌（例如 `[HIDDEN:a1b2c]`），既可在不暴露原始数据的情况下关联错误，又保持可追溯性。\n*   **高性能**：采用 Go 语言编写，实现低延迟处理。\n*   **即插即用部署**：无需修改应用代码，支持任何编程语言。\n\n它以边车容器形式部署，应用日志通过 PII-Shield 二进制程序进行管道处理。该工具经过单元测试、模糊测试和压力测试验证，确保 100% 的检测准确性和运行稳定性。它提供 Docker 镜像，并基于 Apache 2.0 许可证分发。"
  },
  {
    "id": "46868479",
    "title": "Show HN: Safe-now.live – Ultra-light emergency info site (<10KB)",
    "url": "https://safe-now.live",
    "summary": "This is a summary of the ultra-lightweight emergency information website **safe-now.live**.\n\nThe site provides a real-time dashboard of **active disaster declarations** (primarily severe winter storms in the US at the time of posting) and **local public safety alerts** via systems like IPAWS.\n\nIts core purpose is to be a centralized, fast-loading reference for emergency preparedness and response. Key sections include:\n\n*   **Quick Reference Guides:** Immediate action steps for common disasters like earthquakes, tornadoes, floods, fires, and active threats.\n*   **Emergency Kit Checklist:** A comprehensive list of essential supplies across categories like water, food, medical, tools, documents, and sanitation.\n*   **Home Preparedness Advice:** Guidance on creating plans, securing homes, and preparing for power outages, including considerations for pets and children.\n*   **Financial & Recovery Resources:** Links to official aid programs (FEMA, SBA, Canadian relief) and critical post-disaster steps for safety, documentation, and avoiding scams.\n*   **Essential Contacts:** Compiled hotlines for emergency shelters, crisis support (988), domestic violence, and local aid (211).\n\nThe site emphasizes practical, actionable information sourced from official agencies (Ready.gov, GetPrepared.gc.ca) and is designed to function reliably with minimal bandwidth.",
    "chinese_title": "Show HN: Safe-now.live – 超轻量应急信息网站（<10KB）",
    "chinese_summary": "这是超轻量级应急信息网站 **safe-now.live** 的简介。\n\n该网站通过 **实时仪表盘** 展示**当前灾害公告**（发布时主要为美国严重冬季风暴）以及通过IPAWS等系统发布的**本地公共安全警报**。\n\n其核心目标是成为应急准备与响应的集中式快速加载参考平台。主要板块包括：\n\n*   **快速参考指南：** 针对地震、龙卷风、洪水、火灾和现时威胁等常见灾害的即时行动步骤。\n*   **应急包清单：** 涵盖水、食物、医疗、工具、文件、卫生等类别的全面必需品列表。\n*   **家庭备灾建议：** 关于制定计划、加固房屋、应对停电的指导，包括对宠物和儿童的考虑。\n*   **财务与恢复资源：** 官方援助计划（FEMA、SBA、加拿大救援）的链接，以及灾后确保安全、文件记录和防范诈骗的关键步骤。\n*   **重要联系方式：** 汇总应急避难所、危机支持（988）、家庭暴力和本地援助（211）的热线电话。\n\n该网站强调来自官方机构（Ready.gov、GetPrepared.gc.ca）的实用、可操作信息，并设计为在最低带宽下也能可靠运行。"
  },
  {
    "id": "46876455",
    "title": "How Vibe Coding Is Killing Open Source",
    "url": "https://hackaday.com/2026/02/02/how-vibe-coding-is-killing-open-source/",
    "summary": "This article discusses a pre-print paper warning that \"vibe coding\"—using LLM chatbots to generate code—risks harming the Open Source (OSS) ecosystem.\n\nThe core concern is that developers become passive \"clients,\" disengaging from projects. This reduces vital user interactions like bug reports, forum participation, and visits to project websites, undermining sponsorship and community support. The LLM's reliance on its training data also centralizes dependency choices around the most popular libraries, making it harder for new projects to gain traction.\n\nThe article notes these effects are already visible in declining forum usage (e.g., Stack Overflow) and are expected to hit ecosystems like JavaScript and Python first. It cites studies showing such tools can increase bug rates and reduce productivity, potentially degrading developers' skills.\n\nWhile the paper's authors suggest tech companies could compensate OSS projects (similar to streaming services), the article is skeptical. It draws a parallel to Spotify, where most artists earn little, predicting only the most common dependencies in training data would benefit.\n\nIn conclusion, the article frames AI-assisted coding as a potential stress test for OSS, possibly choking its vitality by eroding the human engagement and organic discovery processes that sustain it.",
    "chinese_title": "Vibe Coding如何扼杀开源精神",
    "chinese_summary": "本文讨论了一篇预印本论文，该论文警告称，“氛围编程”——即使用大型语言模型聊天机器人生成代码——可能危害开源生态系统。\n\n核心担忧在于开发者会变成被动的“客户”，从而疏离项目。这会减少关键的用户互动，如错误报告、论坛参与和项目网站访问，进而削弱赞助和社区支持。大型语言模型对其训练数据的依赖还会使依赖选择集中围绕最流行的库，导致新项目更难获得关注。\n\n文章指出，这些影响已在论坛使用量下降（如Stack Overflow）中显现，预计将首先冲击JavaScript和Python等生态系统。文中引用的研究表明，此类工具可能增加错误率并降低生产力，甚至可能削弱开发者的技能。\n\n尽管论文作者建议科技公司可以补偿开源项目（类似流媒体服务模式），但本文持怀疑态度。文章以Spotify为例进行类比——该平台上大多数艺术家收入微薄，并预测只有训练数据中最常见的依赖项才能获益。\n\n总之，文章将AI辅助编程视为对开源生态的潜在压力测试，它可能通过侵蚀维持生态系统的人类参与和有机发现过程，扼杀其生命力。"
  },
  {
    "id": "46865275",
    "title": "Banning lead in gas worked. The proof is in our hair",
    "url": "https://attheu.utah.edu/health-medicine/banning-lead-in-gas-worked-the-proof-is-in-our-hair/",
    "summary": "A study published in PNAS by University of Utah researchers used archived human hair to document a dramatic 100-fold decrease in lead exposure in Americans since the early 20th century. The analysis of hair samples from 48 Utahns, some dating back to 1916, showed lead concentrations fell from as high as 100 parts per million (ppm) to less than 1 ppm by 2024.\n\nThis steep decline is directly linked to environmental regulations, primarily the establishment of the EPA in 1970 and the subsequent phase-out of leaded gasoline, paint, and pipes. The research highlights that before these regulations, activities like smelting and the use of leaded gasoline released enormous amounts of the neurotoxin into the local environment.\n\nThe study underscores the public health success of these regulations while noting contemporary efforts to weaken such rules. The unique ability to conduct this historical analysis relied on Utahns' preservation of family history, including hair in scrapbooks, providing a long-term record of environmental exposure that blood samples could not.",
    "chinese_title": "禁止汽油中的铅含量已见成效，证据就在我们的头发里。",
    "chinese_summary": "犹他大学研究人员在《美国国家科学院院刊》发表的一项研究，利用存档的人类头发样本记录到自20世纪初以来美国人铅暴露量急剧下降100倍。对48位犹他州居民（部分样本可追溯至1916年）的头发分析显示，铅浓度从高达百万分之100（ppm）降至2024年的不足1ppm。\n\n这种急剧下降与环境法规直接相关，主要是1970年环保署的成立及随后含铅汽油、油漆和管道的逐步淘汰。研究指出，在这些法规出台前，冶炼活动和含铅汽油的使用曾向当地环境释放大量神经毒素。\n\n该研究在强调这些法规取得公共卫生成就的同时，也注意到当前削弱此类规则的努力。这项历史性分析的独特可行性得益于犹他州居民对家族史的保存——包括剪贴簿中的头发样本，提供了血液样本无法实现的环境暴露长期记录。"
  }
]