[
  {
    "id": "46781530",
    "title": "430k-year-old well-preserved wooden tools are the oldest ever found",
    "url": "https://www.nytimes.com/2026/01/26/science/archaeology-neanderthals-tools.html",
    "summary": "**Summary of \"430,000-year-old well-preserved wooden tools are the oldest ever found\"**\n\nArchaeologists have discovered the oldest known wooden tools, dating back approximately 430,000 years, at a site in northern Spain. This find dramatically pushes back the record of preserved wooden technology, which rarely survives from such ancient periods.\n\nThe artifacts, including a pointed digging stick and a possible blunted tool, were found waterlogged in peat at the Neanderthal site of La Cueva de los Torrejones. Their exceptional preservation is attributed to the unique, oxygen-poor conditions of the peat bog.\n\nAnalysis indicates the tools were made from boxwood, a dense hardwood, and show clear evidence of sophisticated craftsmanship. The wood was carefully shaped using techniques like scraping and carving with stone tools, then likely fire-hardened to create a durable point.\n\nThis discovery is significant for several reasons:\n*   It proves that early humans, likely pre-Neanderthals or early Neanderthals, were skilled in working wood—a perishable material largely absent from the archaeological record of this era.\n*   It suggests their technological repertoire and cognitive abilities were more advanced than previously understood from stone tools alone.\n*   The pointed stick’s design implies it was used for digging, possibly for extracting tubers, insects, or even for defense, offering direct insight into their daily subsistence activities.\n\nThe find challenges the traditional \"Stone Age\" label, highlighting that it was likely a \"Wood Age\" as well, with organic materials playing a central role in early human technology that has mostly decayed over time.",
    "chinese_title": "43万年前保存完好的木制工具是迄今发现的最古老文物。",
    "chinese_summary": "**《发现43万年前保存完好的木制工具，刷新最古老记录》摘要**\n\n考古学家在西班牙北部一处遗址发现了已知最古老的木制工具，其年代可追溯至约43万年前。这一发现极大地刷新了保存下来的木制技术的记录，此类文物极少能从如此久远的年代留存至今。\n\n这些文物包括一根尖头挖掘棒和一件可能被磨钝的工具，发现于尼安德特人遗址拉奎瓦德洛斯托雷洪内斯一处浸水的泥炭层中。其异常完好的保存状态归功于泥炭沼泽独特、缺氧的环境条件。\n\n分析表明，这些工具由黄杨木（一种致密的硬木）制成，并显示出复杂工艺的清晰证据。木材经过精心塑形，使用了诸如用石器刮削和雕刻等技术，随后可能还经过火烤硬化以制成耐用的尖端。\n\n这一发现具有重要意义，原因如下：\n*   它证明早期人类（可能是前尼安德特人或早期尼安德特人）已熟练掌握加工木材的技能——而木材这种易腐材料在此时期的考古记录中基本缺失。\n*   这表明他们的技术能力和认知水平比仅从石器工具中先前所理解的更为先进。\n*   尖头木棒的设计暗示其用于挖掘，可能是挖掘块茎、昆虫，甚至用于防御，这为了解他们的日常生存活动提供了直接线索。\n\n这一发现对传统的\"石器时代\"标签提出了挑战，强调那很可能也是一个\"木器时代\"，有机材料在早期人类技术中扮演了核心角色，只是大多已随时间腐朽。"
  },
  {
    "id": "46783752",
    "title": "Prism",
    "url": "https://openai.com/index/introducing-prism",
    "summary": "**Summary of \"Introducing Prism\"**\n\nOpenAI has introduced Prism, a new method for evaluating the safety of AI models, specifically focusing on their potential to be misused for creating biological threats. This initiative is part of OpenAI's Preparedness Framework.\n\nThe core problem Prism addresses is the difficulty in assessing how much a powerful AI model could lower the barriers for non-experts to access information and procedures related to hazardous biological material. Traditional evaluations by human experts are slow, expensive, and hard to scale.\n\nPrism works by using a set of AI \"judge\" models to simulate the steps a malicious actor might take when using an AI assistant for a biological threat. It tests the model's ability to provide accurate, actionable information across five key areas: acquiring pathogens, synthesizing DNA, culturing agents, scaling production, and weaponizing/delivery. The AI judges grade the model's responses for correctness and usefulness.\n\nThe key finding from initial testing is that the most capable current models (like GPT-4) provide only a **\"mild uplift\"** in information accessibility compared to existing internet resources. They do not significantly increase risk beyond what a determined individual could find online today. However, the capability to do these assessments automatically and at scale is a major advancement.\n\nUltimately, Prism is presented not as a final solution, but as a scalable early warning system. It is designed to help researchers continuously monitor model capabilities, identify potential spikes in risk as models evolve, and inform safety decisions before deploying new systems. The results and methodology have been shared with the U.S. government and other AI labs.",
    "chinese_title": "棱镜",
    "chinese_summary": "**《Prism简介》摘要**\n\nOpenAI推出了Prism，这是一种评估AI模型安全性的新方法，特别关注其可能被滥用于制造生物威胁的潜在风险。该举措是OpenAI\"准备框架\"的一部分。\n\nPrism解决的核心问题是，难以评估强大的AI模型能在多大程度上降低非专业人士获取危险生物材料相关信息和操作步骤的门槛。传统的人工专家评估方式缓慢、昂贵且难以规模化。\n\nPrism的工作原理是使用一组AI\"评判\"模型，模拟恶意行为者利用AI助手实施生物威胁时可能采取的步骤。它测试模型在五个关键领域提供准确、可操作信息的能力：获取病原体、合成DNA、培养制剂、扩大生产和武器化/投放。AI评判员根据模型回答的正确性和实用性进行评分。\n\n初步测试的关键发现是，当前最强大的模型（如GPT-4）与现有互联网资源相比，仅能带来**\"轻微的提升\"**。它们并未显著增加超越当前有决心的个人在网上所能找到信息之外的风险。然而，能够自动且大规模地进行此类评估本身是一项重大进步。\n\n最终，Prism并非作为最终解决方案提出，而是作为一个可扩展的早期预警系统。它旨在帮助研究人员持续监控模型能力，识别模型进化过程中可能出现的风险激增，并在部署新系统之前为安全决策提供信息。相关结果和方法论已与美国政府及其他AI实验室共享。"
  },
  {
    "id": "46782930",
    "title": "SoundCloud Data Breach Now on HaveIBeenPwned",
    "url": "https://haveibeenpwned.com/Breach/SoundCloud",
    "summary": "In December 2025, SoundCloud suffered a data breach affecting roughly 20% of its user base, or about 29.8 million accounts. An attacker was able to link publicly available profile information to the users' associated email addresses.\n\nThe compromised data includes email addresses, names, usernames, profile avatars, follower/following counts, and, for some users, their country. Notably, the breach did **not** include passwords or financial information.\n\nFollowing the discovery, the attackers attempted to extort SoundCloud before publicly releasing the stolen data in January 2026. The breach was subsequently added to the HaveIBeenPwned notification service on January 27, 2026.\n\nAffected users are strongly advised to:\n1.  **Change their passwords** immediately, especially if the same password was used on other online accounts.\n2.  **Enable two-factor authentication (2FA)** on SoundCloud and any other services where it is available to enhance account security.",
    "chinese_title": "SoundCloud数据泄露事件现已收录于HaveIBeenPwned",
    "chinese_summary": "2025年12月，SoundCloud发生数据泄露事件，影响约20%的用户，即约2980万个账户。攻击者能够将公开的个人资料信息与用户关联的电子邮件地址联系起来。\n\n泄露的数据包括电子邮件地址、姓名、用户名、个人头像、关注者/被关注者数量，以及部分用户的国家信息。值得注意的是，此次泄露**不**包含密码或财务信息。\n\n事件被发现后，攻击者试图勒索SoundCloud，随后于2026年1月公开了窃取的数据。该泄露事件于2026年1月27日被添加到HaveIBeenPwned通知服务中。\n\n强烈建议受影响的用户：\n1.  **立即更改密码**，尤其是在其他在线账户中使用相同密码的情况下。\n2.  **启用双重身份验证（2FA）**，在SoundCloud及其他支持该功能的服务中增强账户安全性。"
  },
  {
    "id": "46783863",
    "title": "Clawdbot Renames to Moltbot",
    "url": "https://github.com/moltbot/moltbot/commit/6d16a658e5ebe6ce15856565a47090d5b9d5dfb6",
    "summary": "This article documents the renaming of \"Clawdbot\" to \"Moltbot\" and provides a comprehensive overview of the Moltbot project's codebase. The core change is reflected in the repository name and likely involves updating internal references throughout the code.\n\nThe content is primarily a detailed file tree listing the project's structure, which reveals Moltbot to be a sophisticated, multi-platform AI assistant/chatbot application. Key aspects of the project include:\n\n*   **Multi-Platform Support:** It has dedicated codebases for Android, iOS, macOS, and shared libraries, indicating it runs on mobile and desktop.\n*   **Gateway & Node Architecture:** The structure suggests a system where a central \"gateway\" coordinates with individual \"node\" instances (likely devices), handling discovery, pairing, and communication.\n*   **Extensive Feature Set:** The files reference capabilities like voice wake words, screen recording, camera capture, canvas/drawing tools, cron jobs, permissions management, and a skills/plugins system.\n*   **Integration & Channels:** It supports numerous messaging platforms (Slack, Discord, iMessage, WhatsApp, etc.) through a channels system and integrates with various AI model providers (Anthropic, OpenAI, Ollama).\n*   **Development & Tooling:** The repository includes extensive documentation, testing suites, build scripts, Docker configurations, and release tooling.\n\nIn summary, the article shows that Moltbot is a large, actively developed open-source project for a customizable AI assistant that connects to various services and can be controlled across different user devices and platforms.",
    "chinese_title": "Clawdbot更名为Moltbot",
    "chinese_summary": "本文记录了“Clawdbot”更名为“Moltbot”的过程，并对Moltbot项目的代码库进行了全面概述。核心变更体现在仓库名称上，且可能涉及整个代码库内部引用的更新。\n\n内容主要是详细的项目结构文件树，揭示了Moltbot是一个复杂的多平台AI助手/聊天机器人应用。项目的关键方面包括：\n\n*   **多平台支持：** 拥有针对Android、iOS、macOS的专用代码库以及共享库，表明其可在移动设备和桌面设备上运行。\n*   **网关与节点架构：** 结构暗示了一个由中央“网关”与各个“节点”实例（可能是设备）协调工作的系统，负责处理发现、配对和通信。\n*   **丰富的功能集：** 文件提及了诸如语音唤醒词、屏幕录制、摄像头捕捉、画布/绘图工具、定时任务、权限管理以及技能/插件系统等功能。\n*   **集成与通道：** 通过通道系统支持众多消息平台（Slack、Discord、iMessage、WhatsApp等），并与多种AI模型提供商（Anthropic、OpenAI、Ollama）集成。\n*   **开发与工具链：** 仓库包含详尽的文档、测试套件、构建脚本、Docker配置和发布工具。\n\n总之，文章表明Moltbot是一个大型、积极开发的开源项目，旨在构建一个可定制的AI助手，能够连接多种服务，并可在不同用户设备和平台上进行控制。"
  },
  {
    "id": "46784572",
    "title": "Lennart Poettering, Christian Brauner founded a new company",
    "url": "https://amutable.com/about",
    "summary": "Lennart Poettering (creator of systemd) and Christian Brauner (Linux kernel VFS maintainer), along with former Kinvolk CEO Chris Kühl, have co-founded a new company named Amutable.\n\nThe company's mission is to provide cryptographically verifiable integrity for Linux workloads, aiming to ensure systems start in a verified state and remain trusted throughout their runtime. Their focus spans three areas: build integrity, boot integrity, and runtime integrity.\n\nThe founding executive team includes Poettering as Chief Engineer, Brauner as Chief Technical Officer, and Kühl as CEO. David Strauss, former Pantheon CTO, joins as Chief Product Officer. The engineering team comprises several notable founding engineers with strong open-source backgrounds, including former systemd and container technology contributors.\n\nAmutable's overarching goal is to embed \"uncompromising integrity\" into Linux systems as a foundational feature.",
    "chinese_title": "伦纳特·波特尔林与克里斯蒂安·布劳纳共同创立了一家新公司。",
    "chinese_summary": "Lennart Poettering（systemd 创始人）与 Christian Brauner（Linux 内核 VFS 维护者）以及前 Kinvolk 首席执行官 Chris Kühl 共同创立了一家名为 Amutable 的新公司。\n\n该公司的使命是为 Linux 工作负载提供可加密验证的完整性保障，致力于确保系统从已验证状态启动，并在整个运行期间保持可信状态。其业务聚焦于三个领域：构建完整性、启动完整性与运行时完整性。\n\n创始高管团队包括：Poettering 担任首席工程师，Brauner 担任首席技术官，Kühl 担任首席执行官。前 Pantheon 首席技术官 David Strauss 加入并担任首席产品官。工程团队由多位具有深厚开源背景的知名创始工程师组成，其中包括前 systemd 及容器技术贡献者。\n\nAmutable 的核心理念是将“不容妥协的完整性”作为基础特性嵌入 Linux 系统。"
  },
  {
    "id": "46782662",
    "title": "OpenSSL: Stack buffer overflow in CMS AuthEnvelopedData parsing",
    "url": "https://openssl-library.org/news/vulnerabilities/#CVE-2025-15467",
    "summary": "This article details multiple security vulnerabilities discovered in various versions of OpenSSL, published on 27 January 2026. The issues range in severity from Moderate to Low, with one rated High.\n\nThe most critical vulnerability (CVE-2025-15467, High severity) is a stack buffer overflow in the parsing of CMS AuthEnvelopedData messages using AEAD ciphers like AES-GCM. An attacker can trigger this by sending a crafted message with an oversized initialization vector (IV), potentially leading to a crash or remote code execution before any authentication occurs.\n\nA Moderate severity issue (CVE-2025-11187) involves improper validation of PBMAC1 parameters in PKCS#12 files, which can cause a stack buffer overflow or NULL pointer dereference during MAC verification, leading to denial of service or possible code execution.\n\nSeveral Low severity vulnerabilities were also disclosed, including:\n*   A NULL dereference in the `SSL_CIPHER_find()` function for QUIC connections.\n*   Silent truncation of large inputs in the `openssl dgst` command-line tool.\n*   Excessive memory allocation in TLS 1.3 certificate compression.\n*   Heap out-of-bounds writes in the `BIO_f_linebuffer` filter.\n*   Unauthenticated trailing bytes when using low-level OCB API calls.\n*   An out-of-bounds write in the `PKCS12_get_friendlyname()` function.\n\nThe affected OpenSSL versions include 3.6, 3.5, 3.4, 3.3, 3.0, 1.1.1, and 1.0.2, with specific patched versions listed for each. The FIPS modules in the affected versions are not vulnerable, as the issues reside in code outside the FIPS boundary. Users are advised to upgrade to the fixed versions.",
    "chinese_title": "OpenSSL：CMS AuthEnvelopedData解析中的栈缓冲区溢出",
    "chinese_summary": "本文详细介绍了2026年1月27日披露的OpenSSL多个版本中发现的安全漏洞。这些问题的严重程度从中等到低不等，其中一项被评为高危。\n\n最关键的漏洞（CVE-2025-15467，高危）是在使用AES-GCM等AEAD密码解析CMS AuthEnvelopedData消息时出现的栈缓冲区溢出。攻击者可通过发送包含超大初始化向量（IV）的特制消息触发此漏洞，可能在身份验证前导致崩溃或远程代码执行。\n\n一项中等严重性问题（CVE-2025-11187）涉及PKCS#12文件中PBMAC1参数验证不当，可能在MAC验证期间导致栈缓冲区溢出或空指针解引用，引发拒绝服务或可能的代码执行。\n\n同时披露的多个低危漏洞包括：\n*   QUIC连接中`SSL_CIPHER_find()`函数的空指针解引用\n*   `openssl dgst`命令行工具对大输入数据的静默截断\n*   TLS 1.3证书压缩中的过量内存分配\n*   `BIO_f_linebuffer`过滤器中的堆越界写入\n*   使用底层OCB API调用时未验证的尾部字节\n*   `PKCS12_get_friendlyname()`函数中的越界写入\n\n受影响的OpenSSL版本包括3.6、3.5、3.4、3.3、3.0、1.1.1和1.0.2，每个版本均有对应的修复版本。受影响版本中的FIPS模块不受影响，因为问题存在于FIPS边界之外的代码中。建议用户升级至修复版本。"
  },
  {
    "id": "46783254",
    "title": "FBI is investigating Minnesota Signal chats tracking ICE",
    "url": "https://www.nbcnews.com/tech/internet/fbi-investigating-minnesota-signal-minneapolis-group-ice-patel-kash-rcna256041",
    "summary": "FBI Director Kash Patel has opened an investigation into Signal group chats used by Minnesota residents to share real-time information about Immigration and Customs Enforcement (ICE) agents' locations and activities. Patel, citing a viral social media thread, stated the probe aims to determine if these actions put federal agents \"in harm's way\" by sharing details like license plate numbers.\n\nThe announcement has drawn immediate criticism from free speech advocates. Organizations like the Foundation for Individual Rights and Expression and the Knight First Amendment Institute argue that the First Amendment protects the public's right to share legally obtained information to observe law enforcement and hold it accountable. They warn the investigation risks conflating protected speech with criminal conduct unless there is evidence of specific illegal acts, such as direct threats or conspiracy.\n\nThe Signal chats are part of a broader toolkit used by activists and community volunteers in Minnesota to warn undocumented families, particularly near schools, about enforcement operations. Patel did not specify which laws may have been violated but also claimed the FBI is making progress investigating the funding of this resistance, alleging it is not organic.\n\nThe case highlights the tension between government enforcement actions and constitutional speech protections, setting up a potential legal conflict over the limits of organizing and information-sharing in the digital age.",
    "chinese_title": "联邦调查局正在调查追踪移民及海关执法局的明尼苏达州信号聊天记录。",
    "chinese_summary": "联邦调查局局长卡什·帕特尔已对明尼苏达州居民使用的Signal群聊展开调查，这些群聊被用于实时分享移民与海关执法局（ICE）人员的位置和活动信息。帕特尔援引一则广泛传播的社交媒体帖文称，此次调查旨在确认此类行为——例如分享车牌号码等细节——是否将联邦执法人员置于“危险境地”。\n\n该声明立即遭到言论自由倡导者的批评。个人权利与表达基金会及奈特第一修正案研究所等组织指出，第一修正案保护公众分享合法获取的信息以监督执法行为并追究其责任的权利。他们警告称，除非有证据表明存在具体违法行为（如直接威胁或密谋），否则此项调查可能混淆受保护的言论与犯罪行为。\n\n这些Signal群聊是明尼苏达州活动人士及社区志愿者所用工具的一部分，旨在向无证移民家庭（尤其是学校附近）通报执法行动。帕特尔未具体说明可能违反哪些法律，但声称联邦调查局在调查此类抵抗行动的资助来源方面已取得进展，并指其“非自发形成”。\n\n此案凸显了政府执法行动与宪法言论保护之间的紧张关系，可能引发关于数字时代组织与信息共享界限的法律冲突。"
  },
  {
    "id": "46779522",
    "title": "Show HN: One Human + One Agent = One Browser From Scratch in 20K LOC",
    "url": "https://emsh.cat/one-human-one-agent-one-browser/",
    "summary": "This article describes a three-day project where a single developer, assisted by an LLM agent (Codex), built a basic cross-platform browser from scratch without using any third-party Rust libraries. The browser can render HTML and CSS (but not JavaScript) and runs on Linux, macOS, and Windows. The final codebase is about 20,000 lines of Rust, all written within roughly 72 hours.\n\nKey requirements were that the code must always compile, be human-readable, and rely only on OS-provided tools (like X11, cURL). The workflow involved the developer setting goals and specifications, while the agent handled much of the implementation, with progress checked via automated screenshot comparisons.\n\nThe main takeaway is that a focused collaboration between one human and one capable agent can be more effective for ambitious projects than deploying many autonomous agents. The author suggests that the human's role in guiding the agent is crucial and that this model could potentially scale to teams where each member has their own agent. The project also implies that simply adding more AI agents may not linearly improve outcomes in autonomous coding.",
    "chinese_title": "展示 HN：一人一智能体，两万行代码从零打造一个浏览器",
    "chinese_summary": "本文描述了一个为期三天的项目：一名开发者在一款LLM智能体（Codex）的协助下，未使用任何第三方Rust库，从零构建了一个基础的跨平台浏览器。该浏览器能够渲染HTML和CSS（但不支持JavaScript），可在Linux、macOS和Windows系统上运行。最终代码库约有两万行Rust代码，全部在大约72小时内完成。\n\n项目的核心要求是代码必须始终保持可编译、具备良好的可读性，且仅依赖操作系统提供的工具（如X11、cURL）。工作流程由开发者设定目标与规范，智能体负责大部分实现，并通过自动截图对比来检查进度。\n\n主要结论是：对于雄心勃勃的项目，单人与一个高效智能体的专注协作，可能比部署多个自主智能体更为有效。作者认为，人类在引导智能体方面的作用至关重要，这种模式未来或可扩展至团队，让每位成员都拥有专属智能体。该项目也暗示，在自主编程中单纯增加AI智能体的数量，未必能线性提升成果。"
  },
  {
    "id": "46784491",
    "title": "Hypercubic (YC F25) Is Hiring a Founding SWE and COBOL Engineer",
    "url": "https://www.ycombinator.com/companies/hypercubic/jobs",
    "summary": "Hypercubic (YC F25) is an AI startup hiring two founding engineers to help maintain and modernize legacy COBOL and mainframe systems. The company's platform targets the 70% of Fortune 500 companies that still rely on these decades-old systems for core operations in finance, insurance, and other critical industries.\n\nThe two open roles are:\n1.  **Founding Mainframe Expert:** A hybrid/remote position requiring 6+ years of experience, offering a $150K–$250K salary and 0.50%–3.00% equity.\n2.  **Founding Software Engineer:** Based in San Francisco, open to any experience level (including new graduates), with a $125K–$200K salary and 0.50%–5.00% equity.\n\nThe company, founded in 2025 by Sai Gurrapu and Aayush Naik, aims to use AI to address the growing knowledge gap as original developers retire, with the goal of autonomously maintaining and future-proofing this vital global infrastructure.",
    "chinese_title": "Hypercubic (YC F25) 正在招聘创始软件工程师与COBOL工程师",
    "chinese_summary": "Hypercubic（YC F25）是一家人工智能初创公司，正在招聘两名创始工程师，协助维护和现代化遗留的COBOL与大型机系统。该公司的平台面向70%的《财富》500强企业，这些企业至今仍依赖这些已有数十年历史的系统来运行金融、保险及其他关键行业的核心业务。\n\n目前开放的两个职位如下：\n1.  **创始大型机专家：** 混合/远程职位，要求6年以上经验，薪资范围为15万至25万美元，股权激励为0.50%至3.00%。\n2.  **创始软件工程师：** 工作地点位于旧金山，经验不限（包括应届毕业生），薪资范围为12.5万至20万美元，股权激励为0.50%至5.00%。\n\n该公司由Sai Gurrapu和Aayush Naik于2025年创立，旨在利用人工智能应对原始开发人员退休带来的日益扩大的知识断层，目标是实现自主维护并确保这一全球关键基础设施面向未来可持续发展。"
  },
  {
    "id": "46778341",
    "title": "I made my own Git",
    "url": "https://tonystr.net/blog/git_immitation",
    "summary": "This article, \"I made my own Git,\" by TonyStr, details the author's journey of building a simplified version control system from scratch to deepen their understanding of Git's core mechanics.\n\nThe primary motivation was to demystify Git's internal workings, which often feel like a \"black box.\" By creating a basic system that mimics Git's fundamental data structures—specifically blobs (file content), trees (directories), and commits—the author gained practical insight into how Git stores and tracks changes.\n\nThe article explains the implementation of key commands like `init`, `add`, `commit`, and `log`. It highlights how the system uses SHA-1 hashing to create immutable snapshots of the repository state, forming a directed acyclic graph (DAG) of commits. This hands-on project revealed the elegance of Git's design, showing that its powerful version tracking is built upon relatively simple concepts of hashing and pointers.\n\nUltimately, the author concludes that building a \"mini-Git\" is an excellent educational exercise. It transforms abstract concepts into tangible understanding, making the official Git's more complex features easier to comprehend. The experience underscores the value of learning complex tools by attempting to recreate their foundational principles.",
    "chinese_title": "我做了自己的Git。",
    "chinese_summary": "托尼·斯特（TonyStr）的文章《我动手写了一个Git》详细记录了作者从零开始构建简化版版本控制系统的历程，旨在深入理解Git的核心机制。\n\n作者的主要动机是揭开Git内部工作原理的神秘面纱——这些原理常如“黑匣子”般令人费解。通过创建一个模拟Git基础数据结构（即blob文件内容、tree目录和commit提交）的简易系统，作者在实践中领悟了Git存储与追踪变更的方式。\n\n文章阐述了`init`、`add`、`commit`和`log`等关键命令的实现过程，着重说明了该系统如何利用SHA-1哈希算法创建不可变的仓库状态快照，并构建出提交记录的有向无环图（DAG）。这一实践项目揭示了Git设计的精妙之处，表明其强大的版本追踪功能实则建立在哈希与指针这两个相对简单的概念之上。\n\n作者最终总结道，构建“迷你Git”是一次极佳的学习实践。它将抽象概念转化为具体认知，使官方Git更复杂的功能变得易于理解。这段经历印证了通过重现实用工具的基础原理来掌握复杂技能的重要价值。"
  },
  {
    "id": "46785572",
    "title": "Chuck Klosterman on why we've never actually seen a real football game",
    "url": "https://www.latimes.com/entertainment-arts/books/story/2026-01-22/chuck-klosterman-new-book-football",
    "summary": "In this essay, Chuck Klosterman argues that televised football is not just an enhanced version of the live game, but the *only* way to truly see it. He posits that football is a \"purely mediated experience,\" where the televised form has become the definitive reality of the sport, even for those attending in person.\n\nKlosterman contends that while other sports like hockey are superior live, televised football is so formally perfect that it renders the in-person experience inferior. He explains that fans in a stadium, unable to see the full field clearly, subconsciously convert what they witness into the standard television perspective—the wide shot from the press box. This \"psychological fascism,\" where the camera's viewpoint overwrites our natural perception, is uniquely effective for football.\n\nHe acknowledges that broadcasts use multiple angles (like the strategic \"All-22\" or Skycam view) which offer more tactical clarity. However, he insists the traditional, limited sideline view remains the mentally dominant framework through which we understand the game. These very limitations—focusing on the ball, excluding players—somehow create the compelling spectacle. Thus, the televised version doesn't just document the event; it constructs the essential experience of football itself.",
    "chinese_title": "查克·克洛斯特曼谈为何我们从未真正看过一场真正的足球比赛",
    "chinese_summary": "在这篇文章中，查克·克洛斯特曼提出，电视转播的美式橄榄球不仅是现场比赛的增强版，更是真正观看这项运动的*唯一*方式。他认为橄榄球是一种“纯粹媒介化的体验”，电视转播的形式已成为这项运动的决定性现实，即使对亲临现场的观众也是如此。\n\n克洛斯特曼指出，虽然冰球等其他运动在现场观看更佳，但电视转播的橄榄球在形式上如此完美，以至于现场体验反而逊色。他解释道，体育场内的球迷由于无法清晰看到整个场地，会下意识地将所见景象转化为标准的电视视角——即从媒体席拍摄的广角镜头。这种“心理上的强制统一”——让摄像机视角覆盖我们自然的感知——对橄榄球尤其有效。\n\n他承认电视转播会使用多种角度（如战术视角的“全22人”镜头或空中摄像机视角），以提供更清晰的战术分析。但他坚持认为，传统且受限的边线视角仍然是我们理解比赛时在心理上占据主导的框架。正是这些限制——聚焦于球、排除其他球员——反而创造了引人入胜的观赛体验。因此，电视版本不仅记录了赛事，更构建了橄榄球运动本身的本质体验。"
  },
  {
    "id": "46783017",
    "title": "AI2: Open Coding Agents",
    "url": "https://allenai.org/blog/open-coding-agents",
    "summary": "AI2 has released **SERA (Soft-verified Efficient Repository Agents)**, a family of open-source coding agents designed to be fast, affordable, and adaptable to any codebase. The key innovation is a new training method that dramatically reduces the cost of creating specialized coding agents for private or internal repositories.\n\nThe method uses **Soft-verified generation (SVG)**, which creates effective training data from partially correct code patches, eliminating the need for expensive, exhaustive correctness testing. Combined with a taxonomy of common bug patterns, this allows for the cheap, scalable generation of synthetic training data that mimics real developer workflows.\n\nSERA models, built on Qwen3 and ranging from 8B to 32B parameters, achieve state-of-the-art open-source performance. The flagship **SERA-32B** solves **54.2%** of problems on the SWE-Bench Verified benchmark, competing with larger proprietary models. Crucially, the entire training pipeline uses simple supervised fine-tuning (SFT), avoiding complex reinforcement learning setups.\n\nA major finding is that a smaller model fine-tuned on a specific codebase (at a cost as low as ~$400) can match or surpass the performance of a much larger general-purpose \"teacher\" model on that codebase. This makes powerful, customized coding agents for tasks like debugging and maintenance accessible to individual researchers, small teams, and organizations without massive budgets.\n\nAll components—models, training recipes, and data—are openly released to ensure full reproducibility and community-driven advancement.",
    "chinese_title": "AI2：开放编码代理",
    "chinese_summary": "AI2发布了**SERA（软验证高效仓库智能体）**系列开源编程智能体，其设计兼具快速、经济高效的特点，并能适配任何代码库。该系列的核心创新在于一种全新的训练方法，可大幅降低为私有或内部仓库创建专用编程智能体的成本。\n\n该方法采用**软验证生成技术**，能够从部分正确的代码补丁中生成有效的训练数据，从而无需昂贵且耗尽的全面正确性测试。结合常见错误模式的分类体系，该方法能以低成本、可扩展的方式生成模拟真实开发者工作流程的合成训练数据。\n\n基于Qwen3构建的SERA模型参数量从80亿到320亿不等，实现了顶尖的开源性能。旗舰模型**SERA-32B**在SWE-Bench Verified基准测试中解决了**54.2%**的问题，足以与规模更大的专有模型竞争。关键在于，整个训练流程仅采用简单的监督微调，避免了复杂的强化学习设置。\n\n一项重要发现是：针对特定代码库微调的小型模型（成本可低至约400美元），在该代码库上的表现能够媲美甚至超越规模更大的通用“教师”模型。这使得个人研究者、小型团队及预算有限的组织都能获得强大的定制化编程智能体，用于调试和维护等任务。\n\n所有组件——包括模型、训练方案和数据——均已开源发布，以确保完全的可复现性，并推动社区驱动的技术发展。"
  },
  {
    "id": "46711159",
    "title": "Flexible use of a multi-purpose tool by a cow",
    "url": "https://doi.org/10.1016/j.cub.2025.11.059",
    "summary": "This article reports on a documented instance of a cow named Luna using a branch as a multi-purpose tool, demonstrating unexpected behavioral flexibility.\n\nThe key observation was that Luna, a female Highland cow, used a stick or branch in her enclosure for two distinct purposes: as a **scratching tool** to groom hard-to-reach parts of her head and neck, and as a **tick-removal aid** by brushing it against her body. Researchers noted that she would actively **modify the tool** by stripping it of leaves and bark to suit her needs and would **carry it with her** over significant distances, indicating deliberate, goal-oriented behavior.\n\nThis finding is significant because it challenges the traditional view that advanced tool use is exclusive to primates, certain birds, and a few other species. It provides evidence of **spontaneous tool use and modification in a domesticated ungulate (hoofed mammal)**, suggesting greater cognitive complexity in cattle than previously assumed. The behavior aligns with criteria for tool use, including object modification and transport for future use.\n\nThe article concludes that this single case study highlights the need for more systematic research into the cognitive abilities of livestock, which could have implications for understanding animal intelligence and improving animal welfare practices.",
    "chinese_title": "奶牛灵活运用多功能工具",
    "chinese_summary": "本文报道了一例有记录的案例：一头名为露娜的奶牛使用树枝作为多功能工具，展现出意想不到的行为灵活性。\n\n关键观察发现，这头名为露娜的苏格兰高地母牛在围栏内将一根树枝用于两种不同用途：一是作为**搔痒工具**梳理头部和颈部难以触及的部位，二是作为**除蜱辅助工具**，将树枝在身体上刮擦以驱除蜱虫。研究人员指出，她会主动**改造工具**——剥去树叶和树皮以适应需求，并会**携带工具**移动相当长的距离，这表明其行为具有明确的目的性和计划性。\n\n这一发现具有重要意义，因为它挑战了传统观点，即高级工具使用行为仅限于灵长类动物、某些鸟类和少数其他物种。该案例提供了**家养有蹄类动物自发使用并改造工具**的证据，表明牛类的认知能力可能比此前认为的更为复杂。其行为符合工具使用的标准，包括为未来使用而进行的工具改造和携带。\n\n文章总结认为，这一独立案例研究凸显了对家畜认知能力进行更系统研究的必要性，此类研究可能对理解动物智能以及改善动物福利实践产生重要影响。"
  },
  {
    "id": "46784599",
    "title": "Arm's Cortex A725 Ft. Dell's Pro Max with GB10",
    "url": "https://chipsandcheese.com/p/arms-cortex-a725-ft-dells-pro-max",
    "summary": "This article analyzes Arm's new Cortex A725 CPU core, a \"density-optimized\" core designed for efficiency in multi-core setups, similar to Intel's E-Cores. The analysis is based on its implementation in Nvidia's GB10 processor.\n\nKey architectural findings include:\n*   **Frontend:** It is a 5-wide out-of-order core with a strong branch predictor, but it removes the micro-op (MOP) cache from its predecessor, relying instead on a streamlined predecode scheme.\n*   **Execution Engine:** It features a significantly larger reorder buffer (224 entries) for finding instruction-level parallelism. Its execution resources are balanced for area efficiency, with four integer pipes and two floating-point/vector pipes.\n*   **Memory System:** It has a triple-AGU load/store setup. The L1 data TLB is enlarged to 48 entries, while the instruction TLB is reduced, reflecting typical application behavior. It also supports a feature similar to AMD's \"page smashing\" to improve TLB coverage.\n*   **Comparison:** The A725 generally improves upon the older A710/Neoverse N2, particularly in branch prediction for some workloads. It is positioned as a competitive contemporary to Intel's Skymont E-Cores, with both having capable predictors, though Skymont benefits from higher clock speeds.\n\nOverall, the Cortex A725 represents Arm's refined approach to efficiency cores, prioritizing area and power savings while maintaining competent performance, which is crucial for its competition with custom designs (like Qualcomm's) and expansion into the laptop market.",
    "chinese_title": "Arm的Cortex A725搭配戴尔Pro Max与GB10",
    "chinese_summary": "本文分析了Arm全新的Cortex A725 CPU核心，这是一款专为多核配置效率优化的“密度优化”核心，其设计理念与Intel的能效核（E-Core）相似。分析基于该核心在英伟达GB10处理器中的实现。\n\n主要架构特点包括：\n*   **前端设计：** 采用5发射乱序执行架构，配备强大的分支预测器，但取消了前代产品的微操作缓存，转而依赖精简的预解码方案。\n*   **执行引擎：** 拥有显著扩大的重排序缓冲区（224项），以提升指令级并行度。其执行资源为面积效率做了平衡配置，包含四个整数流水线和两个浮点/向量流水线。\n*   **内存系统：** 采用三地址生成单元的加载/存储结构。一级数据TLB扩大至48项，而指令TLB则有所缩减，这反映了典型的应用行为模式。它还支持类似AMD“页粉碎”的功能，以提升TLB覆盖率。\n*   **对比分析：** A725总体优于旧款的A710/Neoverse N2，尤其在部分工作负载的分支预测方面表现更佳。其定位是与Intel的Skymont能效核竞争的同期产品，两者均具备出色的预测能力，但Skymont凭借更高时钟频率占据优势。\n\n总体而言，Cortex A725代表了Arm在能效核设计上的精细化思路，在保持出色性能的同时，优先考虑面积与功耗的节约。这对于其与定制设计（如高通方案）竞争以及拓展笔记本电脑市场至关重要。"
  },
  {
    "id": "46777329",
    "title": "Bassoontracker, Tracking in the Browser",
    "url": "https://www.stef.be/bassoontracker/",
    "summary": "**Bassoontracker** is a web-based music application that faithfully recreates the experience of classic Amiga trackers (like ProTracker) directly in a modern browser. Created by Steffest, it allows users to compose music using the iconic four-channel tracker interface and the distinctive sound of the Amiga's original Paula chip.\n\nThe tool is notable for its authenticity, supporting the import and export of original Amiga module files (MOD). It includes a built-in selection of classic Amiga sound samples, enabling users to create music with the authentic \"chiptune\" aesthetic of the late 1980s and early 1990s demoscene.\n\nAs a browser-based application, Bassoontracker requires no installation and is completely free to use. It makes retro music creation accessible to both nostalgic veterans and new users curious about the tracker workflow, preserving a significant piece of digital music history.",
    "chinese_title": "Bassoontracker，浏览器中的追踪工具",
    "chinese_summary": "**Bassoontracker** 是一款基于网络的音乐应用，它忠实复刻了经典 Amiga 追踪器（如 ProTracker）的体验，并可直接在现代浏览器中运行。由 Steffest 开发，该工具允许用户通过标志性的四声道追踪器界面以及 Amiga 原版 Paula 芯片的独特音效进行音乐创作。\n\n该工具的突出之处在于其原真性，支持导入和导出原始的 Amiga 模块文件（MOD）。它内置了一系列经典的 Amiga 音效样本，让用户能够创作出具有 80 年代末至 90 年代初演示场景中地道“芯片音乐”美学的作品。\n\n作为一款基于浏览器的应用，Bassoontracker 无需安装且完全免费使用。它让怀旧的老手和对追踪器工作流程好奇的新用户都能轻松接触复古音乐创作，从而保留了数字音乐历史中的重要一环。"
  },
  {
    "id": "46776155",
    "title": "Doing the thing is doing the thing",
    "url": "https://www.softwaredesign.ing/blog/doing-the-thing-is-doing-the-thing",
    "summary": "This article emphasizes the crucial distinction between preparation and action. The author argues that thinking, planning, talking, or consuming content about a goal—\"the thing\"—is not the same as actually doing it. He lists numerous common procrastination tactics, from visualizing success and buying tools to reorganizing workspaces and feeling guilty, all of which are ultimately substitutes for real work.\n\nThe core message is that action, however imperfect, is the only thing that counts. The piece asserts that even failing, doing poorly, or making a timid, small start still qualifies as \"doing the thing.\" It concludes with a self-aware, ironic twist, noting that even writing a blog about doing the thing is itself a form of avoidance, and ends with a call to action: \"I should probably get back to work.\" The overall theme is a critique of modern productivity culture and a blunt reminder that execution is everything.",
    "chinese_title": "做这件事就是在做这件事。",
    "chinese_summary": "本文强调了准备与行动之间的关键区别。作者指出，思考、计划、讨论或消费与目标——“那件事”——相关的内容，并不等同于真正付诸实践。他列举了诸多常见的拖延策略，从想象成功、购买工具到重新整理工作空间和感到内疚，这些最终都只是实际工作的替代品。\n\n核心信息是：行动，无论多么不完美，才是唯一重要的事。文章主张，即使是失败、表现不佳或胆怯地迈出一小步，也属于“做了那件事”。结尾以带有自我意识的讽刺转折指出，就连撰写关于“做那件事”的博客本身也是一种逃避，并以行动号召收尾：“我可能该回去工作了。”全文主题是对现代效率文化的批判，并直白地提醒人们：执行力才是一切。"
  },
  {
    "id": "46736815",
    "title": "Heathrow scraps liquid container limit",
    "url": "https://www.bbc.com/news/articles/c1evvx89559o",
    "summary": "Heathrow Airport has fully implemented new CT security scanners across all terminals, allowing departing passengers to carry liquids in containers up to two litres and keep electronics in their bags, eliminating the need for clear plastic bags. This makes it the world's largest airport to have completed this high-tech upgrade.\n\nWhile Heathrow is a major milestone, several other UK airports like Gatwick, Edinburgh, and Birmingham had already installed similar scanners and increased their limits. However, many airports with the new technology are still waiting for government approval to relax the rules, leading to inconsistency across the country.\n\nThe UK-wide rollout has faced significant delays and setbacks. Originally promised for 2022, then set for a June 2024 deadline, the process was disrupted by the pandemic. In a confusing reversal in June 2024, the government instructed smaller airports that had already lifted restrictions to reinstate the 100ml rule.\n\nPassengers are advised that the new, more permissive rules only apply to flights *leaving* Heathrow and must check the specific regulations of their departure airport for return journeys. Industry groups have criticized the lack of a unified national approach, stating it causes confusion and frustration for travelers.",
    "chinese_title": "希思罗机场取消液体容器限制",
    "chinese_summary": "希思罗机场已在其所有航站楼全面启用新型CT安检扫描仪，离港旅客现可携带容量不超过两升的液体容器，且无需取出包内电子设备，亦不再需要使用透明塑料袋。这使其成为全球首个完成此项高科技升级的大型机场。\n\n尽管希思罗机场的实现具有里程碑意义，但盖特威克、爱丁堡、伯明翰等英国其他机场此前已安装类似扫描设备并放宽了携带限制。然而，许多已配备新技术的机场仍在等待政府批准以正式放宽规定，导致全国范围内安检标准存在差异。\n\n此项全国性技术推广进程遭遇了严重延误与波折。最初承诺于2022年完成，后设定2024年6月为截止期限，却因疫情而中断。更令人困惑的是，2024年6月政府突然要求已放宽限制的小型机场重新恢复100毫升液体携带规定，政策出现反复。\n\n旅客需注意，当前更宽松的新规仅适用于从希思罗机场*出发*的航班，返程时必须提前查询出发机场的具体规定。行业组织批评这种缺乏全国统一部署的做法，称其给旅客带来了混乱与困扰。"
  },
  {
    "id": "46779645",
    "title": "Xfwl4 – The Roadmap for a Xfce Wayland Compositor",
    "url": "https://alexxcons.github.io/blogpost_15.html",
    "summary": "The Xfce development team has announced a new project, **xfwl4**, a Wayland compositor for Xfce, funded by community donations. The goal is to replicate the functionality and user experience of the current X11 window manager, xfwm4, on the Wayland display protocol.\n\nInstead of modifying the existing xfwm4 code, the team has decided on a **complete rewrite in Rust** using the **Smithay** library. This approach was chosen because refactoring the X11-centric xfwm4 code for Wayland was deemed too difficult and risky, potentially introducing bugs. A separate codebase allows for safer, faster development.\n\nKey reasons for choosing Smithay over alternatives like wlroots include its extensive protocol support, deep customizability, excellent documentation, and the safety benefits of Rust. The project's scope includes achieving feature parity with xfwm4, making major changes to the Xfce session startup process, and adding support for xdg-session-management and XWayland.\n\nDevelopment is already underway, with the first release targeted for mid-2026. The team has thanked its community supporters for making this investment in Xfce's future possible.",
    "chinese_title": "Xfwl4 – Xfce Wayland 合成器的路线图",
    "chinese_summary": "Xfce开发团队宣布启动新项目**xfwl4**——一个由社区捐款资助的Wayland合成器。该项目旨在Wayland显示协议上复现当前X11窗口管理器xfwm4的功能与用户体验。\n\n团队决定采用**基于Smithay库的Rust语言完全重写**方案，而非修改现有xfwm4代码。这是因为重构以X11为核心的xfwm4代码适配Wayland被认为过于困难且风险较高，可能引入程序缺陷。独立的代码库将支持更安全、快速的开发。\n\n选择Smithay而非wlroots等替代方案的关键原因包括：广泛的协议支持、深度可定制性、完善的文档说明，以及Rust语言的安全优势。项目规划涵盖实现与xfwm4的功能对等性、对Xfce会话启动流程进行重大调整，并增加对xdg-session-management和XWayland的支持。\n\n开发工作已启动，首个版本目标定于2026年中旬发布。团队特别感谢社区支持者，正是他们的捐助让这项关乎Xfce未来的投资成为可能。"
  },
  {
    "id": "46781516",
    "title": "Cloudflare claimed they implemented Matrix on Cloudflare workers. They didn't",
    "url": "https://tech.lgbt/@JadedBlueEyes/115967791152135761",
    "summary": "**Summary:**\n\nThe article criticizes a Cloudflare blog post announcing \"Matrix on Cloudflare Workers.\" The core claim is that Cloudflare's implementation is misleading, as it does not constitute a true Matrix server.\n\nThe key points are:\n\n1.  **Misleading Claim:** Cloudflare presented its work as implementing the Matrix protocol, but it only created a minimal, non-compliant \"homeserver\" proxy. It cannot perform essential server functions like managing user accounts, storing history, or federating with other servers.\n\n2.  **Technical Shortcomings:** The implementation relies entirely on the existing Matrix.org foundation server for identity, storage, and federation. The Cloudflare Worker acts merely as a pass-through, not an independent server.\n\n3.  **Critique of Marketing:** The article frames the blog post as marketing \"vibe coding\" – prioritizing hype and aesthetics over technical substance and accurate representation. It suggests this distracts from genuine open-source contributions.\n\n4.  **Broader Context:** The criticism is placed within concerns about large tech companies (like Cloudflare) appropriating the branding and community credibility of decentralized protocols (like Matrix) without delivering full, compliant implementations that support the network's resilience and independence.\n\nIn essence, the article accuses Cloudflare of overstating a limited technical experiment as a major protocol implementation, potentially harming understanding and trust in the Matrix ecosystem.",
    "chinese_title": "Cloudflare声称他们在Cloudflare Workers上实现了Matrix协议。实际上并没有。",
    "chinese_summary": "**摘要：**\n\n本文批评了Cloudflare宣布“基于Cloudflare Workers的Matrix”的博客文章。核心论点是Cloudflare的实现具有误导性，因为它并非真正的Matrix服务器。\n\n主要观点如下：\n\n1.  **误导性声明：** Cloudflare将其工作描述为实现了Matrix协议，但实际上仅创建了一个极简、不兼容的“家庭服务器”代理。它无法执行管理用户账户、存储历史记录或与其他服务器联合等基本服务器功能。\n\n2.  **技术缺陷：** 该实现完全依赖现有的Matrix.org基础服务器来处理身份验证、存储和联合功能。Cloudflare Worker仅充当传递角色，而非独立服务器。\n\n3.  **对营销手法的批评：** 文章认为该博客文章是“氛围编程”式的营销——优先考虑炒作和美观，而非技术实质和准确表述。这可能会分散人们对真正开源贡献的注意力。\n\n4.  **更广泛的背景：** 批评基于一种担忧，即大型科技公司（如Cloudflare）利用去中心化协议（如Matrix）的品牌和社区信誉，却未提供支持网络韧性和独立性的完整、合规的实现。\n\n本质上，文章指责Cloudflare将一个有限的技术实验夸大为重大的协议实现，可能损害对Matrix生态系统的理解和信任。"
  },
  {
    "id": "46782091",
    "title": "A first look at Aperture by Tailscale (private alpha)",
    "url": "https://tailscale.com/blog/aperture-private-alpha",
    "summary": "**Aperture by Tailscale (Alpha)** is an AI gateway designed to solve the security and visibility challenges companies face as AI coding agents (like Claude Code) become more capable and widely adopted.\n\nIts core function is to provide a secure, low-friction way for developers to use AI tools without distributing individual API keys. It leverages Tailscale's built-in identity system, so any machine on the tailnet can access AI providers through Aperture with a simple configuration change. This eliminates the need for manual key management across laptops, VMs, and CI/CD systems.\n\nFor organizations, Aperture offers two key benefits:\n1.  **Visibility:** It centralizes usage logs, allowing leaders to monitor AI adoption, analyze costs, and detect unauthorized or compromised usage.\n2.  **Security:** By being the easiest way to access AI, it discourages risky workarounds. All traffic is tagged with user and machine identities for auditing and can be exported to SIEM systems.\n\nCurrently focused on coding agents in its alpha release, Aperture supports major LLM providers and plans to expand to other AI workloads. It is also built to be extensible, with initial partnerships (like Oso) planned to add more advanced security controls.\n\nThe product is free for up to 3 users in its experimental alpha phase, with a waitlist for larger organizational deployments.",
    "chinese_title": "Tailscale Aperture 功能初探（内测版）",
    "chinese_summary": "**Tailscale Aperture（Alpha版）**是一款AI网关，旨在解决随着AI编程助手（如Claude Code）能力增强和广泛普及后企业面临的安全与可见性挑战。\n\n其核心功能是为开发者提供安全、低门槛的AI工具使用方案，无需分发个人API密钥。该产品依托Tailscale内置身份系统，仅需简单配置调整，即可让tailnet网络中的任何设备通过Aperture访问AI服务商，从而消除在笔记本电脑、虚拟机和CI/CD系统中手动管理密钥的需求。\n\n对组织而言，Aperture提供两大核心价值：\n1.  **可见性**：集中化管理使用日志，便于管理者追踪AI工具采用情况、分析成本并检测未授权或异常使用行为。\n2.  **安全性**：作为最便捷的AI访问通道，它能有效减少高风险替代方案。所有流量均标注用户与设备身份信息以供审计，并可导出至SIEM系统。\n\n当前Alpha版本主要聚焦编程助手场景，已支持主流大语言模型服务商，未来计划扩展至其他AI工作负载。该产品采用可扩展架构，已启动与Oso等伙伴的初期合作，以逐步增强高级安全控制功能。\n\n在实验性Alpha阶段，该产品最多支持3名用户免费使用，更大规模的组织部署可通过候补名单申请。"
  },
  {
    "id": "46731513",
    "title": "The threat eating away at museum treasures",
    "url": "https://www.scientificamerican.com/article/how-extremophile-molds-are-destroying-museum-artifacts/",
    "summary": "This article details the emergence of a previously overlooked threat to museum collections: xerophilic molds. Unlike common molds that thrive in humidity, these extremophile fungi can survive and grow in the dry, climate-controlled environments museums use to protect artifacts. Their presence is often undetectable by standard testing methods, leading to mysterious damage.\n\nThe problem is compounded by stigma, as museums fear reputational and financial harm from admitting to infestations, which hinders information sharing. Climate change is also a factor, as institutions respond to erratic weather by tightening environmental controls, inadvertently creating ideal, stable conditions for xerophiles.\n\nThese molds can directly consume organic materials like canvas, wood, and book bindings. They can also damage inorganic surfaces like frescoes and marble by feeding on dust and altering their microenvironments, often excreting substances that cause staining and decay. Notable cases include damage to Leonardo da Vinci’s self-portrait, King Tut’s burial chamber, and St. Sophia’s Cathedral in Kyiv.\n\nResearchers, including mycologists like Flavia Pinzari, are now identifying these species and understanding their mechanisms, such as how they use salt to create humid microclimates. The article calls for a reevaluation of conservation protocols to address this stealthy and growing threat to cultural heritage.",
    "chinese_title": "侵蚀博物馆珍宝的威胁",
    "chinese_summary": "本文详述了一种先前被忽视的博物馆藏品威胁的出现：嗜干霉菌。与在潮湿环境中滋生的常见霉菌不同，这些极端真菌能够在博物馆用于保护文物的干燥、恒温环境中存活并生长。它们的存在通常无法通过标准检测方法发现，从而导致神秘的损害。\n\n问题的严重性因污名化而加剧，博物馆因担心承认虫害会带来声誉和经济损失，阻碍了信息共享。气候变化也是一个因素，机构为应对无常天气而加强环境控制，无意中为嗜干菌创造了理想、稳定的条件。\n\n这些霉菌能直接消耗有机材料，如画布、木材和书籍装订。它们还能通过以灰尘为食并改变其微环境来损害无机表面，如壁画和大理石，常常分泌导致染色和腐烂的物质。著名案例包括对达·芬奇自画像、图坦卡蒙墓室和基辅圣索菲亚大教堂的损害。\n\n包括真菌学家弗拉维亚·平扎里在内的研究人员正在识别这些物种并了解其机制，例如它们如何利用盐分创造潮湿的微环境。文章呼吁重新评估保护协议，以应对这一对文化遗产日益增长的隐秘威胁。"
  },
  {
    "id": "46770855",
    "title": "Two Twisty Shapes Resolve a Centuries-Old Topology Puzzle",
    "url": "https://www.quantamagazine.org/two-twisty-shapes-resolve-a-centuries-old-topology-puzzle-20260120/",
    "summary": "This article details the resolution of a 150-year-old puzzle in topology known as the Bonnet problem. In 1867, Pierre Ossian Bonnet showed that a surface's overall shape is usually uniquely determined by two local measurements: its metric (intrinsic distances) and its mean curvature (extrinsic bending). Exceptions to this rule were known, but only for \"non-compact\" surfaces that stretch infinitely or have edges.\n\nMathematicians long suspected that \"compact\" surfaces—closed shapes like spheres and doughnuts (tori)—were always uniquely defined by this data. A 1981 result suggested tori could have at most two shapes for a given metric and curvature, but no examples of such a \"Bonnet pair\" were found.\n\nThe breakthrough came from Alexander Bobenko, Tim Hoffmann, and Andrew Sageman-Furnas. Sageman-Furnas first discovered a candidate in the world of discrete (pixelated) geometry—a spiky \"rhino\" torus that could generate a compact Bonnet pair. This computational clue led the team to adapt century-old formulas from Jean Gaston Darboux. After significant adjustments to ensure the surfaces closed properly, they constructed the first-ever smooth, compact Bonnet pair: two distinctly twisty doughnut-shaped surfaces that share identical local geometric data but have different global structures.\n\nThis discovery definitively proves that even nice, closed surfaces like tori cannot always be uniquely identified by their local metric and mean curvature, settling a long-standing conjecture.",
    "chinese_title": "两个扭曲形状解开了一个世纪之久的拓扑学谜题",
    "chinese_summary": "本文详细阐述了一个拓扑学中长达150年之久的谜题——博内问题的解决过程。1867年，皮埃尔·奥西安·博内证明，一个曲面的整体形状通常由两个局部测量值唯一确定：其度量（内蕴距离）和平均曲率（外蕴弯曲）。已知该规则存在例外，但仅限于无限延伸或带有边界的“非紧致”曲面。\n\n数学家长期怀疑“紧致”曲面——如球面和甜甜圈（环面）这类封闭形状——总能由这些数据唯一确定。1981年的一项结果表明，对于给定的度量和曲率，环面最多可能有两种形状，但从未发现此类“博内对”的实际例子。\n\n突破来自亚历山大·博本科、蒂姆·霍夫曼和安德鲁·塞格曼-弗纳斯。塞格曼-弗纳斯首先在离散（像素化）几何领域发现了一个候选对象——一个可生成紧致博内对的尖刺状“犀牛”环面。这一计算线索促使团队改编了让·加斯顿·达布创立于百年前的公式。经过大幅调整以确保曲面正确闭合后，他们首次构建出光滑的紧致博内对：两个具有明显扭曲的甜甜圈状曲面，它们拥有完全相同的局部几何数据，却具有不同的整体结构。\n\n这一发现最终证明，即使是环面这类光滑的封闭曲面，也无法总是通过其局部度量和平均曲率被唯一确定，从而为一个长期存在的猜想画上了句号。"
  },
  {
    "id": "46691548",
    "title": "Snow Simulation Toy",
    "url": "https://potch.me/2026/snow-simulation-toy.html",
    "summary": "This article introduces a simple snow simulation toy created by the author in JavaScript. The project is a nostalgic recreation of one of their earliest programming experiences—a falling snow simulation originally coded in QBasic. The author describes these simulations as soothing, customizable, and full of potential for adding delightful details.\n\nThe toy was developed during idle time over the holidays at their parents' home. The post includes a live, interactive demo for readers to enjoy and is tagged with relevant topics: #toys, #js (JavaScript), and #procgen (procedural generation).",
    "chinese_title": "雪景模拟玩具",
    "chinese_summary": "本文介绍了一款作者用JavaScript制作的简易雪花模拟玩具。该项目是对作者早期编程经历的一次怀旧重现——最初用QBasic编写的飘雪模拟程序。作者形容这类模拟程序令人放松、可自由定制，且充满添加趣味细节的潜力。\n\n这款玩具是作者在假期于父母家中闲暇时开发的。文章附有可交互的实时演示供读者体验，并标注了相关主题标签：#玩具、#js（JavaScript）和#程序生成。"
  },
  {
    "id": "46784263",
    "title": "U.S. government has lost more than 10k STEM PhDs since Trump took office",
    "url": "https://www.science.org/content/article/u-s-government-has-lost-more-10-000-stem-ph-d-s-trump-took-office",
    "summary": "**Summary of \"U.S. government has lost more than 10k STEM PhDs since Trump took office\"**\n\nA study published in *Science* reveals a significant decline in the number of STEM (Science, Technology, Engineering, and Mathematics) Ph.D. holders working for the U.S. federal government. Since the beginning of the Trump administration in 2017, the government has lost over 10,000 employees with STEM doctorates—a 12% reduction in this highly skilled workforce.\n\nKey findings and causes include:\n*   **Steep Decline:** The loss represents a sharp acceleration from previous trends, with the total dropping from approximately 90,000 to under 80,000 by the end of 2021.\n*   **Primary Driver:** The primary cause identified is a dramatic fall in new hires, not a wave of resignations. Hiring of new STEM Ph.D.s plummeted by 45% compared to the latter years of the Obama administration.\n*   **Impact of Hiring Freezes:** Policies like the 2017 federal hiring freeze and a general deprioritization of science in executive branch appointments created a \"chilling effect.\" This discouraged applications and led qualified candidates to seek opportunities in academia or the private sector.\n*   **Aging Workforce:** The decline raises concerns about a \"lost generation\" of government scientists. With many remaining employees nearing retirement, the loss of early- and mid-career researchers threatens the government's long-term capacity for research, regulatory science, and evidence-based policymaking.\n*   **Broad Impact:** The losses were widespread across agencies, affecting critical scientific missions at the Environmental Protection Agency, Department of Agriculture, National Institutes of Health, and Department of Energy.\n\nThe study concludes that this erosion of scientific expertise within the federal government weakens its ability to address complex national challenges, from public health and climate change to technological innovation and competitiveness.",
    "chinese_title": "自特朗普上任以来，美国政府已流失逾万名STEM领域博士。",
    "chinese_summary": "**《特朗普执政以来美国政府流失逾万名STEM博士》摘要**\n\n《科学》杂志发布的一项研究显示，在美国联邦政府工作的STEM（科学、技术、工程和数学）领域博士人数显著下降。自2017年特朗普政府上任以来，政府已流失超过10,000名拥有STEM博士学位的雇员——这一高技能劳动力群体缩减了12%。\n\n主要发现及原因包括：\n*   **急剧下降：** 这一流失速度较以往趋势明显加快，总人数从约90,000人降至2021年底的不足80,000人。\n*   **主要原因：** 研究确定的主要原因是新聘人员大幅减少，而非辞职潮。与奥巴马政府后期相比，新聘STEM博士人数骤降45%。\n*   **招聘冻结的影响：** 2017年联邦招聘冻结等政策，以及行政部门任命中普遍对科学的忽视，产生了“寒蝉效应”。这打击了申请者的积极性，导致合格人才转向学术界或私营部门寻求机会。\n*   **劳动力老龄化：** 这种下降引发了对政府科学家“失落一代”的担忧。随着许多留任员工临近退休，早期和中期职业研究人员的流失威胁着政府长期的研究能力、监管科学和循证决策能力。\n*   **广泛影响：** 人员流失遍及各个机构，影响了环境保护局、农业部、国立卫生研究院和能源部等机构的关键科学使命。\n\n研究结论指出，联邦政府内部科学专业知识的这种削弱，损害了其应对从公共卫生、气候变化到技术创新与竞争力等复杂国家挑战的能力。"
  },
  {
    "id": "46779809",
    "title": "TikTok users can't upload anti-ICE videos. The company blames tech issues",
    "url": "https://www.cnn.com/2026/01/26/tech/tiktok-ice-censorship-glitch-cec",
    "summary": "This article details reports from TikTok users, including popular creators, who were unable to upload videos criticizing U.S. Immigration and Customs Enforcement (ICE) over the weekend of January 24-25, following the fatal shooting of a nurse by a federal agent. Users suspected the platform was censoring anti-ICE content.\n\nTikTok attributed the upload failures to technical glitches from a power outage at a U.S. data center, unrelated to content. However, the timing coincided with a major ownership change, where a U.S.-led joint venture—including Oracle, whose chair is close to former President Trump—took control of TikTok's U.S. operations under a 2024 law.\n\nExperts note that while TikTok, as a private platform, has the legal right to moderate content, the incident has eroded user trust. They cite concerns over data access and potential content bias under the new ownership, which is politically linked to an administration deeply involved with ICE. The opaque nature of TikTok's algorithm makes proving intentional censorship difficult.\n\nThe controversy led some users to delete their accounts, with uninstall rates spiking, while others, like nurse Jen Hamilton, have adapted by using coded language to discuss sensitive topics. The situation highlights growing skepticism about platform neutrality and content control amid political tensions.",
    "chinese_title": "TikTok用户无法上传反ICE视频，公司归咎于技术问题。",
    "chinese_summary": "这篇文章详细报道了TikTok用户（包括知名创作者）在1月24日至25日周末期间无法上传批评美国移民和海关执法局（ICE）视频的情况。此前，一名护士遭联邦探员枪击身亡。用户怀疑该平台正在审查反ICE内容。\n\nTikTok将上传失败归因于美国数据中心停电导致的技术故障，与内容无关。然而，这一时间点恰逢重大所有权变更——根据2024年的一项法律，由美国牵头的合资企业（包括甲骨文公司，其董事长与前总统特朗普关系密切）接管了TikTok的美国业务。\n\n专家指出，尽管TikTok作为私人平台拥有合法内容管理权，但此事已削弱用户信任。他们担忧新所有权结构下数据访问权限与潜在内容偏见问题，因该集团与深度涉足ICE事务的政府存在政治关联。TikTok算法的不透明性使得证实故意审查行为十分困难。\n\n争议导致部分用户注销账户，应用卸载率激增；而像护士珍·汉密尔顿这样的用户则开始使用隐晦语言讨论敏感话题。这一局面凸显了在政治紧张局势下，人们对平台中立性与内容管控日益增长的质疑。"
  },
  {
    "id": "46687729",
    "title": "Velox: A Port of Tauri to Swift by Miguel de Icaza",
    "url": "https://github.com/velox-apps/velox",
    "summary": "Velox is a Swift port of the Tauri framework, enabling developers to build desktop applications using HTML frontends with Swift backends. It includes a CLI tool for project creation, development, and building, supporting both local asset serving and proxy mode for modern frontend toolchains like Vite. The framework offers a Swift API for window and webview management, event handling, and IPC communication, with configuration via a `velox.json` file. Examples demonstrate various features, including multi-window support, system tray integration, and dynamic HTML rendering.",
    "chinese_title": "Velox：Miguel de Icaza 将 Tauri 移植到 Swift 的版本",
    "chinese_summary": "Velox是Tauri框架的Swift移植版本，使开发者能够使用HTML前端与Swift后端构建桌面应用程序。它包含一个用于项目创建、开发和构建的CLI工具，支持本地资源服务以及为现代前端工具链（如Vite）提供的代理模式。该框架提供用于窗口和Webview管理、事件处理和IPC通信的Swift API，并通过`velox.json`文件进行配置。示例展示了多种功能，包括多窗口支持、系统托盘集成和动态HTML渲染。"
  },
  {
    "id": "46775135",
    "title": "A list of fun destinations for telnet",
    "url": "https://telnet.org/htm/places.htm",
    "summary": "This article provides a curated list of destinations accessible via the telnet protocol, highlighting the variety and enduring appeal of text-based internet services. It categorizes entries into several groups:\n\n*   **Fun Telnet Servers:** A primary list of active servers offering diverse experiences, such as checking the time, viewing ASCII maps, accessing NASA solar system data, playing terminal-based *Doom* or chess, checking Bitcoin prices, and exploring a live Wikipedia with an AI assistant.\n*   **Notable, but Offline:** A nostalgic section remembering classic services that are no longer online, including ASCII *Star Wars*, a weather server, ANSI art animations, and Star Trek-themed games.\n*   **MUDs, Talkers, BBS, and Other Systems:** An extensive list of active multiplayer text games (MUDs), bulletin board systems (BBS), and social chat systems, providing their connection addresses.\n*   **Directories:** A set of external website links to larger, specialized directories for finding more BBSs, MUDs, and other telnet-accessible resources.\n\nThe article serves as both a practical guide for exploration and a tribute to the history of text-based networking, last updated on June 4, 2025.",
    "chinese_title": "有趣的telnet目的地列表",
    "chinese_summary": "本文精选了一系列可通过telnet协议访问的目的地，展现了基于文本的互联网服务的多样性与持久魅力。内容分为以下几类：\n\n*   **趣味Telnet服务器：** 提供各类体验的活跃服务器主列表，例如查询时间、查看ASCII地图、访问NASA太阳系数据、玩终端版《毁灭战士》或国际象棋、查看比特币价格，以及探索带有AI助手的实时维基百科。\n*   **值得铭记但已下线：** 怀旧板块，纪念那些已不再运行的经典服务，包括ASCII版《星球大战》、天气服务器、ANSI艺术动画和星际迷航主题游戏。\n*   **MUD、Talker、BBS及其他系统：** 活跃的多人文本游戏（MUD）、电子公告板系统（BBS）和社交聊天系统的详细列表，并提供其连接地址。\n*   **目录索引：** 一组外部网站链接，指向更大型、更专业的目录，用于查找更多BBS、MUD及其他telnet可访问资源。\n\n本文既是一份实用的探索指南，也是对文本网络历史的致敬，最后更新于2025年6月4日。"
  },
  {
    "id": "46702948",
    "title": "A simulation where life unfolds in real time",
    "url": "https://soupof.life",
    "summary": "**Summary:**\n\n\"Soup of Life\" is a real-time digital simulation that visualizes the emergence and evolution of simple life-like organisms. Users can watch as basic elements interact within a simulated primordial environment, following rules inspired by biological processes like metabolism, reproduction, and genetic mutation.\n\nThe core of the simulation is a physics and chemistry engine where digital \"molecules\" combine and react. From this chaos, self-replicating patterns eventually arise. These digital organisms compete for resources, reproduce with slight variations, and evolve over time, demonstrating core principles of natural selection in a sped-up, observable format.\n\nKey features include the ability to observe evolution in action, track lineages, and see how random mutations can lead to increased complexity or specialization. The simulation serves as an educational tool, making abstract concepts of abiogenesis (the origin of life) and evolution tangible. It highlights how complex behaviors and adaptive traits can emerge from simple, rule-based interactions without any pre-programmed design goal, offering an intuitive glimpse into the fundamental processes that may have shaped life on Earth.",
    "chinese_title": "一场生命实时展开的模拟",
    "chinese_summary": "**概述：**\n\n《生命之汤》是一款实时数字模拟程序，可视化呈现了类生命简单生物的涌现与演化过程。用户可观察基础元素在模拟的原始环境中相互作用，其规则设计灵感源自新陈代谢、繁殖和基因突变等生物过程。\n\n模拟的核心是一个物理化学引擎，数字“分子”在其中结合并发生反应。从混沌中最终诞生出自我复制的模式。这些数字生物竞逐资源、以微小变异进行繁殖，并随时间推移不断进化，以加速且可观测的形式展现了自然选择的核心原理。\n\n主要功能包括实时观察演化进程、追踪生物谱系，以及见证随机突变如何催生复杂性或特化性。该模拟作为教育工具，使生命起源和进化等抽象概念变得可触可感。它生动揭示了复杂行为和适应性特征如何从基于规则的简单互动中自发涌现，无需任何预设的设计目标，从而为理解地球上生命形成的基本过程提供了直观的视角。"
  },
  {
    "id": "46780065",
    "title": "The age of Pump and Dump software",
    "url": "https://tautvilas.medium.com/software-pump-and-dump-c8a9a73d313b",
    "summary": "**Summary of \"The age of Pump and Dump software\"**\n\nThe article argues that a significant portion of modern software, particularly in the startup and venture capital-funded space, operates on a \"pump and dump\" model analogous to financial scams.\n\nThe core premise is that the traditional metrics for software success—like user growth and engagement—have been gamed. Companies now prioritize \"growth hacking\" and vanity metrics over building genuinely useful, sustainable products. The goal is not to create long-term value but to inflate the company's valuation quickly.\n\nThis is achieved by spending heavily on marketing and user acquisition (often at a loss) to create the illusion of traction and market dominance. The \"dump\" phase occurs when the overvalued company is sold via an acquisition or IPO, allowing founders and early investors to cash out. The ultimate end-users are left with a product that may be abandoned, monetized aggressively, or shut down shortly after the exit, as the new owners focus on recouping their investment rather than innovation.\n\nThe author cites examples like the \"acqui-hire\" (where a company is bought for its talent, not its product) and the trend of large tech companies buying startups only to discontinue their services. The consequence is a market flooded with software that is not designed to last, wasting users' time, data, and trust, while enriching a small group of insiders at the top of the pyramid.",
    "chinese_title": "“抽水与抛售”软件的时代",
    "chinese_summary": "《“拉高出货”软件时代》摘要\n\n文章指出，现代软件（尤其是初创企业和风险投资领域）有相当大一部分采用类似金融骗局的“拉高出货”模式。\n\n其核心论点是：用户增长和参与度等传统软件成功指标已被操纵。企业如今优先考虑“增长黑客”和虚荣指标，而非构建真正有用、可持续的产品。目标不是创造长期价值，而是快速抬高公司估值。\n\n为实现这一目标，企业不惜重金投入营销和用户获取（常处于亏损状态），制造市场影响力和主导地位的假象。“出货”阶段发生在估值虚高的公司通过收购或首次公开募股被出售时，创始人和早期投资者得以套现离场。最终用户留下的产品可能在退出后不久被弃置、被激进变现或直接关停，因为新所有者关注的是收回投资而非创新。\n\n作者列举了“收购式招聘”（公司为人才而非产品被收购）以及大型科技公司收购初创企业后随即终止其服务等案例。其后果是市场充斥着并非为持久使用而设计的软件，浪费了用户的时间、数据和信任，却让金字塔顶端的少数内部人士得以获利。"
  },
  {
    "id": "46775135",
    "title": "A list of fun destinations for telnet",
    "url": "https://telnet.org/htm/places.htm",
    "summary": "This article is a curated list of fun and interesting destinations accessible via the telnet protocol. It categorizes various servers, including those for getting the current time, viewing ASCII maps, accessing NASA solar system data, playing terminal-based games like Doom and chess, and checking live Bitcoin prices.\n\nIt also nostalgically lists several notable servers that are no longer online, such as the ASCII *Star Wars* animation and weather services. A significant portion is dedicated to active text-based multiplayer environments like MUDs, MMOs, talkers, and BBS systems.\n\nFinally, the article provides links to external directories for discovering more telnet-accessible Bulletin Board Systems and multiplayer text games. The list was last updated on June 4, 2025.",
    "chinese_title": "有趣的telnet目的地列表",
    "chinese_summary": "本文是一份精选的有趣目的地列表，可通过telnet协议访问。它分类列出了各种服务器，包括获取当前时间、查看ASCII地图、访问NASA太阳系数据、玩《毁灭战士》和象棋等终端游戏，以及查看实时比特币价格的服务器。\n\n文章还怀旧地列出了几个现已离线的著名服务器，例如ASCII版《星球大战》动画和天气服务。其中很大一部分专门介绍了活跃的基于文本的多用户环境，如MUD、MMO、聊天系统和BBS系统。\n\n最后，文章提供了外部目录链接，以便发现更多可通过telnet访问的电子公告板和多人文本游戏。该列表最后更新于2025年6月4日。"
  }
]